<HTML>

<HEAD>

  <TITLE>Alert Help</TITLE>
  <META NAME="GENERATOR" CONTENT="HomePage Penguin 2.51pro (Atari/MagiC)">
  <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">

</HEAD>

<BODY TEXT="WHITE" LINK="RED" VLINK="MAGENTA" ALINK="RED" BGCOLOR="BLACK">

<H4 ALIGN="RIGHT"><FONT COLOR="#FFCC00">Alert Help</FONT></H4>
<H1 ALIGN="CENTER"><FONT COLOR="#C0C0C0">Anleitung</FONT></H1>
<DIV ALIGN="JUSTIFY">

<H2><U>Zweck:</U></H2>
<I>Alert Help</I> dient dem Erstellen von Alert-Boxen und ist f&uuml;r mich
eher ein Testprogramm f&uuml;r GEM-Protokolle. Bevor's aber auf meiner
Festplatte verschimmelt, stelle ich es lieber ins Netz ;-)<P>
<P>
<H2><U>Systemanforderungen:</U></H2>
Alles wo TOS draufsteht, sich so nennt oder glaubt es zu sein.
<I>Alert Help</I> unterst&uuml;tzt das erweiterte AES von N.AES.
Das Programm l&auml;uft als ACC oder PRG. Das Programm w&auml;hlt
automatisch die richtige RSC-Datei aus.<P>
<P>
<H2><U>Bedienung:</U></H2>
Die Bedienung d&uuml;rfte selbsterkl&auml;rend sein. Alle Popup-Men&uuml;s k&ouml;nnen
abgerissen und als kleine Fenster den Bildschirm bev&ouml;lkern. Dazu
einfach eines der Popups anw&auml;hlen, Maustaste gedr&uuml;ckt halten und
Mauszeiger vom Popup weg bewegen.<BR>
An Alert-Symbolen stehen neben den drei Standardsymbolen 
(Ausrufezeichen, Stop, Fragezeichen) auch eine Diskette und ein
Info-Symbol zur Verf&uuml;gung. Diese beiden Symbole sind nicht etwa eine
Erfindung von mir, sondern eine Vorgabe von Atari. Die letzte
bekannte TOS-Version (4.92) unterst&uuml;tzt sie bspw., ebenso N.AES.
MagiC geh&ouml;rt nicht dazu, was nat&uuml;rlich eine erhebliche Einschr&auml;nkung
dieses Betriebssystems darstellt :-).<P>
<P>
<H2><U>OLGA:</U></H2>
<I>Alert Help</I> ist OLGA-Server. Was das ist, lesen Sie bitte in der OLGA-Dokumentation.<P>
<P>
<H2><U>GEMscript:</U></H2>
Warum auch immer, aber <I>Alert Help</I> kann von anderen Programmen herumkommandiert
werden. Das sch&ouml;nste: Es wehrt sich nicht. Die ber&uuml;hmte Beta-Version,
Codename "Rambo", die getreu dem Motto &quot;Du sollst keine Programme neben
mir haben!&quot; handelte, ist Vergangenheit.<P>
<U>Es werden folgende Kommandos verstanden:</U><P>
<UL>
  <LI><B>APPGETLONGNAME</B>: Liefert "<I>Alert Help</I>"
  <LI><B>GETALERT</B>: <I>Alert Help</I> sendet den Quelltext der Alert-Box zur&uuml;ck. Ein
  optionaler Parameter bestimmt das Ausgabeformat (siehe OUTPUT).
  <LI><B>NEW</B>: Neue Alert-Box (Fenster wird ge&ouml;ffnet, falls noch nicht geschehen)
  <LI><B>OUTPUT</B>: Setzt das Ausgabe-Format. Ein Parameter ist erlaubt, dieser
  Parameter ist eine Zahl. Es gilt: 1. GFA-Alert, 2. Form-Alert, 
  3. Java-Script.<BR>
  <LI><B>PRINT</B>: Der Quelltext der Alert-Box wird ausgedruckt.
  <LI><B>QUIT</B>: <I>Alert Help</I> beendet sich (mit Sicherheitsabfrage).
  <LI><B>SAVE</B>: Alert-Box wird gespeichert. Ein Dateiname mu&szlig; angegeben werden
  (es sei denn, die Datei wurde schon vorher gespeichert).
  <LI><B>SAVEAS</B>: Die Dateiauswahl wird ge&ouml;ffnet, die Datei wird dann unter
  dem dort eingebenen Namen gespeichert.<BR>
  <LI><B>SHUTDOWN</B>: <I>Alert Help</I> beendet sich (ohne Sicherheitsabfrage).<P>
</UL>
<P>
<H2><U>Sonstiges:</U></H2>
<I>Alert Help</I> wurde mit faceVALUE 3 und GFA-Basic 3.6TT erstellt.
Der Sourcecode ben”tigt faceVALUE3 sowie die OLGA-Lib.<P>
<P>

</DIV><P>
<p>
<I>Erstellt am 17.Oktober 2000 um 21:12</I><BR>
<HR SIZE="4">
<CENTER><a href="http://www.atari-computer.de/mjaap/hpp/" target="_new"><IMG SRC="hppbuilt.gif" WIDTH="100" HEIGHT="31" ALT="Built with HomePage Penguin" BORDER="0"></A></CENTER>
</BODY>
</HTML>
