<html>
<head><title>Documentation de Blaise</title></head>

<body BACKGROUND="../IMAGES/MARBLED.GIF" bgcolor="#FFFFFF" text="#004400" LINK="#884400" VLINK="#004488">
<center><b><FONT SIZE=+1>Limitations et bugs connus</FONT><b></center><P>
<TABLE BORDER=0 CELLPADDING=5 CELLSPACING=0>
<TR><TD><IMG SRC="../IMAGES/BLANC.GIF" ALT="" WIDTH=90 HEIGHT=1 BORDER=0></TD><TD VALIGN=TOP>
Les probl&egrave;mes qu'il y avait apparavant ont presque tous disparus. Seule la vitesse
(d&ucirc;e &agrave; la programmation en GFA) est lente et vous fera pr&eacute;f&eacute;rer un
environnement NVDI et MagiC dans lequel Blaise se compla&icirc;t &agrave; merveille.
<P>
<UL><LI>Des probl&egrave;mes nouveaux sont apparus&nbsp;: La gestion des RIM, bien que simple et
&eacute;l&eacute;gante, m'a occasionn&eacute; de nombreuses prises de t&ecirc;te. La version
2.25 signifie que je consid&egrave;re cette version comme stable par rapport aux
b&eacute;ta et cie que j'avais fait diffuser pour tests.
Il reste quelques probl&egrave;mes mineurs&nbsp;:
<UL>
<LI>le Tiny n'est pas reconnu sur un 68000.<BR>
<LI>le format GEM plante s'il n'y pas de m&eacute;moire libre: c'est le GEM lui-m&ecirc;me qui
se charge de constuire l'image dans une zone m&eacute;moire non allou&eacute;e par Blaise.<BR>
<LI>le format BMP peut planter sur 68000, il s'agit d'un vieux RIM BMP qui utilise une adresse
impaire. Ce RIM a &eacute;t&eacute; corrig&eacute; depuis.<BR>
<LI>certains images IMG sont affich&eacute;es avec une palette bizarre. Normal, ces images
n'ont pas de palette et on doit en 'balancer' une qui ne lui correspond pas tout &agrave; fait
au TRM pour que &ccedil;a marche. Les images XIMG poss&egrave;dent, elles, une palette.<BR>
</UL>
Les tests ont &eacute;t&eacute; effectu&eacute;s sur les formats d'images courants. De
m&ecirc;me, le fonctionnement sur carte graphique non Atari m'est inconnu.
<P>
<LI>Le merge (Control+M) ou Insertion du bloc (Control+I) bugge si le fichier &agrave; charger
ne contient pas LF+CR &agrave; chaque ligne, m&ecirc;me la derni&egrave;re. Il y aura donc des
probl&egrave;mes avec EvereST&nbsp;: le bloc de texte qu'il a sauvegard&eacute; dans le
clipboard ne poss&egrave;de pas toujours ce LF+CR dans sa derni&egrave;re ligne.
<P>
<LI>En monoTOS uniquement, le passage de Blaise vers d'autres programmes perturbe
certains accessoires qui sont ouverts. Pri&egrave;re donc de les fermer, ou d'en choisir
d'autres quisupportent les changements d'applications &agrave; la vol&eacute;e.
</UL>
</TD></TR></TABLE>
</body>
</html>

