<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
        "http://www.w3.org/TR/html4/loose.dtd">
<!-- last modified on 28.12.2003 -->
<html lang="de">
<head>
<title>
Harddrive - Tips &amp; Tricks zum Ger&auml;teanschlu&szlig;: Bussysteme
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta http-equiv="Content-Style-Type" content="text/css">
<meta http-equiv="Content-Script-Type" content="text/javascript">
<meta name="Generator" content="UDO 6.2 PL1 for MacOSX">
<meta name="Email" content="doit@doitarchive.de">
<link rev="made" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="author" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="chapter" href="001.htm" title="1 Autor">
<link rel="chapter" href="003.htm" title="3 Master &amp; Slave">
<link rel="chapter" href="004.htm" title="4 SCSI">
<link rel="chapter" href="005.htm" title="5 IDE">
<link rel="chapter" href="006.htm" title="6 Raid System">
<link rel="chapter" href="007.htm" title="7 USB &amp; FireWire">
<link rel="chapter" href="008.htm" title="8 Kalibrierung">
<link rel="chapter" href="009.htm" title="9 Jumper">
<link rel="chapter" href="00a.htm" title="10 Zugriff">
<link rel="chapter" href="00b.htm" title="11 Pin">
<link rel="chapter" href="00c.htm" title="12 Einbau">
<link rel="chapter" href="00d.htm" title="13 CD-ROM">
<link rel="chapter" href="00e.htm" title="14 CD Formate">
<link rel="chapter" href="00f.htm" title="15 CD-Recorder">
<link rel="chapter" href="010.htm" title="16 DVD Laufwerke">
<link rel="start" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="home" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="first" href="001.htm" title="Autor">
<link rel="prev" href="001.htm" title="Autor">
<link rel="previous" href="001.htm" title="Autor">
<link rel="next" href="003.htm" title="Master &amp; Slave">
<link rel="last" href="010.htm" title="DVD Laufwerke">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border="0" cellspacing="0" cellpadding="0" width="100%">
<tr>
<td valign="top" width="128">
<table border="0" cellpadding="0" cellspacing="0" width="128">
<tr><td align="center"><a href="001.htm"><img src="icon/but1.gif" alt="Autor" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="002.htm"><img src="icon/but2.gif" alt="Bussysteme" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="003.htm"><img src="icon/but3.gif" alt="Master &amp; Slave" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="004.htm"><img src="icon/but4.gif" alt="SCSI" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="005.htm"><img src="icon/but5.gif" alt="IDE" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="006.htm"><img src="icon/but17.gif" alt="Raid System" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="007.htm"><img src="icon/but15.gif" alt="USB &amp; FireWire" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="008.htm"><img src="icon/but6.gif" alt="Kalibrierung" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="009.htm"><img src="icon/but7.gif" alt="Jumper" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00a.htm"><img src="icon/but8.gif" alt="Zugriff" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00b.htm"><img src="icon/but9.gif" alt="Pin" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00c.htm"><img src="icon/but10.gif" alt="Einbau" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00d.htm"><img src="icon/but11.gif" alt="CD-ROM" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00e.htm"><img src="icon/but12.gif" alt="CD Formate" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00f.htm"><img src="icon/but13.gif" alt="CD-Recorder" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="010.htm"><img src="icon/but14.gif" alt="DVD Laufwerke" border="0" width="100" height="30"></a></td></tr>
</table>
</td>
<td valign="top" width="100%">
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="001.htm"><img src="udo_lf.gif" alt="Autor" border="0" width="24" height="24"></a>
<a href="003.htm"><img src="udo_rg.gif" alt="Master &amp; Slave" border="0" width="24" height="24"></a>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr>
<td valign="top" width="8">&nbsp;</td><td valign="top" width="100%">
<h1><a name="Bussysteme">2 Bussysteme</a></h1>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p><tt> Die verschiedenen Bussysteme </tt>
<br>
</p>
<p>
<br>
<br><b> <a href="005.htm">IDE</a>-Bus </b>
<br>
<br>
</p>
<p>
<br>
<br><b> MFM </b>
<br>
</p>
<p>(Modified Frequenz Modulation). Ist die Bezeichnung f&uuml;r das
Verfahren der &Uuml;bertragung von Daten &uuml;ber den
Schreib-/Lesekopf auf die Oberfl&auml;che einer Festplatte. Heute
nicht mehr in Verwendung.
<br>
</p>
<p>Fr&uuml;her bei PC / Atari Standard.
<br>
</p>
<p>Beim MFM Verfahren wird durch einen Frequenzwechsel der
elektrischen Signale die Magnetisierung der Platte durch die
Schreib-/Lesek&ouml;pfe entsprechend der jeweiligen Daten variiert.
Eine MFM-Festplatte ist immer &uuml;ber ein 34-adriges Steuerkabel und
ein 20-adriges Datenkabel mit einem Controler (ST506-Schnittstelle)
verbunden. Dieser Controller steuert den Datenaustausch mit dem
Bussystem des Rechners und kann maximal zwei Festplatten verwalten.
Die Datentransferrate lag bei etwa 450 kByte/sec
<br>
</p>
<p>
<br>
<br><b> RLL </b>
<br>
</p>
<p>(Run Length Limited): Prinzipell ist der Aufbau mit dem einer
MFM-Festplatte identisch, nur die Speicherkapazit&auml;ten waren
gr&ouml;&szlig;er. Das ergab sich aus einer verbesserten
Oberfl&auml;che der Platten und die Ansteuerung der Laufwerke
verbesserte sich sehr stark. Dadurch waren pro Spur 26 Sektoren
m&ouml;glich, was nat&uuml;rlich eine Erh&ouml;hung der Speicherdichte
bedeutete. An einigen Controllern waren die alten MFM-Festplatten
durch eine RLL-Platte direkt ersetzbar.
<br>
</p>
<p>RLL-Festplatten sind heute nicht mehr in Verwendung.
<br>
</p>
<p>Fr&uuml;her bei PC / Atari Standard
<br>
</p>
<p>RLL-Festplatten sind im Detail verbesserte MFM-Festplatten, nicht
mehr und nicht weniger. Ebenfalls &uuml;ber eine ST 506-Schnittstelle
mit dem Rechnerbus verbunden und gesteuert. Die Verbesserungen liegen
einzig in einer optimierten Drehzahlstabilisierung, einer h&ouml;heren
Datendichte und einem speziellen Controller. Die Datentransferrate
liegt bei etwa 700 kByte/sec.
<br>
</p>
<p>ARLL-Festplatten sind ein verbesserter RLL-Festplattentyp, bei dem
die Datendichte erheblich gesteigert wurde. Die ARLL-Festplatte nutzt
die ESDI ((E)nhanced (S)mall (D)evice (I)nterface) -Schnittstelle
&uuml;ber einen entsprechenden Controller. Die Datencodierung
&uuml;bernimmt allerdings nicht wie bei der ST506-Schnittstelle der
Controller, sondern eine in die Festplattenelektronik integrierte
Logik. Dies bringt einen deutlichen Geschwindigkeitsvorteil. Die
Datentransferrate lag bei etwa 1,5 MByte/sec.
<br>
</p>
<p>
<br>
<br><b> Aktuelle Verfahren </b>
<br>
</p>
<p>Das am weitesten verbreiteste Bussytem f&uuml;r Massenspeicher ist
heute wohl der <a href="005.htm">IDE</a> bzw. EIDE Bus. Er findet sich in jedem PC in
einigen Macintosh- und sogar Atari-Computern. Er basiert auf einem
Standard aus dem Jahre 1989, der von einem Herstellerkonsortium
geschaffen wurde.
<br>
</p>
<p>Die Abk&uuml;rzung <a href="005.htm">IDE</a> deutet an, dass sich der eigentliche
Festplattencontroller, also die Elektronik, die die Festplatte
steuert, auf der eigentlichen Festplatte befindet. Der auf modernen
Mainboards bzw. auf Steckkarten zu findende '(E)<a href="005.htm">IDE</a>-Controller' ist
eigentlich nur ein recht primitiver Pegelwandler und weitgehend
unintelligent. Der Vorteil der Auslagerung der Steuerelektronik auf
die Festplatte liegt in der besseren Anpassbarkeit an die Festplatte.
Ein <a href="005.htm">IDE</a>-Bus Kabel ist idR nicht l&auml;nger als maximal 45cm ab dem
ersten Stecker. Speziell beim Atari Falcon k&ouml;nnen jedoch schon 15
cm zu lang sein da dieser &quot;<a href="005.htm">IDE</a>&quot;-Port gleich der CPU-Bus ist
und keine weiteren Treiberbausteine bez&uuml;glich <a href="005.htm">IDE</a>-Port
besitzt.(!nl)
</p>
<p>Einen <a href="005.htm">IDE</a>-Bus erkennen Sie immer sofort am 40 poligen
Flachbandkabel.
<br>Bei 2.5&quot; Ger&auml;ten ist der gleiche Bus 44polig, hier
befinden sich zus&auml;tzlich noch die +5 Versorgungsleitungen im
gleichen Flachbandkabel. Das Rasterma&szlig; der Steckverbinder bei
einem 2.5&quot; Anschlu&szlig; ist wesentlich kleiner als beim 40
poligen Bus. Mit entsprechenden 3.5&quot; / 2.5&quot; Adaptern
k&ouml;nnen beide Systeme jedoch gekoppelt werden. So kein leicht eine
2.5&quot; Festplatte, mittels entsprechendem Adapter, auch an einem
3.5&quot; Bus betrieben werden. Die Kabeladapter enthalten aller Regel
auch die n&ouml;tigen Stromanschl&uuml;sse.
<br>
</p>
<p>
<br>
<br><b> Ultra DMA </b>
<br>Der kleinere der neuen Standards verwendet das alte 40 polige <a href="005.htm">IDE</a>
Kabel auch f&uuml;r UDMA (UltraDMA33), 33 steht f&uuml;r 33Mhz
Busgeschwindigkeit. Der n&auml;chst h&ouml;here Standard (UltraDMA66)
ben&ouml;tigt zwingend ein 80 poliges UDMA66 Kabel welches man im
Fachhandel beziehen kann. Ganz zwingend ist dieses 80 polige Kabel
n&ouml;tig wenn ihr Computer auch neueste UDMA66 Festplatten eingebaut
hat. Nur mit diesem Kabel erreichen diese Festplatten die volle
spezifizierte Busgeschwindigkeit.
<br>
</p>
<p>Verwenden Sie als Beispiel eine UDMA33 und eine UDMA66 Platte am
gleichen Bus wird die Transfergeschwindigkeit des Bus nur mit UDMA33
laufen. Der Bus passt sich an das jeweils langsamste Device an.
<br>
</p>
<p>Sehr wichtig ist die Tatsache das bei dem 80 poligen Kabel die
Stecker farbig markiert sind, dem ein oder anderen wird das sicher
schon aufgefallen sein. Nein, das ist keine Laune der Industrie, es
hat einen tieferen technischen Hintergrund.
<br>
</p>
<p>Der blaue Stecker, das ist der Stecker am l&auml;ngsten Teil des
Flachbandkabels geh&ouml;rt immer und zwingend an den Controller, auf
die Hauptplatine ihres Computers. Der n&auml;chste Stecker, es wird
ein grauer sein, geh&ouml;rt auf das <a href="005.htm">IDE</a>-Laufwerk das als
&quot;Master&quot; eingestellt ist, der letzte Stecker ist schwarz, er
bleibt also entweder frei oder wird f&uuml;r ein zweites Ger&auml;t,
den &quot;Slave&quot; an diesem Bus verwendet. Beachten Sie bitte das
der UDMA-Bus mit diesem Kabel nur in der genannten Form korrekt
arbeiten wird. Er tut es m&ouml;glicherweise auch wenn das Kabel in
einer anderen Richtig verwendet wird, erreicht aber niemals die
spezifizierte Transferrate.
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/udmacabl.gif" border="0" width="335" height="249"></p>
<div align="center"><tt> Abbildung 1 - 3.5&quot; <a href="005.htm">IDE</a> UDMA Kabel f&uuml;r alle Computer
</tt>
</div>
<p>
<br>
<br>
</p>
<p>Das trifft auch zu wenn ihnen ihr Mac-Kumpel gesagt hat das dieses
Kabel, um eine zweite Platte in einen b&amp;w G3 oder einen noch
neueren G4 einzubauen, auch andersrum reinpasst. Es passt sicher
andersrum rein, die Stecker sind ja Baugleich, das Kabel ist aber
technisch f&uuml;r diese Richtung nicht ausgelegt.
</p>
<p>Es kommt daher so, gerade bei UDMA66, rasch zu Laufzeitfehlern,
Signalreflektionen, die sich auch in einem nicht Funktionieren
einzelner Laufwerke ausdr&uuml;cken k&ouml;nnen.
<br>
</p>
<p>Wenn Sie keine UDMA66 Ger&auml;te eingebaut oder gekauft haben
brauchen sie das 80 polige, teuere <a href="005.htm">IDE</a>-Kabel nicht, f&uuml;r rein
optische Zwecke ist dies noch immer zu teuer.
<br>
</p>
<p>Die einzelne rote Ader, auch am 80 poligen Kabel, markiert wie
sonst auch, immer den <a href="00b.htm">Pin</a> 1 am <a href="005.htm">IDE</a> Kabel. <a href="00b.htm">Pin</a> 1 der <a href="005.htm">IDE</a> Buchsen an den
Ger&auml;ten befindet sich immer direkt neben dem Stromanschlu&szlig;
eines Laufwerks.
<br>
</p>
<p>Sie sollten an so einen Bus, wegen der Geschwindigkeit, auch kein
CD- oder ZIP- Laufwerk anschliessen und betreiben.
<br>
</p>
<p>
<br>
<br><b> <a href="004.htm">SCSI</a>-Bus </b>
<br>
<br>
</p>
<p><a href="004.htm">SCSI</a> ist seit 1986 offizieller ANSI Standard und ging Anfang der
80er Jahre aus den SASI Spezifikationen hervor an den die Fa. Adaptec,
neben andern Herstellern, stark beteiligte. <a href="004.htm">SCSI</a> ist ein Bussystem,
das speziell f&uuml;r Multitasking ausgelegt wurde. Es zeichnet sich
durch eine hohe Flexibilit&auml;t, Geschwindigkeit,
Zuverl&auml;ssigkeit und eine Vorteilhafte Erweiterbarkeit aus.
<br>
</p>
<p>Einen <a href="004.htm">SCSI</a>-Bus erkennen Sie am 50 poligen Flachbandkabel
<br>Extern kommen DB25 (D-SUB) oder 50polige Centronicsstecker zum
Einsatz.
<br>
</p>
<p>
<br><b> <a href="005.htm">IDE</a> und <a href="004.htm">SCSI</a> </b>
<br>
<br>
</p>
<p>(E)<a href="005.htm">IDE</a> und <a href="004.htm">SCSI</a> ist im parallelen Betrieb von (E)<a href="005.htm">IDE</a> und <a href="004.htm">SCSI</a>
Ger&auml;ten, ein jedes an seinem eigenen Bus, in einem einzigen
Computer zusammen problemlos m&ouml;glich. Es reicht die <a href="004.htm">SCSI</a>- und
<a href="005.htm">IDE</a>- Ger&auml;te physikalisch korrekt an ihrem Hostadpter/Controller
anzuschliessen. Einzig das <a href="004.htm">SCSI</a>-System mu&szlig; am Host und am
pysikalischen Busende, immer nach oder am pysikalisch letzten
Ger&auml;t, korrekt terminiert werden.
<br>
</p>
<p>
<br><b> <a href="005.htm">IDE</a> vs ATAPI </b>
<br>
<br>
</p>
<p>Beachten Sie bitte das es beim Anschlu&szlig; <a href="005.htm">IDE</a> oder ATAPI
keinen Unterschied gibt, es ist ein und das selbe!
<br>
</p>
<p>Der Unterschied ist die Software-Schnittstelle von <a href="005.htm">IDE</a> bzw. ATAPI!
<br>Beide sind v&ouml;llig verschieden und nicht kompatibel (!!!).
ATAPI ist sehr vereinfacht ausgedr&uuml;ckt, <a href="004.htm">SCSI</a> am <a href="005.htm">IDE</a>-Port.
<br>
</p>
<p>Noch genauer:
<br>
</p>
<p>ATAPI-Ger&auml;te &quot;verstehen&quot; eine Reihe von
<a href="004.htm">SCSI</a>-Kommandos. Einfache <a href="005.htm">IDE</a>-Ger&auml;te (kein ATAPI) sind in der
Regel ziemlich dumm und verstehen keine ATAPI- bzw. keine
<a href="004.htm">SCSI</a>-Kommandos. Der Regel nach sind das eigentlich immer Festplatten,
von denen es meines Wissens grunds&auml;tzlich aber keine
ATAPI-Ausf&uuml;hrungen gibt, also sind die immer gleich <a href="005.htm">IDE</a> zu
behandeln. Vermutlich w&uuml;rden daran auch die meisten
Festplattentreiber f&uuml;r PCs direkt versagen.
<br>
</p>
<p>Alle -anderen- Ger&auml;te am <a href="005.htm">IDE</a>-Port sind meistens
ATAPI-Ger&auml;te.
<br>
</p>
<p>Weil <a href="004.htm">SCSI</a>- und ATAPI-Befehlssatz zuf&auml;llig viel Gemeinsam
haben kann ein <a href="004.htm">SCSI</a>-Treiber grunds&auml;tzlich auch ATAPI-Peripherie
sinnvoll unterst&uuml;tzen. Der in die Atari Treibersoftware
&quot;HDDriver&quot; integrierte <a href="004.htm">SCSI</a>-Treiber tut das generell. Das
wiederum ist wichtig f&uuml;r CD-Treiber wie z.B SPIN!, die dann so
ohne &eacute;nderungen sowohl <a href="004.htm">SCSI</a>- als auch ATAPI-Ger&auml;te direkt
ansprechen k&ouml;nnen. Wie n&uuml;tzlich das ist wird daran deutlich,
dass es den Atari CD-Treiber SPIN! 0.34 schon vor dem Atari Milan gab
und SPIN! trotzdem <a href="00d.htm">CD-ROM</a>-Laufwerke an der <a href="005.htm">IDE</a>-Schnittstelle des Atari
Milan ansprechen kann, da HDDRIVER eben einen geeigneten <a href="004.htm">SCSI</a>-Treiber
daf&uuml;r bereitstellt.
<br>
</p>
<p>An diesem Faktum k&ouml;nnen sich Programmierer anderer
Plattformen auch heute noch gerne eine Scheibe abschneiden, auch wenn
&uuml;ber den &quot;Atari&quot; gerne gelacht wird.
<br>
</p>
<p>Auch die <a href="00f.htm">CD-Recorder</a>-Software f&uuml;r den Atari Milan arbeitet
direkt &uuml;ber diese Schnittstelle. Weil <a href="005.htm">IDE</a>-Festplatten nicht
ATAPI-kompatibel sind und eigene Kommandos benutzen ist es
erforderlich (bzw. n&uuml;tzlich), f&uuml;r diese Platten eine
<a href="004.htm">SCSI</a>-Emulation bereitzustellen. Anwendungen, die den <a href="004.htm">SCSI</a>-Treiber
nutzen, k&ouml;nnen so <a href="005.htm">IDE</a>-Platten &uuml;ber dieselbe Schnittstelle
ansprechen wie <a href="004.htm">SCSI</a>- und ATAPI-Ger&auml;te. Daher emuliert der
<a href="004.htm">SCSI</a>-Treiber f&uuml;r HDDriver f&uuml;r <a href="005.htm">IDE</a>-Platten alle f&uuml;r
Festplatten vorgeschriebenen <a href="004.htm">SCSI</a>-3-Kommandos.
<br>
</p>
<p>Sie d&uuml;rfen halt eines nicht &uuml;bersehen:
<br>
</p>
<p>Nur ein sehr kleiner Teil des <a href="004.htm">SCSI</a>-Funktionsumfangs ist bei ATAPI
m&ouml;glich. Prinzipbedingt gibt es eine Menge an
Einschr&auml;nkungen. Wer hierzu Details wissen will mu&szlig; sich
die ATAPI Spezifikationen besorgen. Auch das findet man direkt im
Internet, Suchworte wie z.B &quot;ATAPI&quot; f&uuml;hren immer zum
Ziel.
<br>
</p>
<p>ATAPI-Ger&auml;te, egal an welchem Computer, ben&ouml;tigen meist
einen speziellen Treiber oder eine Anpassung des selben. Einzigst der
HDDriver f&uuml;r Atari Computer ist mir als Treiber bekannt der
ATAPI-, <a href="004.htm">SCSI</a>- und <a href="005.htm">IDE</a>-Ger&auml;te gleichermassen und direkt
unterst&uuml;tzt.
<br>
</p>
<p>
<br>
<br><b> Powersave </b>
<br>
</p>
<p>Jedes neuere BIOS unterst&uuml;tzt Powermanagement nach der EPA
Norm.
<br>
</p>
<p>Mit ihm l&auml;sst sich bei geeigneten (E)<a href="005.htm">IDE</a> Festplatten nach
einiger Zeit ohne Festplattenzugriff der Plattenmotor abschalten. Dies
spart ein paar Watt Strom und senkt den L&auml;rmpegel deutlich, wobei
man moderne Festplatten vom Laufger&auml;usch her fast nicht mehr
h&ouml;ren kann. Bei Note- PowerBooks nicht ganz zu
vernachl&auml;ssigen!
<br>
</p>
<p><a href="004.htm">SCSI</a> Festplatten unterst&uuml;tzen ebenfalls meist einen Powersave
Modus, nur ist dieser nicht durch das PC BIOS zu aktivieren. Entweder
&uuml;bernimmt der <a href="004.htm">SCSI</a> Hostadapter oder ein Treiber dieses
Powermanagement.
<br>
</p>
<p>Verwenden sie diesen Powersave-Mode sinnvoll!
<br>
</p>
<p>Bei st&auml;ndigen hoch- und runterfahren einer Festplatte leidet
deren Lebensdauer!
<br>
</p>
<p>Zeitfenster von 15 Minuten sind vertretbar, alles darunter eher
nicht!
<br>
</p>
<p>
<br>
<br><b> Speicherorganisation </b>
<br>
</p>
<p>Jede Festplatte hat eine feste Struktur, nach der die Daten
gespeichert werden. Diese Struktur ergibt sich aus der Anzahl der
Scheiben, der Anzahl der konzentrisch beschreibbaren Spuren je
Scheibenseite und der Anzahl einzelner Speicherabschnitt (Sektoren)
auf jedem dieser konzentrischen Spuren.
<br>
</p>
<p>Die Gr&ouml;&szlig;e eines Sektors ist festgelegt auf 512 Byte.
Die &uuml;brigen Gr&ouml;&szlig;en legt der Hersteller der Festplatte
fest. Sie sind &uuml;blicherweise auf dem Festplattengeh&auml;use
aufgedruckt.
<br>
</p>
<p>Hierbei bedeuten:
<br>
</p>
<p>- Zylinder: Anzahl der konzentrischen Spuren je Scheibenseite
<br>- K&ouml;pfe: Die Anzahl der Schreib-/Lesek&ouml;pfe (Diese ist
doppelt so hoch wie die Anzahl der Scheiben)
<br>- Sektoren: anzahl der Sektoren je Zylinder
<br>
</p>
<p>
<br>Aus diesen Angaben kann die Speicherkapazit&auml;t wie folgt
berechnet werden:
<br>
</p>
<p>Zylinder x K&ouml;pfe x Sektoren x 512 Byte
<br>
</p>
<p>Beispiel:
<br>Angaben auf der Festplatte:
<br>989 Zylinder, 16 K&ouml;pfe, 63 Sektoren
<br>989 x 16 x 63 x 512 Byte = 510.418.944 Byte
<br>Da 1MB genau 1.048.576 Byte beinhalten ergibt sich eine
Speicherkapazit&auml;t von 487 MByte.
<br>
</p>
<p>
<br>
<br><b> Serial ATA (SATA) </b>
<br>
</p>
<p>Mit den Macintosh G5 zieht eine neue Bus-Generation in die
Hardwarewelt ein.
<br>
</p>
<p>Mit der neuen Technik halten auch neue Begriffe Einzug, wie
Hypertransport, PCI-X und SATA. Der folgende Artikel soll einen kurzen
&ouml;berblick &uuml;ber &quot;Serial ATA&quot;, dem neuen
Festplatten-Schnittstellen-Standard geben.
<br>
</p>
<p>Serial ATA ein serielles &Uuml;bertragungsprotokoll, bei dem die
Bits von Datenw&ouml;rtern &uuml;ber eine Leitung hintereinander
(seriell) gesendet werden, im Gegensatz zur parallelen
&ouml;bertragung, bei der die Bits eines Datenworts &uuml;ber jeweils
getrennte Leitungen laufen.
<br>
</p>
<p>Fr&uuml;her ist man immer davon ausgegangen, dass eine parallele
&Uuml;bertragung immer schneller sein m&uuml;sste als eine serielle,
da eben mehrere Leitungen gleichzeitig verwendet werden.
<br>
</p>
<p><a href="004.htm">SCSI</a> und PCI sind beispielsweise schneller als USB und die
serielle Schnittstelle. Mit zunehmender Taktrate stellte sich aber
heraus, dass die &ouml;bertragung &uuml;ber zumeist parallel laufende
Leitungen auch zu &uuml;bersprechen und Laufzeitdifferenzen
f&uuml;hrten und eine Taktsteigerung irgendwann am Ende war,
w&auml;hrend gleichzeitig die serielle &ouml;bertragung noch
wesentlich h&ouml;here Taktraten gestattete.
<br>
</p>
<p>Dies f&uuml;hrte zu einer Weiterentwicklungen von ATA zu SATA.
Auch bei <a href="004.htm">SCSI</a> geht die Richtung mittlerweile zu einer seriellen
&ouml;bertragung &uuml;ber.
<br>
</p>
<p>SATA ist nicht die einzige neue serielle Technologie in den neuen
PowerMac G5. Auch der Hypertransport-Bus &uuml;bertr&auml;gt die
Datenbits seriell; er verwendet daf&uuml;r jedoch nicht nur eine
Leitung, sondern parallel bis zu 32 Leitungen und das in jede
Richtung.
<br>
</p>
<p>Der Hypertransport-Bus ist eine komplette Verschmelzung von
paralleler und serieller Technologie und vereint beide Welten.
<br>
</p>
<p>In der aktuellen Spezifikation gestattet SATA bis zu 150
Megabyte/Sec, im Vergleich zum bisherigen ATA Standard mit 133 MB/Sec
ist das rechnerrisch eine Steigerung um 12.7 %
<br>
</p>
<p>In der Praxis scheinen weder Geschwindigkeit noch CPU-Nutzung bei
SATA gegen&uuml;ber EIDE signifikant besser geworden zu sein. Die
CPU-Nutzung soll sich angeblich verbessern. Testen kann ich das so
nicht.
<br>
</p>
<p>Derzeit sind die Vorteile von SATA allerdings noch nicht so sehr
in der Geschwindigkeit zu sehen, sondern in anderen Features von SATA
zu finden.
<br>
</p>
<p>Statt eines Flachbandkabels mit 40 Polen und entsprechend breiten
Steckern, wie bei ATA, verwendet SATA runde d&uuml;nne Kabel mit 7
Leitungen und dementsprechend kleinen Steckern. Der Standard definiert
zudem auch noch einen Stromversorgungsanschluss mit 15 Adern, der 3.3,
5 und eine 12V Spannung bereitstellt.
<br>
</p>
<p>Jedes Ger&auml;t ist bei SATA mit einem eigenen Kabel direkt mit
dem Controller verbunden. Damit entf&auml;llt die Notwendigkeit einen
Master und einen Slave per <a href="009.htm">Jumper</a> zu definieren oder darauf zu hoffen
das &quot;CableSelect&quot; funktioniert. Das ist Geschichte.
<br>
</p>
<p>Defekte Stecker und Kabel beschr&auml;nken sich somit auf ein
Laufwerk, nicht auf einen ganzen Bus, den man dann absuchen durfte.
SATA ist f&uuml;r das Betriebssysteme transparent, das gesamte
Datenhandling ist in die Steuerungselektronik der Ger&auml;te verlegt.
<br>
</p>
<p>Daher gibt es auch schon Adapter die den Anschlu&szlig; normaler
ATA Festplatten an einen neuen SATA Controller erm&ouml;glichen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p align="center"><img src="image/img.gif" border="0" width="50" height="40"></p>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br> Letzte Aktualisierung am 28. Dezember 2003</address>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="001.htm"><img src="udo_lf.gif" alt="Autor" border="0" width="24" height="24"></a>
<a href="003.htm"><img src="udo_rg.gif" alt="Master &amp; Slave" border="0" width="24" height="24"></a>
</td></tr></table>
</td></tr>
</table>
</body></html>
