<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
        "http://www.w3.org/TR/html4/loose.dtd">
<!-- last modified on 28.12.2003 -->
<html lang="de">
<head>
<title>
Harddrive - Tips &amp; Tricks zum Ger&auml;teanschlu&szlig;: SCSI
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta http-equiv="Content-Style-Type" content="text/css">
<meta http-equiv="Content-Script-Type" content="text/javascript">
<meta name="Generator" content="UDO 6.2 PL1 for MacOSX">
<meta name="Email" content="doit@doitarchive.de">
<link rev="made" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="author" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="chapter" href="001.htm" title="1 Autor">
<link rel="chapter" href="002.htm" title="2 Bussysteme">
<link rel="chapter" href="003.htm" title="3 Master &amp; Slave">
<link rel="chapter" href="005.htm" title="5 IDE">
<link rel="chapter" href="006.htm" title="6 Raid System">
<link rel="chapter" href="007.htm" title="7 USB &amp; FireWire">
<link rel="chapter" href="008.htm" title="8 Kalibrierung">
<link rel="chapter" href="009.htm" title="9 Jumper">
<link rel="chapter" href="00a.htm" title="10 Zugriff">
<link rel="chapter" href="00b.htm" title="11 Pin">
<link rel="chapter" href="00c.htm" title="12 Einbau">
<link rel="chapter" href="00d.htm" title="13 CD-ROM">
<link rel="chapter" href="00e.htm" title="14 CD Formate">
<link rel="chapter" href="00f.htm" title="15 CD-Recorder">
<link rel="chapter" href="010.htm" title="16 DVD Laufwerke">
<link rel="section" href="004001.htm" title="4.1 SCSI Adapter">
<link rel="start" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="home" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="first" href="001.htm" title="Autor">
<link rel="prev" href="003.htm" title="Master &amp; Slave">
<link rel="previous" href="003.htm" title="Master &amp; Slave">
<link rel="next" href="004001.htm" title="SCSI Adapter">
<link rel="last" href="010.htm" title="DVD Laufwerke">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border="0" cellspacing="0" cellpadding="0" width="100%">
<tr>
<td valign="top" width="128">
<table border="0" cellpadding="0" cellspacing="0" width="128">
<tr><td align="center"><a href="001.htm"><img src="icon/but1.gif" alt="Autor" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="002.htm"><img src="icon/but2.gif" alt="Bussysteme" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="003.htm"><img src="icon/but3.gif" alt="Master &amp; Slave" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="004.htm"><img src="icon/but4.gif" alt="SCSI" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="005.htm"><img src="icon/but5.gif" alt="IDE" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="006.htm"><img src="icon/but17.gif" alt="Raid System" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="007.htm"><img src="icon/but15.gif" alt="USB &amp; FireWire" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="008.htm"><img src="icon/but6.gif" alt="Kalibrierung" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="009.htm"><img src="icon/but7.gif" alt="Jumper" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00a.htm"><img src="icon/but8.gif" alt="Zugriff" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00b.htm"><img src="icon/but9.gif" alt="Pin" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00c.htm"><img src="icon/but10.gif" alt="Einbau" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00d.htm"><img src="icon/but11.gif" alt="CD-ROM" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00e.htm"><img src="icon/but12.gif" alt="CD Formate" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00f.htm"><img src="icon/but13.gif" alt="CD-Recorder" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="010.htm"><img src="icon/but14.gif" alt="DVD Laufwerke" border="0" width="100" height="30"></a></td></tr>
</table>
</td>
<td valign="top" width="100%">
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="003.htm"><img src="udo_lf.gif" alt="Master &amp; Slave" border="0" width="24" height="24"></a>
<a href="004001.htm"><img src="udo_rg.gif" alt="SCSI Adapter" border="0" width="24" height="24"></a>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr>
<td valign="top" width="8">&nbsp;</td><td valign="top" width="100%">
<h1><a name="SCSI">4 SCSI</a></h1>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p><tt> SCSI Bus </tt>
<br>
<br>
</p>
<p>Das bekannte &quot;SCSI&quot; existiert heute in verschiedenen
Formen die aber irgendwo alle unter mehr oder weniger einen Hut
passen. Wichtig sind die verschiedenen SCSI-Normen, welche auch z.T
nicht untereinander mischbar sind. Es w&uuml;rde dann immer zu
Fehlfunktionen kommen. Bedenken Sie das schon wenn sie eine
vermeidlich &quot;g&uuml;nstige&quot; SCSI-Festplatte kaufen.
<br>
</p>
<p>Die Auflistung ist nach 8- und 16 Bit SCSI aufgeteilt
<br>
</p>
<dl>
<dt><b>SCSI 1</b></dt><dd> 8 Bit
<br>Transferrate: 3 MB/Sec. (asynchron)
<br>8 Bit
<br>Transferrate: 5 MB/Sec. (syncron
<br>
<br>&nbsp;
<dt><b>SCSI 2</b></dt><dd> 8 Bit
<br>Transferrate: bis maximal 5 MB/Sec. (asynchron)
<br>
<br>&nbsp;
<dt><b>Fast SCSI 2</b></dt><dd> 8 Bit
<br>Transferrate: 10 MB/Sec. (asynchron)
<br>
<br>&nbsp;
<br>(Differential: +/- 2,5V statt 0V/+5V)
<br>&nbsp;
<dt><b>Ultra SCSI</b></dt><dd> 8 Bit
<br>Transferrate: 20 MB/Sec. (synchron)
<br>
<br>&nbsp;
<dt><b>Fast 40 SCSI</b></dt><dd> 8 Bit
<br>Transferrate: 40 MB/Sec. (synchron)
<br>
<br>&nbsp;
<dt><b>Wide SCSI 2</b></dt><dd> 16 Bit
<br>Transferrate: 10 MB/Sec. (asynchron)
<br>
<br>&nbsp;
<dt><b>Fast Wide SCSI 2</b></dt><dd> 16 Bit
<br>Transferrate: 20 MB/Sec. (synchron)
<br>
<br>&nbsp;
<dt><b>Ultra Wide SCSI</b></dt><dd> 16 Bit
<br>Transferrate: 40 MB/Sec. (synchron)
<br>
<br>&nbsp;
<dt><b>Fast Wide 40 SCSI</b></dt><dd> 16 Bit
<br>Transferrate: 80 MB/Sec. (synchron)
<br>
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Neben dem 16 Bit breitem Wide SCSI ist auch &quot;Wide 32&quot;
also Wide SCSI mit 32 Bit normiert worden. Dieser Standard ist jedoch
ohne praktische Bedeutung da hier extrem te&uuml;re Kabel zum Einsatz
kommen m&uuml;ssten.
</p>
<p>Ultra SCSI ist auch unter SCSI 3 bekannt und wird oft auch so
beworben. Diese SCSI-Norm ist meines Wissend nach nicht endg&uuml;ltig
spezifiziert und wirft in der Praxis (110 poliges Kabel!) manchmal
Probleme auf. Das normale 8 Bit SCSI wird zur besseren Unterscheidung
gerne auch &quot;Narrow SCSI&quot; genannt.
<br>
<br>
<br>
</p>
<p><b> Synchrone / Asynchrone &uuml;bertragung </b>
<br>
<br>
</p>
<p>Wenn Sender und Empf&auml;nger im Gleichtakt sind, mu&#130; nicht
nach jeder Daten&uuml;bertragung eine zus&auml;tzliche
Synchronisationsinformation &uuml;bertragen werden. Daher ist eine
synchrone Daten&uuml;bertragung am SCSI Bus durchweg immer schneller
als die asynchrone &uuml;bertragung.
<br>
<br>
</p>
<p><b> Differential SCSI </b>
<br>
<br>
</p>
<p>Bei Differential SCSI Devices ist, im Gegensatz zum normalen
&quot;Single Ended SCSI&quot; jede Signalleitung doppelt vorhanden.
Bei der Daten&uuml;bertragung ist nun nicht der Pegel auf einer
Leitung das zu &uuml;bertragende Bit, sondern die Pegeldifferenz
zwischen beiden Signalen ist die Information. Eine h&uuml;here
St&uuml;rsicherheit, laut Hersteller, soll hier der einschlagende
Vorteil sein.
<br>
<br>
<br>
</p>
<p><b> Kabell&auml;nge </b>
<br>
<br>
</p>
<p>Ein immer wieder beliebtes Streitthema sind die
SCSI-Kabell&auml;ngen. Laut dem festgeschriebenen SCSI Standard sind
folgende Kabell&auml;ngen an einem SCSI Bus zugelassen. Die genannten
L&auml;ngen sind jeweils als Maximall&auml;ngen zu betrachten, hinzu
z&auml;hlen auch immer die interne Busl&auml;nge und externe
Busl&auml;nge. Kabel innerhalb externer Ger&auml;te z&auml;hlen daher
auch mit. Als eine L&auml;nge gilt also: Host -&gt; letztes
Ger&auml;t.
<br>
<br>
</p>
<dl>
<dt><b>SCSI 1</b></dt><dd> 6 Meter
<br>&nbsp;
<dt><b>Fast SCSI 2</b></dt><dd> 3 Meter
<br>&nbsp;
<dt><b>Differential SCSI 2</b></dt><dd> 25 Meter
<br>&nbsp;
<dt><b>Ultra Wide SCSI 2</b></dt><dd> 3 Meter: bis 4 Devices
<br>1.5 Meter bis 8 Devices
<br>
<br>&nbsp;
<dt><b>Ultra Wide SCSI 3</b></dt><dd> 2 Meter
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Das SCSI Kabel recht teuer sind haben sie, speziell als z.B
Mac-Benutzer sicher schon an der eigenen Geldb&uuml;rse erfahren. Aber
nur bei einem wirklich hochwertigen, und somit te&uuml;rem Kabel, ist
es m&uuml;glich die volle spezifizierte L&auml;nge eines SCSI Busses
auszunutzen zu k&uuml;nnen. Das trifft ganz speziell auf die
ne&uuml;ren und noch schnelleren SCSI-Modes zu. Von billigen,
d&uuml;nnen Kabeln kann man nur abzuraten. Ein internes Fast SCSI
Kabel kann dann schon leicht 60-80 DM kosten.
<br>
<br>
<br>
</p>
<p><b> Die Terminierung </b>
<br>
<br>
</p>
<p>Bei allen SCSI-Modes herrscht generell eine Terminierungs-Pflicht.
<br>(Auch wenn es bei einigen Atari-Modellen ohne geht..!!)
</p>
<p>Das bedeutet das der SCSI Bus jeweils an seinen physikalischen
Enden terminiert werden mu&szlig;. Das klingt sehr einfach, ruft aber
bei vielen Benutzern verwirrung auf den Plan. U.a werden dann genau
hier schlimme Fehler gemacht die u.U auch Datenverluste zur Folge
haben k&uuml;nnen.
<br>
<br>
<br>
</p>
<p align="center"><img src="image/term1.gif" border="0" width="396" height="218"></p>
<div align="center"><tt> Eine korrekte Terminierung Hostadapter/Ger&auml;t </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Beispiele f&uuml;r eine korrekte Terminierung bei der der
Computer/ Hostadapter in der Mitte einer SCSI-Kette, z.B wenn es einen
internen und einen externen SCSI-Bus gibt, eingebaut ist.
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/term2.gif" border="0" width="396" height="218"></p>
<div align="center"><tt> Eine korrekte Terminierung Ger&auml;t/Hostadapter/Ger&auml;t
</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Es spielt dabei theoretisch keine Rolle wo welches Ger&auml;t in
der Kette seinen Platz hat. Scanner, rein von der Logik her, da dieser
immer mal wieder abgebaut, legt man daher an das Ende eine SCSI-Kette.
Ich w&uuml;rde das auch mit einer 68poligen Festplatte machen da ich
so nur am Ende des Bus einen 50/68poligen Adapter f&uuml;r diese
Platte ben&ouml;tige.
<br>
</p>
<p>Das ist doch eigentlich sehr einfach, oder ?
<br>
</p>
<p>Zur einer richtigen Terminierung geh&ouml;rt die Speisung des SCSI
Bus mit TErMPWr, der Stromversorgung f&uuml;r die Terminierung (<a href="00b.htm">Pin</a>
38) (+5 V). Am SCSI Bus k&uuml;nnen mehrere Ger&auml;te TErMPWr
liefern.
</p>
<p>Vcc aller Terminatoren liegt &uuml;ber eine Diode (z.B 1N4001) an
+5 Volt. <a href="00b.htm">Pin</a> 38 eines SCSI2-Bus liegt &uuml;ber eine Diode 1N4001 und
einer Sicherung an +5 Volt. Diese Sicherung sollte max. 1 Amp
aushalten und kann in vielen F&auml;llen leider nur durch
ausl&ouml;ten Ersetzt werden.
<br>
</p>
<p>&uuml;blicherweise &uuml;bernimmt der SCSI Hostadapter die
Bereitstellung von TErMPWr.
</p>
<p>Bei SCSI 1 und SCSI 2 wird normalerweise mit passiver Terminierung
gearbeitet. Aktive Terminierung ist nie falsch. Bei den neuen SCSI
Normen wie z.B Ultra SCSI 3 ist hier allerdings eine aktive
Terminierung zwingend erforderlich.
<br>
</p>
<p>
<br><b> Die passive Terminierung: </b>
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/term3.gif" border="0" width="320" height="122"></p>
<div align="center"><tt> Abbildung 1 - Schaltung der passiven Terminierung </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Zum besseren Verst&auml;ndniss, hier die Schaltung, damit kann man
auch nachmessen. Ein Terminator enth&auml;lt 18 St&uuml;ck 220-Ohm
Widerst&auml;nde, geschaltet vom SCSI-Signal zum
TermPwr-Anschlu&szlig; des SCSI-Bus. Ebenso gibt es 18 St&uuml;ck
330-Ohm Widerst&auml;nde vom SCSI-Signal nach GND des SCSI-Bus.
Beachten Sie daher die Zeichnung:
<br>
</p>
<pre>TermPwr      --+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+
               |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
220 Ohm -&gt;     #  #  #  #  #  #  #  #  #  #  #  #  #  #  #  #  #  #
               |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
SCSI Signal -&gt; o  o  o  o  o  o  o  o  o  o  o  o  o  o  o  o  o  o
               |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
330 Ohm -&gt;     #  #  #  #  #  #  #  #  #  #  #  #  #  #  #  #  #  #
               |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
GND          --+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+

</pre>
<p>Wenn sie hier nun etwas Messen wollen, z.B ein SCSI-Signal zu GND,
haben sie immer auch eine Parallelschaltung von Widerst&auml;nden die
sie mit messen werden.
</p>
<p>Die generelle Formel, f&uuml;r diesen Fall, f&uuml;r diese
Terminatoren lautet:
<br>
</p>
<pre>r1*r2/(r1+r2).
</pre>
<p>Steckt der Terminator auf einem Bus, finden weitere
Parallelschaltungen statt die die gemessenen Signale verf&auml;lschen
werden. Durch weitere Terminatoren und andere Bauteilen, z.B in
Festplatten, messen Sie Widerst&auml;nde von bis zu 362 Ohm, parallel
bei den 220 Ohm Widerst&auml;nden geht das dann hinunter bis 137 Ohm.
<br>
</p>
<p>Nur damit man sieht welchen &quot;Mist&quot; man messen kann.
<br>
</p>
<p>
<br><b> Die aktive Terminierung: </b>
<br>
</p>
<p>Eine aktive Terminierung ist in der Schaltung wesentlich
aufwendiger als die passive Terminierung, sorgt aber f&uuml;r saubere
Signale. Vereinfacht ausgedr&uuml;ckt werden bei der aktiven
Terminierung durch eine Elektronik die passenden Widerst&auml;nde
erzeugt und damit eine optimale Signal&uuml;bertragung erreicht.
Terminiert wird das Signal gegen 2.85 V TErMPWr.
</p>
<p>Eine Terminierung, ein Busabschlu&szlig; dient dazu um
St&ouml;rungen auf dem SCSI Bus zu minimieren. Nur so sind relativ
lange Kabel an einem SCSI-Bus m&ouml;glich. Wenn keine korrekten
Terminatoren vorhanden sind werden die Signalflanken, bzw. die
Signalimpulse am Kabelende reflektiert und laufen solange im Kabel hin
und her bis sie sich durch &uuml;berlagerung gegenseitig aufgehoben
haben.
</p>
<p>Die eigentlichen Nutzsignale &uuml;berlagern sich so am
schnellsten.
</p>
<p>Die Terminierung erfolgt bei Ger&auml;ten meistens durch
Aktivierung des eingebauten Terminators mittels eines Jumpers oder
einem DIP Schalter. Bei &auml;lteren Ger&auml;ten erreicht man das
gleiche durch das aufstecken vom zumeist 3 Widerstandsarrays. Bei den
Widerstandsarrays ist <a href="00b.htm">Pin</a> 1 meist durch einen kleinen Punkt markiert.
Sie sollten solche Arrays daher immer korrekt einstecken k&ouml;nnen.
<br>
</p>
<p>In der Abbildung 2 sieht man das Beispiel einer aktiven
Terminierung:
<br>
<br>
</p>
<pre>
               +-----------+
TermPwr   -----| In    Out |------+------/\/\/\/-------SCSI Signal
               |   GND     |      |
               +-----------+      |
                    |             +------/\/\/\/-------SCSI Signal
                    |             |
GND  ---------------+             |
                                  +------/\/\/\/-------SCSI Signal
                                  |
                                 etc.
</pre>
<p>
<br>
</p>
<p>Etwas problematisch wird die Terminierung beim gemischten Betrieb
von z.B Wide SCSI und Narrow (normalem) SCSI an einem einzigen Bus.
Dazu ist mir das Schema eines aktiven Terminators in Bild 3 bekannt.
Laut Spezifikation sollen die Wide-Ger&auml;te nach dem letzten
Wide-Ger&auml;t mit einem aktivem Terminator abgeschlossen werden.
<br>
</p>
<p>Das normale (Narrow) 8Bit SCSI wird nach dem letzten (Narrow)
SCSI2 Ger&auml;t terminiert.
<br>
</p>
<p>Bei den verschiedenen H&auml;ndlern von Festplatten gibt es auch
alle Arten von SCSI-Adaptern. Man findet 50/68polige Adapter, mit oder
ohne Terminierung, in dem man den Suchbegriff &quot;SCSI-Apapter&quot;
verwendet. So ist man in der Lage sich seinen Bus so zu konfigurieren
das alle Ger&auml;te korrekt erkannt werden. Es ist dazu allerdings
notwendig zu Wissen wo man seine Ger&auml;te im Bus platziert und wo
sie terminiert werden m&uuml;ssen. Danach entscheidet sich die Art des
Kabeladapters und vor allem ob er eine Terminierung beinhalten
mu&szlig; oder nicht. Letzendlich ist das auch eine nicht unerhebliche
Preisfrage.
<br>
</p>
<p>
<br>
<br><b> Terminierung &uuml;berpr&uuml;fen </b>
<br>
</p>
<p>Alle Ger&auml;te und Computer vom SCSI Bus trennen.
<br>
</p>
<p>An einem pysikalischen Ende den zu pr&uuml;fenden Terminator
aufstecken bzw. eingeschaltet lassen. Mit einem Ohmmeter sollte man
nun auf jeder einzelnen Datenleitung einen Widerstand von ca. 100-130
Ohm messen k&uuml;nnen. Gegen GND. Wenn eine Datenleitung einen
wesentlich anderen Messwert oder gar keinen Anzeigt, ist die
Steckverbindung zu untersuchen und ggf. der Terminator zu tauschen!
<br>
</p>
<p>Beachten Sie bitte das bereits eine einzige fehlerhafte Leitung
St&ouml;rungen verursacht!
<br>
</p>
<p>Beachten Sie bitte weiterhin das bei &auml;lteren
SCSI-Ger&auml;ten mehrere Widerstandsarrays f&uuml;r einen
Abschlu&szlig; des SCSI-Bus zu sorgen haben.
<br>
</p>
<p>Die aktive Terminierung besitzt ein Widerstandsnetzwerk von 220
und 330 Ohm Widerst&auml;nden, jeweils pro Datenleitung zwischen
TermPower und Masse. Eine aktive Terminierung arbeitet aufgrund der
besseren Spannungspegel auch auf l&auml;ngeren SCSI- Leitungen immer
noch Einwandfrei w&auml;rend mit einer passiven Terminierung oft schon
St&uuml;rungen auf dem Bus vorhanden sind.
<br>
</p>
<p>An den Knotenpunkten, durch interne Reglung bei einer aktiven
Terminierung, entsteht hier ein Abschlu&szlig; von ca. 110 Ohm welcher
dem SCSI-Wellenwiderstand am n&auml;chsten liegt.
</p>
<p>Eine passive Terminierung bringt es an den Knotenpunkten auf
typisch ca. 130 Ohm.
<br>
</p>
<p>Die Impedanz, der Wellenwiderstand eines Flachbandkables
betr&auml;gt Herstellerspezifisch ca. 100 Ohm, -+ ca. 10%
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/term4.gif" border="0" width="396" height="285"></p>
<div align="center"><tt> Abbildung 3 - Terminierung bei gemischten Ger&auml;ten </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Gemischter Betrieb </b>
<br>
<br>
</p>
<p>Wenn sich eine SCSI-Karte und die Treiber Software an die SCSI
Norm h&auml;lt braucht man einen 68 pol. HD auf 50 pol.HD Adapter mit
eingebauten HighByte Terminator um an einer solchen Karte auch Narrow
SCSI Ger&auml;te betreiben zu k&uuml;nnen.
<br>
</p>
<p>Das trifft insbesondere bei den neuen G3 PowerMac zu.
<br>
</p>
<p>Es ist aber zu beachten, da&szlig; sobald der Adapter
angeschlossen ist, der SCSI-Bus vom LVD in den SE Modus umschaltet.
Also so langsam wie das langsamste Ger&auml;t wird!
<br>
</p>
<p>Die Transferrate sinkt von FAST 40 auf FAST 20 ab. Weiterhin
sollte man beachten, da&szlig; sich in diesem Fall die Busl&auml;nge
automatisch auf 3 Meter verk&uuml;rzt, mit maximal 4 Ger&auml;ten
(inkl. SCSI Karte) bzw. auf 1,5m mit max. 8 Ger&auml;ten (inkl. SCSI
Karte).
<br>
</p>
<p>Wichtig:
<br>
</p>
<p>Der so manipulierte SCSI-BUS mu&szlig; zwingend auf beiden Seiten
aktiv terminiert werden!
<br>Es sollten KEINE 25 pol. Steckverbinder in diesem Bus verwendet
werden
<br>Es sollten nur noch doppelt Abgeschirmte SCSI-Buskabel verwendet
werden!
<br>
</p>
<p>In Abbildung 3 - Beispiel &quot;A&quot; sieht man einen 16Bit
breiten Controller der bis zum 16Bit Ger&auml;t in 68poliger Leitung
ausgef&uuml;hrt ist. Nach dem 68poligen 16Bit Ger&auml;t soll noch ein
8Bit <a href="00d.htm">CD-ROM</a> angeschlossen werden. Der 16Bit Teil ist somit am 16Bit
Ger&auml;t abzuschliessen. Der dann nur noch 8Bit breite Bus mu&szlig;
nach dem letzen 8Bit Ger&auml;t abgeschlossen werden.
<br>
</p>
<p>In Abbildung 3 - Beispiel &quot;B&quot; sieht man einen 8Bit
breiten SCSI2 (Narrow) SCSI-Bus der ein (oder mehrere) 8Bit
Ger&auml;te betreibt. Nach dem letzten 8Bit Ger&auml;t wird aber noch
eine 16Bit / 68polige Festplatte angeschlossen. Hier schliesst man die
Platte am besten am Ende des Bus da man f&uuml;r diesen Zweck
50/68polige Kabeladapter erh&auml;lt die auch gleich die Terminierung
des Gesammtwerks beinhalten.
<br>
</p>
<p>Der Aufwand f&uuml;r Adapter/Verkabelung und Terminierung ist
meiner Meinung nach im Beispiel &quot;B&quot; geringer und damit
kosteng&uuml;nstiger. Das mag allerdings jeder f&uuml;r sich selbst
Entscheiden.
<br>
</p>
<p>Zu beachten ist noch das eine 16Bit Platte eine deutlich
h&uuml;here Performance besitzt und diese nur am 16Bit breiten SCSI
Bus auch voll zum Tragen kommen wird. Das ist kein Diskussionsansatz,
es steht nur hier weil sich vereinzelt Leute &uuml;ber langsame
Transferraten aufregen, obwohl die Platte lt. Hersteller deutlich mehr
kann.
<br>
</p>
<p>F&uuml;r die verwendete Treibersoftware, auf welcher Plattform
auch immer, stellt die Art des Anschlu&szlig; kein Problem dar. Die
Ger&auml;te m&uuml;ssen beim booten ALLE korrekt erkannt werden. Ist
das nicht der Fall, liegt ein Fehler, zumeist in der Terminierung,
vor.
<br>
</p>
<p>Von irgend welchen selbstgefrickelten Kabeladaptern und
Terminatoren ist abzuraten. &uuml;ber kurz oder lang f&uuml;hrt so
etwas immer wieder zu Problemen die hinter nicht einmal mehr sofort
erkennbar sind.
<br>
</p>
<p>
<br>
<br><b> Zwei Computer an einer SCSI Festplatte? </b>
<br>
</p>
<p>Im Prinzip ja, aber es gibt Einschr&auml;nkungen.
<br>
</p>
<p>Alle verwendeten Computer/Hostadapter m&uuml;ssen Bus-Arbitration
unterst&uuml;tzen.
</p>
<p>Die beiden verwendeten Computer m&uuml;ssen unterschiedliche
SCSI-IDs besitzen, bedenken sie bitte das die Computer/Hostadapter
meistens die h&uuml;chste SCSI-ID, also ID7 vorbelegt haben. Bei
einigen Hostsadaptern kann das nicht ver&auml;ndert werden.
</p>
<p>Nicht nur die Festplatten m&uuml;ssen sich Einwandfrei mit einer
eindeutigen SCSI-ID identifizieren.
</p>
<p>Beim Atari ist es m&ouml;glich, bei Verwendung des HDDrivers, die
SCSI-ID zu &auml;ndern. Bei einigen &auml;lteren Macintosh ist es
nicht m&uuml;glich. Da entscheidet sich schon von vorne herein ob man
eine Festplatte zusammen mit einem anderen Computer benutzen kann oder
nicht.
<br>
</p>
<p>Bei altem Atari TOS ist die Bootfestplatte im TOS auf ID0 gelegt,
da&szlig; kann Probleme bereiten. Insgesamt d&uuml;rfen nicht mehr als
8 SCSI Ger&auml;te, die beiden Computer z&auml;hlen mit, an einem 8Bit
SCSI-BUS betrieben werden.
<br>
</p>
<p>Beide Computer m&uuml;ssen ihre Verwaltungsrechte abgeben
k&uuml;nnen. Bus-Arbitrierung ist nur bei manchen Bussen m&uuml;glich.
<br>
</p>
<p>Die Kabell&auml;nge darf bei 8Bit (Narrow) SCSI 2 Meter auf keinen
Fall &uuml;berschreiten.
<br>
</p>
<p>Die jeweiligen Enden eines solchen SCSI Bus immer aktiv
Terminieren, was durch beide Computer der Regel nach auch geschieht.
Wird das nicht beachtet ist mit herben Datenverlusten, schon beim
ersten Versuch, zu rechnen.
<br>
</p>
<p>
<br>Wichtig:
<br>
</p>
<p>1. Stellen sie vor dem Anschlu&szlig; an zwei Computer ein
Vollbackup dieser Festplatte an.
<br>
<br>
</p>
<p>2. In den offenen Laufwerksfenstern mu&szlig; nicht unbedingt ein
Aktualisierung stattfinden wenn eine Datei von einem Computer auf eine
solche Festplatte gelegt wird. Unter Windows kann mit der Taste
&quot;F5&quot; aktualisieren. Auf einem Atari mit &quot;ESC&quot;
<br>
</p>
<p>
<br>3. Verwenden sie ausschliesslich ein Filesystem das von beiden
Computern benutzt werden kann. Der Regel nach ist das 8+3
</p>
<p>
<br>4. Verwenden sie keine Umlaute in Dateinamen. Stellen sie vorher
fest ob die Verwendung langer Dateinahmen m&ouml;glich ist.
<br>
</p>
<p>
<br>5. Greifen sie stets nur von EINEM der Computer auf die ein und
die selbe Datei zu!
<br>L&ouml;schen sie nicht von Computer 1 w&auml;hren Computer 2 auf
die Platte schreibt.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> SCSI-ID / LUN </b>
<br>
<br>
</p>
<p>Jedem Device am SCSI Bus wird eine ID zugeordnet. Unter dieser
speziellen, immer nur einmal vorhandenen ID wird das Ger&auml;t am
SCSI Bus identifiziert.
</p>
<p>Entsprechend den maximalen Ger&auml;ten gibt es f&uuml;r 8
Bit-SCSI daher 8 IDs und f&uuml;r Wide SCSI 16 IDs. Die h&ouml;chste
ID wird idr. immer vom SCSI Hostadapter selbst belegt, also meistens
dem Computer selber. Bei 8 Bit-SCSI bleiben demnach also die IDs 0..6
f&uuml;r SCSI Ger&auml;te frei. Alle SCSI Hostadapter suchen beim
booten beginnend von ID 0 alle IDs nach Ger&auml;ten ab. Bootdevice
ist zumeist das Ger&auml;t mit der niedrigsten ID.
<br>
</p>
<p><a href="00d.htm">CD-ROM</a>-Wechsler, RAID Hostadapter arbeiten auch mit Sub-IDs, den
sogenannten LUNs. Jede CD eines <a href="00d.htm">CD-ROM</a> Wechslers bekommt eine eigene
LUN und wird unter dieser angesprochen. Das bedeutet genauer, als
Beispiel, dass es auf der SCSI ID 1.0 noch ein weiteres Ger&auml;t
gibt. Beim Atari k&ouml;nnen Sie die LUNs mit dem HDDriver ab V 7.6
korrekt verwenden.
<br>
<br>
<br>
</p>
<p><b> UW-SCSI wo und wie, ein Beispiel </b>
<br>
</p>
<dl>
<dt><b>Frage</b></dt><dd> Ich m&ouml;chte eine UltraWide-SCSI-Platte (IBM DCAS-34330)
&uuml;ber einen Adapterstecker am 50 poligen SCSI-Kabel betreiben.
Mein Adaptec 2940UW zeigt sie zwar beim Booten mit konrekter
Typenbezeichnung und SCSI-ID an, jedoch l&auml;sst sie sich nicht
ansprechen.
<br>&nbsp;
<dt><b>Antwort</b></dt><dd> SCSI-Platte und Adapter handeln zu Beginn der Kommunikation aus,
ob sie die Daten mit 16 bit oder nur mit 8bit &uuml;bertragen wollen
(Wide Negotiation) Da es sich bei diesem SCSI-Adapter aber um ein
Wide-<a href="004001.htm">SCSI Adapter</a> handelt und auch die Festplatte Wide SCSI
beherrscht, gehen die beiden davon aus, sie k&uuml;nnten 16 bit breit
kommunizieren. Das 50 polige Kabel &uuml;bertr&auml;gt aber leider nur
die unteren acht Datenbits, so da&szlig; jedes zweite Byte auf dem Weg
zwischen Festplatte und Adapter verlorengeht. Schaltet man nun im
Setup des Hostadapters die Wide Negotiation f&uuml;r die SCSI-ID der
Platte ab, dann l&auml;uft die &uuml;bertragung zwischen Platte und
Hostadapter auch mit 8 bit und die Daten werden vollst&auml;ndig
&uuml;bertragen. Au&szlig;erdem sollten man &uuml;berpr&uuml;fen ob
die Festplatte nicht von sich aus schon eine Wide Negotiation
durchf&uuml;hrt &quot;Target Initiated Wide Negotiation&quot;.
<br>&nbsp;
<br>Aktuelle Festplatten haben dazu immer einen <a href="009.htm">Jumper</a>.
<br>
<br>&nbsp;
<br>Achtung: Bei den ,Entry Level Server`-Modellen ist die Wide
Negotiation bei gesetztem <a href="009.htm">Jumper</a> eingeschaltet (DCAS, DDrS),
w&auml;hrend es bei den High-End-Laufwerken genau umgekehrt ist (DrVS,
DGVS, DGHS).
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/6880ad.gif" border="0" width="681" height="284"></p>
<div align="center"><tt> Abbildung 4 - <a href="004001.htm">SCSI Adapter</a> 68 / 80 polig </tt>
</div>
<p>
<br>
<br>
</p>
<p>Mit dem Adapter aus Abbildung 4 und &auml;hnlicher Adapter, ist
man in der Lage die verschieden SCSI-Welten funktionsf&auml;hig
miteinander zu verbinden. Der Bus ist dabei aber niemals schneller als
der verwendete Contoller. Ein 8Bit Ger&auml;t an einem 16Bit Bus wird
nie so schnell sein wie ein 16Bit Ger&auml;t an einem 16Bit Bus.
<br>
</p>
<p>Alle genannten Kabeladapter erhalten sie im einschl&auml;gigen
Fachhandel und vor allem dort wo 68 und 80polige Festplatten verkauft
werden. Festplatten mit einem 50poligen Anschlu&szlig; geh&ouml;ren
langsam der Vergangenheit an und sind immer seltener Aufzutreiben.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> SCSI Leitungstheorie </b>
<br>
</p>
<p>Jedes Ger&auml;t belastet den Bus mit, (10pF bei 10MHz sind)
&lt;2kOhm). H&auml;lt man die restlichen randbedingungen aus dem
Standard ein, z.B. &quot;stub clustering&quot;, d.h. der minimale
Abstand zwischen 2 Ger&auml;ten, ist sichergestellt, da&szlig; keine
besonderen St&ouml;rungen auftreten. Das perfekte Signal gibt es
nicht.
<br>
</p>
<p>Ein Treiber mit Z=132Ohm in der Mitte eines Busses mit Z=100Ohm
f&uuml;hrt zu einem reflexionsfaktor von r=(57-100)/(57+100) = -0.27.
Deutlich zu sehen das dies nichts taugt.
<br>
</p>
<p>Ein Leitungsempf&auml;nger mit einer Eingangsimpedanz von 100 Ohm,
der in der Mitte eines SCSI-Busses angeschlossen ist, w&uuml;rde eben
dort heftige Reflexionen verursachen.
<br>
</p>
<p>Der SCSI-2 Standard fordert dagegen mindestens 1.25kOhm (max.
0.4mA bei Vil=0.5V), zusammen mit den maximal erlaubten 25pF macht das
dann 10MHz:
<br>
</p>
<p>Z=1250Ohm + j*637Ohm, damit ergibt sich ein Betrag des
reflexionsfaktors von 0.03 - nahe beim Idealfall 0.
<br>
</p>
<p>Dazu kommt dann noch der Effekt durch die Leitungsabzweigung auf
dem Ger&auml;t, deren Maximall&auml;nge daher auch begrenzt ist.
<br>
</p>
<p>Der SCSI-Standard fordert, da&szlig; ein ausgeschaltetes
Ger&auml;t den SCSI-Bus nicht mehr belasten darf als ein
eingeschaltetes - das geht durchaus. Wenn es nicht geht, ist das
betreffende Ger&auml;t zumeist defekt.
<br>
</p>
<p>Leitungstreiber bei SCSI sind generell niederohmig. Die
Empf&auml;nger liegen ebenfalls mindestens im KOhm-Bereich.
<br>
</p>
<p>
<br><b> Verschaltung externer SCSI Bus </b>
<br>
</p>
<p>Nachfolgend finden Sie ein Beispiel wie man einzelne externe
SCSI-Ger&auml;te korrekt miteinander verbindet. Die dazu notwendigen
Kabel, Adapter und Terminatoren erh&auml;lt man im Fachhandel.
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/scsibus.gif" border="0" width="431" height="737"></p>
<div align="center"><tt> Abbildung 1 - SCSI Ger&auml;te anschliessen.. </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br><b> SCA SCSI / SCSI Hotplug </b>
<br>
</p>
<p>SCA-Adapter, ein Stichwort das man schon geh&uuml;rt hat, zumeist
aber nichts damit anfangen kann.
<br>
</p>
<p>SCSI2, wie z.B am Atari und Amiga bekannt, mit den dort heute noch
&uuml;blichen SCSI-Hostadaptern und den noch &uuml;blichen 25 oder 50
poligen Kabeln ist nicht Hotplug-f&auml;hig, auch wenn diverse
Oberlehrer im Mausnetz das Gegenteil behaupten und dar&uuml;ber auch
noch lautstarke &ouml;ffentliche Doktorarbeiten verfassen.
<br>
</p>
<p>Alle diese Ger&auml;te sollten sie nur umstecken wenn sie und der
Computer ausgeschaltet sind.
<br>
</p>
<p>Normal bekannte, 50 polige SCSI2 Festplatten, sind nicht mehr dick
ges&auml;ht und werden wegen mangelnder Nachfrage leider oft nicht
mehr gelagert oder Hergestellt.
<br>
</p>
<p>Hotplugf&auml;hig - im Sinn von w&auml;rend dem Betrieb
umsteckbar, w&auml;rend -keine- Daten transferriert werden, wird ein
SCSI-Bus erst <b>-nach-</b> einem sog. SCA-Adapter. Genauer: Sie
schliessen ihre Platte nach einem solchen Adapter an. Dann k&ouml;nnen
sie die Platte am eingeschalteten SCSI-Bus an- und abstecken. Vorher
nicht.
<br>
</p>
<p>Bei SCSI-Ger&auml;ten die nach einem SCA-Adapter angeschlossen
wurden werden beim abziehen des Bussteckers zuerst die Daten- und
danach erst die GND-Leitungen getrennt. Das ist am Busstecker
mechanisch gel&ouml;st und so gewollt. Die Hersteller garantieren
dabei die geforderte Hotplugf&auml;higkeit von SCSI in jeder Form.
<br>
</p>
<p>In der Hauptsache findet man das bei RAID-Systemen.
<br>
</p>
<p>SCA-Adapter sind auch Umsetzer der Anschlu&szlig;form und sie
terminieren dabei auch den Wide- bzw. die obere H&auml;lfte des 16 Bit
SCSI Bus. Schnelle Wide-SCSI Festplatten, die nach so einem Adapter,
an einem 8 Bit SCSI Bus betrieben werden, z.B am Atari, der
ausschliesslich einen 8Bit SCSI2 Bus zur Verf&uuml;gung stellt,
erreichen daher nie ihre volle Transferleistung.
<br>
</p>
<p>SCSI-Hotplugging ist technisch klar definiert, einige
Festplattenhersteller garantieren daf&uuml;r, verkaufen es als Feature
und es funktioniert auch in der Praxis gut, einfach und sicher.
<br>
</p>
<p>Sofern man seine Ger&auml;te <b> -nach-</b> besagtem SCA-Adapter
vom SCSI Bus trennt. Nicht vorher und nicht w&auml;hrend Daten
transportiert werden.
<br>
</p>
<p>Trennen Sie den Bus vor einem SCA-Adapter, z.B einen 8 Bit Bus, so
ist das ihr Problem.
<br>Der SCSI Chip beim Atari ist ein 5380, ein 83C30 bzw. 5380 PLCC.
<br>Der kostenintensive Austausch dieser Chips ist in DOITF030 und
DOITST beschrieben.
<br>
</p>
<p>
<br>
<br><b> <a href="006.htm">Raid System</a> </b>
<br>
</p>
<p>Als RAID bezeichnet man eine Gruppe von Standards zur
Erh&ouml;hung der Datensicherheit in professionell genutzten
Massenspeichersystemen. Der Standard geht auf eine
Ver&ouml;ffentlichung von Gibson, Katz und Patterson aus dem Jahre
1987 zur&uuml;ck.
<br>
</p>
<p>Die Grundidee von RAID ist es, durch die (redundante) Verwendung
mehrerer Festplatten ein schnelles, fehlertolerantes
Festplatten-Verbundsystem aufzubauen. Dazu ist in der Regel ein
spezieller SCSI oder <a href="005.htm">IDE</a> Hostadapter notwendig.
<br>
</p>
<p>
<br>Mehr dazu finden sie im Artikel RAID Systeme
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p align="center"><img src="image/img.gif" border="0" width="50" height="40"></p>
<ul class="content">
<li> 4.1 <a href="004001.htm">SCSI Adapter</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br> Letzte Aktualisierung am 28. Dezember 2003</address>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="003.htm"><img src="udo_lf.gif" alt="Master &amp; Slave" border="0" width="24" height="24"></a>
<a href="004001.htm"><img src="udo_rg.gif" alt="SCSI Adapter" border="0" width="24" height="24"></a>
</td></tr></table>
</td></tr>
</table>
</body></html>
