<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
        "http://www.w3.org/TR/html4/loose.dtd">
<!-- last modified on 28.12.2003 -->
<html lang="de">
<head>
<title>
Harddrive - Tips &amp; Tricks zum Ger&auml;teanschlu&szlig;: Raid System
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta http-equiv="Content-Style-Type" content="text/css">
<meta http-equiv="Content-Script-Type" content="text/javascript">
<meta name="Generator" content="UDO 6.2 PL1 for MacOSX">
<meta name="Email" content="doit@doitarchive.de">
<link rev="made" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="author" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="chapter" href="001.htm" title="1 Autor">
<link rel="chapter" href="002.htm" title="2 Bussysteme">
<link rel="chapter" href="003.htm" title="3 Master &amp; Slave">
<link rel="chapter" href="004.htm" title="4 SCSI">
<link rel="chapter" href="005.htm" title="5 IDE">
<link rel="chapter" href="007.htm" title="7 USB &amp; FireWire">
<link rel="chapter" href="008.htm" title="8 Kalibrierung">
<link rel="chapter" href="009.htm" title="9 Jumper">
<link rel="chapter" href="00a.htm" title="10 Zugriff">
<link rel="chapter" href="00b.htm" title="11 Pin">
<link rel="chapter" href="00c.htm" title="12 Einbau">
<link rel="chapter" href="00d.htm" title="13 CD-ROM">
<link rel="chapter" href="00e.htm" title="14 CD Formate">
<link rel="chapter" href="00f.htm" title="15 CD-Recorder">
<link rel="chapter" href="010.htm" title="16 DVD Laufwerke">
<link rel="start" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="home" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="first" href="001.htm" title="Autor">
<link rel="prev" href="005.htm" title="IDE">
<link rel="previous" href="005.htm" title="IDE">
<link rel="next" href="007.htm" title="USB &amp; FireWire">
<link rel="last" href="010.htm" title="DVD Laufwerke">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border="0" cellspacing="0" cellpadding="0" width="100%">
<tr>
<td valign="top" width="128">
<table border="0" cellpadding="0" cellspacing="0" width="128">
<tr><td align="center"><a href="001.htm"><img src="icon/but1.gif" alt="Autor" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="002.htm"><img src="icon/but2.gif" alt="Bussysteme" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="003.htm"><img src="icon/but3.gif" alt="Master &amp; Slave" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="004.htm"><img src="icon/but4.gif" alt="SCSI" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="005.htm"><img src="icon/but5.gif" alt="IDE" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="006.htm"><img src="icon/but17.gif" alt="Raid System" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="007.htm"><img src="icon/but15.gif" alt="USB &amp; FireWire" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="008.htm"><img src="icon/but6.gif" alt="Kalibrierung" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="009.htm"><img src="icon/but7.gif" alt="Jumper" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00a.htm"><img src="icon/but8.gif" alt="Zugriff" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00b.htm"><img src="icon/but9.gif" alt="Pin" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00c.htm"><img src="icon/but10.gif" alt="Einbau" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00d.htm"><img src="icon/but11.gif" alt="CD-ROM" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00e.htm"><img src="icon/but12.gif" alt="CD Formate" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00f.htm"><img src="icon/but13.gif" alt="CD-Recorder" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="010.htm"><img src="icon/but14.gif" alt="DVD Laufwerke" border="0" width="100" height="30"></a></td></tr>
</table>
</td>
<td valign="top" width="100%">
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="005.htm"><img src="udo_lf.gif" alt="IDE" border="0" width="24" height="24"></a>
<a href="007.htm"><img src="udo_rg.gif" alt="USB &amp; FireWire" border="0" width="24" height="24"></a>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr>
<td valign="top" width="8">&nbsp;</td><td valign="top" width="100%">
<h1><a name="Raid_20System">6 Raid System</a></h1>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p><tt> Raid System </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border="0" width="35" height="22"></p>
<p>
<br>
<br><b> Was ist RAID? </b>
<br>
</p>
<p>RAID (Redundant Array of Independent Disks)-Systeme bestehen immer
aus mehreren einzelnen Festplatten, m&ouml;glichst vom gleichen
Hersteller und einer einheitlichen Kapaztit&auml;t, die dem Nutzer und
dem Betriebssystem vom RAID- Controller als eine einzige grosse
Festplatte pr&auml;sentiert wird.
<br>
</p>
<p>Intern verteilt ein RAID-Controller die Daten einer jeden Datei
beim Schreiben gleichm&auml;ssig &uuml;ber alle in diesem Array
vorhandenen Festplatten, so dass beim Lesen der Datei die Daten von
allen Platten gleichzeitig geholt werden. Der Vorteil dabei ist, dass
die resultierende Lesegeschwindigkeit, im Idealfall, die Addition der
Transfergeschwindigkeit aller Platten ist. Bei drei benutzten
Festplatten also in etwa drei mal so hoch ist wie bei einer einzelnen
Platte, bei 4 Platten viermal so hoch.
<br>
</p>
<p>Die Obergrenze wird durch die maximale Geschwindigkeit des
&ouml;bertragungssystems beschr&auml;nkt. In aktuellen
Computersystemen ist das der PCI-Bus.
<br>
</p>
<p>Nur die Transfergeschwindigkeit, nicht die Zugriffsgeschwindigkeit
verbessert sich, das wird immer wieder gerne verwechselt und
vermischt.
<br>
</p>
<p>Bei den verwendeten Festplatten m&uuml;ssen alle verwendeten
Platten bzw. Partitionen die gleiche Gr&ouml;sse besitzen. Daher ist
es erforderlich, immer Festplatten des gleichen Typs zu verwenden.
Kaufen die sie Platten am besten aus einer einzigen Charge. Mit
unterschiedlich grossen Partitionen erreicht man keinen
Geschwindigkeitsvorteil!
<br>
</p>
<p>Um Ausf&auml;lle und Datenverluste zu minimieren, wenn z.B eine
der Festplatten ausf&auml;llt, sind die Daten der anderen Festplatten
oft auch nicht mehr zu gebrauchen das Risiko erh&ouml;ht mit jeder
eingesetzten Festplatte. Daher gibt es verschiedene Varianten von RAID
Systemen, RAID-Level, genannt, die je nach Einsatzgebiet und
Ressourcen eine bestimmte Gewichtung der Faktoren Geschwindigkeit,
Preis und Datensicherheit erlauben.
<br>
</p>
<p>Alle diese Systeme sind &quot;Hot-pluggable&quot; konfiguriert,
d.h. bei Ausfall einer einzigen Festplatte kann diese im laufenden
Betrieb und aller Regel nach ohne Datenverlust ersetzt werden.
<br>
</p>
<p>
<br>
<br><b> Welcher Benutzer braucht ein RAID-System? </b>
<br>
</p>
<p>F&uuml;r den normalen Computeranwender, der Briefe schreibt und
ein wenig Musik speichert, als Beispiel, ist ein RAID-System
&uuml;berfl&uuml;ssig. Es gen&uuml;gt wenn hier einmal pro Woche ein
BackUp erstellt wird.
<br>
</p>
<p>Ein Benutzer der professionell DV Material schneidet und schnell
und sicher <a href="00a.htm">Zugriff</a> auf grosse Datenmengen haben muss, macht ein
RAID-System auf jeden Fall einen Sinn. Wechselbare Festplatte
vermutlich auch.
<br>
</p>
<p>Ein Administrator der vielen Clients schnell eine Menge an Daten
zur Verf&uuml;gung stellen muss ben&ouml;tigt ein RAID-System. Wird
Schnelligkeit und Sicherheit gross geschrieben ist das ausschliesslich
ein Hardware RAID-Level 5.
<br>
</p>
<p>Ich denke das man mit diesen drei einfachen Beispielen sehr
schnell herausbekommt ob man ein Kandidat f&uuml;r ein RAID-System ist
oder nicht. Verwendet man Betriebsysteme die RAID von Haus aus
unterst&uuml;tzen vereinfacht sich dieses Frage etwas da ausser einer
weiteren Festplatte keine Anschaffung notwendig ist.
<br>
</p>
<p>
<br>
<br><b> RAID Level </b>
<br>
</p>
<p>RAID Level 0
<br>
</p>
<p>Auf zwei oder mehr Festplatten wird parallel zugegriffen. Dadurch
l&auml;sst sich bei Lese- und Schreibzugriffen die Transferrate
erheblich steigern. Die Zugriffszeit bleibt nat&uuml;rlich gleich
hoch. Alle Daten werden doppelt auf zwei vorhandene Laufwerke
geschrieben. Redundante Daten, also eine hohe Datensicherheit, die
Geschwindigkeit ist nur so gross wie die eines Einzellaufwerkes. Das
Prinzip ist wie ein kontinuierliches automatisches Backup aller
verf&uuml;gbaren Daten.
<br>
</p>
<p>
<br>
<br>RAID Level 1
<br>
</p>
<p>Ein einfaches Verfahren zur Erh&ouml;hung der Datensicherheit:
Alle Daten werden parallel auf zwei Festplatten geschrieben. Der
Datenbestand beider Festplatten ist also identisch. Nachteile dieses
'Primitiv-RAID' sind die 50%-ige Platzverschwendung und die immer noch
relativ grosse Datenunsicherheit. Im Falle eines Schreibfehlers auf
einer Festplatte l&auml;sst sich n&auml;mlich bei RAID 1 nicht
bestimmen, welche der beiden HDDs die richtigen Daten gespeichert hat.
<br>
</p>
<p>Eine erweiterte Form des Mirrorings ist das Disk-Duplexing.
Hierbei sind nicht nur zwei Festplatten, sondern auch zwei Hostadapter
vorhanden, so dass auch bei Ausfall eines Hostadapters weiter
gearbeitet werden kann. Zur Erh&ouml;hung der Datensicherheit wird
RAID 1 gern mit einem anderen RAID Level kombiniert.
<br>
</p>
<p>
<br>
<br>RAID Level 2
<br>
</p>
<p>Bei diesem Verfahren werden die Daten &auml;hnlich wie bei RAID 0
&uuml;ber zwei oder mehr Festplatten verteilt. Zus&auml;tzlich wird
eine Festplatte mit einer Pr&uuml;fsumme nach dem Hamming-Code
beschrieben. Der Hamming-Code ist in der Lage kleinere Fehler im
Datenbestand nicht nur zu erkennen, sondern auch zu beheben. Durch das
dedizierte Laufwerk f&uuml;r den Fehlercode wird RAID 2 recht langsam.
Ausserdem ist es durch die in allen modernen Festplatten enthaltenen
Fehlerpr&uuml;fcodes obsolet geworden.
<br>
</p>
<p>Level 0 + 1 werden kombiniert. Grosse Geschwindigkeit und
Datensicherheit ist gew&auml;hrleistet, es werden mehrere Festplatten
daf&uuml;r ben&ouml;tigt, mindestens aber 4 St&uuml;ck. Zwei
Festplatten dienen dabei einem schnellen Stripe-Array, und beide
werden zur Sicherheit nochmal auf zwei weiteren Platten gespiegelt.
<br>
</p>
<p>Dieser RAID-Level wird von verschiedenen Betriebssystemen direkt
unterst&uuml;tzt.
<br>
</p>
<p>
<br>
<br>RAID Level 3
</p>
<p>Eine vor allem in der Performance verbesserte Alternative zu RAID
2. Es arbeitet wiederum auf Basis eines Stripe Set und speichert die
redundante Fehlerinformation auch auf einem separaten Laufwerk. Im
Unterschied zu RAID 2 wird aber eine XOR-Verkn&uuml;pfung als
Redundanzcode verwendet. Bei Ausfall einer Festplatte ist es
m&ouml;glich alle Daten w&auml;hrend des Betriebs aus den Daten der
anderen Festplatten zu errechnen. Es tritt also kein Datenverlust auf.
<br>
</p>
<p>RAID 3 ist recht flink, aber seine Leistung bricht bei kleinen,
unzusammenh&auml;ngenden Datenbl&ouml;cken schnell zusammen. Gut
f&uuml;r grosse Datentransfers.
<br>
</p>
<p>
<br>
<br>RAID Level 4
<br>
</p>
<p>Das sogenannte Sector Striping verteilt die Daten in
gr&ouml;sseren Bl&ouml;cken als RAID 3 auf die verschiedenen
Festplatten. Ansonsten wird ebenfalls ein Laufwerk mit XOR
Pr&uuml;fsumme verwendet. Der Vorteil des Stripings geht durch den
Flaschenhals der dedizierten Festplatte f&uuml;r den Fehlercode
verloren. Nur bei Lesezugriffen kann das Striping seine Vorteile
ausspielen.
<br>
</p>
<p>
<br>
<br>RAID Level 5
<br>
</p>
<p>Dieser RAID Level stellt praktisch eine Kombination aus RAID 0, 3
und 4 dar.
<br>
</p>
<p>Auch hier werden die Daten &uuml;ber drei oder mehr Festplatten
verteilt und eine XOR Pr&uuml;fsumme wird erzeugt. Allerdings wird die
Pr&uuml;fsumme nicht wie bei den anderen RAID Levels auf einer
dedizierten Festplatte untergebracht, sondern ist &uuml;ber alle
Laufwerke verteilt ('Striped Parity'). Dadurch entsteht kein
Flaschenhals. RAID 5 bietet hohe Datensicherheit und ist durch seine
gute Performance heute sehr beliebt. Da das Berechnen XOR
Pr&uuml;fsumme und die Verteilung der Informationen auf die einzelnen
HDDs recht aufwendig ist, wird auf RAID 5 Hostadaptern meist ein
eigener 'RAID 5 Chip' eingesetzt.
<br>
</p>
<p>Hier werden alle Pr&uuml;fsummendaten nicht auf eine eigene
Festplatte geschrieben sondern auf alle vorhandenen Festplatten
verteilt. Level 5 bietet eine sehr gute Balance zwischen
Geschwindigkeit, Sicherheit und der Anzahl der notwendigen Platten.
Software RAID 5 wird von Windows 2000 Server und Linux direkt
unterst&uuml;tzt.
<br>
</p>
<p>
<br>
<br>
</p>
<p>Neben der Erh&ouml;hung der Ausfallsicherheit bieten RAID-Systeme
einige Techniken, um im Fehlerfall m&ouml;glichst schnell wieder eine
redundante Datenhaltung aufbauen zu k&ouml;nnen:
</p>
<p>- Hot Swapping:
<br>W&auml;hrend des laufenden Serverbetriebs kann eine defekte
Festplatte durch eine nue ausgetauscht werden. Das betroffene Laufwerk
wird dazu vom Hostadapter automatisch abgeschaltet und die neue
Festplatte wird automatisch eingerichtet und in das RAID-System
eingebunden. Der Serverbetrieb kann w&auml;hrenddessen weitergehen.
<br>
</p>
<p>- Hot Standby:
<br>Eine zus&auml;tzliche Festplatte wartet in ausgeschaltetem Zustand
auf einen eventuellen Defekt einer der Platten des Arrays. Tritt
dieser ein, so wird die bisher ungenutzte Festplatte automatisch
hochgefahren und die defekte Platte wird deaktiviert. So wird ohne
Benutzereingriff trotz Defekts immer h&ouml;chste Redunanz bewahrt.
<br>
</p>
<p>Folgende RAID Levels sind genormt:
<br>
</p>
<p>
<br>
</p>
<div align="center"><table border="1" frame="box">
<caption align="bottom">Tabelle 7: RAID Level / Systeme</caption>
<tr>
  <td align="left" valign="top">RAID</td>
  <td align="left" valign="top">Bezeichnung</td>
  <td align="left" valign="top">Pr&uuml;fcode</td>
  <td align="left" valign="top">min. Daten HDDs</td>
  <td align="left" valign="top">+ Pr&uuml;f HDDs</td>
</tr>
<tr>
  <td align="left" valign="top"></td>
  <td align="left" valign="top"></td>
  <td align="left" valign="top"></td>
  <td align="left" valign="top"></td>
  <td align="left" valign="top"></td>
</tr>
<tr>
  <td align="left" valign="top">0</td>
  <td align="left" valign="top">Stripe Set</td>
  <td align="left" valign="top">kein</td>
  <td align="left" valign="top">2</td>
  <td align="left" valign="top">-</td>
</tr>
<tr>
  <td align="left" valign="top">1</td>
  <td align="left" valign="top">Disk-Mirroring</td>
  <td align="left" valign="top">kein</td>
  <td align="left" valign="top">1</td>
  <td align="left" valign="top">1</td>
</tr>
<tr>
  <td align="left" valign="top">2</td>
  <td align="left" valign="top">Stripe Set</td>
  <td align="left" valign="top">Hamming Code dediz.</td>
  <td align="left" valign="top">2</td>
  <td align="left" valign="top">1</td>
</tr>
<tr>
  <td align="left" valign="top">3</td>
  <td align="left" valign="top">Stripe Set</td>
  <td align="left" valign="top">XOR dediziert</td>
  <td align="left" valign="top">2</td>
  <td align="left" valign="top">1</td>
</tr>
<tr>
  <td align="left" valign="top">4</td>
  <td align="left" valign="top">Sector Striping</td>
  <td align="left" valign="top">XOR dediziert</td>
  <td align="left" valign="top">2</td>
  <td align="left" valign="top">1</td>
</tr>
<tr>
  <td align="left" valign="top">5</td>
  <td align="left" valign="top">Stripe Set</td>
  <td align="left" valign="top">XOR verteilt</td>
  <td align="left" valign="top">2</td>
  <td align="left" valign="top">1</td>
</tr>
<tr>
  <td align="left" valign="top">6</td>
  <td align="left" valign="top">Stripe Set</td>
  <td align="left" valign="top">2x XOR verteilt</td>
  <td align="left" valign="top">2</td>
  <td align="left" valign="top">2</td>
</tr>
</table></div>

<p>
<br>
</p>
<p>
<br>
<br><b> Ein <a href="004.htm">SCSI</a> oder EIDE-RAID? </b>
<br>
</p>
<p><a href="004.htm">SCSI</a>-Festplatte waren fr&uuml;her f&uuml;r RAID-Systeme die
einzige M&ouml;glichkeit. RAID wurde generell nur in Servern
eingesetzt. Heute jedoch sind RAID-Systeme auch f&uuml;r den
Heimanwender erschwinglich und dank der fortgeschrittenen Technik eine
gute Wahl.
<br>
</p>
<p>Der Vorteil von <a href="004.htm">SCSI</a>-Arrays ist das bis zu 15 <a href="004.htm">SCSI</a> Festplatten an
einem einzigen RAID-Controller angeschlossen werden d&uuml;rfen. Hier
darf die <a href="004.htm">SCSI</a>-Kabell&auml;nge gr&ouml;sser sein um die Platten z.B
auch extern in einem anderen, externen Geh&auml;use unterzubringen.
Generell gelten aber die &uuml;blichen <a href="004.htm">SCSI</a> Tips.
<br>
</p>
<p>Die maximale verf&uuml;gbarte Kabell&auml;nge bei
EIDE-Festplkatten kann bei der Unterbringung aller Platten in einem
Geh&auml;use Probleme verursachen. Es m&uuml;ssen gen&uuml;gend freie
<a href="005.htm">IDE</a>-Kan&auml;le vorhanden sein. Optimal ist ein Kanal pro
<a href="005.htm">IDE</a>-Festplatte, ein normales Computer Mainboard stellt 2 <a href="005.htm">IDE</a>
Kan&auml;le zur Verf&uuml;gung. Jeder zus&auml;tzliche EIDE-Controller
nochmal zwei. G&uuml;nstige <a href="005.htm">IDE</a> RAID-Cointroller bieten zwei
Kan&auml;le, besserere Controller vier Kan&auml;le.
<br>
</p>
<p>Vom Preis her sind <a href="005.htm">IDE</a>-Festplatten immer g&uuml;nstiger. Von der
Geschwindigkeit d&uuml;rfte sich heute ein <a href="004.htm">SCSI</a>-RAID und ein <a href="005.htm">IDE</a>-RAID
nichts mehr geben. Es ist alles gleich schnell, Abh&auml;ngig davon
was man machen will.
<br>
</p>
<p>
<br>
<br><b> Software RAID </b>
<br>
</p>
<p>Bei einem Software-RAID &uuml;bernimmt immer die CPU die Steuerung
der Datenverteilung der einzelnen Festplatten, in Betriebssystemen wie
Linux oder Windows NT/2000/XP, MacOS X sind verschiedene Versionen von
RAID schon integriert.
<br>
</p>
<p>Vorteil:
<br>geringe Kosten
<br>
</p>
<p>Nachteil:
<br>Mehr Prozessorleistung wird verbraucht.
<br>
</p>
<p>
<br>
<br><b> Hardware RAID </b>
<br>
</p>
<p>In reinen Hardware-RAIDs gilt der Vorteil das man
Systemunabh&auml;ngig ist und das so gut wie keine Prozessorbelastung
anf&auml;llt. Hier &uuml;bernimmt ein RAID-Controller die
Steuerungsaufgaben und eventuell auch die Rechenarbeit f&uuml;r die
Pr&uuml;fsummenerstellung.
<br>
</p>
<p>Dieses RAID kann an verschiedene Betriebssysteme angebunden
werden, auch welche die selbst kein RAID beherrschen, das RAID-System
erscheint als eine normale Festplatte.
<br>
</p>
<p>Nachteil:
<br>
</p>
<p>Deutlich h&ouml;here Kosten.
<br>
</p>
<p>
<br>
<br><b> Fragmentierung / Performance </b>
<br>
</p>
<p>Eine gute Festplattenperformance erh&auml;lt man nur bei einer
kleinen Fragmentierung aller auf dem System gespeicherten Daten. Das
war schon immer so. Fragmentiert werden die Daten im Laufe der Zeit
immer, es h&auml;ngt in der Hauptsache von der Art der Nutzung ab wie
stark sie in einem gewissen Zeitraum fragmentiert.
<br>
</p>
<p>Eine regelm&auml;ssige Defragmentierung sollte man sich auf jeden
Fall angew&ouml;hnen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p align="center"><img src="image/img.gif" border="0" width="50" height="40"></p>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br> Letzte Aktualisierung am 28. Dezember 2003</address>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="005.htm"><img src="udo_lf.gif" alt="IDE" border="0" width="24" height="24"></a>
<a href="007.htm"><img src="udo_rg.gif" alt="USB &amp; FireWire" border="0" width="24" height="24"></a>
</td></tr></table>
</td></tr>
</table>
</body></html>
