<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
        "http://www.w3.org/TR/html4/loose.dtd">
<!-- last modified on 28.12.2003 -->
<html lang="de">
<head>
<title>
Harddrive - Tips &amp; Tricks zum Ger&auml;teanschlu&szlig;: Einbau
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta http-equiv="Content-Style-Type" content="text/css">
<meta http-equiv="Content-Script-Type" content="text/javascript">
<meta name="Generator" content="UDO 6.2 PL1 for MacOSX">
<meta name="Email" content="doit@doitarchive.de">
<link rev="made" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="author" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="chapter" href="001.htm" title="1 Autor">
<link rel="chapter" href="002.htm" title="2 Bussysteme">
<link rel="chapter" href="003.htm" title="3 Master &amp; Slave">
<link rel="chapter" href="004.htm" title="4 SCSI">
<link rel="chapter" href="005.htm" title="5 IDE">
<link rel="chapter" href="006.htm" title="6 Raid System">
<link rel="chapter" href="007.htm" title="7 USB &amp; FireWire">
<link rel="chapter" href="008.htm" title="8 Kalibrierung">
<link rel="chapter" href="009.htm" title="9 Jumper">
<link rel="chapter" href="00a.htm" title="10 Zugriff">
<link rel="chapter" href="00b.htm" title="11 Pin">
<link rel="chapter" href="00d.htm" title="13 CD-ROM">
<link rel="chapter" href="00e.htm" title="14 CD Formate">
<link rel="chapter" href="00f.htm" title="15 CD-Recorder">
<link rel="chapter" href="010.htm" title="16 DVD Laufwerke">
<link rel="start" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="home" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="first" href="001.htm" title="Autor">
<link rel="prev" href="00b.htm" title="Pin">
<link rel="previous" href="00b.htm" title="Pin">
<link rel="next" href="00d.htm" title="CD-ROM">
<link rel="last" href="010.htm" title="DVD Laufwerke">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border="0" cellspacing="0" cellpadding="0" width="100%">
<tr>
<td valign="top" width="128">
<table border="0" cellpadding="0" cellspacing="0" width="128">
<tr><td align="center"><a href="001.htm"><img src="icon/but1.gif" alt="Autor" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="002.htm"><img src="icon/but2.gif" alt="Bussysteme" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="003.htm"><img src="icon/but3.gif" alt="Master &amp; Slave" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="004.htm"><img src="icon/but4.gif" alt="SCSI" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="005.htm"><img src="icon/but5.gif" alt="IDE" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="006.htm"><img src="icon/but17.gif" alt="Raid System" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="007.htm"><img src="icon/but15.gif" alt="USB &amp; FireWire" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="008.htm"><img src="icon/but6.gif" alt="Kalibrierung" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="009.htm"><img src="icon/but7.gif" alt="Jumper" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00a.htm"><img src="icon/but8.gif" alt="Zugriff" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00b.htm"><img src="icon/but9.gif" alt="Pin" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00c.htm"><img src="icon/but10.gif" alt="Einbau" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00d.htm"><img src="icon/but11.gif" alt="CD-ROM" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00e.htm"><img src="icon/but12.gif" alt="CD Formate" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00f.htm"><img src="icon/but13.gif" alt="CD-Recorder" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="010.htm"><img src="icon/but14.gif" alt="DVD Laufwerke" border="0" width="100" height="30"></a></td></tr>
</table>
</td>
<td valign="top" width="100%">
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="00b.htm"><img src="udo_lf.gif" alt="Pin" border="0" width="24" height="24"></a>
<a href="00d.htm"><img src="udo_rg.gif" alt="CD-ROM" border="0" width="24" height="24"></a>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr>
<td valign="top" width="8">&nbsp;</td><td valign="top" width="100%">
<h1><a name="Einbau">12 Einbau</a></h1>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p><tt> Festplatten Einbauen </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border="0" width="35" height="22"></p>
<p>Das Einbauen von Festplatten in welchen Computer oder in welches
externe Geh&auml;use auch immer kann u.U nicht gerade mal eben in der
Mittagspause erledigt werden. Das klappt in den wenigsten F&auml;llen.
Und wenn dann auch nur wenn die Festplatte nicht neu ist und eventuell
schon an einem gleichen Computer gelaufen ist.
<br>
<br>
<br><b> Einbaulage </b>
<br>
</p>
<p>Moderne Festplatten k&ouml;nnen in fast beliebigen Einbaulagen
f&uuml;r lange Zeit sicher Betrieben werden. Die sicherste Methode ist
aber noch immer, Elektronik nach unten und Waagerecht. Auf den
Anschlu&szlig;steckern stehend und mit der Elektronik nach oben wird
<tt> keine </tt> der mir bekannten Ger&auml;te eingebaut. Seltsame
Ger&auml;usche nach kurzer Betriebszeit, das sind die
Vorank&uuml;ndigungen von Lagersch&auml;den, sind w&auml;ren hier die
direkte Folge zu betrachten.
<br>
</p>
<p>Das betrifft auch alle mir bekannten 2.5&quot; Notebook
Festplatten als <a href="005.htm">IDE</a> oder &auml;lteres <a href="004.htm">SCSI</a> Ger&auml;t.
Notebook-Festplatten sind im allgemeinen unemfindlicher als normale
Festplatten im 3.5&quot; Format. Auch hier gibt es speziell Schock
sichere Festplatten die jedoch einen wesentlich h&ouml;heren Preis
haben. Meist auch nur auf Anfrage lieferbar.
<br>
<br>
<br><b> 2.5&quot; Ger&auml;te </b>
<br>
</p>
<p>Bei 2.5&quot; Platten gibt es eine kleine &quot;Neuerung&quot; die
seitlichen Befestigungsl&ouml;cher befinden sich nach neuer
&quot;IBM-Norm&quot; nicht mehr zentral auf der L&auml;ngsseite einer
Festplatte, sondern mehr zu den Enden des Metalrahmens hin. F&uuml;r
den willigen DO_IT_YOURself Festplattentauscher bedeutet das gemeinhin
das z.B solche <a href="005.htm">IDE</a>-Ger&auml;te nicht mehr ohne n eue L&ouml;cher zu
bohren in einen K&auml;fig von z.B einem Apple Powerbook 5300cs
passen. Eine weitere Chance f&uuml;r Notbook-Hersteller spezielle,
reichlich &uuml;berteuerte und angeblich &quot;eigene&quot;
Festplatten an den Man zu bringen. Eine jede &quot;normale&quot;
OEM-Platte tut &uuml;brigens das gleiche, meine Erfahrung ist das dies
nur vom Treiber abh&auml;ngt. Speziell im Fall &quot;Apple&quot; kann
daher passieren das nur Platten erkannt werden die Apple eben in ihrem
Treiber als &quot;passend&quot; ausgewiesen hat. RES_EDIT hilft ihnen
hier u.U weiter.
<br>
</p>
<p>Zur W&auml;rmeentwicklung gibt es auch keinen gesonderten Beitrag.
Tragbare Computer sind doch ziemlich aufger&auml;umt so das immer eine
ausreichende Luftzirkulation gew&auml;hrleistet ist. Die
pers&ouml;nliche Erfahrung sagt das der Prozessor und die RAM-Module
in jedem Notebook weitaus w&auml;rmer als die dort eingebaute
Festplatte werden. Neuere Computer besitzen zudem einen Temperatur
gesteuerten L&uuml;fter der sich einschaltet wenn es eben doch zu warm
wird. Es kann so eigentlich nichts passieren. Fakt ist und bleibt, je
h&ouml;her die Plattendrehzahl, also 5200, 7200 U/Min, um so
w&auml;rmer wird die Platte nat&uuml;rlich. Verk&auml;ufer
verschweigen das gerne.
<br>
<br>
<br><b> Am Macintosh </b>
<br>
</p>
<p>Wenn der Rechner mehrere <a href="005.htm">IDE</a>-Platten unterst&uuml;tzt kann so gut
wie jede <a href="005.htm">IDE</a>-Festplatte in einer Standard Baugr&ouml;sse von
101x146x25mm verwendet werden. EIDE, Ultra-EIDE Platten sind der Regel
nach immer abw&auml;rtskompatibel. Die meisten PowerMac
unterst&uuml;tzen den PIO Mode 4 mit 16,6MB/s, G3 grau, Yosemite-G3
Modelle UDMA Mode 2 (UDMA33) mit 33MB/s. G4 mit(UDMA66) 66MB/s. Der
zweite <a href="005.htm">IDE</a>-Anschluss f&uuml;r das <a href="00d.htm">CD-ROM</a> und Zip-Drive kann der Regel
nach nur PIO Mode 4 und sollte daher auch nicht f&uuml;r Festplatten
verwendet werden. Bei den ersten b&amp;w G3 Macintosh aktiviert
&quot;Festplatte einrichten&quot; auch den UDMA2 Mode. Der
Mac-Controller hat hierbei aber mit einigen Festplatten probleme. Das
ist ein Apple-Problem! nicht eines der Festplattenhersteller!
<br>
</p>
<p>Diverse Hersteller bieten kommerzielle Programme an die in der
Lage sind die Ger&auml;te am PowerMac korrekt einzurichten. LaCie
http://www.lacie.com/scripts/software/silverlining.cfm ist eine
L&ouml;sung f&uuml;r <a href="004.htm">SCSI</a>, <a href="005.htm">IDE</a> und LaCie USB Laufwerke, auch f&uuml;r
Wechselplattenlaufwerke.
<br>
<br>
</p>
<p>Eine zweite <a href="005.htm">IDE</a>-Festplatte im b&amp;w G3 oder im grauen G4
<br>
</p>
<p>In die ersten blauen G3 Mac l&auml;sst sich auch eine zweite
<a href="005.htm">IDE</a>-Festplatte im Slave-Modus anschliessen. Ab Mac Revision 2 gibt es
daf&uuml;r auch einen zus&auml;tzlichen Einbaurahmen.
</p>
<p>Allgemein mu&szlig; bei der ersten Serie die Festplattenhalterung
ausgebaut werden um die neue, zus&auml;tzliche, Festplatte auf dem
mittleren Platz befestigen zu k&ouml;nnen. Das Anschlusskabel sollte
zwingend ein neues <a href="005.htm">IDE</a> Kabel mit zwei Buchsenleisten sein. Das
orignale Apple Kabel ist zu kurz und hat ausserdem nur einen Stecker.
Kabell&auml;nge ist ca. 25-30cm. Stromversorgungskabel ist bereits im
Macintosh.
<br>
</p>
<p>Die neue Festplatte sollte unbedingt als Slave gejumpert werden!
</p>
<p>Wie das geht ist bei vielwn Festplatten auf deren Geh&auml;use
aufgedruckt. Die ab Werk eingebaute Festplatte bleibt wie sie ist.
Wenn beim schliessen des Geh&auml;uses das neue <a href="005.htm">IDE</a> Kabel nicht
eingeklemmt wird ist es richtig verlegt. Die neue Platte sollte von
&quot;Laufwerke konfigurieren&quot; ganz normal erkannt werden. Ist
das nicht der Fall ist etwas falsch. Garantiert. Zumeist die
Jumperung.
</p>
<p>Die UDMA <a href="005.htm">IDE</a> Kabel haben einen blaue Endstecker, dieser wird
ausschliesslich auf die Controllerseite gesteckt, also auf das
Mainboard. Danach kommt die Buchsenleiste f&uuml;r den Master (grau),
zum Schlu&szlig; die Buchsenleiste f&uuml;r die Slave-Festplatte
(schwarz)
<br>
</p>
<p>Sie k&ouml;nnen und sie sollten nicht dieses Kabel in einer
anderen Art und Weise verwenden!
<br>Verwenden Sie bei diesen Computern generell nur UDMA 66 Kabel!
<br>
</p>
<p>
<br>
<br><b> Am Atari </b>
<br>
</p>
<p>HDDRiver ist am Atari, bei allen 16Bit Atari Computer, die beste
Wahl. F&uuml;r Atari 16Bit Computersyteme ergeben sich technische
bedingt folgende Partitonsgr&ouml;ssen:
<br>
</p>
<pre>
OS-Release              Size
----------------------------------------------------------------
TOS 1.00 - 1.02         256 MByte
TOS 1.04 - 3.xx         512 Mbyte
TOS 4.0x               1024 MByte

MagiC / BigDOS         1024 MByte
                       2048 MByte (DOS-Kompatibel)

MagiC V 6.10  / FAT 32 -&gt;   Terrabyte

FreeMiNT 1.15 / FAT16  2048 MByte (DOS/TOS komp. Partitionierung)
FreeMiNT      / FAT32  -&gt;   Terrabyte
----------------------------------------------------------------

</pre>
<p>
<br>
</p>
<p>Die physkalische Gr&ouml;sse einer Festplatte spielt fast keine
Rolle. Es h&auml;ngt eher an den einrichtbaren Partitionsgr&ouml;ssen.
(TOS)
<br>
</p>
<p>Mit dem richtigen Festplattentreiber hat man am Atari, in
Abh&auml;ngigkeit vom verwendeten Betriebsystem, so gut wie keine
Einschr&auml;nkung. Zu unterscheiden ist generell der Begriff
&quot;Plattengr&ouml;sse&quot; und &quot;Partitionsgr&ouml;sse&quot;,
was auch f&uuml;r alle anderen Plattformen gilt. Die Grenze dessen ist
abh&auml;ngig von der eingesetzten TOS-Version und dem dabei
vorhandenen Dateisystem.
<br>
</p>
<p>Unter MiNT und MagiC bestehen daher fast keine
Beschr&auml;nkungen. Maximal 128 GB Festplatte sollten eigentlich
jedem Benutzer reichen. Aller Regel nach kannst man eine beliebige
Festplatte benutzen. <a href="005.htm">IDE</a>-Festplatten sind ausreichend vorhanden, sind
aber nicht ohne weitere Hardware an jedem Atari einsetzbar.
<br>
</p>
<p><a href="004.htm">SCSI</a> Festplatten sollten 50 polige 8Bit SCSI2 Schnittstelle haben.
Man kann auch sehr leicht UltraWide <a href="004.htm">SCSI</a> Festplatten verwenden. Hier
zu braucht man dann aber immer einen Kabeladapter von 8 auf 16 Bit.
Diese Platten erreichen aber nicht ihre volle Transferleistung.
<br>
</p>
<p>
<br>
<br><b> Am PC </b>
<br>
</p>
<p>Beim PC, da gibt es nicht viel. Die Platte sollte eben schon
technisch zum Controller passen. Die Plattenparameter werden f&uuml;r
<a href="005.htm">IDE</a>-Festplatten im BIOS-Setup eingestellt. Das ist von PC zu PC eben
verschieden. Man sollte schon wissen was man da tut. Eine Beschreibung
gibt es meistens nicht.
</p>
<p>Stark verbreitet ist die Tatsache, auch heute noch, das etwas
&auml;ltere BIOS Vaarianten einfach probleme haben z.B eine simple
2.3GB <a href="005.htm">IDE</a> Platte vollst&auml;ndig zu erkannen, das ist schier
unm&ouml;glich. Solche moderne <a href="005.htm">IDE</a>-Platten werden vom
&quot;Industriestandard&quot; dann nur zur H&auml;lfte erkannt. Hier
bleibt ihnen nur das jonglieren mit den Parametern im BIOS-Setup oder
gar der Austausch des BIOS gegen eine aktuellere Version.
</p>
<p>Bei Mainboards mit ON-Board Controller haben sie die
M&ouml;glichkeit schnelle <a href="005.htm">IDE</a>-Festplatten an den Primery <a href="005.htm">IDE</a> Bus im
Master/Slave-Verfahren, und die nicht ganz so schnellen Ger&auml;te
wie z.B ein <a href="00d.htm">CD-ROM</a> am Secondary <a href="005.htm">IDE</a> Bus anzuschliessen. Hier werden
normalerweise alle modernen Ger&auml;te sofort und auch
vollst&auml;ndig erkannt.
<br>
</p>
<p>MFM- / RRL-Festplatten sind heute kaum mehr im Einsatz, werden
daher auch nicht gesondern Erw&auml;hnt.
<br>
<br><b> Allgemeines </b>
<br>
</p>
<p>Welchen Bus sie vorfinden m&uuml;ssen sie schon am Flachbandkabel
erkennen. Beachten Sie dringend das es verschiedene <a href="002.htm">Bussysteme</a> gibt!
40polig ist <a href="005.htm">IDE</a>, ATAPI. Die breiteren 50 poligen Kabel sind <a href="004.htm">SCSI</a>.
UltraWide <a href="004.htm">SCSI</a> ist auch 50 polig, jedoch das Rasterma&szlig; der
Stecker ist kleiner/enger. Diese <a href="002.htm">Bussysteme</a> sind untereinander nicht
mischbar! wohl aber zusammen, mit jeweils eigenem Controller, in ein
und dem selben Computer verwendbar. Das geht beim PC, Mac und Atari
so.
<br>
<br>
<br><b> Befestigungsmaterial </b>
<br>
</p>
<p>Beachten Sie bitte dringend das idR alle <a href="005.htm">IDE</a>- u. <a href="004.htm">SCSI</a> Ger&auml;te
zum befestigen Schraubengewinde nach der US- Zoll Norm verwenden.
Benutzen Sie daher nur die mitgelieferten Schrauben und achten Sie
dringlich auf deren Gewingel&auml;nge! Zu lange Schrauben k&ouml;nnen
die emfpindliche Festplattenelektronik besch&auml;digen oder auch
Kurzschl&uuml;sse erzeugen. In beiden F&auml;llen ist mit einem
Ausfall des Ger&auml;tes zu rechnen!
<br>
<br>
<br><b> Stromversorgung </b>
<br>
</p>
<p>W&auml;hrend Festplatten &auml;lterer Generationen, heute noch im
Einsatz, wahre Stromfresser waren hat sich das Bild heute gewandelt.
Moderne Festplatten ben&ouml;tigen heute nur noch einen Bruchteil an
Energie ihrer Vorl&auml;ufermodelle. Beim Anschlu&szlig; neuer oder
zus&auml;tzlicher Festplatten oder CD-ROMs und auch CD-Brenner
brauchen Sie sich bei einem PowerMac oder einem PC keinerlei Gedanken
zu machen. Das dort verwendete Netzteil ist in allen F&auml;llen stark
genung um ihre zus&auml;tzliche Platte neben den alten Ger&auml;ten zu
versorgen. Ausnahmen bilden hier &auml;ltere Mac und
PowerMac-Ger&auml;te sowie die beliebten Konsolen Computer der Firmen
Atari, Comodore ect. Hier k&ouml;nnen die dort Eingebauten Netzteile
aufgrund ihrer Bauform meistens keinen weiteren Verbraucher versorgen.
Seltsames verhalten der Ger&auml;te oder ein Totalausfall des
Computers sind hier die direkte Folge.
<br>
</p>
<p>Sie k&ouml;nnen hier nur die technischen Daten des Netzteils mit
der ben&ouml;tigten Leistung der Festplatte, des CD-ROMs laut der
Typenaufkleber vergleichen. Wenn Sie sich nicht sicher sind, fragen
sie vorher!!
<br>
<br>
<br><b> Ger&auml;te Einrichten </b>
</p>
<p>Speziell bei Festplatten gen&uuml;gt es idR diese Ger&auml;te nach
erfolgreichem Anschlu&szlig; zu Partitionieren, also dem Aufteilen in
logische Einheiten.
<br>
</p>
<p>Bedenken Sie, speziell bei <a href="005.htm">IDE</a> Platten, die ersten 10% dieser
Platten sind die schnellsten!. Bei einer Partitionierung nimmt man
daher zumeist 10% der Platte, also die erste Partition und legt hier
sein komplettes Betriebssystem drauf.
<br>
</p>
<p>Das trifft auch auf Wechselplattenlaufwerke wir z.B einem ZIP- od.
JAZ- Drive zu. Der von ihnen verwendete Treiber unterst&uuml;tzt alle
Vorg&auml;nge. Macintosh- oder PC-Benutzter ben&ouml;tigen hier den
Treiber vom Hersteller. Atari-Benutzer sind fein raus,
Wechselplattenlaufwerke werden von z.B dem HDDriver 7.6
vollst&auml;ndig erkannt und eben wie eine Fest- bzw. Wechselplatte in
das System eingebunden.
<br>
</p>
<p>Alle anderen Systeme ben&ouml;tigen die Herstellerspezifischen
Treiber um die eingelegten Medien zu erkennen und Einzurichten.
Beachten sie beim Einrichten der Ger&auml;te, speziell der <a href="005.htm">IDE</a>- u.
<a href="004.htm">SCSI</a>- Festplatten, die Vorgaben des von ihnen verwendeten
Betriebssystems!
</p>
<p>Auch am PC oder Mac sind auf einer Platte mehrere Partitionen,
also logische Laufwerke, mit unterschiedlichen Parametern einrichtbar.
Es bietet sich daher meistens die M&ouml;glichkeit an die sog.
&quot;Bootpartition&quot; z.B bei Atari, Mac nur so gro&szlig;
auszulegen das das Betriebsystem und alle wichigen Utilities gut
darauf passt. Kleine Partitionen sind idR schneller, schneller
Aufgr&auml;umt und auch schneller im BackUp gesichert. Alle anderen
Arbeitsprogramme oder sogar ganze Projekte erhalten dann ebenfalls
eine oder mehrere Partitionen der gleichen Festplatte. Eine
&ouml;bersichtliche und einfache Aufteilung erleichert das Arbeiten.
</p>
<p>Ebenso kann eine einzige Festplatte so auch unterschiedliche
Betiebsysteme beinhalten. Die Bootpartition mu&szlig; nicht zwingend
die erste Partition sein.
</p>
<p>Auch der Macintosh hat mit dem Kontrollfeld
&quot;Startlaufwerk&quot; die M&ouml;glichkeit von einer anderen
logischen Partition oder auch einer ganz anderen, auch einer externen
Festplatte, das System zu starten.
</p>
<p>Vermeiden sie speziell bei <a href="005.htm">IDE</a>-Ger&auml;ten das
&quot;LowLevelFormatieren&quot; einige <a href="005.htm">IDE</a>-Ger&auml;te werden dabei
u.U besch&auml;digt. Haupts&auml;chlich sind damit die PC-Benutzer
gemeint. Einige Utilties bieten diesen Vorgang ja an.
<br>
</p>
<p>
<br>
<br><b> <a href="007.htm">USB &amp; FireWire</a> </b>
<br>
</p>
<p>Theoretisch wird ein Datendurchsatz, laut Spezifikation, von 400
Megabit, also 50MB/s erreicht. Die Firewireports dienen aller Regel
nach zum Anschlu&szlig; von diversen Pheriperieger&auml;ten die es im
Lauf der Zeit nach und nach ebenfalls mit Firewire-Anschlu&szlig;
geben wird.
<br>
</p>
<p>Es lassen sich an einer Schnittstelle bis 128 Ger&auml;te
anschliessen. Das kann auch im &quot;Hot-Plug&quot;-Verfahren
passieren, es braucht nichts mehr abgeschaltet zu werden. Kleine
Ger&auml;te, mit einem geringen Stromverbrauch, werden direkt
&uuml;ber den FireWire Bus versorgt. Es sind keine Netzteil mehr
erforderlich.
<br>
</p>
<p>Eine Firewire-Verbindung darf mehrere Meter lang sein, ist aber
nicht unbegrenzt.
<br>
</p>
<p>Der neue USB-Standard 2.0 bringt einen deutlich h&ouml;heren
Datendurchsatz. Bei Apple ist USB 2.0 bisher noch nicht implemetiert.
<br>
</p>
<p>Die Ger&auml;te untereinander sind Abw&auml;rtskompatibel.
<br>
</p>
<p>
<br>
<br><b> Formatmatieren / Lowlevel Format </b>
<br>
</p>
<p>Den normalen Ablauf kennt jeder: Es ist zur Einrichtung jeder
neuen Festplatte notwendig. Es werden alle (eventuell vorhandenen)
Daten auf der Festplatte gel&ouml;scht und die Festplattenstruktur
wird entsprechend dem Dateisystem (z.B. FAT, HSF, HSF+, DOS)
<br>
</p>
<p>Selten wird das Formatieren &uuml;berhaupt ben&ouml;tigt!
<br>Aller Regel nach reicht ein -Partitionieren- einer Festplatte
vollkommen aus.
<br>
</p>
<p>Seltener wird das Lowlevel Format (LL) ben&ouml;tigt. Es kann
nicht mit DOS Befehlen, sondern nur mit speziellen Tools
durchgef&uuml;hrt werden. Beim Lowlevel Format ist es wichtig, darauf
zu achten, dass man das richtige Format-Programm verwendet (meist vom
Plattenhersteller).
<br>
</p>
<p>Andere Software zur Lowlevel-Formatierung l&ouml;scht unter
Umst&auml;nden die Bad-Sector Map und andere wichtige Informationen
(z.B. ZBR Eintraege)!!
<br>
</p>
<p><b> Warnung </b>
<br>
</p>
<p>Dadurch kann eine Festplatte dauerhaft unbrauchbar werden oder
ihre Kapazit&auml;t extrem kleiner werden. Eine LowLevel-Formatierung
wird nur ben&ouml;tigt, wenn eine Festplatte mit dem normalen DOS
Format nicht mehr ansprechbar ist.
<br>
</p>
<p>Einige Festplatten fangen aus Sicherheitsgr&uuml;nden den Befehl
zum LL-Format ab und f&uuml;hren statt dessen ein ganz normales Format
durch.
<br>
</p>
<p>Beachten sie bitte das sie beim umgehen dieser Vorgangsweise ihre
<a href="005.htm">IDE</a>-Festplatte zerst&ouml;ren werden. Die erneute Einrichtund der
Platte kann nur beim Hersteller erfolgen.
<br>
</p>
<p><a href="004.htm">SCSI</a>-Festplatten sind von einer LowLevel Formatierung nicht
betroffen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p align="center"><img src="image/img.gif" border="0" width="50" height="40"></p>
<p>
<br>
<br>
</p>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br> Letzte Aktualisierung am 28. Dezember 2003</address>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="00b.htm"><img src="udo_lf.gif" alt="Pin" border="0" width="24" height="24"></a>
<a href="00d.htm"><img src="udo_rg.gif" alt="CD-ROM" border="0" width="24" height="24"></a>
</td></tr></table>
</td></tr>
</table>
</body></html>
