<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
        "http://www.w3.org/TR/html4/loose.dtd">
<!-- last modified on 28.12.2003 -->
<html lang="de">
<head>
<title>
Harddrive - Tips &amp; Tricks zum Ger&auml;teanschlu&szlig;: DVD Laufwerke
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta http-equiv="Content-Language" content="de">
<meta http-equiv="Content-Style-Type" content="text/css">
<meta http-equiv="Content-Script-Type" content="text/javascript">
<meta name="Generator" content="UDO 6.2 PL1 for MacOSX">
<meta name="Email" content="doit@doitarchive.de">
<link rev="made" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="author" href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel="chapter" href="001.htm" title="1 Autor">
<link rel="chapter" href="002.htm" title="2 Bussysteme">
<link rel="chapter" href="003.htm" title="3 Master &amp; Slave">
<link rel="chapter" href="004.htm" title="4 SCSI">
<link rel="chapter" href="005.htm" title="5 IDE">
<link rel="chapter" href="006.htm" title="6 Raid System">
<link rel="chapter" href="007.htm" title="7 USB &amp; FireWire">
<link rel="chapter" href="008.htm" title="8 Kalibrierung">
<link rel="chapter" href="009.htm" title="9 Jumper">
<link rel="chapter" href="00a.htm" title="10 Zugriff">
<link rel="chapter" href="00b.htm" title="11 Pin">
<link rel="chapter" href="00c.htm" title="12 Einbau">
<link rel="chapter" href="00d.htm" title="13 CD-ROM">
<link rel="chapter" href="00e.htm" title="14 CD Formate">
<link rel="chapter" href="00f.htm" title="15 CD-Recorder">
<link rel="start" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="home" href="harddriv.htm" title="Beginn des Dokumentes">
<link rel="first" href="001.htm" title="Autor">
<link rel="prev" href="00f003.htm" title="Phillips CD 2600">
<link rel="previous" href="00f003.htm" title="Phillips CD 2600">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border="0" cellspacing="0" cellpadding="0" width="100%">
<tr>
<td valign="top" width="128">
<table border="0" cellpadding="0" cellspacing="0" width="128">
<tr><td align="center"><a href="001.htm"><img src="icon/but1.gif" alt="Autor" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="002.htm"><img src="icon/but2.gif" alt="Bussysteme" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="003.htm"><img src="icon/but3.gif" alt="Master &amp; Slave" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="004.htm"><img src="icon/but4.gif" alt="SCSI" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="005.htm"><img src="icon/but5.gif" alt="IDE" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="006.htm"><img src="icon/but17.gif" alt="Raid System" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="007.htm"><img src="icon/but15.gif" alt="USB &amp; FireWire" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="008.htm"><img src="icon/but6.gif" alt="Kalibrierung" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="009.htm"><img src="icon/but7.gif" alt="Jumper" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00a.htm"><img src="icon/but8.gif" alt="Zugriff" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00b.htm"><img src="icon/but9.gif" alt="Pin" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00c.htm"><img src="icon/but10.gif" alt="Einbau" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00d.htm"><img src="icon/but11.gif" alt="CD-ROM" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00e.htm"><img src="icon/but12.gif" alt="CD Formate" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="00f.htm"><img src="icon/but13.gif" alt="CD-Recorder" border="0" width="100" height="30"></a></td></tr>
<tr><td align="center"><a href="010.htm"><img src="icon/but14.gif" alt="DVD Laufwerke" border="0" width="100" height="30"></a></td></tr>
</table>
</td>
<td valign="top" width="100%">
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="00f003.htm"><img src="udo_lf.gif" alt="Phillips CD 2600" border="0" width="24" height="24"></a>
<img src="udo_norg.gif" border="0" width="24" height="24">
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr>
<td valign="top" width="8">&nbsp;</td><td valign="top" width="100%">
<h1><a name="DVD_20Laufwerke">16 DVD Laufwerke</a></h1>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p><b> DVD Laufwerk am Computer anschliessen </b>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border="0" width="35" height="22"></p>
<p>
<br>
</p>
<p>DVD Laufwerke schliessen Sie genau wie jedes andere <a href="004.htm">SCSI</a>- oder
<a href="005.htm">IDE</a>-Laufwerk an ihrem Computer an. Es spielt dabei weniger eine Rolle
zu welcher Plattform ihr liebstes St&uuml;ck geh&ouml;rt, eher spielt
es aber eine wichtige Rolle das Sie einige bestimmte Dinge beachten
sollten. Sollten Sie hier bereits externe <a href="004.htm">SCSI</a>-Drives besitzen, falls
Sie ich f&uuml;r ein <a href="004.htm">SCSI</a>-Ger&auml;t entschieden haben sollten,
erleichert das die Sache ungemein. Ihre Mitwirkung beschr&auml;nkt
sich dann auf die reine Anschlu&szlig;arbeit und auf das richtige
Terminieren des <a href="004.htm">SCSI</a>-Bus sowie die vergabe einer freien <a href="004.htm">SCSI</a> ID an
eben dieses neue Laufwerk. Das ist auch der Fall wenn Sie das Laufwerk
in einen Computer einbauen werden. Es gelten die gleichen Richtlinien.
</p>
<p>Wichtig ist noch die Installation der entsprechenden
Treibersoftware. Kein DVD ROM oder RAM arbeitet ohne spezifischen
Systemtreiber. Das ist am Mac und am PC gleich. Wenn Sie mit einem
solchen DVD-Laufwerk an z.B ihrem Mac das interne <a href="00d.htm">CD-ROM</a> ersetzen
m&ouml;chten, beachten Sie bitte das speziell bei Macintosh-Computern,
das von einigen dieser Laufwerke das MacOS nicht gebootet werden kann!
<br>
</p>
<p>Einige DVD-Videos enthalten zus&auml;tzlich einen DVD-ROM Teil.
Macintosh Computer verschlucken sich manchmal an diesen Hybrid-DVDs.
Das Problem umgeht man in dem gleichzeitig die undokumentierte
Kombination aus Apple-Taste (Command), Optionstaste (Alt) und
&quot;i&quot;, bevor Sie die DVD einlegen, gedr&uuml;ckt h&auml;lt,
bis der Mac die DVD in der &uuml;blichen Art auf dem Desktop mountet.
Mit der Tastenkombination zwingt man den DVD-Treiber des MacOS, den
ersten ISO-9660-Track des Mediums einzulesen. Wenn Sie jetzt die
Wiedergabetaste des Apple DVD Player anklicken, sollte der Rechner den
Titel ohne Probleme direkt abspielen.
<br>
<br>
</p>
<p><b> Folgende CD-Formate sollte ein DVD-Laufwerk beherrschen </b>
<br>
<br>
</p>
<pre>
- <a href="00d.htm">CD-ROM</a>
- <a href="00d.htm">CD-ROM</a> Multisession
- CD-DA (Digital Audio mit PQ-Editing)
- Mixed Mode <a href="00d.htm">CD-ROM</a>
- CD plus
- CD-XA
- Video CD
- Disk at Once
- Track at Once
- Redbook, OrangeBook
- Audio CD

</pre>
<p>
<br>
<br>
</p>
<p><b> Verschiedene DVD ROM und RAM Laufwerke </b>
<br>
<br>
</p>
<dl>
<dt><b>MATSHITA SR-8583</b></dt><dd> Treiberversion: 1.2.2
<br>Mac OS Partitionen: Ja
<br>Wechselmedium: Ja
<br>Hersteller: MATSHITA
<br>Revision: D54A
<br>Produkt-ID: DVD-ROM SR-8583
<br>
<br>&nbsp;
<br>Mac / PC-Software: ?
<br>Atari-Software: ? HDDriver
<br>Port : <a href="005.htm">IDE</a>
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p><b> DVD ROM </b>
<br>
</p>
<p>Wie sie schon aus dem Namen entnehmen k&ouml;nnen erhalten Sie bei
einem DVD-ROM ein ReadOnly Device, nichts anderes als ein <a href="00d.htm">CD-ROM</a>, nur
abspielen, mit dem Unterschied das dieses Laufwerk in der Lage ist
moderne DVD-Medien direkt auf ihrem Computer verf&uuml;gbar zu machen.
Es spielt keine Rolle welche Art DVD Medium in dieses Laufwerk
einlegen werden, mit der richtigen Treibersoftware wird der Typ
erkannt und der richtige Mediaplayer gestartet.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> DVD RAM </b>
<br>
</p>
<p>Das DVD RAM hat die gleichen technischen Eigenschaften wie zuvor
das DVD-ROM. Gravierenster Unterschied: Dieses Laufwerk ist
gleichzeitig ein Recorder mit dem Sie in der Lage sind, neben normalen
CDR, CDRW, Photo-, Daten CDs auch DVD Medien bespielen zu k&ouml;nnen.
Es passen auf ein normales DVD Medium immerhin 5.2GB an Daten. Ein
DVD-RAM Medium kann von beiden Seiten bespielt werden.
<br>
</p>
<p>Wenn Sie eine DVD bespielen sind sie auch hier gut beraten wenn
die die Image Dateien immer von ihrer schnellsten Festplatte aus auf
das Laufwerk schreiben lassen. Es gelten keine anderen Regeln wie beim
erstellen einer normalen CDR auch.
<br>
</p>
<p>DVD-Laufwerke haben idR einen ausreichend gro&szlig;en internen
Buffer. Dennoch sollten Sie es nicht darauf anlegen und beim erstellen
einer DVD den Rechner in Ruhe sein Arbeit machen lassen.
<br>
</p>
<p>Eine Unterbrechung des Datenstoms zerst&ouml;rt in jedem Fall die
momentane Aufnahme.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Stromversorgung </b>
<br>
</p>
<p>Die Stromversorgung eines nackten DVD-Laufwerks erfolgt mit der
&uuml;blichen Steckvorrichtung die auch eben an jedem anderen <a href="004.htm">SCSI</a>
oder <a href="005.htm">IDE</a>-Device vorhanden ist. Beachten Sie hier bitte das ein
DVD-Brenner ein wenig mehr Strom als eine moderne Festplatte
ben&ouml;tigt. In jedem PC oder Mac k&ouml;nnen dieser Laufwerke ohne
bedenken an den &uuml;blichen Stromversorgungsleitungen angeschlossen
werden.
<br>
</p>
<p>Das gilt nicht f&uuml;r Atari Computer der Serie TT/Falcon, alle
mit internem Netzteil. Diese Netzteile w&uuml;rden &uuml;berlastet.
Haben Sie jedoch diese Rechner in einem Towergeh&auml;use und
betreiben diese Mainboards an einem PC-, auch ATX-Netzteil sind Sie
fein aus dem Schneider. Diese Laufwerke k&ouml;nnen hier direkt
angeschlossen werden. Alle anderen sollten sich ein extra Netzteil
besorgen das den Spezifikationen eines DVD-Laufwerks entspricht.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Allgemein </b>
<br>
</p>
<p>Alle DVD RAM- oder ROM- Laufwerke eignen sich genauso f&uuml;r den
internen <a href="00c.htm">Einbau</a> in einen bereits vorhanden Tower oder ein mehrfach
<a href="004.htm">SCSI</a>-Geh&auml;use. Hier sollte schon darauf geachten werden, das gilt
&uuml;brigens f&uuml;r jedes <a href="004.htm">SCSI</a>-Drive gleich am Atari, PC oder Mac,
da&szlig; die <a href="004.htm">SCSI</a> Flachbandkabel zwischen den einzelnen Devices
ca.15-20cm lang sein sollten. Das w&uuml;rde ziemlich genau dem
<a href="004.htm">SCSI</a>-Standard entsprechen und die Signalreflektionen innerhalb des
Kabels auf ein Minimum reduzieren. Es funktioniert aber aber auch wenn
die Kabel l&auml;nger bleiben.
<br>
</p>
<p>Bei <a href="005.htm">IDE</a>-Ger&auml;ten brauchen sie nur darauf zu achten das solche
Ger&auml;te aller Regel nach am zweiten <a href="005.htm">IDE</a>-Bus (secondary <a href="005.htm">IDE</a>)
angeschlossen werden und zumeist hier als &quot;SLAVE&quot; gejumpert
werden sollten. Betreiben Sie alle anderen <a href="005.htm">IDE</a>-Ger&auml;te im Mode
&quot;CableSelect&quot; kann auch das DVD so gejumpert werden.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> W&auml;rmeentwicklung </b>
<br>
</p>
<p>Beachten Sie bei DVD-RAM Laufwerken das diese eine bessere
Geh&auml;useentl&uuml;ftung ben&ouml;tigen da beim Schreibvorgang, im
Volksmund &quot;brennen&quot; genannt, eine wesentlich h&ouml;here
W&auml;rmeentwicklung als bei einem ROM vorhanden ist. Beachten Sie
zwingend das ein eventuell in dem DVD-RAM eingebauter L&uuml;fter
nicht durch andere Geh&auml;useteile abgedeckt wird.
<br>
</p>
<p>
<br>
<br><b> Wie funktioniert DVD </b>
<br>
</p>
<p>Ein DVD-Medium stellt im wesentlichen eine CD dar. Die
Aufzeichnung der bin&auml;ren Informationen geschieht in Form von
eingepr&auml;gten Strukturen (den sogenannten Pits). Zur Abtastung
dient ein Laserstrahl. Bei einer DVD sind die Pits bedeutend kleiner
als bei der CD. Dadurch passen in eine einzelne Spur auch deutlich
mehr Daten.
<br>
</p>
<p>In den &auml;u&szlig;eren mechanischen Abmessungen entspricht eine
DVD exakt einer CD. W&auml;hrend eine CD aber aus einem St&uuml;ck
gefertigt wird, besteht eine DVD immer aus zwei aneinandergeklebten
H&auml;lften. Damit verdoppelt sich die Speicherkapazit&auml;t.
Daf&uuml;r bleibt allerdings nur noch wenig Platz, um das Medium zu
beschriften, da die Silberscheibe ja von beiden Seiten gelesen werden
muss. Zwar ist es technisch m&ouml;glich, ein solches Medium
zeitgleich beidseitig abzutasten, doch daf&uuml;r w&auml;ren zwei
optische Abtasteinheiten (optical pickups) notwendig.
<br>
</p>
<p>G&auml;ngig sind mittlerweile Formen mit zwei Informationsebenen
auf einer Seite. Das gelingt durch die Verwendung halbtransparenter
Filmschichten. Um die untere Informationsschicht abzutasten, liest der
Laser durch die obere Schicht hindurch. Damit die Auswertelektronik
des Laufwerks die gespeicherten Daten erkennen kann, fokussiert sich
der Laser jeweils genau auf jeweils eine der beiden Ebenen. Beim
Abtasten der unteren Lage bleiben die Daten der oberen Ebene so
&quot;unscharf&quot;, dass sie nicht st&ouml;ren.
<br>
</p>
<p>Lediglich f&uuml;r zwei Anwendungen herrscht bereits Klarheit
&uuml;ber Spezifikationen und Formate: DVD-Video f&uuml;r Spielfilme
und DVD-ROM f&uuml;r Computerdaten.
<br>
</p>
<p>Alles andere ist bisher noch Wischiwaschi.
<br>
</p>
<p>Auf eine DVD passen je nach Bauweise (Anzahl Seiten, Anzahl
Schichten) zwischen zwei und &uuml;ber acht Stunden Video. Neben der
erheblich h&ouml;heren Bild- und Audioqualit&auml;t als bei VHS ist
eine DVD-Video deutlich g&uuml;nstiger in der Fertigung,
verschlei&szlig;frei und erlaubt zus&auml;tzliche Funktionen. So
werden zum Beispiel mehrere Kameraeinstellungen oder alternative
Schnittversionen eines Filmes unterst&uuml;tzt. Auch Untertitel,
Karaoke-Texte, Animationen und mehrere Sprachen sind m&ouml;glich.
<br>
</p>
<p>Trozdem kostet eine gekaufte DVD deutlich mehr als eine gekaufte
VHS-Kassette.
<br>
</p>
<p>DVD er&ouml;ffnet die Perspektive, im heimischen Wohnzimmer nicht
nur Filme, sondern auch reine Musikproduktionen in perfektem
6-Kanal-Sound erklingen lassen zu k&ouml;nnen. DVD-Audio ist mit der
Audio CD (16 bit/44 kHz) vergleichbar, arbeitet jedoch mit einer
h&ouml;heren Aufl&ouml;sung und Sampling-Frequenzen (bis zu 24 bit/192
kHz).
<br>
</p>
<p>F&uuml;r Computerdaten gibt es die Variante DVD - ROM. Ein
spezielles Dateiformat (&quot;UDF-Bridge&quot;) stellt sicher, dass
diese DVD auf den verschiedensten Rechnern lesbar bleibt,
unabh&auml;ngig vom verwendeten Betriebssystem. Auch Videoprogramme
sind in diesem Format auf DVD. Daher lassen sie sich in einem
entsprechend leistungsf&auml;higen Mac auch &uuml;ber ein
DVD-ROM-Laufwerk abspielen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align="center"><img src="image/sline.gif" border="0" width="640" height="2"></p>
<p align="center"><img src="image/img.gif" border="0" width="50" height="40"></p>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br> Letzte Aktualisierung am 28. Dezember 2003</address>
</td></tr></table>
<table border="0" cellpadding="0" cellspacing="0" width="100%"><tr><td valign="top">
<a href="harddriv.htm"><img src="udo_hm.gif" alt="Home" border="0" width="24" height="24"></a>
<img src="udo_noup.gif" border="0" width="24" height="24">
<a href="00f003.htm"><img src="udo_lf.gif" alt="Phillips CD 2600" border="0" width="24" height="24"></a>
<img src="udo_norg.gif" border="0" width="24" height="24">
</td></tr></table>
</td></tr>
</table>

</body></html>


