<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Falcon F030
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="03.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon F030 System" border=0 width="24" height="24"></a>
<a href="0301.htm" target="UDOcon"><img src="udo_lf.gif" alt="Spezifikation - Atari Falcon F030" border=0 width="24" height="24"></a>
<a href="0303.htm" target="UDOcon"><img src="udo_rg.gif" alt="Falcon F030 CLAB" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Falcon_20F030">3.2 Falcon F030</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Falcon F030 allgemein </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Eine kleine Zusammenfassung &uuml;ber alles das was ich im laufe
der Zeit beim Umgang mit dem Atari Falcon angesammelt hat.
<br>
<br>
</p>
<div align=center>
<br>
</div>
<p align=center><img src="image/f030main.gif" border=0 width="177" height="127"></p><br>
<div align=center><tt> Abbildung 1 - Falcon F030 / Mainview </tt>
<br>
</div>
<p align=center><img src="image/f030falc.gif" border=0 width="270" height="120"></p><br>
<div align=center><tt> Abbildung 2 - Falcon F030 / Mainview </tt>
<br>
</div>
<p align=center><img src="image/mainbor1.gif" border=0 width="338" height="205"></p><br>
<div align=center><tt> Abbildung 3 - Falcon F030 / Mainview </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p><b> Einige wichtige Tips zum Falcon Mainboard </b>
<br>
</p>
<p>Wie Sie in der &Uuml;bersicht erkennen k&ouml;nnen ist das Falcon
Mainboard eine komplexe Platine auf der sich alle Systemkomponenten
befinden. Das ist nicht nur mit den gro&szlig;en Teilen wie <a href="0f01.htm" target="UDOcon">Netzteil</a>,
IDE Festplatte, dem L&uuml;fter oder den gro&szlig;en Chips getan.
<br>Auf der Platine befinden sich eine Unzahl an kleinsten
SMD-Bauteilen die einer gesonderten, einer sehr vorsichtigen
Behandlung bed&uuml;rfen. Bei Modifikationen, sp&auml;ter, m&uuml;ssen
Bauteile auf der Platinenunterseite erreichbar werden, dazu mu&szlig;
die Platine komplett aus dem Geh&auml;use ausgebaut werden.
<br>
<br>
<br><b> Vorsicht, Multilayer.. </b>
<br>
</p>
<p>Beachten Sie bitte daher dringlichst diese Platine nicht zu biegen
oder zu verspannen! Wichtige Bauteile k&ouml;nnen so unter anderem
ihren d&uuml;nnen L&ouml;tkontakt zu den L&ouml;tpads oder den feinen
Leiterbahnen verlieren. Fehlfunktionen der gesamten Einheit w&auml;ren
die Folge.
<br>Solche Fehler sind idR nicht leicht zu finden! Einige
Hauptplatinen ist besonders auf der Platinenunterseite schlecht
gel&ouml;tet. In der Hauptsache macht sich das bei Ausf&auml;llen im
Audiosubsystem des Falcons bemerkbar.
<br>
<br>
<br><b> SMD-Bauteile </b>
<br>
</p>
<p>Nicht alle SMD-Bauteile k&ouml;nnen so einfach wie ein Widerstand
gewechselt werden!
<br>Gr&ouml;&szlig;ere Bauteile, u.a sind das die meisten Custom
Chips, setzen ein gesondertes Werkzeug voraus. Dieses Werkzeug findet
sich nicht in der heimischen Bastelkiste, dazu ist es zu teuer. Lange
L&ouml;tzeiten an SMD Kondensatoren ver&auml;ndert deren
Kapazit&auml;t! Beachten Sie dazu auch bitte den Artikel Elektronische
Arbeiten.
<br>
</p>
<p>Ein sehr wichtiger Punkt ist die Tatsache, speziell f&uuml;r die
Platinenunterseite, das hier immer eine weiche, nicht leitende
Arbeitsunterlage verwendet werden sollte. Kanten oder Tischecken
k&ouml;nnen den Verlust von kleinsten SMD-Teilen verursachen. Bedenken
Sie bitte das SMD-Bauteile idR keine normale Bauteilebeschriftung
besitzen. Alle Bauteile geben ihre Werte nur in einem speziellen
SMD-Code wieder. Ohne die passende Codetabelle oder zumindestens den
genauen Platinenaufdruck ist so ein Teil nur schwer zu Ersetzen.
<br>
</p>
<p>An allen Kondensatoren und Widerst&auml;nden ist man mit sehr
kurzen L&ouml;tzeiten gut beraten.
<br>Zum einl&ouml;ten von SMD-Widerst&auml;nden ist es Vorteilhaft das
Bauteil auf beiden Seiten gleichzeitig anl&ouml;ten zu k&ouml;nnen,
das geht nur mit einem richtigen SMD-L&ouml;tger&auml;t. Ein sehr
feiner SMD-L&ouml;tkolben tut es auch, allerdings schwerer.
<br>Das Soundsubsystem hat fast alle aktiven Bauteile auf der
Platinenunterseite.
<br>
</p>
<p>Beachten Sie auch den Artikel <a href="1607.htm" target="UDOcon">Elektronik Arbeiten</a>.
<br>
</p>
<p>
<br>
<br><b> Die Bauteilebeschriftung </b>
<br>
</p>
<p>Der n&auml;chste wichtige Punkt ist die Tatsache, speziell trifft
das auf die Unterseite der Platine zu, das sich nicht alle Bauteile,
speziell Kondesatoren und Widerst&auml;nde, in unmittelbarer N&auml;he
ihres Baueileaufdrucks befinden. Vorschnell wird hier leider das
falsche Bauteil entl&ouml;tet! Verfolgen Sie Notfalls die Leitebahnen
bis zum n&auml;chsten Teil und vergleichen sie die Angaben mit denen
der Anleitung nach der Sie gerade Arbeiten. Gezielt sind die
Modifikationen um den Bassbooster herrum gemeint.
<br>Am einfachsten geht das sicher mit dem original <a href="030806.htm" target="UDOcon">Schaltplan</a>,
allerdings ist das leider kein allgemeingut
<br>
<br>
<br><b> Static </b>
<br>
</p>
<p>Es soll nicht vergessen werden das auch die Platine des Falcons
empfindlich gegen&uuml;ber statischer Entladungen ist. Wenn Sie aus
ihrem Wohnzimmer kommen sollten Sie einen elektrisch geerdeten Punkt
mit den Fingern ber&uuml;hren, immer bevor Sie direkt auf die Platine
des Falcons fassen. Beim L&ouml;ten gen&uuml;gt es die Erd-Buchse der
L&ouml;tstation mit der &auml;usseren metallischen Umrandung der
Platine zu verbinden. Es reicht bei einem normalen L&ouml;tkolben
diesen Rand mit der L&ouml;tspitze vor dem eigentlichen
L&ouml;tvorgang an einem Bauteil kurz zu ber&uuml;hren.
<br>Einen Vollschutz erreicht man allerdings nur mit einem
antistatischem Armband. Vollprofis verwenden nur eine korrekte
Ausr&uuml;stung.
</p>
<p>
<br><b> L&ouml;ten Sie niemals am Rechner wenn dieser in Betrieb ist
!
<br>L&ouml;ten Sie niemals am eingeschalteten <a href="0f01.htm" target="UDOcon">Netzteil</a>!
<br>Verwenden Sie keine L&ouml;tger&auml;te die einen Pol ihrer
Betriebsspannung am metallischen Teil des L&ouml;tger&auml;tes liegen
haben, gemeint sind billige 12V Niederspannungs L&ouml;tkolben,
Autol&ouml;ter und solche Dinge </b>
<br>
<br>
</p>
<p>Mit solchen Ger&auml;ten ist es m&ouml;glich sich beim
L&ouml;tvorgang eine Fremdspannung, u.a die Betriebsspannung des
L&ouml;tger&auml;tes in den Computer zu holen, gr&ouml;&szlig;ere
Hardwaredefekte k&ouml;nnen dann leider nicht ausgeschlossen werden.
<br>
</p>
<p>Verwenden Sie nur technisch einwandfrei passendes Werkzeug!
<br>
</p>
<p>
<br>
<br><b> PLCC Bauteile </b>
<br>
</p>
<p>Die meisten gesockelten Chips im Falcon sind PLCC Bauteile mit
einer unterschiedlichen Anzahl von Anschlu&szlig;beinchen. Man bekommt
diese Chips nicht mit gewalt aus dem Sockel. Bauteile an denen man
schon mal Zugriff hat sind z.B die FPU, direkt unter dem internen
<a href="0f01.htm" target="UDOcon">Netzteil</a>, und das ROM f&uuml;r das Falcon Betriebssytem. Der Sockel
befindet sich direkt unter der internen Speicherkarte, neben dem
L&uuml;fter. F&uuml;r alle diese Bauteile gibt es im Fachhandel eine
sog. PLCC-Ausziehzange. Sie sollten auch nur eine solche Zange
benutzen. Werden solche Bauteile mit zwei Schraubendrehern
ausgehebelt, ja das geht auch, endet das auch schon einmal mit einem
zerbrochenen PLCC-Sockel. Sie brauchen das Bauteil dann nicht mehr
erneut einsetzen, es wird keinen vern&uuml;nftigen Kontakt herstellen.
Es braucht ja nur ein einzelner Kontakt zu fehlen..
</p>
<p>Besch&auml;ftigen Sie sich dann schon einmal mit dem Gedanken
einen PLCC-Sockel zu entl&ouml;ten. Schon gesehene Reparaturversuche,
den Sockel mit Kabelbindern zusammenzuhalten, schlagen aller Regel
nach fehl, es schafft niemand einen Sockel zu zu fixieren das wirklich
alle Pins korrekt kontaktiert werden.
<br>
</p>
<p>Beachten Sie auch den Artikel <a href="1607.htm" target="UDOcon">Elektronik Arbeiten</a>.
<br>
</p>
<p>
<br>
<br><b> Ausl&ouml;ten der Bauteile </b>
<br>
</p>
<p>Gute Erfahrungen habe ich mit Hei&szlig;luft gemacht.
<br>Was nicht bedeutet das Sie jetzt in den n&auml;chsten OBI-Markt
fahren um sich dort mit einem g&uuml;nstigen Hei&szlig;luft-Equipment
auszustatten, das passt so leider nicht. Es gibt spezielle
Hei&szlig;luft-L&ouml;tger&auml;te ganz speziell f&uuml;r
SMD-Geschichten.
<br>Allerdings zu Preisen die Privat nicht machbar sind, das hat nur
eine Firma. Es geht allerdings mit einer der kleinsten D&uuml;sen des
'Haushaltsgebl&auml;ses' vorsichtig ein bestimmtes Teil so zu zu
erw&auml;rmen das es sich leicht vom Mainboard abheben l&auml;sst.
Testen Sie das vorher irgendwo an einer alten Platine !!
<br>Bedenken Sie auch das, sollten Sie einen Chip oder Sockel auf
diesem Wege entfernen wollen, das sich auch kleinste Bauteile in der
n&auml;heren Umgebung ihres Sockels noch schneller Erw&auml;rmen als
das was Sie eigentlich entl&ouml;ten wollten. Schnell ist was
'verrutscht' oder gar Explodiert.
<br>
</p>
<p>Ich spreche hier absichtlich von 'Erw&auml;rmen', das ist Ihnen
sicher schon Aufgefallen.
<br>
</p>
<p>Sollte sich ihre Falconplatine einige dunkle Stellen oder gar
Brandflecke bei einer derartigen Aktion eingehandelt haben d&uuml;rfen
Sie sich langsam mit dem Gedanken eines Totalschadens befassen. Diese
Platine ist ein Multilayer, das bedeutet das unter der oberen ersten
sichtbaren Schicht noch bis zu f&uuml;nf weitere Lagen, also weitere
Leiterbahnebenen liegen k&ouml;nnen. Daher ist mit 'Erw&auml;rmen'
auch nur genau das gemeint.
<br>Wenn der alte, defekte, Sockel nach dem entl&ouml;ten einen Buckel
macht ist das Egal.
</p>
<p>Im &uuml;brigen kann man auch so die gro&szlig;en Chips von der
Platine entfernen.
<br>
</p>
<p><b> Blasen Sie niemals die hei&szlig;en L&ouml;tstellen eines
Sockels oder eines Chips an! </b>
<br>Das L&ouml;tzinn der Bauteilebeinchen, der Sockelkontakte und der
L&ouml;tpads auf der Platine w&uuml;rden einen unl&ouml;sbaren Klumpen
ergeben. Auch w&uuml;rden L&ouml;tzinnspritzer in aller Regel zwischen
die Beine benachbarter Bauteile fliegen. Beim VIDEL, COMBEL w&uuml;rde
sich das dann richtig lohnen
<br>
</p>
<p>L&ouml;tpads auf der Platine d&uuml;rfen auch mit einer feinen
Bronzedrahtb&uuml;rste geb&uuml;rstet werden.
<br>Ich spreche hier vom reinigen nach dem entl&ouml;ten. Unebene
L&ouml;tpads, ungleichm&auml;ssig verzinnte L&ouml;tpads ergeben einen
schiefen Sockel, ein Unsichers und Unsauberes einl&ouml;ten von neuen,
u.U sehr teueren Bauteilen. Das Rasterma&szlig; der Bauteile im Falcon
l&auml;sst leider keinerlei Spielraum zu!
<br>
</p>
<p>Benutzten Sie eine Lupe, sofern Sie es so nicht sehen, es lohnt
hinterher!
<br>
</p>
<p>Beachten Sie auch den Artikel <a href="1607.htm" target="UDOcon">Elektronik Arbeiten</a>.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="03.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon F030 System" border=0 width="24" height="24"></a>
<a href="0301.htm" target="UDOcon"><img src="udo_lf.gif" alt="Spezifikation - Atari Falcon F030" border=0 width="24" height="24"></a>
<a href="0303.htm" target="UDOcon"><img src="udo_rg.gif" alt="Falcon F030 CLAB" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
