<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: COMBO Chip
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0401.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Custom Chip" border=0 width="24" height="24"></a>
<a href="040101.htm" target="UDOcon"><img src="udo_lf.gif" alt="NVRAM" border=0 width="24" height="24"></a>
<a href="040103.htm" target="UDOcon"><img src="udo_rg.gif" alt="VIDEL Chip" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="COMBO_20Chip">4.1.2 COMBO Chip</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Der COMBEL (COMBO) CHIP im Falcon</tt>
</p>
<p>Der COMBO ist ein speziell f&uuml;r den <a href="0302.htm" target="UDOcon">Falcon F030</a> hergestellter
Multifunktionsbaustein mit folgenden Funktionen:
<br>
<br>
</p>
<pre>
- Memory Contol Unit [MCU]
- Interrupt Priority and Illegal Condition Detection
- Clock Dividers / Taktteiler
- Chip Select Handling
- <a href="0c0c.htm" target="UDOcon">Paddleport</a> Controller
- Joystick Controller
- Light Gun Controller
- Blitter (Grafischer Coprozessor im Falcon)

</pre>
<p>
<br>
</p>
<p>Die MCU im COMBO nimmt die Adressen vom Adressbus (A1-A23) und
wandelt diese in Reihen und Spalten f&uuml;r das DRAM. Ebenso erzeugt
die MCU die RAS- und CAS-Signale f&uuml;r den Betrieb des
Ramspeichers.
<br>
</p>
<p>Ebenso werden hier die Chipselectsignale f&uuml;r das ROM und die
I/O-Bausteine generiert. Die MCU im COMBO kann im FalconF030 bis zu
14MB Ram verwalten und adressieren. Sie ist auch der Grund f&uuml;r
brachliegende 2 MB Speicher, die im Falcon nicht mal als Ramdisk
angesprochen werden k&ouml;nnen.
<br>
</p>
<p>Die Gr&ouml;&szlig;e des Ramspeichers beschr&auml;nkt sich im
Falcon auf genau zwei Ausbaustufen. Es gibt eine 4MB und eine 14MB
(16MB) Ramkarte, die auf den internen Erweiterungsplatz gesteckt
werden k&ouml;nnen. Hierzu existieren genau zwei Selektionspins, die
&uuml;ber einen weiteren Hardwarebaustein der MCU mitteilt, welche
Menge von RAM zur Verf&uuml;gung steht. Die MCU produziert ebenfalls
s&auml;mtliche Adressen f&uuml;r den Videospeicher, den Refresh und
den CPU/DMA Datentransfer &uuml;ber den Multiplex-Adressbus des
Falcon.
</p>
<p>Es ist jedoch m&ouml;glich, ein Falcon-System &uuml;ber den
<a href="030702.htm" target="UDOcon">Expansionsport</a> mit schnellem TT-Ram (FAST-Ram) auszustatten. Siehe
<a href="0b03.htm" target="UDOcon">FX-Karte</a>.
<br>
</p>
<p>S&auml;mtliche Systeminterrupts werden im COMBO maskiert. Ebenso
wird der Status aller Interrups im COMBO gespeichert. Beachten Sie die
Auflistung der Systeminterrupts und deren Priorit&auml;t.
<br>
</p>
<pre>
Interrupt Level       Priorit&auml;t
----------------------------------------------
7 (highest)           Open (Bus)
6                     MFP / DSP Interrupt
5                     85C30 LAN Baustein
4                     VSYNC (Vertikal Blank)
3                     Open (Bus)
2                     HSYNC (Horizontal Blank)
1 (lowest)            Open (Bus)

</pre>
<p>
<br>Die <a href="0305.htm" target="UDOcon">Hardware</a> im COMBEL erlaubt es, die Interruptlevels 1-3 als
Interrupts von externen Devices zu behandeln. So sind einige
Subsysteme in wie z.B. der IDE- oder der Parallelport in der Lage,
diese Interrupts zu aktivieren. Weitere <a href="0305.htm" target="UDOcon">Hardware</a> nutzt den
Interruptlevel 5. Der COMBO Chip meldet der CPU &uuml;ber die
Leitungen IPLO-IPL2, mit welcher Priorit&auml;t der gerade
aufgetretene Interrupt anliegt. Die CPU entscheidet die Behandlung.
<br>
<br>
</p>
<pre>
Interrupt Signal Definiton

IPL2   IPL1    IPL0    Interrupt Level
----------------------------------------------
1      1       1       Level 1
1      0       1       Level 2
1      0       0       Level 3
0      1       1       Level 4
0      1       0       Level 5
0      0       1       Level 6
0      0       0       Level 7

</pre>
<p>
<br>
</p>
<p>Weiterhin ist der COMBEL in der Lage, einen Bus Error und diverse
andere Fehlfunktionen festzustellen. Die meisten Fehlererkennungen
basierten auf Laufzeitfehlern. Im COMBO ist festgelegt welche Funktion
welche Zeit ben&ouml;tigt. Wird eine Funktion nicht innerhalb einer
bestimmten Zeitspanne positiv beendet, ist dies ein Fehler des
entsprechenden Systems.
<br>
</p>
<p>Nach folgenden Kriterien sendet der COMBEL ein BERR-Signal zur
CPU:
<br>
</p>
<p>- Ein Buszyklus ist nicht in 16 Microsekunden beendet
(&Auml;nderbar auf 32uS)!!
<br>- Ein Versuch, das ROM zu beschreiben
<br>- Ein Versuch, Daten mit falscher L&auml;nge, Format in ein
Register zu schreiben
<br>- Beschreiben des Systemspeichers im Usermode
<br>
<br>
</p>
<p><b> Taktteiler </b>
<br>
</p>
<p>Das COMBO IC wandelt die urspr&uuml;nglichen 32Mhz Mastertakt in
16Mhz, 8Mhz sowie in ein 4 Mhz und in ein 500Khz Taktsignal um. Alle
Taktsignale werden von anderen Custom Chips bzw. Systembausteinen
ben&ouml;tigt.
<br>
<br>
</p>
<p><b>Chipselekt </b>
<br>
</p>
<p>Der COMBEL dekodiert die Adressen und selektiert daraus die
Chipselectsignale f&uuml;r weitere Peripheriebausteine des Falcon
F030.
<br>Das betrifft folgende Systembausteine:
<br>
</p>
<p>8650, MFP, VIDEL , RTCCS (RealTimeClock), MMU , <a href="0c09.htm" target="UDOcon">Romport</a>,
(XROM3/XROM4)
<br>IDE (HIDECS0/HIDECS1) sowie ROM / ROM2
<br>
</p>
<p>Im COMBO werden ebenfalls die Signale PAD0X, PAD1X und PAD0Y,
PAD1Y sowie PADRST verarbeitet. Alle diese Signale stammen vom
<a href="0c0c.htm" target="UDOcon">Paddleport</a>, den es bisher auch nur am Falcon bzw. am Atari STe gibt.
<br>PADRST dient als Resetsignal f&uuml;r den <a href="0c0c.htm" target="UDOcon">Paddleport</a>.
<br>Ebenso befindet sich im Innern des COMBO die Logik, um ein paar
Joysticks am Falcon betreiben zu k&ouml;nnen. Hierzu liegen am COMBEL
die Inputsignale JOYRH, JOYRL an. Beide Signale sind
ReadEnable-Signale. JOYWH und JOYWL sind WriteEnable-Signale. BUTTON
ist die Signalleitung f&uuml;r die Feuertasten
<br>
</p>
<p><b> Blitter integriert </b>
<br>
</p>
<p>Der im COMBO integrierte BLITTER ist der grafische Coprozessor,
wie er auch schon in anderen Atari-Computern eingebaut war. Im Falcon
wurde der Blitter aber eben in den COMBEL integriert. Der Blitter
l&auml;sst sich im Falcon mit einem Softwarebefehl deaktivieren. In
anderen Systemen musste hier ein Jumper oder eine L&ouml;tbr&uuml;cke
gesetzt werden. Der Blitter sollte Bitblock-Operationen beschleunigen
und die CPU unterst&uuml;tzen/entlasten. Die Pinbelegung des COMBO
Chip entnehmen Sie bitte dem Kapitel Pin aus DOITF030.
<br>
</p>
<p>Letztlich bleibt noch das Signal XPEN, welches den COMBO
veranlasst, die Daten vom Horizontal-/ Vertikalz&auml;hler einzulesen.
Diese Daten werden erreicht, in dem die korrekte Position der
&quot;Lightgun&quot; anhand des Bildschirm-Lichtrasters von der CPU
errechnet wird.
<br>
</p>
<p>Bleibt als Abschlu&szlig; noch zu sagen, da&szlig; Sie sich
bem&uuml;hen sollten, den COMBEL in ihrem Falcon pfleglich zu
behandeln. Anhand dieser Erl&auml;uterungen k&ouml;nnen Sie sehen,
da&szlig; ohne diesen Chip Ihr Falcon nicht mal eine einfache Diskette
erkennen wird. Sie werden ohne den COMBEL nicht mal eine einfache
Bildschirmausgabe haben.
<br>
</p>
<p>Funktioniert der COMBEL nicht, erhalten Sie, wie bei einem Fehler
im Videoteil, einen wei&szlig;en Bildschirm. Kein Bootlogo. Die
interne IDE-Festplatte l&auml;uft nicht an und es kann auch nicht von
einer Diskette gebootet werden. Eventuell l&auml;uft das Testmodul im
<a href="0c09.htm" target="UDOcon">Romport</a>.
<br>
</p>
<p>Ersatzchips finden Sie unter <a href="030805.htm" target="UDOcon">Ersatzteile</a> und <a href="1604.htm" target="UDOcon">H&auml;ndler</a>.
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0401.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Custom Chip" border=0 width="24" height="24"></a>
<a href="040101.htm" target="UDOcon"><img src="udo_lf.gif" alt="NVRAM" border=0 width="24" height="24"></a>
<a href="040103.htm" target="UDOcon"><img src="udo_rg.gif" alt="VIDEL Chip" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
