<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: NVRAM
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0401.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Custom Chip" border=0 width="24" height="24"></a>
<a href="0401.htm" target="UDOcon"><img src="udo_lf.gif" alt="Falcon Custom Chip" border=0 width="24" height="24"></a>
<a href="040102.htm" target="UDOcon"><img src="udo_rg.gif" alt="COMBO Chip" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="NVRAM">4.1.1 NVRAM</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Einiges &uuml;ber das NVRAM im Falcon.</tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Wie ich immer wieder in den verschiedenen Mailboxen u. Netzwerken
lesen kann gibt es doch Leute die Probleme mit dem
nichtfl&uuml;chtigen Ram, kurz NVRAM, im <a href="0302.htm" target="UDOcon">Falcon F030</a> haben. Auch ist
es wohl so das einige Ger&auml;te bzw. dessen Uhrenchip schon eine
leere Batterie hat. Da diese von aussen nicht zu ersetzen ist
mu&szlig; leider der gesammte Chip daher ausgewechselt werden
<br>
</p>
<p>Dieser Baustein der auf dem Mainbord die Bezeichnung U64
tr&auml;gt ist direkt unter der Tastatur zu finden, die Tastatur
sollte hierzu abgezogen werden. Es ist der gr&ouml;&szlig;te Baustein
in diesem Bereich. Dieser Chip, Uhrenchip oder wie auch immer, wird
von einer internen 3,6V Lithium Batterie versorgt die laut
Herstellerangaben ca. 10 Jahre halten sollte.
<br>
</p>
<p>Jedesmal wenn also der Falcon ausgeschaltet wird &uuml;bernimmt es
diese interne Batterie das Rechnersetting, inklusive der aktuellen
Uhrzeit, bis zum n&auml;chsten Einschalten zu sichern.
<br>
<br>
<br>
</p>
<p align=center><img src="image/nvram.gif" border=0 width="458" height="318"></p><br>
<div align=center><tt>Abbildung 1 - Pinbelegung des NVRAM im Falcon.</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Im NVRAM sind idR 50 Bytes Platz f&uuml;r die Einstellungen die
man als Benutzer am Falcon t&auml;tigt. Weiterhin sind 14 Bytes als
Clock- / Controll-Register vorhanden. Das SquareWave Output-Signal ist
Programmierbar, wird aber im <a href="0302.htm" target="UDOcon">Falcon F030</a> nicht verwendet. (Pin 23) U.a
so auch die Bootaufl&ouml;sung, Bildschirmaufl&ouml;sung usw. Auf
diese 50 Byte greift man jeweils mit einem Doppelwort zu. Das erste
Wort enth&auml;lt die entsprechende Adresse, das zweite dann die die
Daten. Man braucht das aber nicht von Hand zu machen. Es gibt hier
Programme von Atari und auch z.B von Uwe Seimet,z.B BOOTKONF.PRG, die
diese Arbeit sehr gut &uuml;bernehmen. Eine &Auml;nderung im NVRAM
wird jedoch erst beim n&auml;chsten also erneuten Booten des Rechners
aktiviert.
<br>
<br>
<br><b> Die Bausteilebezeichnung kompatibler Uhrenchips lautet: </b>
<br>
<br>MK48T87B-24 (Signetics)
<br>MCCS146818 BM (Motorola)
<br>MC146818A (Motorola)
<br>DS12887 /DS12887A (Dallas)
<br>
</p>
<p>Wobei in einigen Falcons wohl eher ein &auml;lteres NVRAM von
Dallas zu finden sein wird. Meistens wohl der Typ: DS1287 oder der
noch &auml;ltere Baustein MC146818A. Der neue Baustein DS12887 ist
Pinkompatibel zum alten DS1287 und wird wohl besser zu erhalten sein.
Er ersetzt den alten DS1287 zum Gl&uuml;ck vollst&auml;ndig.
<br>
<br>
<br><b> Description DS12887 / DS12887A </b>
<br>
<br>The DS12887 Real Time Clock plus RAM is designed to be a direct
replacment for the DS1287. The DS12887 is indentical in form, fit and
function to the DS1287, and has an additional 64 bytes of general
purpose RAM. Access to this additional RAM space is determined by the
logic level presented on AD6 during the address portion of an access
cycle. A lithium energie source, quarz crystal, an write-protection
circurity are contained within a 24-pin dual in line package. As such,
the DS12887 is a complete subsystem replacing 16 components in a
typical application. The functions include a nonvoilate time-of-day
clock, an alarm, a one-hundred-year calendar, programmmable interrupt,
square wave generator and 114 bytes of nonvoilate static RAM. The real
time clock is distinctive in that time-of-day memory are maintained
even in the absence of power.
</p>
<p>Source: (C) DALLAS SEMICONDUCTOR Data Sheet
<br>
<br>
<br>
<br>
</p>
<p align=center><img src="image/nvram3.gif" border=0 width="275" height="187"></p><br>
<div align=center><tt>Abbildung 2 - Pinbelegung des NVRAM DS1287 / DS12887 / DS
12887A </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Alle diese Bausteine sind Pinkompatibel!
<br>Diese Bauteile lassen sich z.B gut &uuml;ber die Fa. M&Uuml;TRON
oder die Fa. SEGOR beziehen.
<br>PCs benutzen eben die gleichen Bausteine. Die Adressen finden Sie
unter <a href="1604.htm" target="UDOcon">H&auml;ndler</a>.
<br>
<br>
</p>
<p><tt>Programmierung/Abfrage:</tt>
<br>
</p>
<p>NVMaccess()
<br>
</p>
<p>WORD NVMaccess(op,start,count,buffer)
<br>WORD op, start, count; char *buffer;
<br>
</p>
<p>NVMacces() liest oder modifiziert Daten im nicht- fl&uuml;chtigen
RAM
<br>
</p>
<p><tt>OPCODE</tt> 46(0x2E)
<br>
</p>
<p># Die Funktion ist variabel
<br>
</p>
<p><tt>NVM_READ 0</tt> Liest eine Anzahl Bytes (count)vom offset Start
und legt die Daten in den Buffer.
<br><tt>NVM_WRITE 1</tt> schreibt Daten (count)vom Buffer zum offset
Start
<br>
</p>
<p><tt>NVM_RESET 2</tt> L&ouml;scht alle Daten im NVRAM
</p>
<p>Binding:
</p>
<p>pea buffer
<br>move.w count,-(sp)
<br>move.w start,-(sp)
<br>move.w op,-(sp)
<br>move.w #$2E,-(sp)
<br>trap #14
<br>lea 12(sp),sp
<br>
</p>
<p>Alle oben genannten Uhrenbausteine sind Pinkompatibel und
k&ouml;nnen jederzeit gegeneinander Ausgetauscht werden. Es kommt also
schon vor das irgendwelche Schweineprogramme oder einfach eine
Unachtsamkeit den Inhalt des NVRAMs zerst&ouml;rt oder einfach mit
sinnlosen Daten beschreibt. Im einfachsten Fall stimmt einfach nur die
Uhrzeit nicht mehr. Im schlimmsten Fall bootet der Falcon nicht mehr
korrekt.
<br>
</p>
<p>Hier gibt es ein NVRES.PRG welches man auf einer Diskette im
Autoordner stets parat halten sollte. Diese Diskette legt man in das
Diskettenlaufwerk und schaltet den Rechner ein. Das Programm
l&ouml;scht den gesammten Inhalt des NVRAMs und bringt den Falcon
wieder dazu sich vern&uuml;nftig zu Verhalten in dem die
Voreinstellungen aus dem ROM geladen werden. Auch das anschliessen
einens monochromen Monitors, also eines SM124 oder &auml;hnlichem
&uuml;ber den ST-Adapter hat in gewissen Situationen einen rettenden
Einflu&szlig;. Das einstecken eines Atari-Testmoduls l&ouml;scht den
Inhalt des NVRAM ebenfalls und setzt hier ebenfalls die Defauldaten
aus dem internen ROM des Falcons ein.
<br>
</p>
<p>Im Ordner PROGRAM ist das entsprechende Reset-Programm zu finden,
auf der Festplatte n&uuml;tzt es wenig da man in einigen F&auml;llen
auch auf die nicht zugreifen kann. Eine einfache Diskette kann also
ihre Vorz&uuml;ge haben. Hilft ein Reset des NVRAMs nicht weiter,
bleibt die Uhrzeit troz allen Versuchen falsch oder l&auml;sst sich
Stellen, l&auml;uft aber nicht weiter kann es m&ouml;glich sein das
die interne Batterie ersch&ouml;pft ist oder einfach ein defekt des
Chips vorliegt. In diesem Fall hilft leider nur ein Austauschen des
gesamten Bauteiles. Viele Fehler treten ja erst wieder auf nachdem der
Falcon eine weile abgeschaltet war. An die interne Batterie des Chips
kommt man leider nicht heran ohne den Chip zu zerst&ouml;ren.
<br>
<br>Den entl&ouml;teten Chip bitte im n&auml;chsten Entsorgungskasten
f&uuml;r Altbatterieen einwerfen, nicht in den Hausm&uuml;ll geben.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/nvram1.gif" border=0 width="140" height="200"></p><br>
<div align=center><tt>Abbildung 3 - Position des NVRAM im Falcon.</tt>
<br>
</div>
<p>
<br>
<br>Zum Auswechseln des NVRAM mu&szlig; der Falcon ge&ouml;ffnet
werden, so da&szlig; man auch gleich die inneren Abschirmbleche
entfernen kann. Hierzu wird erst das obere Blech komplett entfernt.
S&auml;mtliche Schrauben des Blechkragens sind zu l&ouml;sen. Nachdem
alle oberen Bleche entfernt wurden werden die am seitlichen
Platinenrand sichtbaren Blechhaken gerade gebogen. Danach entfernt man
die Befestigungsschrauben der Platine rundum komplett. Leider
mu&szlig; hier auch das interne <a href="0f01.htm" target="UDOcon">Netzteil</a> und das Diskettenlaufwerk
abgeschraubt werden um die Platine auszubauen zu k&ouml;nnen. Gleiches
betrifft die interne <a href="060402.htm" target="UDOcon">IDE-Platte</a>. Diese wird nur mit ihrem Blechhalter
von der Platine geschraubt. Die Flachbandkabel der <a href="060402.htm" target="UDOcon">IDE-Platte</a> und des
Diskettenlaufwerkes sind m&ouml;glichst nicht zu knicken. Auch ziehen
und zerren an diesen kurzen Kabeln kann schnell zu einem Defekt
f&uuml;hren.
<br>Siehe hierzu auch unter <a href="030803.htm" target="UDOcon">Open Case</a>
<br>
</p>
<p>Die Schrauben f&uuml;r das Diskettenlaufwerk befinden sich auf der
Geh&auml;useunterseite. Es sind hier vier Schrauben zu l&ouml;sen.
<br>
</p>
<p>Verwenden Sie BOOTKONF.PRG 1.30 von Uwe Seimet zum Herstellen
einer korrekten und lauff&auml;higen Bootkonfiguration.
<br>
</p>
<p><b> Note:</b>
<br>
</p>
<p>Beachten Sie bitte dringlich das im Atari <a href="0302.htm" target="UDOcon">Falcon F030</a> NICHT alle
Beinchen des NVRAM verl&ouml;tet sind. Nutzen Sie die Gelegenheit vor
dem Ausl&ouml;ten die entsprechenden Pins zu markieren. Nutzen Sie die
Pinbelegung! Werden alle Pins verl&ouml;tet kommt es bei einigen
Boards zu fehlfunktionen
<br>
</p>
<p><b> Fehler die nach dem auswechseln Auftreten k&ouml;nnen </b>
<br>
<br>
</p>
<p>- NVRAM l&auml;sst sich nicht neu beschreiben.
<br>- Uhrzeit stimmt troz mehrfacher korrektur nicht
<br>- Uhzeit u. Datum zeigen Phantasiedaten
<br>- Falcon bootet nicht
<br>
<br>
</p>
<p>In allen F&auml;llen d&uuml;fen Sie zuerst den gerade eben
eingel&ouml;teten Baustein wieder entfernen. Untersuchen Sie danach
zuerst die L&ouml;taugen auf Kurzschl&uuml;sse, Unterbrechungen und
&auml;hnlichem. Versuchen Sie einen Sockel einzul&ouml;ten, manchmal
passt das inkl. dem Chip doch noch unter die eingelegte Tastatur.
Verl&ouml;ten Sie den Sockel erst *nachdem* die dessen Bauh&ouml;he
inkl. dem eingestecken NVRAM getestet haben! Die Tastatur darf dabei
nicht Wackeln, ansonsten dr&uuml;ckt das alles im zugeschraubten
Zustand auf das wehleidige Falcon Mainboard!
<br>
<br>
</p>
<p><b> Ersatz f&uuml;r die interne Lithium-Batterie </b>
<br>
<br>Die Grundidee zu diesem Umbau stammt von Andreas Buch@OF2.
<br>
</p>
<p>Originaltext:
<br>
</p>
<p>Wenn man keinen neuen Uhrenchip kriegt kann man versuchen eine
Litium-Batterie &uuml;ber eine Diode direkt an die Pins der
Versorgungsspannung zu l&ouml;ten. Die interne Lithium-Batterie
mu&szlig; gegen die Spannung gesch&uuml;tzt sein (auch &uuml;ber 'ne
Diode), daher kann man die 3,6V (wahrsch. tuts auch eine 3V ) Batterie
folgenderma&szlig;en anl&ouml;ten. +Pol der Batterie an die Anode der
Diode und die Kathode (da wo der Ring ist )dann an Pin 24, -Pol der
Batterie an Pin 12.
</p>
<pre>24
  -------------
  &gt;  NV RAM    |
  -------------     Diode:
              12    A-|&lt;-K
</pre>
<p>
<br>
</p>
<p>Da aber so die Batterie den gesamten Falcon mit Strom versorgen
w&uuml;rde, demnach ziemlich schnell leer w&auml;re, erfolgt eine
kleine Korrektur der Schaltung durch das einf&uuml;gen einer weiteren
Diode und dem Unterbrechen einer Leiterbahn im Falcon.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/nvram2.gif" border=0 width="275" height="187"></p><br>
<div align=center><tt> Abbildung 4 - Modifikation der Stromversorgung des NVRAM </tt>
</div>
<p>Beachten Sie bitte das diese Modifikation nicht leicht ist,
eventuell besch&auml;digen Sie hier wichtige Leiterbahen ihres Atari
<a href="0302.htm" target="UDOcon">Falcon F030</a>. Bedenken Sie bitte das die +5 Versorgung bei Falcon
Multilayer zumeist in den mittleren Schichten der Platine stattfindet.
L&ouml;ten Sie daher, wenn der Chip schon raus mu&szlig;, einen
passenden Sockel ein, trennen Sie zuvor den Pin 24 am Sockel so kurz
wie m&ouml;glich ab. L&ouml;ten sie hier einen roten Draht an den Sie
sp&auml;ter zurechtschneiden k&ouml;nnen.
<br>
</p>
<p>L&ouml;ten Sie den Sockel nun ein. Besorgen Sie sich zwei Dioden
1N4001 od. &auml;hnlich. L&ouml;ten Sie eine Diode an das Ende des
roten Drahtes und zwr so da&szlig; der Markierungsring der Diode in
Richtung des NVRAM-Sockels zeigt. Am selben Pin 24 l&ouml;ten sie die
zweite Diode, ebenfalls mit Markierungsring in Richtung Pin 24, fest.
An das Ende dieser Diode kommt der Pluspol ihrer 3.6V
Lithium-Batterie. Minus dieser Batterie verbinden Sie mit Pin 12 des
NVRAM oder mit jedem anderen GND-Punkt im Falcon.
<br>
</p>
<p>Der rote Draht, dessen noch freies Ende, l&ouml;ten sie irgendwo
an +5V fest. Benutzen Sie die Abbildung 3 um eine &Uuml;bersicht zu
erhalten.
</p>
<p>Beide Dioden verhindern das sich +5V und die 3.6V der Batterie
behinden und die Batterie sich nicht &uuml;ber den Rechner entleeren
wird. Im ausgeschalteten Zustand des Falcon wird die neue
Lithiumbatterie NUR den NVRAM-Chip versorgen. Sobald der Rechner
eingeschaltet wird &uuml;bernimmt die h&ouml;here +5 Spannung die
notwendige Versorgung des Chips.
<br>
</p>
<p>Zu kompliziert? Dann m&uuml;ssen Sie den Chip halt eben wechseln
:)
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0401.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Custom Chip" border=0 width="24" height="24"></a>
<a href="0401.htm" target="UDOcon"><img src="udo_lf.gif" alt="Falcon Custom Chip" border=0 width="24" height="24"></a>
<a href="040102.htm" target="UDOcon"><img src="udo_rg.gif" alt="COMBO Chip" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
