<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Jumper Einmaleins
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="06.htm" target="UDOcon"><img src="udo_up.gif" alt="Verschiedene Laufwerke am Falcon F030" border=0 width="24" height="24"></a>
<a href="0601.htm" target="UDOcon"><img src="udo_lf.gif" alt="Festplatten Notfall" border=0 width="24" height="24"></a>
<a href="0603.htm" target="UDOcon"><img src="udo_rg.gif" alt="Falcon Festplatten" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Jumper_20Einmaleins">6.2 Jumper Einmaleins</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Das kleine Einmaleins der Ger&auml;tejumper </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<p>Eine Zusammenstellung der wichtigsten Begriffe, eine kleine
Sammmlung, rund um das korrekte Einstellen von Ger&auml;tejumpern an
SCSI-, <a href="0604.htm" target="UDOcon">IDE-Festplatten</a> sowie den meisten anderen <a href="0701.htm" target="UDOcon">CD-ROM</a> Laufwerken und
CDR- CDRW-Brennern. Werden alle Jumper korrekt gesetzt spart man sich
h&auml;ufig eine lange <a href="0308.htm" target="UDOcon">Fehlersuche</a>. Bei SCSI-Ger&auml;te trifft man
sehr oft eine fehlende oder gar eine doppelte Terminierung des Bus und
auch sehr oft eine doppelte Vergabe der SCSI IDs. Beachten Sie bitte
das beim mischen von SCSI2, U- UW-SCSI Ger&auml;ten andere Richtlinien
zur Anwendung kommen m&uuml;ssen. Die hierzu passenden Tips finden Sie
in <a href="http://www.atari-computer.de/doitarchive/index.htm" target="_top">DOITDRIVE</a>, welches Sie leicht auf meiner Website finden.
<br>
</p>
<p>An IDE-Laufwerken gibt es die meisten Jumper nicht! An
IDE-Ger&auml;te finden sich zumeist ausschliesslich Jumper f&uuml;r
&quot;Master&quot; (MS) (D0), &quot;Slave&quot; (SL) (D1) oder (CS)
f&uuml;r &quot;CableSelect&quot;. Am Atari Falcon IDE-Interface
k&ouml;nnen zwei IDE-Ger&auml;te betrieben werden.
<br>
</p>
<p>Die kleine Sammlung gilt nicht ausschliesslich nur f&uuml;r
Atari-Computer!
<br>
</p>
<dl>
<dt><b>ID-Jumper</b></dt><dd>
<br>&nbsp;
<br>Als ID-Jumper werden idR bei SCSI eine Reihe von 3 Jumpern
bezeichnet
<br>mit denen es m&ouml;glich ist das entsprechende Ger&auml;t auf
eine Adresse
<br>zwischen 0-7 fest einzustellen. Externe Ger&auml;te besitzen dazu
einen von aussen zug&auml;nglichen ID-Schalter
<br>Jeder Jumper steht f&uuml;r eine Zahl:
<br>
<br>&nbsp;
<br>Jumper 0 = ID1, Jumper 1 = ID2 und Jumper 2 = ID4
<br>Daraus ergibt sich, entsprechend gesteckt, jede Adresse zwischen 0
und 7
<br>
<br>&nbsp;
<br>Beispiel: Jumper 1 = ON und Jumper 2 = ON ergibt: 2+3 = SCSI ID5
<br>Beispiel: Jumper 0 = ON ergibt: 1, alle anderen sind OFF = SCSI
ID1
<br>
<br>&nbsp;
<br>Bedenken Sie bitte das bei vielen Computern unterschiedlicher
Hersteller
<br>die ID0 bereits f&uuml;r eine interne SCSI-Platte, die ID7 durch
den
<br>Computer selber belegt wird! Das betrifft insbesondere Macintosh
<br>Hier ist z.B die ID3 immer durch das eingebaute <a href="0701.htm" target="UDOcon">CD-ROM</a>
zus&auml;tzlich belegt!
<br>
<br>&nbsp;
<br><a href="0604.htm" target="UDOcon">IDE-Festplatten</a> verf&uuml;gen &uuml;ber nur zwei 'ID'-Jumper.
'Master' ist hierbei
<br>immer das erste Ger&auml;t am IDE-Bus, als 'Slave' wird das zweite
Ger&auml;t
<br>gejumpert. Das gilt auch f&uuml;r IDE CD-ROMs.
<br>Achten Sie darauf, nur so kann ein reibunsloser Betieb
gew&auml;hrleistet werden
<br>
<br>&nbsp;
<dt><b>LED</b></dt><dd>
<br>&nbsp;
<br>Ein meistens zweipoliges Anschlu&szlig;feld f&uuml;r eine
Leuchtdiode die zur Anzeige der Zugriffskontrolle benutzt wird.
<br>
<br>&nbsp;
<dt><b>TE / SCSI-TERM / TERM</b></dt><dd>
<br>&nbsp;
<br>Wird dieser Jumper gesteckt ist der auf dem Ger&auml;t angebrachte
<br>Terminator (Abschlu&szlig;widerstand) eingeschaltet. Beachten Sie
bitte
<br>hiezu unbedingt die pysikalische Ger&auml;tereihenfolge! Sie
finden hier im Archiv mehrere bebildete Beispiele f&uuml;r einen
korrekten SCSI-BUS(!nl)
<br>&nbsp;
<br>Es darf an ALLEN Computern nur das jeweils letzte Ger&auml;t am
SCSI-Bus
<br>terminiert werden. Verwenden sie bei einer langen Busleitung
lieber einen aktiven Terminator da nur dieser in der Lage ist einen
100% korrekten Abschlu&szlig; selbst bei langen Leitungen zu bilden.
Beachten Sie hierzu aber auch TermPwr!!
<br>Der Computer, als HOST, ist immer terminiert.
<br>
<br>&nbsp;
<dt><b>TP / TERMPWR</b></dt><dd>
<br>&nbsp;
<br>TermPwr ist die Stromversorgungsleitung &uuml;ber den SCSI-Bus. Es
werden hier
<br>alle Terminatoren mit +5 Volt versorgt. &Uuml;blicherwiese
&uuml;bernimmt die
<br>Stromversorgung der Computer. Es schadet aber auch nicht wenn
dieser Jumper auf einer oder mehreren SCSI-Ger&auml;ten gesteckt ist.
Es spielt keine Rolle ob ein, zwei oder noch mehr Laufwerke TermPwr
liefern.
<br>
<br>&nbsp;
<br>Beachten Sie bitte das z.B &auml;ltere SCSI-ZIP Laufwerke, also
die ersten Serien ohne TermPwr nicht korrekt arbeiten werden!
<br>
<br>&nbsp;
<dt><b>UNIT ATTENTION</b></dt><dd>
<br>&nbsp;
<br>Ist dieser Jumper gesteckt sendet das Ger&auml;t nach dem
Einschalten eben
<br>das 'Unit Attention' Signal zum Host. Normalerweise ben&ouml;tigt
man das nicht
<br>
<br>&nbsp;
<br>Benutzen sie diesen Jumper nur wenn die Platte nicht korrekt
erkannt wird
<br>
<br>&nbsp;
<dt><b>WP / WPROT</b></dt><dd>
<br>&nbsp;
<br>Dieser Jumper setzt einen aktiven Schreibschutz!
<br>Ist dieser Jumper 'ON' kann das Medium nur gelesen werden
<br>
<br>&nbsp;
<dt><b>SPIN DELAY / SPIN / DELAY START</b></dt><dd>
<br>&nbsp;
<br>Eine kleine Einschaltverz&ouml;gerung f&uuml;r den
Festplattenantrieb
<br>Man kann immer darauf verzichten
<br>
<br>&nbsp;
<dt><b>SPIN UP / DELAY START</b></dt><dd>
<br>&nbsp;
<br>Mit diesem Jumper wird das starten des Plattenmotors beim
Einschalten eingestellt
<br>Dieser Jumper ist immer so zu setzen das die Platte beim
einschalten
<br>des Computers automatisch startet
<br>
<br>&nbsp;
<dt><b>PARITY</b></dt><dd>
<br>&nbsp;
<br>Jumper f&uuml;r die Parit&auml;tspr&uuml;fung. IdR arbeiten die
meisten Hostadapter
<br>SCSI-Controller ohne Parit&auml;tspr&uuml;fung. NICHT
PCI-Controller!
<br>Sie sollten darauf achten das ALLE ihre Ger&auml;te den
Parityjumper einheitlich eingestellt haben. Das trifft besonders auf
CD-Brenner zu. Einige Modelle arbeiten nur korrekt wenn dieser Jumper
gesteckt ist.
<br>
<br>&nbsp;
<dt><b>SPINDLE SYNC</b></dt><dd>
<br>&nbsp;
<br>Synconisieren des Plattenantriebs mit dem Antrieb anderer
Festplatten
<br>die sich zusammen in einem sog. Festplattenarray befinden
<br>
<br>&nbsp;
<br>Entsprechende Treibersoftware wird ben&ouml;tigt!
<br>Diese Einstellung kommt nur bei Server-Anwendungen in Frage
<br>Trifft an allen Atari-Computern nicht zu!
<br>Diesen Jumper daher immer OFFEN lassen
<br>
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Sollten Sie in die Lage kommen eine SCSI Festplatte in ein
externes SCSI-Geh&auml;use einbauen zu wollen, taucht die Frage auf
wie man den ID-Schalter richtig mit den Jumpern verbindet. IdR ist es
so das ein solches Anschlu&szlig;kabel aus zwei Steckerleisten
besteht, der eine enth&auml;lt 3 schwarze Leitungen, das ist GND. Der
zweite Stecker enth&auml;lt drei farbige Leitungen von denen meistens
eine rot ist. Diese rote Leitung kommt auf den Jumper mit der
Bezeichnung ID1. Sie k&ouml;nnen hier nichts zerst&ouml;ren, bei einem
falschen Anschlu&szlig; erhalten Sie keine ID-Einstellung oder immer
eine falsche ID. Drehen Sie dann immer den zweiten Stecker, mit den
farbigen Leitungen, so da&szlig; die rote Leitung auf ID1 zum stecken
kommt. Erhalten Sie keine ID, tauschen Sie den Stecker mit den
farbigen Leitungen gegen den GND-Stecker. Das Funktionierte hier
bisher immer, zumindestens was SCSI-Geh&auml;use der OPTI-Line
betrifft. Sie k&ouml;nnen hier nichts zerst&ouml;ren solange Sie an
diese Jumper keine Fremdspannung anlegen.
<br>
</p>
<p>Beachten Sie bitte das SCSI-Ger&auml;te ausgeschaltet werden
m&uuml;ssen um eine &Auml;nderung an den Jumpern korrekt zu erkennen.
Eine Eerkennung findet ausschliesslich bei erneutem Einschalten der
Ger&auml;te statt.
<br>
</p>
<p>Weitere Informationen finden Sie in <a href="http://www.doitarchive.de/download.htm" target="_top">DOITDRIVE</a>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="06.htm" target="UDOcon"><img src="udo_up.gif" alt="Verschiedene Laufwerke am Falcon F030" border=0 width="24" height="24"></a>
<a href="0601.htm" target="UDOcon"><img src="udo_lf.gif" alt="Festplatten Notfall" border=0 width="24" height="24"></a>
<a href="0603.htm" target="UDOcon"><img src="udo_rg.gif" alt="Falcon Festplatten" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
