<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Atari Festplatten am Mac
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0603.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Festplatten" border=0 width="24" height="24"></a>
<a href="0603.htm" target="UDOcon"><img src="udo_lf.gif" alt="Falcon Festplatten" border=0 width="24" height="24"></a>
<a href="0604.htm" target="UDOcon"><img src="udo_rg.gif" alt="IDE-Festplatten" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Atari_20Festplatten_20am_20Mac">6.3.1 Atari Festplatten am Mac</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Atari-Festplatten am Mac </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Sollte jemand auf den Gedanken kommen sich einen Macintosh
zuzulegen so ist es ein kleiner Schritt die eventuell vorhandenen SCSI
Atari-Festplatten am Mac weiter zu verwenden. Vorausgesetzt es sind
bereits Platten in einem externen Geh&auml;use ohne ACSI-SCSI_Adapter.
SCSI-Platten werden von MagiCMac ohne Einschr&auml;nkungen sofort nach
dem Start erkannt und k&ouml;nne wie am Atari gewohnt benutzt werden.
<br>
</p>
<p>Interne Platten aus einem Tower m&uuml;ssten sie entweder in ihren
PowerMac einbauen oder dieser Platte ein externes Geh&auml;use
spendieren.
<br>
</p>
<p>Das bedeutet, solange die Atari-Festplatten mit einem der normalen
Treiber, also HuSHI, <a href="1302.htm" target="UDOcon">HDDriver</a> oder AHDI formatiert bzw. Partitioniert
wurden gibt es damit keinerlei Probleme. Benutzen Sie zum Einstellen
einfach das Setup von MagiCMac
<br>
</p>
<p>Umgekehrt existiert das Problem das Mac-Platten im HSF-Format
schwerlich am Atari laufen. Eine neue Formatierung steht auf alle
F&auml;lle dann an. SCSI-Platten m&uuml;ssen in diesem Fall leider
komplett neu eingerichtet werden. Hier sollte man sich &uuml;ber die
Initiator-Identifizierung und das Parityverhalten dieser Festplatten
gedanken machen.
<br>
</p>
<p>&Auml;ltere Megafile-Platten oder c't Billigl&ouml;sungen ect.pp
k&ouml;nnen hier leider nicht mehr weiterverwendet werden. Gleiches
Trifft auch den alten Atari Laserdrucker, ohne passendes Interface ist
da nichts zu machen
<br>
</p>
<p>Bei vorhandenen Festplatten mu&szlig; nur daf&uuml;r gesorgt
werden das eine 25- oder 50 polige SCSI-Anschlu&szlig;buchse vorhanden
ist und zum Anschlu&szlig; an den Mac das passende Kabel bereit liegt.
25 polig D-Sub auf 50 polig SCSI passt an allen MACs mit aussnahme der
verschiedenen PowerBooks, hier ist ein DB 25 zu HDI30-Kabel notwendig.
Passende Kabel mit HDI30-Stecker gibt es ebenfalls mit dem
&auml;lteren 50 poligen SCSI Stecker. Ebenso nach der neuen SCSI2
Norm.
</p>
<p>Z.b kann man f&uuml;r ein PowerBook 150 / 5300 das passende Kabel
vom Mac auf 50 polig SCSI bei jedem Apple <a href="1604.htm" target="UDOcon">H&auml;ndler</a> f&uuml;r viel
Geld erstehen. Die Firma LINDY f&uuml;hrt die gleichen Kabel, halt nur
erheblich billiger und in einer vern&uuml;nftigen Qualit&auml;t.
Externe SCSI-Verbindungen am PowerBook sollten 50cm - 1Meter
Kabell&auml;nge nicht &Uuml;berschreiten. An anderen MACs kann auch
hier die Kabell&auml;nge 2 Meter betragen.
<br>
</p>
<p>Platten die an einem ST &uuml;ber einen ASCI / DMA-SCSI Adapter
betrieben wurden k&ouml;nnen in der gleichen Art u. Weise verwendet
werden. Es mu&szlig; lediglich der ASCI-Adapter entfernt werden. Auf
das SCSI-Kabel welches vom Adapter zu den Platten f&uuml;hrt wird die
50 polige Stiftleiste durch eine 50 polige Centronicsbuchse zum
aufquetschen auf Flachbandkabel ersetzt. Diese Buchsen sind im
einschl&auml;gigen Fachhandel f&uuml;r ca. 10 DM zu beziehen.
<br>
</p>
<p>Die Terminierung der Laufwerke erfolgt am Mac wie bei den Ataris
in der gleichen Art wie es an allen SCSI-Systemen durchgef&uuml;hrt
wird. Jeweils das pysikalisch letzte Laufwerk mu&szlig; terminiert
bleiben.
<br>Beachten Sie bitte das neuere ZIP Drives, EZFlyer eine
automatische Terminierung besitzen wenn die weiterf&uuml;hrende
SCSI-Buchse nicht beschaltet wird!
<br>
</p>
<p>Wird der Mac unter MacOS gestartet, also ohne MagiCMac bleiben die
Atari-Festplatten vorerst Unsichtbar. Das MacOS kann damit nichts
anfangen. Allerdings sollten sie auch auf die Vergabe der SCSI IDs
geachtet haben. ID0 und 3 sind bei gr&ouml;&szlig;eren MACs idR durch
eine interne Festplatte und das <a href="0701.htm" target="UDOcon">CD-ROM</a> bereits vergeben! Ebenso die
ID7 welche vom MAC als Host selber benutzt wird.
</p>
<p>Erst beim Start von MagiCMac werden solche Atari Platten gesucht
und eingebunden. Die Platten brauchen nicht abgesteckt werden.
Gleiches trifft auf ein <a href="0701.htm" target="UDOcon">CD-ROM</a> zu, wobei die meisten PowerMacs bereits
ein internes <a href="0701.htm" target="UDOcon">CD-ROM</a> besitzen. Sollten Sie in ihrem Atari System ein
SCSI <a href="0701.htm" target="UDOcon">CD-ROM</a> angeschlossen haben k&ouml;nnen sie darauf auch direkt
unter MacOS zugreifen. Das <a href="0701.htm" target="UDOcon">CD-ROM</a> wird gesehen und vom CD-Treiber
erkannt.
</p>
<p>Sehr wichtig ist die Tatsache das ein Mac f&uuml;r sich bzw.
f&uuml;r seine interne Platte immer die SCSI-ID 0 beansprucht und auch
fest belegt. Extern anzusteckende Atari SCSI-Platen sollten daher mit
der Vergabe ihrer ID-Adressen immer bei 1 oder noch h&ouml;her
beginnen. Einmal Eingestellt kann die Verteilung der IDs f&uuml;r alle
Ger&auml;te beibehalten werden. Die Atari-Platten sind so durch
einfaches Umstecken an beiden Rechnersystem zu benutzten. Gleiches
trifft auf die ZIP-Drives zu. Neuere ZIP Drives k&ouml;nnen auf alle
SCSI IDs eingestellt werden
<br>
</p>
<p>Bleibt noch zu sagen das man sich trotz allem str&auml;uben ruhig
einmal MagiCMac auf einem PowerMac zeigen lassen sollte. Die
Geschwindigkeit mit den die Atari-Anwendungen laufen ist schon sehr
verbl&uuml;ffend.
<br>
</p>
<p>Atari-Spiele oder Demos die hier direkt auf eine bestimmte Falcon
oder Atari-<a href="0305.htm" target="UDOcon">Hardware</a> zugreifen bleiben leider au&szlig;en vor. Beachten
Sie bitte auch das da u.U auf einige beliebte Harddisk-Utilities aus
ihrer Atari Zeit zutrifft!!!
<br>Besorgen sie sich rechtzeitig Hilfsprogramme die in der Lage sind
unter MagicMac auf einem PowerMac korrekt zu arbeiten. Nur so werden
sie noch lange Freude an ihrer Atari-Software haben
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0603.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Festplatten" border=0 width="24" height="24"></a>
<a href="0603.htm" target="UDOcon"><img src="udo_lf.gif" alt="Falcon Festplatten" border=0 width="24" height="24"></a>
<a href="0604.htm" target="UDOcon"><img src="udo_rg.gif" alt="IDE-Festplatten" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
