<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: external SCSI Device
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0605.htm" target="UDOcon"><img src="udo_up.gif" alt="SCSI-Festplatten" border=0 width="24" height="24"></a>
<a href="060502.htm" target="UDOcon"><img src="udo_lf.gif" alt="SCSI-Sense Codes" border=0 width="24" height="24"></a>
<a href="060504.htm" target="UDOcon"><img src="udo_rg.gif" alt="SCSI Parameter" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="external_20SCSI_20Device">6.5.3 external SCSI Device</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> How to build your own external SCSI Device </tt>
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Note: That description is only usable with new low power scsi
devices with a minimum of power surge!
<br>
</p>
<p>Get a case with the right size for your SCSI Device and a smal
electronic board
<br>Fit your drive into the case as shown in the picture below Build
your internal power regulator as shown in the description Wire all
parts as shown in the overview of the regulator board
</p>
<p>I build my own case with transparent aluminum :) Have a look to
the picture of the ready to use device. (It's a joke, i use
transparent acryl to build the case)
<br>
</p>
<p>Use a voltchecker to make sure that yellow is +12V, the red wire
is +5V !!
<br>Both black pin in the middle are GND ( both black cable )
<br>
</p>
<p>If you chance +5 and +12 you lost your device
<br>It's irrelevant to repair!!
<br>
</p>
<p>Do not connect ANY device before recheck the power connection!
<br>
</p>
<p>This homebrewed external scsi device is build to use a scsi device
as stand alone device for any falcon f030 or tt computer It's not
possible to use that device by the DMA-Port of any other Atari!! If
you like connect that device to your falcon computer you must have a
cable from falcon scsi2 connector to 50 way scsi at the other side If
your use that drive a single device, termination must be switched ON!
As device in a line with some other devices switch termination OFF In
a line only the physical last device must have termination ON
<br>
</p>
<p>That's a MUST for all SCSI-Devices on and Computer with a
SCSI-Port
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p>Partlist:
<br>
</p>
<p>1 external SCSI-Device Case
<br>1 SCSI Drive
<br>1 50 way ribbon SCSI Connector(s)
<br>1 external PSU +12VDC / 1.2 Amps
<br>1 3.5mm PowerJack
<br>1 smal Veroboard
<br>1 normal SCSI 4 way Powerplug
<br>1 IC1 Power Regulator LM78S05
<br>1 IC2 Power Regulator LM78S12
<br>1 C1 CAP. 1000uF / 25VDC
<br>1 C2 CAP. 1uF / 10VDC
<br>1 C3 CAP. 1uF / 16VDC
<br>1 F1 Fuse 1 Amp.
<br>1 D1 1N4001
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p>
<br><tt> Ein externes SCSI Drive selbstgebaut </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Da sich in meiner Bastelecke wieder einige Teile aus diversen
Umbauten angesammelt haben, bin ich auf die Idee gekommen mir aus
diesen vorhandenen Teilen eine kleine externe SCSI Festplatte zu
bauen.
<br>
</p>
<p>Zur Verwendung kommt hier ein Geh&auml;use aus transparentem
Aluminium (1) wie in der Abbildung 1 deutlich zu sehen ist. Diese
Anleitung soll nur als Beispiel dienen, einhalten sollte man
allerdings die technischen Daten der Stromversorgung, ansonsten wird
es nicht Funktionieren.
<br>
</p>
<p>Was sie dringend ben&ouml;tigen ist handwerkliches Geschick und
die M&ouml;glichkeit ein eventuell fertiges Kunststoffgeh&auml;use
bearbeiten zu k&ouml;nnen. Wollen Sie auch das Geh&auml;use selber
Herstellen ben&ouml;tigen Sie Material das sie sich am besten fertig
im Fachhandel zuschneiden lassen (3). Somit erreichen Sie auch
perfekte Schiffl&auml;chen die nur noch sauber geklebt werden
m&uuml;ssen. Das ist &auml;hnlich wie im Modellbau. Auch passt hier
Zuf&auml;llig der selbe Klebstoff f&uuml;r Acryl oder Kunststoff.
<br>
</p>
<p>Bauen Sie sich vorher das Geh&auml;use aus Pappe, sollten Sie mit
einer Zeichnung auf Papier nicht zurecht kommen. Das ist dann
einfacher.
<br>
</p>
<p>Mir ging es darum neben einem ZIP-Drive ein transportables Medium
zu besitzten das ich an allen meinen Atari-Computern und sowie auch an
meinem Mac benutzen zu k&ouml;nnen. Es &auml;ndert sich stets nur die
Einteilung.
<br>
</p>
<p>Wie Sie ihr Geh&auml;use gestalten ist v&ouml;llige Egal, es gibt
hierzu im Fachhandel auch formsch&ouml;nde passende
Kunststoffgeh&auml;use zu guten Preisen. U.a findet man bei
RS-Elektronik eine gute Auswahl. Die n&ouml;tige
Geh&auml;usegr&ouml;&szlig;e ergibt sich aus der gr&ouml;&szlig;e
ihrer Reglerplatine und der gr&ouml;&szlig;e der Festplatte welche Sie
dazu verwenden wollen. In meinem Fall sind die Geh&auml;usema&szlig;e
bei 200x150x40 geblieben.
<br>
</p>
<p>Beachten Sie bitte das die dazu verwendete Festplatte unbedingt
ein LowPower- Laufwerk sein mu&szlig;. Diese Stromversorgung
funktioniert mit &auml;lteren Festplatten nicht! Diese haben zumeist
einen wesentlich h&ouml;heren Energiebedarf.
<br>
</p>
<p>Alle Ma&szlig;angaben bestehen immer aus (L&auml;nge * Breite *
H&ouml;he)
<br>
</p>
<p align=center><img src="image/trscsi1.gif" border=0 width="165" height="81"></p><br>
<div align=center><tt> Abbildung 1 - Das externe Laufwerk im transparenten
Geh&auml;use </tt>
</div>
<p>
<br>
</p>
<p align=center><img src="image/trscsi2.gif" border=0 width="175" height="129"></p><br>
<div align=center><tt> Abbildung 2 - Das externe Laufwerk, eine andere Ansicht </tt>
</div>
<p>
<br>
</p>
<p>Bei meiner Geh&auml;usewahl sind auch so deutlich alle internen
Komponenten zu erkennen. Die Platine mit den Spannungsreglern
k&ouml;nnen Sie aus der unteren &Uuml;bersicht entnehmen. Die
Zeichnung k&ouml;nnte auch als Platinenlayout betrachtet werden. Der
Regler wurde von mir auf einer kleinen Lochrasterplatine aufgebaut.
Der Vorteil besteht darin das diese Platte so an jeder
Gleichspannungsquelle von +12 bis ca.+24 Volt betrieben werden kann.
Defekte sind keine zu erwaren da ich einen verpolungssicheren
Anschlu&szlig; gew&auml;hlt habe.
<br>
</p>
<p>Sie werden in der Schaltung auch die Sicherung und eine
Schutzdiode bemerken.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/scsiext.gif" border=0 width="570" height="380"></p><br>
<div align=center><tt> Abbildung 3 - eine externe SCSI-Festplatte im Eigenbau </tt>
</div>
<p>
<br>
</p>
<p>So ausger&uuml;stet ist man sogar in der Lage diese Festplatte in
einem PKW neben einem PowerBook betreiben zu k&ouml;nnen. Ihr externes
Steckernetzteil oder was immer Sie als <a href="0f01.htm" target="UDOcon">Netzteil</a>, Stromversorung
verwenden sollte in der Lage sein den Anlaufstom der verwendeten
Festplatte liefern zu k&ouml;nnen.
<br>
</p>
<p>Beim Testen mit einer nicht direkt nagelneuen Festplatte der Fa.
Quantum bin ich nach der Stroanzeige des Labornetzteils bei 1.2 Amp
h&auml;ngengeblieben. Im Betrieb, also wenn die Platte ihre
Solldrehzahlt erreicht hat liegt die Stromaufnahme bei deutlich
weniger, bei ca. 600mA.
<br>
</p>
<p>Das ist stark davon abh&auml;ngig welche Festplatte sie verwenden!
Im Betrieb kann ich hier 600-650mA messen, im Standby-Betrieb noch
etwas weniger.
<br>
</p>
<p>Ihr <a href="0f01.htm" target="UDOcon">Netzteil</a> mu&szlig; daf&uuml;r also sicher ausgelegt sein!
<br>Eine Anschlu&szlig; im PKW, die Autobatterie verkraftet das also
z.B spielend.
<br>
</p>
<p>Die Spannungsregler besitzen einen K&uuml;hlk&ouml;rper der
niemals unterdimensioniert Ausgelegt werden sollte. Halten sie die
K&uuml;hlfl&auml;che eher gr&ouml;&szlig;er. F&uuml;r meine Anwendung
in Bezug auf Stromst&auml;rke und Verlustleisung der Regler konnte ich
meinen K&uuml;hlk&ouml;rper mit den Ma&szlig;en 150 * 30 * 4mm, also
noch sehr klein Auslegen. Er passt also wie auf dem Bild zu sehen ist
der L&auml;nge und H&ouml;he nach sehr bequwem in L&auml;ngsrichtung
in mein Geh&auml;use. Selbst bei l&auml;ngerem Betrieb dieser
Festplatte wird die K&uuml;hlfl&auml;che auf die gesammte l&auml;nge
etwas mehr als Handwarm soda&szlig; hier auf eine zus&auml;tzliche
Ventilationsk&uuml;hlung verzichtet wurde. Das Festplattengeh&auml;use
selber wird bei l&auml;ngerem Betrieb w&auml;rmer.
<br>
</p>
<p>Nachr&uuml;stbar bleibt ein Miniventilator bei dieser Bauart auf
jeden Fall. Wenn Sie sich f&uuml;r &quot;Festspannungsregler&quot; und
&quot;Schaltnetzteile&quot; interessieren sollen kann ich Sie hier an
die einschl&auml;gige gleichnamige Fachliteratur verweisen. Hier
finden Sie angefangen vom einfachen Festspannungsregler bis zum fertig
berechneten Eigenbau-Schaltnetzteil alles was das Herz begehrt. Die
darin gezeigten Schaltungen k&ouml;nnen Anhand der gezeigten
Berechnungsgrundlagen leicht an fast jeden Bedarf direkt angepasst
werden.
<br>
</p>
<p>Die Festplatte selber sollen Sie auf jeden Fall mit kleinen
Gummischwingundsd&auml;mpfern auf die Kunststoffgrundplatte des
Geh&auml;uses montieren. Das ist nicht nur f&uuml;r die Festplatte
gut, sondern auch f&uuml;r ihre Ohren.
<br>
</p>
<p>Das SCSI Anschlu&szlig;feld auf der R&uuml;ckseite des
Geh&auml;uses besteht aus zwei 50 poligen SCSI-Anschlussbuchsen. An
der Festplatte befindet sich im Flachbandkabel eine einzige
Pfostenfeldbuchse. Alle Teile sind durchgehend mit 50 poligen
Flachbandkabel verbunden. Eine Buchse tut es auch, verhindert aber
wirkungsvoll das diese Platte in bereits vorhandene Systeme
eingeschleift werden kann. Sie w&uuml;rde so nur als Endger&auml;t
fungieren k&ouml;nnen. Diese 50 poligen Anschlussteile, in der Form
50polig SCSI - Buchsenleiste - 50polig SCSI gibt es in jedem
Computerfachgesch&auml;ft f&uuml;r wenig Geld fertig. Man braucht sich
das Kabel also nicht unbedingt selbst quetschen. Zumal es sehr kurz
ist.
<br>
</p>
<p align=center><img src="image/scsiad.gif" border=0 width="160" height="200"></p><br>
<div align=center><tt> Abbildung 4 - SCSI-Anschlu&szlig; </tt>
</div>
<p>
<br>
</p>
<p>Beachten Sie bitte immer die korrekte Terminierung ihres
SCSI-Systems! Die internen Terminatoren der Festplatte werden
Entfernt. Teilweise gen&uuml;gt es einen einzigen Jumper zu ziehen.
(TERM)
<br>
</p>
<p><b> Das Kabel doch selber machen. </b>
<br>
</p>
<p>Alle Buchsen und Pfostenfeldleisten sind in Schneid-Klemmtechnik
ausgef&uuml;hrt. Das Flachbandkabel wird so auf die Buchsen geqwetscht
das die farbige Ader der Flachbandleitung an ALLEN Buchsen jeweils auf
Pin 1 zu liegen kommt. Das spart Fehlerquellen und das &uuml;berlegen
wie rum den nun der Stecker in welche Buchse mu&szlig;. Alle
Flachbandkabel sind eigentlich so orientiert. Alles andere ist
direkter Pfusch!
<br>
</p>
<p>Pin 1 des SCSI-Steckers der Festplatte befindet sich immer direkt
neben dem Stromversorgungsstecker der Festplatte. Das ist bei allen
SCSI-Devices so. Beachten Sie bitte das bei einem falschen
Anschlu&szlig; der Stromversorgung das Laufwerk zerst&ouml;rt wird!
Wie jede andere Festplatte kann auch diese hier mit z.B dem HDDRiver7
komplett eingerichtet werden. Es ist so m&ouml;glich einen
transportablen Speicher bis in den Gigabyte-Bereich zu erhalten. Je
nach Anwendung.
<br>
</p>
<p><b> Doch ein fertiges Geh&auml;use kaufen ? </b>
<br>
</p>
<p>Fertig gekaufte externe Festplatten im Geh&auml;use sind nach wie
vor sehr teuer. Sind Teile vorhanden bietet sich ein Eigenbau also
f&ouml;rmlich an Selbstredend k&ouml;nnen Sie logischerweise auch ein
fertiges Geh&auml;use mit bereits integriertem <a href="0f01.htm" target="UDOcon">Netzteil</a> kaufen,
teilweise finden man diese Dinge schon bei einem
Anschaffungswiderstand (2) von ca. 100 DM.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/scsiid.gif" border=0 width="395" height="123"></p><br>
<div align=center><tt> Abbildung 5 - Anschlu&szlig; eines externen SCSI ID-Switch
</tt>
</div>
<p>
<br>
<br>
</p>
<p><b> Der SCSI ID-Schalter </b>
<br>
</p>
<p>An bisher allen mir untergekommenen SCSI ID-Schaltern war jeweils
der gemeinsame Anschlu&szlig;, also GND, auf einem extra 3 poligen
Flachstecker gef&uuml;hrt. Dieser sollte mit einem der drei GND Pin in
Verbindung gebracht werden. Die GND Pin der Jumperleiste befindet sich
in den meisten F&auml;llen immer direkt am Rand der Platine, die
eigentlich 3 ID-Pin befinden sich auf der Innenseite. Die &uuml;brigen
drei Leitungen werden wie in dem Bild auf die eigentlichen ID-Pin des
verwendeten Laufwerks gesteckt. Stimmt die eingestellte ID nicht mit
der wirklichen ID &uuml;berein ist der 3 polige Stecker auf den ID-Pin
um 180 Grad zu verdrehen. Etwas schwierger ist es bei Einzeladern,
hier tauschen Sie die Reihenfolge eben bis es stimmt. Es kann dabei
nichts besch&auml;digt werden.
<br>
</p>
<p>Beachten Sie hier bitte das die Jumper nur beim Einschalten der
Platte gelesen werden. Ein Umstecken w&auml;rend dem Betieb ist nicht
ratsam.
<br>
</p>
<p>Die ID-Pin, die Jumper werden prinzipiell nur gegen GND,
Signalmasse gelegt.
<br>Niemals aber hier eine Fremdspannung anlegen!
<br>Sie w&uuml;rden damit die Festplattenelektonik sicher
zerst&ouml;ren!
<br>
</p>
<p>Das SCSI-ID Schalterchen findet man ebenfalls im Einsch&auml;gigen
Fachhandel. An fertigen Geh&auml;usen ist es fest Eingebaut. Man
sollte darauf achten.
<br>
</p>
<p>Fu&szlig;note:
<br>
</p>
<p>(1) transparentes Aluminium wurde leider noch nicht Erfunden
<br>(2) Als Anschaffungswiderstand bezeichet man einen bestimmten
Kaufpreis
<br>(3) Auf eine Zeichnung des Geh&auml;uses wurde verzichtet
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0605.htm" target="UDOcon"><img src="udo_up.gif" alt="SCSI-Festplatten" border=0 width="24" height="24"></a>
<a href="060502.htm" target="UDOcon"><img src="udo_lf.gif" alt="SCSI-Sense Codes" border=0 width="24" height="24"></a>
<a href="060504.htm" target="UDOcon"><img src="udo_rg.gif" alt="SCSI Parameter" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
