<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: MKX SCSI
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0605.htm" target="UDOcon"><img src="udo_up.gif" alt="SCSI-Festplatten" border=0 width="24" height="24"></a>
<a href="060504.htm" target="UDOcon"><img src="udo_lf.gif" alt="SCSI Parameter" border=0 width="24" height="24"></a>
<a href="0606.htm" target="UDOcon"><img src="udo_rg.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="MKX_20SCSI">6.5.5 MKX SCSI</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Die <a href="0c08.htm" target="UDOcon">SCSI-Schnittstelle</a> am Falcon </tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Die Art der Terminierung des SCSI Bus am Falcon ist
ausschlaggebend f&uuml;r ein korrektes Arbeiten des SCSI Bus.
Normalerweise befinden sich in jedem SCSI-Drive ab Werk
Abschlu&szlig;widerst&auml;nde die den SCSI-Bus terminieren.
(Abschlie&szlig;en)
<br>
</p>
<p>Sollte Ihr neues Ger&auml;t einziges oder letztes Laufwerk am
SCSI-Bus sein sind die Widerst&auml;nde, der Terminierungsjumper, so
zu belassen, im anderen Fall, wenn das Laufwerk also an einem Bus
eingef&uuml;gt wird an dem sich schon ein 'letztes' SCSI-Device
befindet, sind die Terminatoren in jedem Fall zu entfernen. Ansonsten
kommt es zu einer &Uuml;berlastung des SCSI-Bausteins, KEIN
angeschlossenes Laufwerk arbeitet korrekt. Der SCSI-Controller im
Falcon kann dadurch Schaden erleiden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cdterm.gif" border=0 width="480" height="100"></p><br>
<div align=center><tt>Abbildung 2 - Beispiele f&uuml;r eine korrekte
Bus-Terminierung: </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Deutlich also zu sehen das wirklich immer nur das pysikalisch
letzte Laufwerk an einem SCSI-Bus einen Terminator tragen darf. Der
Computer als Host ist ebenfalls immer Terminiert. Der Computer als
Host, im speziellen der Falcon mit seinem ungebufferten SCSI Bus, kann
als HOST nicht in der mitte eines SCSI Bus betrieben werden.
<br>
</p>
<p>Beim Falcon z.B sind diese Terminatoren fest eingel&ouml;tet. Sie
befinden sich direkt hinter der SCSI2-Anschlu&szlig;buchse im Falcon.
Der Falcon ist im ausgeschaltetem Zustand nicht terminiert
<br>
</p>
<p>Diverse Umbauten der original Falcon Hauptplatinen durch dritte
Firmen, speziell sind die Falcon Computer gemeint die nach dem Umbau
eine &quot;interne&quot; SCSI Festplatte besitzen und irgendwie
&quot;MK&quot; heissen, enthalten eine Modifikation am SCSI Bus.
<br>
</p>
<p>Man ist also einfach hergegangen und hat die internen, auf dem
Falcon Mainboard Werksseitig vorhandenen Widerstandsarrays
entl&ouml;tet, die nun so frei gewordenen L&ouml;taugen hat man mit
einem nicht-Standardstecker versehen um so ein Flachbandkabel nebst
einer &quot;internen&quot; SCSI Festplatte f&uuml;r viel Geld
verkaufen zu k&ouml;nnen.
<br>
</p>
<p>Bis hier hin ist das ja weiter noch nicht tragisch.
<br>
</p>
<p>Das wird es jedoch wenn der Anwender am gleichen Falcon externe
SCSI-Ger&auml;te anschliessen wird. M&ouml;glicherweise, solange man
sehr kurze SCSI Kabel verwendet, mag das alles perfekt klappen, jedoch
bildet sich genau bei diesen MK, MKX Falcon nach dem Anschlu&szlig;
externer SCSI-Ger&auml;te ein sog. Y-f&ouml;rmiger SCSI-Bus der lt.
SCSI Spezifikation so nicht existiert.
<br>
</p>
<p>Zeichnerrisch dargestellt passiert nun folgendes:
<br>
<br>
</p>
<pre>
           Falcon 5380 SCSI Controller             F A L S C H !
                 ######                            W R O N G !
                 +    +
        Platte   +    +      externe Ger&auml;te
   T----######---+    +------######--------####-T

</pre>
<p>
<br>
</p>
<p>Das -kann- wie oben geschrieben Funktionieren. Jedoch sind mir
mehrere Benutzer bekannt die nach dem Anschlu&szlig; externer
Ger&auml;te, in der gerade gezeigten Form, hinterher einen defekten
SCSI Controller im Rechner hatten. Da mu&szlig; nicht sofort
passieren, es kann Tage dauern. Eine Y-Form ist nicht zul&auml;ssig.
Solage man eine einzelne interne Festplatte an diesem Falcon betreibt,
diese korrekt Terminiert ist, stellt dies kein Problem dar.
<br>
</p>
<p>Wollten Sie an so einem Falcon nun wirklich mehrere SCSI
Ger&auml;te -sicher- betreiben m&uuml;ssten Sie den SCSI Bus umbauen.
Dazu gibt es mehrere M&ouml;glichkeiten:
<br>
</p>
<dl>
<dt><b>Belassen wie es ist</b></dt><dd>
<br>&nbsp;
<br>Entweder belassen Sie alles wie es ist. Stecken einen externen
SCSI2 Steckerterminator auf die originale externe <a href="0c08.htm" target="UDOcon">SCSI-Schnittstelle</a>.
Entfernen Sie die Terminatoren der internen Platte und schliessen sie
pysikalisch nach dieser internen Platte (zumeist ID0) noch bis zu 6
weitere Ger&auml;te an diesem intern vorhandenen Flachbandkabel an.
<br>
<br>&nbsp;
<br>Terminieren sie dann ausschliesslich das letzte Ger&auml;t an
diesem einen SCSI Strang! Selbstredend geht das nat&uuml;rlich nur
relativ einfach wenn sich der Falcon schon in einem Tower befindet und
dieser noch Platz f&uuml;r weitere SCSI-Ger&auml;te bietet.
<br>
<br>&nbsp;
<br>Es d&uuml;rfen keine Ger&auml;te an den originalen externen SCSI
Anschlu&szlig; angeschlossen werden.
<br>
<br>&nbsp;
<dt><b> wieder Umbauen</b></dt><dd>
<br>&nbsp;
<br>Sie entfernen alle fremden SCSI Modifikationen aus ihrem Falcon.
Sie setzen die Terminatorarrays zur&uuml;ck an ihren originalen
Einbauplatz und sie verzichten auf dieses eine interne
SCSI-Ger&auml;t.
<br>
<br>&nbsp;
<br>Sie schliessen nun alle SCSI-Ger&auml;te, nach dem Umbau, an der
originalen externen <a href="0c08.htm" target="UDOcon">SCSI-Schnittstelle</a> des Falcons an. Die interne
Platte verfrachten Sie in ein externes SCSI Geh&auml;use aus dem
Fachhandel.
<br>
<br>&nbsp;
<br>Sitz ihr Falcon in einem Tower startet ihr -korrekter- SCSI Bus
ebenfalls an der originalen externen SCSI-Buchse des Falcon. Mit einem
SCSI2 Stecker und passendem SCSI Kabel wird der Bus zur&uuml;ck in das
Geh&auml;use gef&uuml;hrt, mit passendem Kabeladapter, Centronics auf
Flachband, der kostet ca. 10DM, schliessen Sie alle dort vorhandenen
SCSI-Ger&auml;te an, maximal sind 6 m&ouml;glich, und terminieren hier
ebenfalls ausschliesslich das letzte pysikalisch vorhandene
SCSI-Ger&auml;t.
<br>
<br>&nbsp;
<br>Wenn sie nun dennoch SCSI-Ger&auml;te ausserhalb des Towers
anschliessen wollen f&uuml;hrt der einzig korrekte Weg wieder
&uuml;ber einen Flachband zu Centronics Adapter aus dem Tower hinaus.
Dazu entfernen Sie den Terminator am pysikalisch letzten internen
SCSI-Ger&auml;t. Nach der 50 poligen SCSI Centronics Buchse
k&ouml;nnen dann externe SCSI-Ger&auml;te betrieben werden. Intern u.
externe Ger&auml;te bilden zusammen maximal 6 Ger&auml;te. Entfernen
Sie die externen Ger&auml;te so ist in die 50 polige Buchse ein
Steckerterminator einzustecken da die internen Ger&auml;te ansonsten
nicht terminiert w&auml;ren.
<br>
<br>&nbsp;
<dt><b> warme Worte</b></dt><dd>
<br>&nbsp;
<br>Ich wei&szlig; das dies nicht der einfache Weg, den viele gerne
nehmen, ist und das das gerade beschriebene relativ Umst&auml;ndlich
ist. Seien Sie versichtert, es ist der einzige korrekte Weg lange
freude an einem funktionierendem SCSI Bus an einem Falcon Computer zu
haben.
<br>
<br>&nbsp;
<br>Der SCSI Chip ist &uuml;brigens nur in wenigen Falcon Modellen
gesockelt. Auch nicht weiter aufregend, aber ausschlaggebend wenn der
Chip durch SCSI-Unfug zerst&ouml;rt wurde. Glauben Sie, es macht
-keinen- Spass einen SCSI PLCC zu entl&ouml;ten und einen Sockel oder
gleich einen neuen Chip auf die dann meist schlechten L&ouml;tpads der
Platine zu l&ouml;ten.
<br>
<br>&nbsp;
<br>Hei&szlig;luft klar, schon die vielen kleinen netten SMD-Teile
drum herum gesehen? Ich schon.
<br>&nbsp;
</dl>
<p>
<br>
<br><b>SCSI2-Buchse am Falcon </b>
<br>
<br>
</p>
<p>Die Pinbelegung entspricht der &uuml;blichen MiniDIN Belegung bzw.
dem was sie an jedem Atari <a href="0302.htm" target="UDOcon">Falcon F030</a> an dessen externer SCSI Buchse
vorfinden.
<br>
</p>
<p>
<br>
</p>
<div align=center><table border=1 frame=box>
<caption align=bottom>Tabelle 8: Falcon SCSI Port</caption>
<tr>
  <td align=left valign=top>Pin</td>
  <td align=left valign=top>Signalbeschreibung</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>Pin 50</td>
  <td align=left valign=top>IO - Signal</td>
  <td align=left valign=top>Pin 49</td>
  <td align=left valign=top>REQ - Request</td>
</tr>
<tr>
  <td align=left valign=top>Pin 48</td>
  <td align=left valign=top>Code/Data Signal</td>
  <td align=left valign=top>Pin 47</td>
  <td align=left valign=top>SEL - Select</td>
</tr>
<tr>
  <td align=left valign=top>Pin 46</td>
  <td align=left valign=top>MSG - Message</td>
  <td align=left valign=top>Pin 45</td>
  <td align=left valign=top>RST - Reset</td>
</tr>
<tr>
  <td align=left valign=top>Pin 44</td>
  <td align=left valign=top>SACK - Acknowledge</td>
  <td align=left valign=top>Pin 43</td>
  <td align=left valign=top>BSY - Busy</td>
</tr>
<tr>
  <td align=left valign=top>Pin 42</td>
  <td align=left valign=top>GND</td>
  <td align=left valign=top>Pin 41</td>
  <td align=left valign=top>ATN</td>
</tr>
<tr>
  <td align=left valign=top>Pin 40</td>
  <td align=left valign=top>GND</td>
  <td align=left valign=top>Pin 39</td>
  <td align=left valign=top>Not Connected</td>
</tr>
<tr>
  <td align=left valign=top>Pin 38</td>
  <td align=left valign=top>+5 Volt (1Amp)(TermPwr)</td>
  <td align=left valign=top>Pin 37</td>
  <td align=left valign=top>Not Connected</td>
</tr>
<tr>
  <td align=left valign=top>Pin 36</td>
  <td align=left valign=top>GND</td>
  <td align=left valign=top>Pin 35</td>
  <td align=left valign=top>GND</td>
</tr>
<tr>
  <td align=left valign=top>Pin 34</td>
  <td align=left valign=top>PARITY Signal</td>
  <td align=left valign=top>Pin 33</td>
  <td align=left valign=top>SCSI 7 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 32</td>
  <td align=left valign=top>SCSI 6 - Signal</td>
  <td align=left valign=top>Pin 31</td>
  <td align=left valign=top>SCSI 5 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 30</td>
  <td align=left valign=top>SCSI 4 - Signal</td>
  <td align=left valign=top>Pin 29</td>
  <td align=left valign=top>SCSI 3 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 28</td>
  <td align=left valign=top>SCSI 2 - Signal</td>
  <td align=left valign=top>Pin 27</td>
  <td align=left valign=top>SCSI 1 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 26</td>
  <td align=left valign=top>SCSI 0 - Signal</td>
  <td align=left valign=top>Pin 25-15</td>
  <td align=left valign=top>GND</td>
</tr>
<tr>
  <td align=left valign=top>Pin 14-12</td>
  <td align=left valign=top>NC - Not used</td>
  <td align=left valign=top>Pin 11</td>
  <td align=left valign=top>Vcc - Resistor R65 with 10KOhm</td>
</tr>
<tr>
  <td align=left valign=top>Pin 10-1</td>
  <td align=left valign=top>GND - Signal Ground</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
</table></div>

<p>
<br>
<br><b> 220/330Ohm Widerstandsarrays auf dem Falcon Mainboard
(serienm&auml;ssig) </b>
<br>
</p>
<p>&Uuml;bersicht welche Signalleitungen des SCSI Controllers im
Falcon abgeschlossen sind.
<br>Es gibt insgesamt 3 Busterminatoren: (Widerstandsarrays!)
Widerstandsarrays sind auf einer Seite mit einem Punkt markiert.
Dieser Punkt definiert den gemeinsamen Anschlu&szlig;. Beachten Sie
bitte das SCSI Terminatorarrays zumeist an +5 UND! an GND
angeschlossen sind.
<br>
<br>
</p>
<dl>
<dt><b>Terminator P1:</b></dt><dd> &nbsp;
<br>
<br>&nbsp;
<br>1 = Vcc
<br>2 = SEL
<br>3 = BSY
<br>4 = SACK
<br>5 = ATN
<br>6 = RST
<br>7 = REQ
<br>8 = GND
<br>
<br>&nbsp;
<dt><b>Terminator P2:</b></dt><dd> &nbsp;
<br>
<br>&nbsp;
<br>1 = Vcc
<br>2 = CD
<br>3 = MSG
<br>4 = SCSI1
<br>5 = SCSI0
<br>6 = IO
<br>7 = SCSI2
<br>8 = GND
<br>
<br>&nbsp;
<dt><b>Terminator P3:</b></dt><dd> &nbsp;
<br>
<br>&nbsp;
<br>1 = Vcc
<br>2 = SCSI7
<br>3 = SCSI6
<br>4 = SCSI5
<br>5 = SCSI4
<br>6 = SCSI3
<br>7 = P
<br>8 = GND
<br>
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Die SCSI-Schaltung des Falcon finden sie unter SCSI hier im
Archiv.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/scsiterm.gif" border=0 width="300" height="110"></p><br>
<div align=center><tt>Abbildung 3 - Termination im Falcon (Widerstandsarrays)</tt>
</div>
<p>
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p><tt> Termination Falcon MK.. </tt>
<br>
</p>
<p>If it is a MKII, then the termination on the motherboard has been
removed in order to fit the internal SCSI cabling. If you have removed
the drive but not replaced the terminator packs onto the board, then
you will have to do so, or have it done by a service tech. There are
two or three 220 OHM single in line resistor packs, I think 8 pin. The
header connection has to be desoldered and the packs resoldered in.
<br>
</p>
<p>Our tech department has this info if you need it, or you can send
the machine to us for Certified C-Lab Service.
<br>
</p>
<p><a href="http://compdirect.com" target="_top">Computer Direct Homepage</a> All the best,
<br>Chris @ Computer Direct
<br>
</p>
<p>
<br>
<br><b> MKX </b>
<br>
</p>
<p>What they do is to remove the termination resistors on the
motherboard and solder some pins for a non-standard connector. Making
the connection like that produces what Robert calls the &quot;Y&quot;.
I would guess it depends on what cable is the longest as to which
device you terminate, internal or external, but surely not both. That
would be like terminating each drive connected to the external SCSI
connector they way the MK-X is setup.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0605.htm" target="UDOcon"><img src="udo_up.gif" alt="SCSI-Festplatten" border=0 width="24" height="24"></a>
<a href="060504.htm" target="UDOcon"><img src="udo_lf.gif" alt="SCSI Parameter" border=0 width="24" height="24"></a>
<a href="0606.htm" target="UDOcon"><img src="udo_rg.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
