<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Zip-Drive
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0607.htm" target="UDOcon"><img src="udo_up.gif" alt="Wechselplattenlaufwerke" border=0 width="24" height="24"></a>
<a href="0607.htm" target="UDOcon"><img src="udo_lf.gif" alt="Wechselplattenlaufwerke" border=0 width="24" height="24"></a>
<a href="060702.htm" target="UDOcon"><img src="udo_rg.gif" alt="Das Zip am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Zip-Drive">6.7.1 Zip-Drive</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Das IOMEGA ZIP und der <a href="0302.htm" target="UDOcon">Falcon F030</a></tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Seit dem erscheinen des bei IOMEGA hergestellen ZIP-100 Drive
tauchen immer wieder Fragen auf wie man denn nun dieses g&uuml;nstige
Laufwerk an seinem FalconF030 betreiben kann.
</p>
<p>Die Antwort lautet auch hier nicht 42, sondern eben mit einem
passenden Kabel und einem Atari HD-Treiber der eben auch die neuen
ZIP-Laufwerke unterst&uuml;tzt. Beachten Sie bitte das nur Atari
HD-Treiber neueren Datums ZIP-Laufwerke korrekt unterst&uuml;tzen. Das
ZIP ist zwar ein Wechselplattenlaufwerk, sollte daher wie jede
Festplatte behandelt werden, dennoch bin ich der Meinung das man in
diese Fall auf alte Treiber, wie z.B AHDI, direkt verzichten sollte.
Das trifft auch auf die ZIP-Einbaulaufwerke zu.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/zip1.gif" border=0 width="142" height="42"></p><br>
<div align=center><tt> Abbildung 1 - ZIP Laufwerk </tt>
<br>
<br>
</div>
<p align=center><img src="image/zip2.gif" border=0 width="148" height="45"></p><br>
<div align=center><tt> Abbildung 2 - ZIP Laufwerk </tt>
</div>
<p>
<br>
</p>
<p>Zur Frage des Treibers kann ich hier mit ruhigem Gewissen auf den
<a href="1302.htm" target="UDOcon">HDDriver</a> ab der Release 5.x , besser V 7.12 verweisen da ich diesen
selber seit l&auml;ngerer Zeit benutze. Ebenso sind die SCSI-Tools von
Hard &amp; Soft geeignet. Beim <a href="1302.htm" target="UDOcon">HDDriver</a> sind allerdings im Gegensatz
zu den SCSI-Tools die ZIP-Features wie Schreibschutz ect. voll mittels
einem .CPX-Modul nutzbar. Ansonsten ben&ouml;tigen sie daf&uuml;r
weitere externe Utilities. <a href="1302.htm" target="UDOcon">HDDriver</a> hat einen kompletten Support
<br>
</p>
<p>Das Atarikonforme formatieren von Zip-Medien wird in allen
F&auml;llen auch von beiden HD-Treibern &uuml;bernommen. Es spielt
hierbei keine Rolle ob ZIP-Disketten f&uuml;r DOS oder den Mac
eingekauft wurden. Im Normalfall reicht es wie bei einer Festplatte
auch bei weitem aus die ZIP-Medien einfach logisch zu Partitionieren.
Beide HD-Treiber reservieren beim Erkennen des ZIP-Drives eine Anzahl
von Partitionen f&uuml;r das ZIP. Unter bestimmten Umst&auml;nden
bringt das den Nachteil mit sich das ZIP-Medien die auf einem anderen
Rechner in mehrere kleine Partitionen eingteilt wurden auf dem eigenen
Atari nun die bereits vorhandenen Partitionen, die Laufwerkskennungen
nach hinten verschieben. Meiner Meinung nach ist es aussreichend wenn
man eine ZIP-Diskette als eine einzige Partition anmeldet. Das
erleichert das Handling und man kommt sp&auml;ter nicht mit den
verschobenen Laufwerkskennungen durcheinander. Mit dem <a href="1302.htm" target="UDOcon">HDDriver</a>
l&auml;sst sich das leich regeln. F&uuml;r Backups stehen so 96MB pro
Medium zur Verf&uuml;gung. Beim wechsel der Medien zwischen dem Falcon
und z.B einem PC bedenken Sie bitte das MagiC 5 mit den DOS-Medien
klarkommt, das SingleTOS jedoch nicht unbedingt. Das geht nur wenn Sie
den <a href="1302.htm" target="UDOcon">HDDriver</a> in der neuesten Version verwenden. Ansonsten m&uuml;ssten
sie BigDOS verwenden
<br>
</p>
<p>Das ZIP-Drive wird korrekt erkannt wenn es korrekt am SCSI-Bus
angeschlossen wurde. Ohne eingelegtes Medium wird das Laufwerk zwar
gefunden, jedoch k&ouml;nnen sie das passende Laufwerksfenster zwar
&ouml;ffnen, erhalten dabei aber ein leeres Fenster. Alle IOMEGA
ZIP-Laufwerke fallen nach 15 Minuten in den SLEEP MODE. Der
Schlafmodus endet jeweils bei einem Zugriff auf das eingelegte Medium.
</p>
<p>Zum Einrichten eines Mediums w&auml;hlt man beim <a href="1302.htm" target="UDOcon">HDDriver</a>
&quot;ZIP-Medien&quot; Hier finden sich alle gew&uuml;nschen Optionen.
Stellen Sie sicher das sie neue Medien immer auf diesem Weg
einrichten. ZIP-Medien k&ouml;nnen gunds&auml;tzlich nur entnommen
werden wenn das ZIP-Laufwerk eingeschaltet, bzw. am Stromnetz
angeschlossen ist.
</p>
<p>Um Sch&auml;den am ZIP-Drive und am Falcon zu vermeiden werden
ZIP-Drives pinzipiell nur An- oder Abgesteckt wenn eben beide
Ger&auml;te abgeschaltet sind. Auch werden die Medien nur entnommen
wenn die gelbe Lampe erloschen ist. Entfernen Sie niemals ein Medium
gewaltsam aus dem Laufwerk. ZIP-Medien lassen sich per Software gegen
das Herausnehmen sichern!! Auch kann man ZIP Medien per Mausklick
auswerfen lassen. Ebenso ist die Vergabe eines Kennworts m&ouml;glich.
Ohne dieses passende Kennwort haben Sie keinen Zugriff. Notieren sie
sich ihre ZIP-Kennw&ouml;rter gut falls Sie von dieser Funktion
gebrauch machen sollten.
</p>
<p>Das trifft auch auf die ZIP-Laufwerke der neuesten Generation zu.
Diese beinhalten eine automatische Umschaltung zwischen Parallel- und
SCSI-Betrieb. Das Laufwerk erkennt selbstst&auml;ndig an welcher
Schnittstelle es angeschlossen ist. Um ein ZIP mit parallelem
Anschlu&szlig; am Atari zu betreiben sehen Sie bitte unter 'Das Zip am
<a href="0c09.htm" target="UDOcon">Romport</a>' nach. Hier finden Sie das dazu n&ouml;tige passende
Interface.
</p>
<p>Ein direkter Betrieb am Falcon-Druckeranschlu&szlig; ist nicht
m&ouml;glich.
<br>
</p>
<p>Ebenso ist das neueste ZIP auch automatisch Terminiert, sind an
seiner zweiten Anschlu&szlig;buchse keine weiteren SCSI-Ger&auml;te
anschlossen. Das trifft logischerweise nur auf den SCSI-Betrieb zu.
<br>
</p>
<p>Zeigen sich nach einiger Zeit Lese- oder Schreibfehler sollten die
Laufwerksk&ouml;pfe mit dem IOMEGA Reinigungskit gereinigt werden. Das
Reinigungskit ist direkt bei IOMEGA erh&auml;ltlich.
<br>
</p>
<ul>
<li> <a href="http://www.iomega.com" target="_top">iomega</a>
<br>&nbsp;
</li>
</ul>
<p>F&uuml;r den Falcon kann das mitgelieferte DB25-SCSI Kabel sehr
problemlos verwendet werden wenn man sich einen passenden Adapter der
SCSI2-Norm nach DB25 besorgt. Solche Adapter gibt es z.B bei MISCO
f&uuml;r ca. 40 DM. Der Adapter ist k&uuml;rzer als ein externer
<a href="0806.htm" target="UDOcon">ScreenBlaster</a> und kann bequem mit dem DB25-Stecker fest verschraubt
werden. Ist in diesem Fall das ZIP-Drive das einzigste SCSI-Laufwerk
das am <a href="0302.htm" target="UDOcon">Falcon F030</a> angeschlossen ist, mu&szlig; der auf der
R&uuml;ckseite zwischen den Anschlu&szlig;buchsen montierte Schalter,
&quot;Termination&quot; eingeschaltet werden. Schalterstellung
&quot;ON&quot; bedeutet Termination aktiv. Ist das ZIP das einzige
Laufwerk spielt der zweite Schalter &quot;SCSI ID&quot; keine Rolle.
Beachten Sie hierzu bitte die Grafik &uuml;ber die richtige
SCSI-Terminierung.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/zip3.gif" border=0 width="140" height="80"></p><br>
<div align=center><tt> Abbildung 3 - richtiger Anschlu&szlig; mit dem ZIP </tt>
</div>
<p>
<br>
</p>
<p>Es gibt f&uuml;r Atari Computer keinen Treiber der das Zip-Drive
in seiner Centronics-Version unterst&uuml;tzen w&uuml;rde. Gemeint ist
hier also der vom PC her bekannte Anschlu&szlig; &uuml;ber die
<a href="0c05.htm" target="UDOcon">Druckerschnittstelle</a>. Diese Verbindung ist zu dem sehr langsam und
sollte nur an PC Notebooks bennutzt werden die keinen
SCSI-Anschlu&szlig; haben. Solange ein SCSI-Port vorhanden ist sollte
man stets auch diesen benutzen, alleine schon wegen der
Geschwindigkeit von ca. 1MB pro Sekunde. Der Druckerport am Atari ist
zwar Bidirektional, Herstellungsbedingt ist die <a href="0305.htm" target="UDOcon">Hardware</a> nicht in der
Lage ein ZIP zu bedienen. Sollten Sie trozdem die parallel- Version
bevorzugen m&uuml;ssen Sie sich bei woller &amp; link in Berlin ein
passendes Interface f&uuml;r den Atari <a href="0c09.htm" target="UDOcon">Romport</a> kaufen.
<br>
</p>
<p>Beachten Sie die Benchmarks welche mit HowFast und den SCSI-Tools
ermittelt wurden.
<br>
</p>
<p>Sicherlich ist ein Wechselplattenlaufwerk nicht mit einer
Festplatte vergleichbar, mit den Resultaten die mit einem fast vollen
Medium ermittelt wurden kann man aber leicht leben. Mir
pers&ouml;nlich sind Benchmarks relativ Egal, der Vollst&auml;ndigkeit
wegen habe ich aber welche Erstellt. Die Benchmarks wurden auf einem
<a href="0302.htm" target="UDOcon">Falcon F030</a> unter MagiC 5.04 und 32Mhz Takt erzeugt. Das d&uuml;rfte
heute dem normalen Durchschnitt entsprechen.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/zipbenc1.gif" border=0 width="332" height="322"></p><br>
<div align=center><tt> Abbildung 4 - ZIP Benchmark / SCSI-TOOLs </tt>
<br>
<br>
</div>
<p align=center><img src="image/zipbenc2.gif" border=0 width="926" height="310"></p><br>
<div align=center><tt> Abbildung 5 - ZIP Benchmark / HowFastII </tt>
</div>
<p>
<br>
</p>
<p>&Auml;ltere Zip-Drives besitzt im Gegensatz zu anderen externen
SCSI-Devices leider keinen Netzschalter, es mu&szlig; hier also immer
der Klinkenstecker oder eben das Steckernetzteil abgezogen werden. Die
neuen Laufwerke besitzen endlich einen Netzschalter. Auf der
R&uuml;ckseite des ZIPs findet man eine SCSI-IN und eine SCSI-OUT
Buchse mit denen man die Verbindung zu seinem System herstellt. Beide
Buchsen sind relativ eindeutig Bezeichnet und sollten auch, speziell
bei den neueren Drives, auch so benutzt werden. Mit den passenden
Kabeln ist es hier schnell m&ouml;glich das Drive im Wechsel zwischen
einem Mac, einem Mac Powerbook, dem Atari und eben auch einem PC zu
betreiben. Beim PC sollten Sie ein wenig das Format Ihrer Medien
beachten, nur damit es kein b&ouml;ses Erwachen gibt. In der Regel
l&auml;uft der Datentausch aber sehr Reibungslos. Mit &auml;lterem
AtariOS sollten Sie den Zusatz 'BigDOS' benutzen! Mit dem <a href="1302.htm" target="UDOcon">HDDriver</a> in
der neuesten Ausgabe ist BigDOS nicht mehr erforderlich (!Nl)
</p>
<p>Weiterhin m&ouml;chte ich noch einmal die Funktion der beiden
Schiebeschalter an den &auml;lteren Ger&auml;ten beschreiben die sich
auf der Ger&auml;ter&uuml;ckseite zwischen den beiden DB 25
Anschlu&szlig;buchsen befinden. Leicht kommt es hier immer wieder zu
Verwechslungen die den Betieb beeintr&auml;chtigen. &quot;TERM
ON&quot; aktiviert so die SCSI-Terminierung des Zip-Drives. Das
mu&szlig; immer geschehen wenn das Zip in Ihrer SCSI-Kette das
einzigste oder eben das pysikalisch letzte Ger&auml;t ist.
</p>
<p>Der zweite Schalter l&auml;sst eine Auswahl zwischen leider nur
zwei SCSI-IDs zu, hier betrifft das die ID 5 und 6. Man sollte also
darauf achten das vom Zip-Drive immer nur eine SCSI-ID belegt wird die
im restlichen System noch nicht benutzt wurde. Sollten diese IDs
bereits von Ihrer restlichen <a href="0305.htm" target="UDOcon">Hardware</a> belegt sein kommen Sie nicht
drum herrum dort eine &Auml;nderung in deren ID-Verteilung vozunehmen.
Neuere ZIP-Drives f&uuml;r den internen Einbau wurden von IOMEGA so
ge&auml;ndert das man auch hier jetzt eine SCSI ID zwischen 0-7
einstellen kann.
<br>
</p>
<p>Am <a href="0302.htm" target="UDOcon">Falcon F030</a> braucht man neben diesen kleinen Dingen eigentlich
wenig zu beachten, sollte das Drive an einem anderen Atari verwendet
werden so ist man gut Beraten sich vor dem Kauf des Zip dar&uuml;ber
zu Informieren ob der an diesem Atari verwendete SCSI-Hostadapter das
sog. Parity-Signal erzeugt. Ohne Parity arbeitet Zip-Laufwerk ganz
sicher nicht! Am Falcon wird Parity unterst&uuml;tzt. Mit dem LINK'96
ist man sehr gut beraten wenn man das ZIP auch im Wechsel mit einem
alten ST nutzen m&ouml;chte.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/zipterm.gif" border=0 width="580" height="100"></p><br>
<div align=center><tt>Abbildung 6 - richtige Terminierung mit dem ZIP-Drive</tt>
</div>
<p>
<br>
</p>
<p>Bildet das ZIP das letzte Glied in ihrer SCSI-Kette sollten dann
nat&uuml;rlich alle anderen noch vorhandenen Terminatoren am Bus
entfernt werden. Es darf immer nur das letzte Laufwerk terminiert
werden. Sollte das ZIP nicht immer am Falcon-Bus verbleiben so
mu&szlig; in die vom ZIP belegte Buchse an diesem System ein
SCSI-Steckerterminator gesteckt werden sobald das ZIP-Laufwerk
entfernt wird. Passende Steckerterminatoren kann man f&uuml;r ca. 10
DM im einschl&auml;gigen Fachhandel erwerben.
</p>
<p>Es sicheres Zeichen f&uuml;r fehlende oder falsche/doppelte
Terminierung werden immer Schreib- und Lesefehler, sowie auch das
nicht Auffinden bestimmter SCSI-Ger&auml;te bleiben. So kann der Fall
eintreten das Devices nach einer doppelten, also falschen
Terminierung, am Bus von den HD-Treibern nicht mehr gefunden werden.
Sch&auml;den am System nicht ausgeschlossen.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/scsi2ad1.gif" border=0 width="171" height="156"></p><br>
<div align=center><tt> Abbildung 7 - SCSI2 50polig zu DB25 Kabeladapter, stehend</tt>
<br>
</div>
<p align=center><img src="image/scsi2ad3.gif" border=0 width="159" height="147"></p><br>
<div align=center><tt> Abbildung 8 - SCSI2 50polig zu DB25 Kabeladapter, DB25
oben</tt>
</div>
<p>Das ZIP-Laufwerk darf liegend oder auch stehend betrieben werden,
es gibt hier keine Einschr&auml;nkung. Beachten Sie einfach die
Anordnung der Gummif&uuml;&szlig;e. Das Zip ist eine schnelle und
g&uuml;nstige Methode seine Daten als Backup auf einer 100MB Diskette
zu sichern. Nat&uuml;rlich auch eine sehr brauchbare L&ouml;sung wenn
es darum geht mit Bekannten oder Kunden gr&ouml;ssere Mengen an Daten
tauschen zu m&uuml;ssen. Neue Zip-Medien kann man kaufen wo man
m&ouml;chte. Vorformatiert f&uuml;r PC oder Mac lassen sich diese
Disketten auch am Atari verwenden. Neu Formatieren ist nicht unbedingt
n&ouml;tig. Partitionieren und fertig.
<br>
</p>
<p>Passende SCSI2-Anschlu&szlig;kabel f&uuml;r das IOMEGA ZIP
erhalten Sie z.B zu recht g&uuml;nstigen Preisen und guter
Qualit&auml;t bei MISCO-Germany. Es gibt also fertige SCSI2 - DB25
Kabel. SCSI-Kabel mit DB25 Stecker enthalten den vollen
SCSI-Standardanschlu&szlig;. Es fehlen lediglich einige
GND-Verbindungen die in der alten 50 poligen SCSI-Norm reichlich
vorhanden waren. Diese SCSI-Kabel fallen daher im Kabeldurchmesser
etwas d&uuml;nner aus. Vermeiden sollten Sie aber auch hier
Sonderangebote aus dem billigen Asien. Insgesamt darf die
Kabell&auml;nge des SCSI-Systems an Ihrem Falcon eine L&auml;nge bis
zu 2 Metern aufweisen, auch hier gen&uuml;gt das dem Standard. Sog.
Sniffer, Busdriver und sonstige Sp&auml;sse werden am Falcon zum Zweck
der Leitungsverl&auml;ngerung nicht den gew&uuml;nschen Erfolg haben.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/scsi2ad2.gif" border=0 width="128" height="155"></p><br>
<div align=center><tt> Abbildung 9 - SCSI2 50polig zu DB25 Kabeladapter mit DB25
Kabel</tt>
</div>
<p>
<br>
</p>
<p>Passende Kabeladapter lassen sich f&uuml;r fast jeden Zweck im
einschl&auml;gigen Fachhandel auftreiben, auch wenn nicht Atari drauf
steht
<br>
</p>
<p><tt> ZIP+ Laufwerke </tt>
<br>
<br>Ebenso wie die bereits bekannten ZIP Drives lassen sich die neuen
ZIP Plus Laufwerke am Atari <a href="0302.htm" target="UDOcon">Falcon F030</a> sicher betreiben. Die neuen
IOMEGA Laufwerke sind im SCSI-Betrieb schneller als die bereis
bekannten Laufwerke. Beachten Sie bitte das die neuen ZIP Plus
Laufwerke selbstst&auml;ndig erkennen k&ouml;nnen ob sie an einer
SCSI- oder einer parallel Schnittstelle (PC) angeschlossen sind. Bei
den neuen Laufwerken ist man nicht mehr nur von zwei einstellbaren
SCSI IDs abh&auml;nging. Es k&ouml;nnen alle verf&uuml;gbaren SCSI IDs
von aussen geschaltet werden. Neue ZIP-Drives erkennen automatisch ob
sie das letzte Laufwerk in einer SCSI-Kette sind. Solange der
weiterf&uuml;hrende Port am ZIP unbeschaltet bleibt und das ZIP das
letzte Laufwerk ist wird es intern automatisch Terminiert.
</p>
<p>Ein externer Steckerterminator ist hier also nicht Notwendig!
<br>
</p>
<p>Im Betrieb verh&auml;lt sich ein ZIP+ genau wie die alten
Laufwerke.
<br><a href="1302.htm" target="UDOcon">HDDriver</a> ab 7.1 ist Emfehlenswert
<br>
<br>
</p>
<p><b> Probleme mit dem IOMEGA ZIP+ </b>
<br>
<br>
</p>
<p>Wie bei IOMEGA zu erfahren ist gibt es einige Probleme mit neueren
ZIP+ Laufwerken. Es handelt sich dabei nur um Laufwerke die
automatisch zwischen einem SCSI- und einem parallelen Anschlu&szlig;
umschalten k&ouml;nnen
<br>
</p>
<p>Dahingehend hat der Hersteller sogar die Dokumentation
ge&auml;ndert:
<br>
</p>
<p>Das Zip+ soll als einzigstes Lauftwerk an einem SCSI oder
parallelen Anschlu&szlig; betrieben werden. Nur das blaue!
Anschlu&szlig;kabel verwenden. Weiterhin sollten keinerlei
Kabeladapter verwendet werden.
</p>
<p>Das ZIP+ sollte nicht an NoteBooks, PowerBooks mit
SCSI-Anschlu&szlig; betrieben werden
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0607.htm" target="UDOcon"><img src="udo_up.gif" alt="Wechselplattenlaufwerke" border=0 width="24" height="24"></a>
<a href="0607.htm" target="UDOcon"><img src="udo_lf.gif" alt="Wechselplattenlaufwerke" border=0 width="24" height="24"></a>
<a href="060702.htm" target="UDOcon"><img src="udo_rg.gif" alt="Das Zip am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
