<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: CD-Writer
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="07.htm" target="UDOcon"><img src="udo_up.gif" alt="CD-ROM Devices" border=0 width="24" height="24"></a>
<a href="070102.htm" target="UDOcon"><img src="udo_lf.gif" alt="XM 5701 CD-ROM" border=0 width="24" height="24"></a>
<a href="070201.htm" target="UDOcon"><img src="udo_rg.gif" alt="CDR 400" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="CD-Writer">7.2 CD-Writer</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> SCSI CD-Writer am <a href="0302.htm" target="UDOcon">Falcon F030</a></tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>SCSI CD-Writer werden am Falcon genau wie jedes andere CD-Laufwerk
an der externen SCSI2-Buchse angeschlossen. Sollten Sie hier bereits
SCSI-Drives angeschlossen haben erleichert das die Sache ungemein.
<br>Es beschr&auml;nkt sich die Anschlu&szlig;arbeit auf das richtige
Terminieren ihres SCSI-Bus und auf die Installlation der
entsprechenden Software.
<br>
</p>
<p>Zum lesen von fertigen CDs gen&uuml;gt die eventuell bereits
vorhandene Software zum Betrieb eines CD-ROMs. Das wird wohl in vielen
F&auml;llen das Paket bestehend aus MetaDOS 2.70 und den CD-Tools oder
<a href="1303.htm" target="UDOcon">EXTenDOS</a> sein. Es gen&uuml;gt hier das Laufwerk in der hier
&uuml;blichen Art anzumelden. Sie ben&ouml;tigen nach einen Reboot
dann eigentlich nur noch ein passendes Icon auf Ihrem <a href="030505.htm" target="UDOcon">Desktop</a>.
<br>Meiner Meinung nach ist zum lesen von CDs allerdings ein normales
CD-Rom wesentlich besser geeignet.
<br>Passende Software zum Betrieb eines CD-Brenners erhalten Sie z.B
recht g&uuml;nstig bei Bernd Lohrum der hier ein recht brauchbare
L&ouml;sung entwickelt hat. Auch bei der Firma Soundpool kann man sich
mit Software und auch Komplettl&ouml;sungen versorgen. Leider fehlt
mir hier bis heute jegliche <a href="0205.htm" target="UDOcon">Information</a> dazu.
<br>
</p>
<p>Bernd Lohrum bietet ebenso anschlu&szlig;fertige L&ouml;sungen
f&uuml;r alle Atari-Computer an.
<br>Die Software von Bernd Lohrum, CD-Recorder 2.x unterst&uuml;tzt
die CD-Writer folgender Hersteller:
<br>
</p>
<pre>
- Phillips, alle Modelle
- Ricoh, alle Modelle
- Kodak CDD 225
- Yamaha, alle Modelle
- Pinnacle Micro, alle Modelle
- Hewlett Packard

</pre>
<p>Die Software l&auml;uft vollst&auml;ndig unter GEM auf dem Falcon
F030 und dem TT.
<br>4MB Ram sollten vorhanden sein, mehr Speicher w&auml;re besser.
<br>Die Kapazit&auml;t der Festplatte sollte mindestens die
Gr&ouml;&szlig;e der zu beschreibenden CD-R haben. Mehr Platz ist hier
nat&uuml;rlich auch besser.
<br>
</p>
<p><tt> Die nachfolgenden Formate werden im allgemeinen
unterst&uuml;tzt</tt>
</p>
<pre>
- <a href="0701.htm" target="UDOcon">CD-ROM</a>
- <a href="0701.htm" target="UDOcon">CD-ROM</a> Multisession
- CD-DA (Digital <a href="0907.htm" target="UDOcon">Audio</a> mit PQ-Editing)
- Mixed Mode <a href="0701.htm" target="UDOcon">CD-ROM</a>
- CD plus

</pre>
<p>Das zusammenstellen der CD-R passiert im bequemen Drag u. Drop
verfahren.
<br>Dateien und Ordner einfach auf die Arbeitsfl&auml;che ziehen und
das entsprechende Verzeichniss auf der CD-R angeben.
<br>
</p>
<p>Alle CD-Burner eignen sich genauso f&uuml;r den internen Einbau in
einen bereits vorhanden Tower. Hier sollte schon darauf geachten
werden, das gilt &uuml;brigens f&uuml;r jedes SCSI-Drive gleich am
Atari,PC oder Mac, da&szlig; die Flachbandkabel zwischen den einzelnen
Devices ca.15cm lang sein sollten. Das w&uuml;rde ziemlich genau dem
SCSI-Standart entsprechen und die Signalreflektionen innerhalb des
Kabels auf ein Minimum reduzieren.
<br>Die meisten CD-Writer wie z.B der Yamaha CDR 102 &uuml;bertragen
durchschnittlich ca. 600Kb/Sec.
<br>
</p>
<p>Beim Betrieb unter MTasking-Systemen ist man gut beraten wenn man
den Rechner w&auml;rend des Schreibvorgangs in Ruhe l&auml;sst, das
gilt nicht nur f&uuml;r den Atari. Selbst die angeblich wesentlich
besseren PC- oder Mac-Systeme sind hiergegen nicht immer gut
ger&uuml;stet. Die beschreibaren CD-Rs sind hier f&uuml;r
Fehlschl&auml;ge einfach noch zu teuer. Es gibt viele Hersteller von
beschreibbaren CDs. Hier sollte Sie auf jeden Fall die
Datentr&auml;ger verwenden die auch der Hersteller des CD-Writers
angibt.
<br>Gut beraten ist man wenn man sich alle Dateien die man auf eine CD
brennen m&ouml;chte vorher auf einer einzigen Festplattenpartition
zurechtlegt und in einem einzigen Rutsch auf die leere CD schreiben
l&auml;sst.
<br>Laufen weitere Programme, Tasks die momentweise die gesammte
Rechnerleistung f&uuml;r sich beanspruchen, kann man mit einer
zerschossenen CD rechnen. Genau in diesem Moment setzt der
Datentransfer beim Schreibvorgang aus. Das hat nat&uuml;rlich folgen
f&uuml;r den eingelegten Rohling.
<br>Bedenken Sie auch beim brennen ihrer eigenen CD das z.B bei der
Herstellung einer sog. Multisession CD eine ganze menge Platz auf der
CD f&uuml;r die diversen Directorys verbraten wird. Schnell steigt
hier der Speicherbedarf der Datentr&auml;gerverwaltung auf einige MB
an.
<br>500-650Mb an Daten und Programmen passen auf eine CD. Beim
Herstellen reiner Sound-CDs k&ouml;nnen ca. 700-750Mb auf eine CD
passen.
<br>Diese CDs sollten stets in einem Rutsch gebrannt werden.
<br>
</p>
<p>Zum externen Anschlu&szlig; sollten ausschliesslich 50 polige
SCSI-Kabel verwendet werden. Ist Ihr CD-Writer das einzige Ger&auml;t
am Bus oder ebenso das letzte Device in einer SCSI-Kette sollte die
Termination aktiviert werden. Das kann von Hersteller zu Hersteller
verschieden Funktionieren. IdR findet bei externen Ger&auml;ten ein
Steckerterminator auf der letzten SCSI-Buchse seinen festen Platz.
CD-Writer k&ouml;nnen auch in ein bereits vorhandenes System
eingeschleift werden. Beachten Sie bitte dringlich das das neue Device
keine bereits verwendete SCSI-ID belegt.
<br>
</p>
<p>Bei denen f&uuml;r PC oder Mac erh&auml;ltlichen
Softwareprogrammen ist es m&ouml;glich den Schreibvorgang im Testmodus
auszuprobieren. Hier fehlten mir bisher an der Atari-Software die
M&ouml;glichkeit f&uuml;r genauere Tests.
<br>
</p>
<p>Die Pinbelegung der SCSI-Buchse eines CD-Writers entspricht dem
Standart und kann mit den &uuml;blichen SCSI-Ger&auml;ten jederzeit
verglichen werden.
<br>Die Pinbelegung entnehmen Sie bitte der folgenden Auflistung:
<br>
</p>
<p><tt>Belegung der SCSI2-Buchse am Falcon:</tt>
</p>
<dl>
<dt><b>Pin 50 = </b></dt><dd> IO - Signal
<br>&nbsp;
<dt><b>Pin 49 = </b></dt><dd> REQ - Request
<br>&nbsp;
<dt><b>Pin 48 = </b></dt><dd> Code/Data Signal
<br>&nbsp;
<dt><b>Pin 47 = </b></dt><dd> SEL - Select
<br>&nbsp;
<dt><b>Pin 46 = </b></dt><dd> MSG - Message
<br>&nbsp;
<dt><b>Pin 45 = </b></dt><dd> RST - Reset
<br>&nbsp;
<dt><b>Pin 44 = </b></dt><dd> SACK - Acknowledge
<br>&nbsp;
<dt><b>Pin 43 = </b></dt><dd> BSY - Busy
<br>&nbsp;
<dt><b>Pin 42 = </b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 41 = </b></dt><dd> ATN
<br>&nbsp;
<dt><b>Pin 40 = </b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 39 = </b></dt><dd> NC - not connected
<br>&nbsp;
<dt><b>Pin 38 = </b></dt><dd> Vcc +5 Volt TermPwr (1Amp Microfuse)
<br>&nbsp;
<dt><b>Pin 37 = </b></dt><dd> NC - not connected
<br>&nbsp;
<dt><b>Pin 36-35=</b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 34 = </b></dt><dd> PARITY - Signal
<br>&nbsp;
<dt><b>Pin 33 = </b></dt><dd> SCSI 7 - Signal
<br>&nbsp;
<dt><b>Pin 32 = </b></dt><dd> SCSI 6 - Signal
<br>&nbsp;
<dt><b>Pin 31 = </b></dt><dd> SCSI 5 - Signal
<br>&nbsp;
<dt><b>Pin 30 = </b></dt><dd> SCSI 4 - Signal
<br>&nbsp;
<dt><b>Pin 29 = </b></dt><dd> SCSI 3 - Signal
<br>&nbsp;
<dt><b>Pin 28 = </b></dt><dd> SCSI 2 - Signal
<br>&nbsp;
<dt><b>Pin 27 = </b></dt><dd> SCSI 1 - Signal
<br>&nbsp;
<dt><b>Pin 26 = </b></dt><dd> SCSI 0 - Signal
<br>&nbsp;
<dt><b>Pin 25-15=</b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 14-12=</b></dt><dd> NC - Not used
<br>&nbsp;
<dt><b>Pin 11 = </b></dt><dd> Vcc - Resistor R65 with 10KOhm
<br>&nbsp;
<dt><b>Pin 10-1= </b></dt><dd> GND - Signal Ground
<br>&nbsp;
</dl>
<p>Die Stromversorgung eines nackten CD-Writer erfolgt mit der
&uuml;blichen Steckvorrichtung die auch eben an jedem anderen
SCSI-Device vorhanden ist. Beachten Sie hier bitte das ein CD-Brenner
ein wenig mehr Strom als eine moderne Festplatte ben&ouml;tigt.
Entnehmen Sie keinesfalls die Versorgungsspannungen dem internen
Netzteiles Ihres <a href="0302.htm" target="UDOcon">Falcon F030</a>, dieses <a href="0f01.htm" target="UDOcon">Netzteil</a> kann die erforderliche
Leistung nicht zur Verf&uuml;gung stellen. Betreiben Sie ihren Falcon
in einem Towerumbau der ein PC-Schaltnetzteil enth&auml;lt kann der
Writer hier recht problemlos an diesem <a href="0f01.htm" target="UDOcon">Netzteil</a> angeschlossen werden.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/cdromsup.gif" border=0 width="260" height="100"></p><br>
<div align=center><tt> Abbildung 1 - Stromversorgung des Writers </tt>
<br>
</div>
<p>
<br>
</p>
<p>Weitere Tip entnehmen Sie bitte dem Handbuch Ihres CD-Writers.
<br>Um Fehlschl&auml;ge zu minimieren lesen Sie auch aufmerksam die
Anleitung zu ihrer CD-Writer Software durch.
<br>
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p><tt> CD-Writer Models how was works with the Atari <a href="0302.htm" target="UDOcon">Falcon F030</a>
</tt>
<br>
<br>
</p>
<dl>
<dt><b>Philips CDD2000</b></dt><dd> Software: CD-Recorder 2.0 Bernd Lohrum
<br>Software: CDRec 2.18 - SoundPool
<br>Driver : MetaDos, <a href="1303.htm" target="UDOcon">EXTenDOS</a>
<br>Port : SCSI
<br>Features:
<br>
<br>&nbsp;
<dt><b>Philips CDD2600</b></dt><dd> Software: CD-Recorder 2.0 Bernd Lohrum
<br>Software: CDRec 2.18 - SoundPool
<br>Driver : MetaDos, <a href="1303.htm" target="UDOcon">EXTenDOS</a>
<br>Port : SCSI
<br>Features:
<br>
<br>&nbsp;
<dt><b>Yamaha CDR 400T </b></dt><dd> Software: CD-Recorder 2.0 Bernd Lohrum
<br>Software: CDRec 2.18 - SoundPool
<br>Driver : MetaDos, <a href="1303.htm" target="UDOcon">EXTenDOS</a>
<br>Port : SCSI, am Falcon unbedingt den PARTIY Jumper stecken!
<br>Features:
<br>
<br>&nbsp;
<dt><b>Ricoh </b></dt><dd> Software: CD-Recorder 2.0 Bernd Lohrum
<br>Software: CDRec 2.18 - SoundPool
<br>Driver : MetaDos, <a href="1303.htm" target="UDOcon">EXTenDOS</a>, all Models
<br>Port : SCSI
<br>Features:
<br>
<br>&nbsp;
<dt><b>Kodak CDD 225 </b></dt><dd> Software: CD-Recorder 2.0 Bernd Lohrum
<br>Software: CDRec 2.18 - SoundPool
<br>Driver : MetaDos, <a href="1303.htm" target="UDOcon">EXTenDOS</a>, all Models
<br>Port : SCSI
<br>Features:
<br>
<br>&nbsp;
<dt><b>Pinnacle Micro </b></dt><dd> alle Modelle
<br>Software:
<br>Software: CDRec 2.16 - SoundPool
<br>Port : SCSI
<br>Features:
<br>
<br>&nbsp;
<dt><b>Hewlett Packard</b></dt><dd> Software:
<br>Software: CDRec 2.16 - SoundPool
<br>Port : SCSI
<br>Features:
<br>
<br>&nbsp;
<dt><b>NEC Multispin 2Xi Model NEC 211</b></dt><dd> Software: CDRec 2.18 - Soundpool
<br>Driver : <a href="0701.htm" target="UDOcon">CD-ROM</a>.PRG und SCSI-DRV.PRG von Steffen Engel, sowie mit
CD-TOOLS von H&amp;S
<br>Port : SCSI
<br>Features: Schublade, kein Caddy
<br>Features: Frontal Kopfh&ouml;reranschlu&szlig; und
Lautst&auml;rkeregler
<br>
<br>&nbsp;
<dt><b>Yamaha 4260t CDRW</b></dt><dd> Software: ExtenDOS 3
<br>Driver : ExtenDOS GOLD
<br>Port : SCSI2
<br>Features: Schublade, kein Caddy
<br>Features: Frontal Kopfh&ouml;reranschlu&szlig; und
Lautst&auml;rkeregler
<br>Features: Notentriegelung
<br>Features: LEDs f&uuml;r ON/Disk und READ/WRITE Anzeige
Gr&uuml;n/Orange
<br>Features: 2MB Buffer Features: Jumper f&uuml;r SCSI ID, PARITY,
Blocksize, Terminator
<br>Features: Track ot Once, Disc at Once, Session at Once, Packet
Writing
<br>Features: <a href="0701.htm" target="UDOcon">CD-ROM</a>, <a href="0701.htm" target="UDOcon">CD-ROM</a> XA, CD-I, CD-DA, CD-Bidge, CD-Extra,
Video-CD
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br><tt> Das erstellen von eigenen <a href="0907.htm" target="UDOcon">Audio</a> CDs </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Nachdem ich nun endlich mal Zeit hatte, mich mit der
CD-Recorder-Software zu besch&auml;ftigen, habe ich soeben meine erste
Daten-CD mit dem Falcon und dem Yamaha CDR 400T gebrannt. Das Brennen
habe ich &uuml;ber ein Image-File auf meiner <a href="060402.htm" target="UDOcon">IDE-Platte</a> in
4-fach-Speed ohne Probleme hinbekommen. Vorher habe ich nat&uuml;rlich
Testl&auml;ufe gemacht, dabei ist mir aufgefallen, da&szlig;
On-The-Fly-Brennen von der SCSI-Platte Probleme bringt (das wird aber
auch von SoundPool gesagt). Ich mu&szlig; jetzt mal noch andere
Varianten ausprobieren, insbesondere die <a href="0907.htm" target="UDOcon">Audio</a>-Sonderfunktionen.
</p>
<p>Im gro&szlig;en und ganzen erscheint mir die CDRecoder-Software
schon ziemlich ausgereift zu sein. Es sind drei Programme: CDRecorder
Pro 2.18 f&uuml;r Daten-, Mix- und normale <a href="0907.htm" target="UDOcon">Audio</a>-CDs, CDRecorder <a href="0907.htm" target="UDOcon">Audio</a>
f&uuml;r das Neuzusammenstellen eigener <a href="0907.htm" target="UDOcon">Audio</a>-CDs mit speziellen
Eigenschaften (Pre&szlig;masterf&auml;hig!), CD-Copy zum Kopieren von
vorhandenen CDs, dazu ein MetaDOS-Treiber (l&auml;uft bei mir auch mit
SPIN!0.32) und ein CPX, mit dem man gezielt die einzelnen Sessions bei
MultiSession-CDs ansprechen kann.
</p>
<p>Ich meine nach meinem ersten Test schon, Du kannst es schon
riskieren, den Brenner am Falcon zu betreiben. Ich h&auml;tte mit mehr
Problemen gerechnet.
</p>
<p>
<br>
<br><b> SoundPool Software CDRecorder 2 </b>
<br>
<br>
</p>
<p>Das umfassende 'State of the art' CD-Recording Paket f&uuml;r
Atari TT-, Falcon- und Hades Computer enth&auml;lt alle Programme und
Tools, die zur Herstellung und zum Lesen von CD-ROMs ben&ouml;tigt
werden:
<br>
</p>
<p>CDRecorder Pro 2, CDRecorder <a href="0907.htm" target="UDOcon">Audio</a> 2, CD-Copy, SCSI_CD.BOS und das
Multisession CPX. Es werden die g&auml;ngigen Yamaha und Philips
kompatiblen CD-Writer unterst&uuml;tzt (auch 4 x Speed)
<br>
<br>
</p>
<p align=center><img src="image/cdrec.gif" border=0 width="599" height="209"></p><br>
<div align=center><tt> Abbildung 2 - Soundpool CDRecorder 2 </tt>
</div>
<p>
<br>
<br>
</p>
<p>Mit CDRecorder Pro 2 k&ouml;nnen alle <a href="0701.htm" target="UDOcon">CD-ROM</a> Formate (im ISO 9660,
ATARI, DOS und Backup Standard) incl. Mixed-Mode CD und CD-Extra sowie
<a href="0907.htm" target="UDOcon">Audio</a> CD-DA gebrannt werden. High Speed Iso Formatting und
Multisession mit Back-up und Archivbit Verwaltung erleichtern die
regelm&auml;ssige Datensicherung. Die Drag und Drop Funktionen und das
komplett &uuml;berarbeitete Userinterface bieten einen sehr hohen
Bedienungskomfort.
</p>
<p>- intelligente CD-Format Verwaltung
<br>- <a href="0701.htm" target="UDOcon">CD-ROM</a>, Mixed-Mode, CD-Extra, <a href="0907.htm" target="UDOcon">Audio</a> CD-DA
<br>- Generic SCSI Copy Funktion, kopiert beliebige Festplatten
(Sampler u.a.) sowie Daten CDs
<br>- Automatische Archivbitbit Verwaltung
<br>- Editierbarer Volume Desciptor f&uuml;r CD-ROMs
<br>
<br>
<br><b> CDRecorder 2 <a href="0907.htm" target="UDOcon">Audio</a> </b>
<br>
<br>
</p>
<p>Mit der CDRecorder <a href="0907.htm" target="UDOcon">Audio</a> 2 Software werden <a href="0907.htm" target="UDOcon">Audio</a> CDs hergestellt.
Das Programm verwaltet <a href="0907.htm" target="UDOcon">Audio</a> Dateien im AIFF, AVR und WAV Format. Im
professionellen PQ-Dateneditor f&uuml;r 'redbook' kompatible <a href="0907.htm" target="UDOcon">Audio</a>
CDs, incl. Masterlist und <a href="0907.htm" target="UDOcon">Audio</a> Wiedergabe (auch &uuml;ber SPDIF) wird
das CD Projekt bearbeitet. Die fertige <a href="0907.htm" target="UDOcon">Audio</a> CD kann dann in jedem
CD-Player abgespielt werden. Presswerke akzeptieren die CD als Master
f&uuml;r die Vervielf&auml;ltigung.
<br>
</p>
<p>- Sub-Index kann frei im Musiktrack gesetzt werden
<br>- Frei einstellbare Pre-Emphasis und Copy-Protection pro Track
<br>- Frei einstellbare Pausenzeiten
<br>- Einstellbarer Trackoffset in Audioframes pro Track
<br>- Eingabe der Media Katalog Nummer f&uuml;r jede CD
<br>- Eingabe eines International Standard Recording Codes pro Track
<br>- Printout Funktion f&uuml;r Master Liste und Cover Liste
<br>
</p>
<p>Das zus&auml;tzliche CD-Copy Programm f&uuml;r Daten und <a href="0907.htm" target="UDOcon">Audio</a>
CDs, der SCSI_CD.BOS Treiber f&uuml;r den Einsatz von CD-Writern als
<a href="0701.htm" target="UDOcon">CD-ROM</a> Laufwerk und das Multisession CPX zum Umschalten zwischen den
Sessions einer Multisession <a href="0701.htm" target="UDOcon">CD-ROM</a> runden das Bild ab.
</p>
<p>Diese Software arbeitet auch mit CDRW-Ger&auml;ten, z.B dem CDRW
4260 von Yamaha. Ansonsten sollten Sie scon mal einen Blick auf das
wesenlich g&uuml;nstigere ExtenDOS GOLD von Anodyne-Sofware Canada
werfen!
<br>
</p>
<dl>
<dt><b>CDRecorder PRO:</b></dt><dd> Alle <a href="0701.htm" target="UDOcon">CD-ROM</a> Formate incl. Mixed Mode und CD Extra
(Bluebook-kompatibel)
<br>&nbsp;
<dt><b>CDRecorder AUDIO:</b></dt><dd> CD-DA <a href="0907.htm" target="UDOcon">Audio</a> CDs
<br>&nbsp;
<dt><b>CDRecording Tools:</b></dt><dd> CD-Copy Programm, Multisession CPX, Metados Treiber f&uuml;r
CD-Writer
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p><b> Unterst&uuml;tzte CD Writer Typen Stand 4/98 </b>
<br>
<br>
</p>
<dl>
<dt><b>Philips CDD2000</b></dt><dd> IMS CDD2000 PHILIPS CDD2000 Phillips CDD2600 Philips CDD2600
Philips CDD521/CDD522
<br>&nbsp;
<dt><b>PLASMON</b></dt><dd> PLASMON CDR4220 PLASMON RF4100
<br>&nbsp;
<dt><b>GRUNDIG</b></dt><dd> GRUNDIG CDR100 HIGHTECH CD-R2000
<br>&nbsp;
<dt><b>MITSUMI</b></dt><dd> Mitsumi CD-R CR-24 Mitsumi CD-R CR-24
<br>&nbsp;
<dt><b>HP</b></dt><dd> HP CD-Writer 6020 HP C4324/C4325
<br>&nbsp;
<dt><b>YAMAHA</b></dt><dd> CDR100/CDR102 YAMAHA CDR100 YAMAHA CDR102 YAMAHA CDR400 YAMAHA
CDR200 YAMAHA CDRW4460 YAMAHA CDRW2260
<br>&nbsp;
<dt><b>TEAC CDR</b></dt><dd> TEAC CD-R50S TEAC CD-R55S
<br>&nbsp;
<dt><b>SONSTIGE</b></dt><dd> WPI CDR-432 IMS CDD521 IMS CDD522 KODAK PCD225 IMS CDD2600 WPI
CDR-632
<br>&nbsp;
</dl>
<p>Adressen und Bezugsquellen finden Sie unter <a href="1604.htm" target="UDOcon">H&auml;ndler</a>
<br>
</p>
<p>
<br>
<br><b> Der Betrieb </b>
<br>
</p>
<p>CD-Recorder sollten immer an staubfreien Orten betrieben werden.
Staubpartikel k&ouml;nnen die CD besch&auml;digen und die Aufnahmen
zerst&ouml;ren. Betreiben Sie alle CD-Writer in einem
Temperaturbereich von +5 bis +40 Grad. Die relative Luftfeuchte kann
dabei bis zu 50% betragen. K&ouml;nnen Sie die Temperatur nicht halten
ist das Geh&auml;use zwingend mit einem passenden L&uuml;fter zu
k&uuml;hlen.
<br>
</p>
<p><b> Rohlinge und Handbuch </b>
<br>
</p>
<p>F&uuml;r z.B den Yamaha 4260t CDRW eignen sich Rohlinge des Typs:
CDM12Y63
<br>CDM12Y74
<br>CDM12Y74M
<br>CDRWM74R
<br>
</p>
<p>Beachten Sie bitte das die Rohlinge stets nur frei von Staub und
Fusseln in das entsprechende Laufwerk gelegt werden sollten. Reinigen
Sie ihre Rohlinge falls n&ouml;tig vorher! Legen Sie niemals feuchte
CD's in einen CD-Brenner!
<br>
</p>
<p>Weitere Informationen zu den verschiedenen CD-Brennern entnehmen
Sie bitte dem Handbuch ihres Ger&auml;tes. Wenn Sie kein Handbuch
haben, treten Sie ihren <a href="1604.htm" target="UDOcon">H&auml;ndler</a>. Das Handbuch haben Sie mit
bezahlt. Die Ger&auml;tehersteller, z.B Yamaha legen immer ein
Handbuch dem Ger&auml;t bei.
<br>
</p>
<p>
<br><b> CDRWs l&ouml;schen mit dem CDRecorder 2 </b>
<br>
<br>
</p>
<p>Wenn das &quot;Trackmanager&quot;-Fenster &gt;leer&lt; ist und man
&quot;CD...RECORD&quot; auf Record klickt erscheint ein neues Fenster,
da&szlig; in etwa so aussieht:
<br>
</p>
<pre>-----------------------------------
Delete

Erase CDRewriteable?

Cancel     Quick Erase     Erase
----------------------------------
</pre>
<p>Wenn man da&szlig; nicht wei&szlig; denkt man der CD-Recorder kann
immer noch keine CDRW l&ouml;schen. Ich erfuhr es auch nur nach einem
Anruf bei SoundPool bei dem ich mich beschwerte das auf der letzten
Messe Packs mit Yamaha CDRWs verkauft wurden CDRWs aber nicht
gel&ouml;scht werden k&ouml;nnen.
<br>
</p>
<p>Otto Grunewald
<br>
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>
<br><b> Some words about CDRecorder2 from Dennis Vermeire </b>
<br>
</p>
<p>Hi guys,
<br>
</p>
<p>There seem to be a few misconceptions here about what exactly one
can do with CD Recorder Pro.
<br>
</p>
<p>SoundPool CD Recorder Pro supports the CD formats CD ROM, <a href="0907.htm" target="UDOcon">Audio</a>
CD, Mixed Mode CD and CD extra. Generic formats, such as HFS, PSX,
UNIX and various sampler formats, can be copied with the SCSI copy
function.
<br>
</p>
<p>I'll try to explain what the Generic Format do, because there is a
lot of confusion about this:
<br>From SCSI hard disk drives and CD ROM drives in ANY format one can
burn a CD. After scanning the SCSI bus, all connected SCSI devices are
displayed. The drive which has to be copied is selected and one can
burn a straight one to one copy to CD from it. What this means in
practice is that one can burn a CD from a partition which is NOT
accessable by TOS. Mac HFS, UNIX or some special formats used by
samplers can all be transferred to CD. The produced CD can NOT be read
by TOS, when copying a MAC HFS partition you end up with a MAC HFS CD.
So the Generic Format is OK for backup from ALL none TOS partitions
and also to copy CDs like the Playstation PSX format. There are a
couple of drawbacks: the SCSI Copy function only works like its name
suggests with SCSI devices, so IDE drives &amp; partitions are not
recognised. The maximum capacity is 650MB, so if one has a partition
which is bigger, say 800MB, only the first 650MB are copied.
<br>
</p>
<p><b> So far so good... </b> When one wants to create a CD from
scratch, this is handled by the the file formatter. The file formatter
can NOT handle long file names, these will be truncated and burned
like this to the CD. This is a real pain, when working with MagiC or
<a href="1307.htm" target="UDOcon">MiNT</a> one starts to use the long file name options rather quickly. The
ISO formatter can handle the 9960 level 1 standard, the Atari format,
DOS format and a special format which is called: &quot;don't
care&quot;. With this last option the CD wil be written as the data
is. It is not gueranteed however that this CD will work on every OS
<br>
</p>
<p><b> Backups </b> Normally one uses the multi session format to
backup data on CD ROM. The program supports the archive bit management
function. With the &quot;use archive bit&quot; and &quot;clear archive
bit&quot; functions the software will only save edited files to the
CD. So, when one makes a backup from his data, the next time ONLY data
that is new or changed will be written to the CD. This saves a lot of
space and time.
<br>
</p>
<p><b> Burning </b> Before burning a CD, one can test if the CD will
be burned succesfully at the choosen speed. This is a question of
knowing your system.... When burning a CD containing 30000 files
(fonts, small gifs, HTML pages) the harddisk can't keep up, and 1X is
the maximum speed on a TT. When burning a CD containing big files
(&gt;1MB) 4X can be sustained easily... If you have enough harddisk
space the best system is to make an image, this will take some time
(15' max.) but then you can always burn at 4X and the time lost making
the image is gained back quickly. You also never have to waist time
with the &quot;test&quot; option, because an image will always be
written succesfully at maximum speed.
<br>
</p>
<p><a href="0907.htm" target="UDOcon">Audio</a> files can be written straight to the CD at 4X without the
need to make an image, so copying a Music CD goes very fast. With
certain writers 4X can not be handled on a Falcon, but on a TT there
are no problems.
<br>
</p>
<p>I'm not gonna explain the <a href="0907.htm" target="UDOcon">Audio</a> CD functions here, for the time
just be happy with the fact that it is one of very few programs on any
platform which can prepare a CD ready to be pressed by an Recording
Studio. Not suprising really, because the roots from SoundPool is the
music business after all.
<br>
</p>
<p>Comparing CD Recorder Pro with CD Writer is unfair...
<br>CD Writer makes backups from partitions which can then be viewed
in TOS. So Minix, HFS, UNIX etc are out of the question. It is capable
of making a backup from a accessable partition containing long file
names. Accessable partitions is the magic word here... Compared to CD
Recorder Pro, CD Writer Gold is very limited and offers only the pure
basics. Considering that CD Recorder Pro has come down in price, the
choice should be easy....
<br>
</p>
<p>CD Recorder Pro works with Falcon and TT, with a Link '97
connected ST &amp; STE can also work with the program. For some
strange reason the program does NOT work on a Milan (SCSI card ?), I
don't know about the Hades...
<br>
</p>
<p>Cheers from Belgium
<br>
<br>
<br>Some technical information From:
<br>Dennis Vermeire &lt;dennis.vermeire@ping.be&gt;
<br>Otto Grunewald@t-online.de
<br>Vincent Bakker &lt;bakkerv@pi.net&gt;
<br>Thomas Steuer@OF2.maus.de
<br>Joerg Sprenger@K2.maus.de
<br>Jens Fellmuth
<br>Roger Burrows
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li> 7.2.1 <a href="070201.htm" target="UDOcon">CDR 400</a></li>
<li> 7.2.2 <a href="070202.htm" target="UDOcon">Yamaha CDRW 4260t</a></li>
<li> 7.2.3 <a href="070203.htm" target="UDOcon">Yamaha CDRW 6416</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="07.htm" target="UDOcon"><img src="udo_up.gif" alt="CD-ROM Devices" border=0 width="24" height="24"></a>
<a href="070102.htm" target="UDOcon"><img src="udo_lf.gif" alt="XM 5701 CD-ROM" border=0 width="24" height="24"></a>
<a href="070201.htm" target="UDOcon"><img src="udo_rg.gif" alt="CDR 400" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
