<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Yamaha CDRW 4260t
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0702.htm" target="UDOcon"><img src="udo_up.gif" alt="CD-Writer" border=0 width="24" height="24"></a>
<a href="070201.htm" target="UDOcon"><img src="udo_lf.gif" alt="CDR 400" border=0 width="24" height="24"></a>
<a href="070203.htm" target="UDOcon"><img src="udo_rg.gif" alt="Yamaha CDRW 6416" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Yamaha_20CDRW_204260t">7.2.2 Yamaha CDRW 4260t</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Yamaha CDRW 4260 am Atari Falcon </tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Die Firma Yamaha belegt in allen Fachzeitschriften mit ihren
<a href="0701.htm" target="UDOcon">CD-ROM</a> Laufwerken und auch den CD-Brennern immer die ersten
Pl&auml;tze und wird somit auch meistens Testsieger, zumindest was z.B
den CD-ROMs und CD-Brenner betrifft.
<br>
</p>
<p>Ein Grund mehr sich also f&uuml;r einen CD-Brenner aus diesem
Hause zu entscheiden. Meine Entscheidung ist auf einen CDRW gefallen
da ich diesen Recorder f&uuml;r ebenfalls f&uuml;r BackUp-Zwecke
einsetzen wollte. Eine CD-R w&auml;re daf&uuml;r zwar auch geeignet,
nach 1 Woche jedoch bereits 'alt'. Man erh&ouml;ht mit einer solchen
CD-R dann nur den M&uuml;llberg. Richtig ist das wiederbeschreibare
CDs noch teuer sind. Einfache CD-Rs bekommt man heute idR f&uuml;r ca.
3 DM. Als Wegwerf-BackUp aber leider nicht sonderlich
Umweltfreundlich, denn was macht man den mit einer alten einmal
beschriebenen CD, mal ehrlich, die wenigsten werden die Scheibe wohl
zum Entsorger bringen. Eine CD-RW ist wesentlich teuerer, daf&uuml;r
aber bis zu 1000 mal neu beschreibbar. Das ist meiner Meinung nach
f&uuml;r BackUp-Zwecke geradezu Ideal.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/cdrw4260.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 1 - Yamaha CDRW 4260 im externen SCSI-Geh&auml;use
</tt>
<br>
</div>
<p>
<br>
</p>
<p>Der Yamaha Recorder 4260t CDRW ist ein Ger&auml;t einer relativ
neuen Generation von CD-Recordern. Er beherrscht einige Betriebsmodi
die man bei anderen Brennern leider vergeblich sucht. Was hierzu jeder
Recorder-Software leider fehlt ist das l&ouml;schen einer CD-RW. Man
kann nur hoffen das solche Funktionen noch eingebaut werden.
<br>
</p>
<dl>
<dt><b>Schnittstelle</b></dt><dd> SCSI2
<br>&nbsp;
<dt><b>Datenkapazit&auml;t</b></dt><dd> 650Mb oder 74 Minuten Musik
<br>&nbsp;
<dt><b>Aufnahmegeschwindigkeit</b></dt><dd> CD-RW x2, CD-R x2
<br>&nbsp;
<dt><b>Lesen von CDs</b></dt><dd> 2, 4 und 6-fach
<br>&nbsp;
<dt><b>Daten&uuml;bertragung</b></dt><dd> 6-fach 900KB/Sec., 4-fach 600KB/Sec., 2fach 300KB/Sec.
<br>&nbsp;
<dt><b>Burst-&Uuml;bertragung</b></dt><dd> 4.2MB/Sec asyncron
<br>&nbsp;
<dt><b>Datenpuffer</b></dt><dd> 2MB Ramspeicher
<br>&nbsp;
<dt><b>Zugriffszeit</b></dt><dd> 250mS als Mittelwert aus allen Operationen
<br>&nbsp;
<dt><b>Einbaulage</b></dt><dd> Nur Horizontal, gut bel&uuml;ftetes Geh&auml;use
<br>&nbsp;
<dt><b>CD-Aufnahme</b></dt><dd> Laufschlitten, ohne Caddy
<br>&nbsp;
<dt><b><a href="0907.htm" target="UDOcon">Audio</a>-Ausgang</b></dt><dd> Frequenzgang 20-20.000Khz (Line Out) Pegel 1Vrms, MOLEX 53532-04
<br>&nbsp;
<dt><b>Leistungsaufnahme</b></dt><dd> 11 Watt beim schreiben einer CD gemessen
<br>&nbsp;
<dt><b>Stromversorgung</b></dt><dd> +5V, +12 Volt +/- 10%
<br>&nbsp;
<dt><b>Gewicht</b></dt><dd> 950g ohne eingelegte CD
<br>&nbsp;
<dt><b>Betriebsbedingungen</b></dt><dd> +5-40c Grad, Luftfeuchte 25-80% 40c nur mit
Geh&auml;useventilator
<br>&nbsp;
<dt><b>Leuchtanzeigen</b></dt><dd> Der CDRW besitzt zwei LEDs die unterschiedliche Funktionen
anzeigen. ON/DISK und READ/WRITE zeigen jeweils in unterschiedlichen
Farben die verschiedenen Betriebszust&auml;nde des Brenners an.
<br>&nbsp;
</dl>
<p>
<br><b> Anschlu&szlig; an den Computer </b>
<br>
<br>
</p>
<p>SCSI CD-Brenner werden am Falcon genau wie jedes andere
SCSI-Laufwerk an der externen SCSI2-Buchse angeschlossen. Sollten Sie
hier bereits ein externes SCSI-Drive angeschlossen haben erleichert
das die Sache ungemein. Ihre Mitwirkung beschr&auml;nkt sich die
Anschlu&szlig;arbeit und auf das richtige Terminieren ihres SCSI-Bus
sowie die <a href="0204.htm" target="UDOcon">Installation</a> der entsprechenden Software.
<br>
</p>
<p>Beim Kauf meines CDRW von Yamaha lag die Mac-Software TOAST 3.5.3
dabei. Beachten Sie bitte das &auml;ltere Ausgaben von TOAST diesen
Brenner nicht unterst&uuml;tzen!
<br>Selbstredent kann dieses Ger&auml;t an beiden Rechnerwelten
eingesetzt werden. Am Atari steht mir als einzigste Software ExtenDOS
GOLD zur Verf&uuml;gung. Es ist daher nicht auszuschliessen das andere
Produkte diesen CD-Brenner nicht unterst&uuml;tzen. Erkundigen Sie
sich vor dem Kauf des Ger&auml;tes bei ihrem Softwarehersteller. Der
Soundpool CD-Recorder V 2.02 unterst&uuml;tzt diesen Recorder wie auf
der Atari Messe in Neuss zu erfahren war. Testdaten liegen mir leider
keine vor
<br>
</p>
<p>
<br><b> Nachfolgende CD-Formate werden unterst&uuml;tzt</b>
<br>
<br>
</p>
<pre>
- <a href="0701.htm" target="UDOcon">CD-ROM</a>
- <a href="0701.htm" target="UDOcon">CD-ROM</a> Multisession
- CD-DA (Digital <a href="0907.htm" target="UDOcon">Audio</a> mit PQ-Editing)
- Mixed Mode <a href="0701.htm" target="UDOcon">CD-ROM</a>
- CD plus
- CD-XA
- Video CD
- Disk at Once
- Track at Once
- Redbook, OrangeBook
- <a href="0907.htm" target="UDOcon">Audio</a> CD

</pre>
<p>Das zusammenstellen der CD-R(W) auf dem Mac passiert im bequemen
Drag u. Drop verfahren. Dateien und Ordner oder Soundfiles einfach auf
die Arbeitsfl&auml;che ziehen und das entsprechende Verzeichniss auf
der CD-R(W) angeben.
<br>
</p>
<p>Auf dem Atari kann ExtenDOS GOLD bisher nur AudioCDs
zusammenstellen. Ebenso befindet sich im ExtenDOS-Paket ein AudioCD
Player f&uuml;r den <a href="030505.htm" target="UDOcon">Desktop</a>. Der Soundpool Recoder schreibt wohl auch
normale Daten CDs
<br>
</p>
<p>Alle Yamaha CD-Brenner eignen sich genauso f&uuml;r den internen
Einbau in einen bereits vorhanden Tower oder ein mehrfach
SCSI-Geh&auml;use. Hier sollte schon darauf geachten werden, das gilt
&uuml;brigens f&uuml;r jedes SCSI-Drive gleich am Atari, PC oder Mac,
da&szlig; die Flachbandkabel zwischen den einzelnen Devices ca.15-20cm
lang sein sollten. Das w&uuml;rde ziemlich genau dem SCSI-Standard
entsprechen und die Signalreflektionen innerhalb des Kabels auf ein
Minimum reduzieren. Es funktioniert aber aber auch wenn die Kabel
l&auml;nger bleiben
<br>
</p>
<p>Der CDRW-4260t &uuml;bertr&auml;gt bei x4 fach Durchschnittlich
600Kb/Sec.
<br>Das bedeutet das bei mir eine CD brennen ca. eine halbe Stunde
dauert.
<br>
</p>
<p>W&auml;hrend dem Betrieb ist man gut beraten wenn man den Rechner
einfach in Ruhe l&auml;sst, das gilt nicht nur f&uuml;r den Mac.
Selbst die angeblich wesentlich besseren PC-Systeme verlangen zum
einfachen Brennen einer dummen CD-R mindestens einen Pentium 100
Prozessor laut Yamaha-Handbuch! Performance-Probleme? :-&gt;
<br>
</p>
<p>In allen F&auml;llen sind sie gut beraten wenn die die CD-Image
Dateien immer von ihrer schnellsten Festplatte aus auf eine CD-Brennen
lassen. Mehrere Versuche mit dem Falcon von der internen Standard IDE
Platte zu brennen scheiterten immer an einem 'Buffer underrun' Hier
ist dann leider immer die n&auml;chst kleinere Geschwindigkeit am
Brenner einzustellen.
<br>Beruhigen Sie sich, das passiert auch am PowerBook 5300cs mit
interner <a href="060402.htm" target="UDOcon">IDE-Platte</a>. Sehr wichtig ist auf jedem Fall das der
Datenstrom von einer Festplatte &uuml;ber den Computer bis hin zum
CD-Brenner niemals Unterbrochen werden darf. Auch nicht wenn der
Brenner selbst 2MB Pufferspeicher hat.
<br>
</p>
<p>Eine Unterbrechung des Datenstoms zerst&ouml;rt in jedem Fall die
momentane Aufnahme.
<br>
</p>
<p>Zum Anschlu&szlig; des 4260t sollten ausschliesslich
h&ouml;herwertige SCSI-Kabel verwendet werden. Die passenden Kabel
finden Sie bei jedem besseren Fachh&auml;ndler. Spezielle HDI30 zu
50pol SCSI wie es f&uuml;r z.B ein PowerBook ben&ouml;tigt wird
sollten Sie sich ebentuell auch gleich dort bestellen wo sie den
Brenner kaufen. Mitgeliefert wird ein DB25 zu 50 pol SCSI-Kabel.
</p>
<p>Ist Ihr <a href="0702.htm" target="UDOcon">CD-Writer</a> das einzige Ger&auml;t am Bus oder ebenso das
letzte Device in einer SCSI-Kette sollte die Terminierung aktiviert
werden. Das kann von Hersteller zu Hersteller verschieden
Funktionieren. IdR findet bei externen Ger&auml;ten ein
Steckerterminator auf der letzten SCSI-Buchse seinen festen Platz. Das
bedeutet das intern, also direkt am Brenner kein Jumper f&uuml;r die
Terminierung gesteckt werden darf! <a href="0702.htm" target="UDOcon">CD-Writer</a> k&ouml;nnen auch in ein
bereits vorhandenes System eingeschleift werden. Beachten Sie bitte
dringlich das das neue Device keine bereits verwendete SCSI-ID belegt.
<br>
</p>
<p>Externe Brenner f&uuml;r den Mac werden prinzipiel mit SCSI-Kabel
und einem passiven externen Terminator ausgeliefert.
<br>
</p>
<p>Die Pinbelegung der SCSI-Buchse eines CD-Writers entspricht dem
Standard und kann mit den &uuml;blichen SCSI-Ger&auml;ten an PC und
Atari jederzeit verglichen werden.
<br>Die Pinbelegung entnehmen Sie bitte der folgenden Auflistung:
<br>
</p>
<p>
<br><b>Belegung der SCSI2-Buchse am Yamaha CDRW 4260t:</b>
<br>
<br>
</p>
<dl>
<dt><b>Pin 50 = </b></dt><dd> IO - Signal
<br>&nbsp;
<dt><b>Pin 49 = </b></dt><dd> REQ - Request
<br>&nbsp;
<dt><b>Pin 48 = </b></dt><dd> Code/Data Signal
<br>&nbsp;
<dt><b>Pin 47 = </b></dt><dd> SEL - Select
<br>&nbsp;
<dt><b>Pin 46 = </b></dt><dd> MSG - Message
<br>&nbsp;
<dt><b>Pin 45 = </b></dt><dd> RST - Reset
<br>&nbsp;
<dt><b>Pin 44 = </b></dt><dd> SACK - Acknowledge
<br>&nbsp;
<dt><b>Pin 43 = </b></dt><dd> BSY - Busy
<br>&nbsp;
<dt><b>Pin 42 = </b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 41 = </b></dt><dd> ATN
<br>&nbsp;
<dt><b>Pin 40 = </b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 39 = </b></dt><dd> NC - not connected
<br>&nbsp;
<dt><b>Pin 38 = </b></dt><dd> Vcc +5 Volt TermPwr (&uuml;ber 1Amp Microfuse am F030)
<br>&nbsp;
<dt><b>Pin 37 = </b></dt><dd> NC - not connected
<br>&nbsp;
<dt><b>Pin 36-35=</b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 34 = </b></dt><dd> PARITY - Signal
<br>&nbsp;
<dt><b>Pin 33 = </b></dt><dd> SCSI 7 - Signal
<br>&nbsp;
<dt><b>Pin 32 = </b></dt><dd> SCSI 6 - Signal
<br>&nbsp;
<dt><b>Pin 31 = </b></dt><dd> SCSI 5 - Signal
<br>&nbsp;
<dt><b>Pin 30 = </b></dt><dd> SCSI 4 - Signal
<br>&nbsp;
<dt><b>Pin 29 = </b></dt><dd> SCSI 3 - Signal
<br>&nbsp;
<dt><b>Pin 28 = </b></dt><dd> SCSI 2 - Signal
<br>&nbsp;
<dt><b>Pin 27 = </b></dt><dd> SCSI 1 - Signal
<br>&nbsp;
<dt><b>Pin 26 = </b></dt><dd> SCSI 0 - Signal
<br>&nbsp;
<dt><b>Pin 25-15=</b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 14-12=</b></dt><dd> NC - Not used
<br>&nbsp;
<dt><b>Pin 11 = </b></dt><dd> Vcc +5V
<br>&nbsp;
<dt><b>Pin 10-1= </b></dt><dd> GND - Signal Ground
<br>&nbsp;
</dl>
<p>Pin 1 der <a href="0c08.htm" target="UDOcon">SCSI-Schnittstelle</a> befindet sich wie bei jedem anderen
SCSI-Ger&auml;t direkt neben dem Stecker der Stromversorgung. Pin 1
sollte mit einer einzelnen farbigen Ader des Flachbandkabels markiert
sein. Die Stromversorgung eines nackten <a href="0702.htm" target="UDOcon">CD-Writer</a> erfolgt mit der
daf&uuml;r &uuml;blichen Steckvorrichtung die auch eben an jedem
anderen SCSI-Device vorhanden ist. Beachten Sie hier bitte das dieser
CD-Brenner beim schreiben einer CD ca. 11 Watt Leitung aus ihrem
<a href="0f01.htm" target="UDOcon">Netzteil</a> ben&ouml;tigen wird.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/cdromsup.gif" border=0 width="260" height="100"></p><br>
<div align=center><tt> Abbildung 2 - Stromversorgung</tt>
<br>
</div>
<p>
<br>
</p>
<p>Weitere Tip entnehmen Sie bitte dem Handbuch Ihres CD-Writers.
<br>Um Fehlschl&auml;ge zu minimieren lesen Sie auch aufmerksam die
Anleitung zur <a href="0702.htm" target="UDOcon">CD-Writer</a> Software durch. Die Ger&auml;uschentwicklung
des eigentlichen Brenners ist Minimal und mit den Ger&auml;uschen
eines CD-ROMs zu vergleichen. CD-Brenner im externen SCSI-Geh&auml;use
besitzten einen L&uuml;fter der die Arbeitsger&auml;usche des Brenners
idR &uuml;bert&ouml;nt
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0702.htm" target="UDOcon"><img src="udo_up.gif" alt="CD-Writer" border=0 width="24" height="24"></a>
<a href="070201.htm" target="UDOcon"><img src="udo_lf.gif" alt="CDR 400" border=0 width="24" height="24"></a>
<a href="070203.htm" target="UDOcon"><img src="udo_rg.gif" alt="Yamaha CDRW 6416" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
