<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: TV Modulator
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="080203.htm" target="UDOcon"><img src="udo_lf.gif" alt="RGB-Konverter" border=0 width="24" height="24"></a>
<a href="0804.htm" target="UDOcon"><img src="udo_rg.gif" alt="ScreenEye" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="TV_20Modulator">8.3 TV Modulator</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Der TV-Modulator im Falcon </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Im Atari <a href="0302.htm" target="UDOcon">Falcon F030</a>, auch in anderen Atari Computern, befindet
sich ein TV-Modulator der das Videosignal und ein Gemisch aus linkem
und rechtem Stereo- Audiosignal mit einem (HF) hochfrequentem
Tr&auml;gersignal versieht damit beides &uuml;ber die Antennenbuchse
auf ein handels&uuml;bliches TV-Ger&auml;t &uuml;bertragen werden
kann.
<br>
</p>
<p>Dazu gibt es verschiedene Ausf&uuml;hrungen.
<br>In USB geschieht dies mit dem NTSC-Verfahren w&auml;rend in Europa
das hier gel&auml;ufige PAL-Verfahren benutzt wird. Einzelne
SECAM-Ger&auml;te soll es auch gegeben haben.
<br>
</p>
<p>Der jeweils verwendete Modulator ist ein fertiges Modul dessen
Innenleben uns nicht interessiert da dies weder einfach zu Reparieren
noch einfach Abzugleichen ist. Hat der TV-Modulator einen defekt
sollte dieser stets nur komplett Ersetzt werden. Es ist nur
ausschliesslich so zu Gew&auml;hrleisten das dieses Modul andere
TV-Empf&auml;nger nicht st&ouml;rt. Um das innere Reparieren zu
k&ouml;nnen sind umfangreiche Kenntnisse in HF-Technik erforderlich.
<br>
</p>
<p>Der TV-Modulator sitzt im Falcon, an dessen R&uuml;ckwand und ist
anhand der runden RCA-Buchse zu erkennen. Es kann hier ausschliesslich
ein hochfrequentes Antennensignal entnommen werden wenn am Falcon
-kein- weiterer Monitor angeschlossen ist. Beide Monitordetect Pin
sind dabei offen, also nicht auf GND geschaltet.
<br>
</p>
<p>Das Verfahren ist &uuml;ber die Monitordetect Pin Mo und M1 am 19
poligen Monitoranschlu&szlig; des Falcon geregelt. Nur wenn beide Pin
-nicht- belegt sind bootet der Falcon im TV Modus und ist in der Lage
&uuml;ber den TV-Modulator eine Bild- und Tonausgabe zu initieren.
Beide Signale sind jedoch &auml;usserst schlecht und eignen sich
ausschliesslich f&uuml;r einige RGB-Spiele oder Demos.
<br>
</p>
<p>
<br>
<br><b> Die Anschl&uuml;sse </b>
<br>
</p>
<p>Pin 1 am Modulatoranschlu&szlig; ist die Versorgungsspannung von
+5 Volt.
<br>
</p>
<p>R601 ist mit 10 Ohm ein Schutzwiderstand und dient der
Strombegrenzung. R601 liegt direkt in der Zuleitung des Modulators und
brennt durch wenn der Modulator einen internen defekt hat. Pin 3 am
Modulator ist der Audioanschlu&szlig; welcher dem Modulator das
gemische aus L+R Stereo aus dem Audioteil (AUDIO) direkt zuf&uuml;hrt.
Das Audiosignal wird im Modulator auf den HF-Tr&auml;ger aufmoduliert,
mit einer ZF von 4.5Mhz, wie bei PAL &uuml;blich.
<br>
</p>
<p>Pin 2 bringt das PAL-Videosignal dem bereits auch das Horizontal-
und das Vertikale Synconisationssignal aufgemischt wurde. Aus dem im
Rechner vorhandenen HSYNC und VSYNC wird ein Signalgemisch gebildet
das &uuml;ber den Jumper W10, er sollte auf 2+3 gesteckt sein, der
Vorbereitung des TV-Signals dient.
<br>
</p>
<p>U18 (MC1377) bereitet aus den Farbinformationen R, G und B
zusammen mit dem Syncronisationssignal ein FBAS-Videosignal das an Pin
13 von U18 ansteht. &Uuml;ber C62 (2.2uF) und R108 (120 Ohm) sowie dem
Filter L61, Pin 5 und 4, wird das FBAS-Signal &Uuml;ber einen
Spannungsteiler, bestehend aus R45, R48 und R47 Pin 2 des Modulators
zugef&uuml;gt.
<br>
</p>
<p>Das Signal ist an dieser Stelle fertig um es an einem
FBAS-Videomonitor benutzen zu k&ouml;nnen.
<br>
</p>
<p>In einem NTSC-Falcon entfernen Sie die Widerst&auml;nde R104 und
R105 um ein PAL-Konformes Ausgangssignal zu erhalten. U18 ist in der
Lage entweder NTSC oder PAL zu erzeugen.
<br>
</p>
<p>In Falcon die nie einen Modulator enthalten haben finden Sie einen
Transistor mit der Bezeichnung Q1 (2N3904)
<br>
</p>
<p>Ein schlechtes TV-Bild hat zumeist einen schlechten Modulator als
Grundlage. In sehr wenigen F&auml;llen liegt das Problem an U18 und
dessen Aussenbeschaltung.
</p>
<p>Gar kein Videosignal hat auch oft zur Ursache das keine +12V
vorhanden sind!
<br>&Uuml;berpr&uuml;fen sie das am <a href="0f01.htm" target="UDOcon">Netzteil</a>!
<br>
</p>
<p>Die beste Testm&ouml;glichkeit ist das FBAS-Signal von Pin 13
einem Videomonitor zuzuf&uuml;hren und dies auf Sch&auml;rfe,
Bildhelligkeit und Kontrast zu testen.
<br>Ist das Signal hier in Ordnung tauschen Sie den Modulator.
<br>
</p>
<p>Ist das Signal hier nicht in Ordnung &uuml;berpr&uuml;fen Sie die
passiven Bauteile, besonders die verwendeten Kondensatoren.
Kapazit&auml;tsmessbr&uuml;cke!
<br>
</p>
<p>C73 (2.2nF), R107 (1.6K), C60 (58pF), die beiden letzten Bauteile
haben in NTSC-Ger&auml;ten andere Werte!, ferner die Bauteile:
C81,C80, C70, C75, C69 mit 0.1uF bzw. 0.01uF Kapazit&auml;t. R70
sollte 5.6K gro&szlig; sein, Notfalls hier etwas vaarieren. C71
mu&szlig; 1nF Kapazit&auml;t haben. C51, C87 ,C72 haben jeweils 15uF.
&Uuml;ber diese Kondensatoren wird jeweils das R-, G- und B-Signal
zugef&uuml;hrt.
<br>
</p>
<p>Besonders bei schlechten Farben oder unecht wirkenden Farben sind
diese -drei- Kondensatoren zu ersetzen. Und es sind dabei alle drei
gleichzeitig gemeint. Drei mal exakt den gleichen Kondesator
verwenden! Hier gewinnt man nichts wenn man nur einen Ersetzt. Zumeist
ist es dann schlimmer als vorher.
<br>
</p>
<p>Wenn U18 exterm warm wird ist dieser Chip zu ersetzen.
<br>Die Bildstabilit&auml;t wird sich mit dem neuen Chip verbessern
<br>
</p>
<p>Im <a href="040101.htm" target="UDOcon">NVRAM</a> des Falcon kann TV-Konformes booten des Computers
eingestellt werden.
<br>Der neue Bootmode funktioniert ausschliesslich nach einen Reset
der <a href="0305.htm" target="UDOcon">Hardware</a>.
<br>
</p>
<p>
<br>
<br><b> HF-Signal </b>
<br>
</p>
<p>Der TV-Modulator moduliert das Signal, das vom MC1377 erzeugt
wurde, legiglich auf einen HF-Tr&auml;ger um es per Antenneneingang an
einem TV-Ger&auml;t benutzen zu k&ouml;nnen. Auch kommt der Ton erst
im Modulator zum Signal hinzu. Im &uuml;brigen ist der Sendekanal
UHF-Kanal 36. Oft auch VHF Kanal 14-16 bzw. VHF Low, auf Kanal 2-3.
Benutzen sie den Suchlauf am TV-Ger&auml;t.
</p>
<p>Schalten Sie AFC aus, verwenden sie bei schlechten Bild die
Feineinstellung am TV-Ger&auml;t. Zumeist erh&auml;lt man ein gutes
Bild und einen schlechteren Ton oder einen guten Ton und ein
schlechters Bild. Eine gute Qualit&auml;t beider Signale ist fast
ausgeschlossen.
<br>
</p>
<p>
<br>
<br><b> Die Schaltung.. </b>
<br>
</p>
<p>Zum MC1377 und dessen Aussenbeschaltung finden sich diverse
Informationen auf einschl&auml;gigen Webseiten im <a href="15.htm" target="UDOcon">Internet</a>. Daher
braucht hier nicht mehr gesagt werden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/mod.gif" border=0 width="600" height="400"></p><br>
<div align=center><tt> Abbildung 1 - MC1377 und HF-Modulator </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="080203.htm" target="UDOcon"><img src="udo_lf.gif" alt="RGB-Konverter" border=0 width="24" height="24"></a>
<a href="0804.htm" target="UDOcon"><img src="udo_rg.gif" alt="ScreenEye" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
