<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: ScreenEye
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="0803.htm" target="UDOcon"><img src="udo_lf.gif" alt="TV Modulator" border=0 width="24" height="24"></a>
<a href="080401.htm" target="UDOcon"><img src="udo_rg.gif" alt="ScreenEye + HandyCam" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="ScreenEye">8.4 ScreenEye</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>ScreenEye-Digitizer</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>&Uuml;ber den Falcon Video-Digitizer.
<br>
</p>
<p>Im Multimediazeitalter macht der Fortschritt selbst auch vor einem
Atari-Computer nicht halt. Dazu gab es schon vor langer Zeit bei
OverScan, Compo und der Firma Matrix das ScreenEye f&uuml;r den Atari
<a href="0302.htm" target="UDOcon">Falcon F030</a>.
<br>Das ScreenEye ist ein Echtzeitdigitizer der auf den internen
Erweiterungsport des Falcons gesteckt wird und z.B auch auf einer
bereits vorhandenen <a href="0b03.htm" target="UDOcon">FX-Karte</a> o.&Auml; gut arbeitet.
<br>
</p>
<p>Ein &auml;hnliches Ger&auml;t ist &uuml;brigens der Expose', ein
Digitizer mit den ann&auml;hernd gleichen technischen Daten, der in
U.K z.B &uuml;ber die Firma Titan Ltd. bezogen werden kann. Das ist
die gleiche Firma (Black Scorpion Software) die auch APEX-Multimedia
herstellt.
<br>
</p>
<p>Laut Hersteller kann der Expose' PAL und NTSC !
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/expose2.gif" border=0 width="153" height="44"></p><br>
<div align=center><tt> Abbildung 1 - Expose' Digitizer</tt>
</div>
<p>
<br>
<br>
</p>
<p>Es f&auml;llt mir niemand ein der einen Expose' hier jemals
Angeboten h&auml;tte, so wie es auch mit vielen anderen Dingen auch so
ist.
<br>
</p>
<p>Ansonsten k&ouml;nnen Sie sich bei Titan Design &uuml;ber den
Expose' Digitizer jederzeit Informieren. Die Adresse, die
Telefonnummer sowie die EMail-Adresse k&ouml;nnen Sie unter
<a href="1604.htm" target="UDOcon">H&auml;ndler</a> finden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/expose1.gif" border=0 width="320" height="320"></p><br>
<div align=center><tt> Abbildung 2 - Screenshot mit dem Expose'-Digitizer</tt>
</div>
<p>
<br>
<br>
</p>
<p><tt>Technische Daten Expose' Digitizer</tt>
</p>
<p>ScreenEye und das teuerere ScreenEye+ unterscheiden sich nur
dadurch das ScreenEye+ eine etwas h&ouml;here Bildaufl&ouml;sung, bei
gleicher Bildqualit&auml;t, bringt. Unterschiede von der Platine her
sind mir nicht bekannt.
<br>
<br>
</p>
<p><b> technische Daten/Aufl&ouml;sung </b>
<br>
<br>
</p>
<dl>
<dt><b>Maximales Videooutput</b></dt><dd> 1024 x 768
<br>&nbsp;
<dt><b>Videoeingang</b></dt><dd> S-Video, Composit-Video (Nur mit FalCAM Tripod)
<br>&nbsp;
<dt><b>Signal Typ</b></dt><dd> PAL / NTSC
<br>&nbsp;
<dt><b>Maximale Aufl&ouml;sungen</b></dt><dd> 512 x 320 in 16 Bit TrueColor
<br>
<br>&nbsp;
<br>Animation (Real Time) :
<br>512 x 256 mit 6 Bilder pro Sekunde
<br>256 x 160 mit 17 Bildern pro Sekunde
<br>128 x 80 mit 25 Bildern pro Sekunde
<br>
<br>&nbsp;
<dt><b>Interface</b></dt><dd> Interner Erweiterungsbus
<br>&nbsp;
<dt><b>Einstellm&ouml;glichkeiten</b></dt><dd> Helligkeit, Kontrast, Farbe, Syncron., NTSC Hue
<br>&nbsp;
<dt><b>Bildspeicher</b></dt><dd> 512Kb statisches RAM
<br>&nbsp;
<dt><b>Videoausgang</b></dt><dd> R,G,B - Syncron getrennt
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Wobei zwei Erweiterungen, also z.B ein <a href="0b04.htm" target="UDOcon">Afterburner</a> und ein
Screeneye &uuml;bereinander leider nicht mehr in das originale
Geh&auml;use passen. Ein Tower oder ein <a href="0d02.htm" target="UDOcon">Desktopper</a> l&ouml;st auch
dieses Problem. Ein <a href="0b04.htm" target="UDOcon">Afterburner</a> alleine passt ja so schon nicht mehr.
Auch mit einer <a href="0b03.htm" target="UDOcon">FX-Karte</a> reicht der Platz unter dem <a href="0c02.htm" target="UDOcon">Keyboard</a> gerade
eben..
<br>
</p>
<p>Das Screeneye nutzt die volle Bandbreite es internen
Expansionsports aus. Selbst wenn die Karte auf den ersten Blick nicht
diesen Eindruck vermittelt. Ein hochintegrierter Chipsatz macht diese
Leistung auf kleinstem Raum m&ouml;glich. Das ScreenEye ist relativ
flexibel und kann jederzeit durch reine Software-Updates auf den
neuesten Stand gebracht werden. Es ist hier sozusagen nichts fest
verdrahtet.
<br>
</p>
<p>
<br>
<br>
</p>
<div align=center><tt> Die Videomodes des ScreenEye </tt>
</div>
<p align=center><img src="image/screenmo.gif" border=0 width="474" height="277"></p><br>
<p>
<br>
<br>
</p>
<p><b> Zum Einbau des Digitizers </b>
<br>
</p>
<p>Der Einbau eines ScreenEye in den Falcon ist relativ einfach.
Sofern keine weiteren Erweiterungen einzubauen sind kann man das nach
dem &ouml;ffnen des F030 in ca. 5 min erledigt haben. Der interne
Erweiterungsport des Falcon liegt unter der Tastatur von vorne gesehen
direkt vor dem Netztteil. Die beiden Stiftleisten tragen die
Bezeichnung J20 und J16 wobei letztere die 50 polige Stiftleiste
darstellt.
<br>Auf der kurzen Leiste, also J20, steckt ein Jumper der auch nach
einem sp&auml;teren Entfernen des ScreenEyes dort wieder gesteckt
werden mu&szlig; um den F030 betreiben zu k&ouml;nnen. Die Stelle ist
an der Stiftleiste mit einem wei&szlig;en &quot;U&quot; markiert.
Bewaren Sie diesen Jumper bitte gut auf.
<br>
</p>
<p>Sollten man einen Falcon besitzten bei dem die Stelle nicht
markiert ist sollte man das vorher mit einem wasserfesten Filzstift
auf jeden Fall nachholen. Nach dem man also den Rechner ge&ouml;ffnet
hat, den l&auml;stigen oberen Teil des Blechverschlages sowie das
<a href="0c02.htm" target="UDOcon">Keyboard</a> entfernt hat kann man die Erweiterungsstiftleisten direkt
sehen. Hier wird das ScreenEye Pingleich leicht auf die Stiftleisten
gelegt. Es ist zu beachten das die Buchsenleisten des ScreenEyes genau
Deckungsgleich mit den Stiftleisten des Falcons sind. Also nicht um
etwa einen oder mehrere Pins versetzt!
<br>
</p>
<p>Ist man sich sicher das das nicht der Fall ist wird das ScreenEye
gleichm&auml;ssig ca. 10mm tief auf die Stiftleisten gedr&uuml;ckt.
Alle Pins sollten nun richtig und gerade gesteckt sein. Zu den
Stiftleisten gibt es noch eine Bemerkung. Sollte man Erweiterungen auf
ein bereits eingestecktes ScreenEye aufstecken wollen kann man hier
die entsprechenden Buchsenleisten Pingleich aufl&ouml;ten. Zugegeben
eine schwierige Arbeit die aber mit ein wenig Gedult und gutem
Werkzeug leicht zu bew&auml;ltigen ist. Beachten Sie auch hierbei den
Jumper!
<br>
</p>
<p>Solche Buchsenleisten bekommt man nur in guten
Fachgesch&auml;ften!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/screen01.gif" border=0 width="515" height="155"></p><br>
<div align=center><tt>Abbildung 3 - Screeneye im eingebauten Zustand </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Am ScreenEye befindet sich eine d&uuml;nne abgeschirmte Leitung an
deren Ende sich ein Chinchstecker befindet. Das ist die
Videozuleitung. Da mir die Sache mit raush&auml;ngenden Kabel aus
irgendwelchen Computern zwischen Rom- und <a href="0c0c.htm" target="UDOcon">Paddleport</a> noch nie gefallen
hat habe ich dieses Kabel einfach so gek&uuml;rzt das es bequem bis
zur R&uuml;ckwand des Falcon reicht. (original Geh&auml;use!) Man
sucht sich hier eine passende Stelle f&uuml;r eine normale
Chinch-Einbaubuchse die man hier noch sch&ouml;n Einbauen kann. Das
Kabel vom ScreenEye wird mit dieser Buchse verl&ouml;tet. Die
Abschirmung des Kabels sollte dabei mit dem &auml;usseren Rand der
Chinchbuchse in Verbindung kommen. So erh&auml;lt man einen externen
Videoeingang und kann auf das am <a href="0c09.htm" target="UDOcon">Romport</a> raush&auml;ngende Kabel
verzichten. Der <a href="0c09.htm" target="UDOcon">Romport</a> w&auml;re die einzigeste Stelle an der man den
Chinchstecker durch die L&uuml;cke am Geh&auml;use dr&uuml;cken kann
:/
<br>
</p>
<p>Demensprechend l&auml;stig ist das Kabel dann auch wenn man in den
<a href="0c09.htm" target="UDOcon">Romport</a> eine Erweiterung einstecken m&ouml;chte. Das ScreenEye wurde
&uuml;brigens nur direkt f&uuml;r den Falcon entwickelt. Es
d&uuml;rfte somit nicht m&ouml;glich sein das Ger&auml;t an einem
anderen Computer zu betreiben.
<br>
</p>
<p>Weitere Arbeitsschritte fallen eigentlich keine an. Man braucht
nur noch den Treiber f&uuml;r das ScreenEye nach der Anleitung im
Autoordner installieren und es kann sofort mit dem Ger&auml;t
gearbeitet werden. Ist der Treiber nicht geladen ist diese Erweiterung
eigentlich f&uuml;r den restlichen Computer uninteressant, bleibt
lediglich die Tatsache das durch das einstecken des ScreenEyes bereits
der Bus verl&auml;ngert wird. Hierzu sollte man sich mal den F030
ClockPatch n&auml;her ansehen. Die genaue Beschreibung dar&uuml;ber
ist in DOITF030 zu finden.
<br>
</p>
<p>Es kann hier jedes g&auml;ngige Composit-Videosignal am ScreenEye
angelegt werden so wie es z.B von CamCordern, Videorecordern oder
Spielkonsolen erzeugt wird. Es ist *kein* Antennenanschlu&szlig;! Es
kann allerdings &uuml;ber z.B einen Videorecorder ein live TV-Bild in
einem Fenster auf dem <a href="030505.htm" target="UDOcon">Desktop</a> mitlaufen.
<br>
</p>
<p>Zum Anschlu&szlig; an eine Scartbuchse sollte man sich einen
passenden Adapter l&ouml;ten. Auch das ist kein gro&szlig;es Problem.
Hier kann man gleich die Audioanschl&uuml;sse mitbelegen. Das Programm
SOUND_TRUE erm&ouml;glicht es z.B auch das Stereo-Audiosignal einer
Videoquelle aus denem am Falcon angeschlossenen Aktivboxen in
aussreichernder Qualit&auml;t wiederzugeben.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/screeney.gif" border=0 width="378" height="310"></p><br>
<div align=center><tt>Abbildung 4 - Euro-Scartadapter f&uuml;r das ScreenEye (inkl.
<a href="0907.htm" target="UDOcon">Audio</a>) </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>GND kann noch mit dem Blechschirm des Scartsteckers verl&ouml;tet
werden.
<br>
</p>
<p>An den Kabelenden mu&szlig; hier nur jeweils die entspechende
Steckverbindung angel&ouml;tet werden. IdR d&uuml;rften das hier wohl
Chinch- oder 3.5 mm Klinkenstecker werden. Nur die passen in die
Soundbuchsen am Falcon sofern diesen nicht schon nach meinem Tip durch
Chinchbuchsen ersetzt wurden. Siehe DOITF030-Archiv.
<br>Das ScreenEye besitzt auf seiner Platine neben diesen Eingang
offensichtlich noch zwei weitere Eing&auml;nge die man Umschalten
kann.
<br>
</p>
<p>Grafikprogramme mit GPDS-Unterst&uuml;tzung k&ouml;nnen jederzeit
von einem eingebauten ScreenEye profitieren bzw. Bilder direkt
&uuml;bernehmen. APEX-Multimedia unterst&uuml;tzt das ScreenEye direkt
sofern dessen Treiber geladen ist. Es kann hier also direkt in APEX
digitalisiert werden um das Ergebniss sofort weiterbearbeiten zu
k&ouml;nnen. Hier hat man ebenso wie mit der original
ScreenEye-Software die M&ouml;glichkeit komplette &quot;Filme&quot;
aufzuzeichenen. Bei APEX sogar direkt im beliebten .FLH /.FLI-Format,
jederzeit jedoch bei beiden L&ouml;sungen auch im Einzelbild.
<br>
</p>
<p>In beiden Programmen ist die L&auml;nge eines Films direkt und
analog vom zur Verf&uuml;gung stehendem Speicherplatz abh&auml;nging.
APEX hat arge Probleme beim Digitalisieren in virtuelles- oder
FastRam. Die Funktion wird hier meistens nach wenigen Bilder
abgebrochen kann aber sofort wieder gestartet werden. Gut wer hier
einen Rechner mit 14Mb Ram benutzten kann.
<br>Beim FastRam gehen nat&uuml;rlich Sequenzen verloren. Man wird
sehen wie APEX das in der zu erwartenden Release 3 Handhaben wird.
<br>
</p>
<p>Zum ScreenEye gibt es ein Developer-Kit mit dem man die
M&ouml;glichkeit sich eigene Treiber ect. selber zu Programieren. Das
ganze ist in &quot;C&quot; und kann von guten Programmierern direkt
mit PURE-C erledigt werden.
<br>Die Software zum Expose' habe ich leider noch nie gesehen,
scheinbar gibt es hier auch keine Demo-Version wie beim ScreenEye. Von
OverScan ist zu erfahren das eine neuere Ausgabe der
ScreenEye-Software in Vorbereitung ist, vieleicht wecken hier einige
Nachfragen danach ein gesteigertes Intresse.
<br>
</p>
<p>Das ScreenEye bzw. die Software dazu erlaubt das Speichern der
digitalsierten Bilder in folgenden Format:
<br>
<br>
</p>
<dl>
<dt><b>- .TGA</b></dt><dd> Targa 16 Bit, 16 Bit reine Farbdaten.
<br>&nbsp;
<dt><b>- .JPG</b></dt><dd> 15 Bit expandiert auf 24 Bit, sehr Kompakt.
<br>&nbsp;
<dt><b>- .FLM</b></dt><dd> Einfaches schnelles Format, keine Kompression.
<br>&nbsp;
<dt><b>- .TIC</b></dt><dd> TIFF-Block, 15 Bit expandiert auf 24 Bit.
<br>&nbsp;
<dt><b>- .TIF</b></dt><dd> TIFF-Datei, 24 Bit nur im Vollbildmodus, also TrueColor.
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Hier findet man sicher f&uuml;r jede Anwendung ein brauchbares
Format. Diese Formate k&ouml;nnen jederzeit mit anderen Programmen
konvertiert werden. Die meisten digitalisierten Bilder in DOITF030
sind auf diesem Weg entstanden, zumindest f&uuml;r 4 Jahre, solange
ich ein ScreenEye eingebaut hatte. Ein 24Bit-Vollbild belegt idR ca
1.2 Mb auf der Festplatte, man sollte hier also ausreichend
Festplattenplatz frei haben.
<br>Verwendet man z.B das .JPG-Format wird man auch den neuen
.JPG-Decoder mitladen, h&auml;ufig wird hierdurch die Ladezeit der
Bilder oder eines Films der aus Einzelbildern besteht jeweils um die
H&auml;lfte reduziert.
<br>
</p>
<p>Ich hoffe das ich Euch hier auf diesem Weg eine weiterere
interessante Anwendung f&uuml;r den Falcon ein St&uuml;ck n&auml;her
bringen konnte. Weitere M&ouml;glichkeiten bestehen z.B im
&quot;Snappen&quot; von Bildern aus einem laufenden TV-Film, dem
Nachbearbeiten und das erneute Einspielen auf eigene VHS-B&auml;nder.
<br>Hierzu sollte man allerdings das Bildformat genau im Auge
behalten. Hier scheint das Format des ScreenEye+ besser geeignet zu
sein. Ich hege die Hoffnung das OverScan (Hallo Rainer :-) hier noch
ein paar gute Features zulegen kann.
<br>Rainer sollte ebenso an einer neuen Ausgabe der originalen
ScreenEye-Software arbeiten. Gelegentliche Anfragen deswegen
k&ouml;nnten also nicht Schaden. Im eigenen Intresse :-&gt;
<br>
</p>
<p>
<br>
<br>
</p>
<p>Expose' Picture (c) Titan Design Ltd UK
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li> 8.4.1 <a href="080401.htm" target="UDOcon">ScreenEye + HandyCam</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="0803.htm" target="UDOcon"><img src="udo_lf.gif" alt="TV Modulator" border=0 width="24" height="24"></a>
<a href="080401.htm" target="UDOcon"><img src="udo_rg.gif" alt="ScreenEye + HandyCam" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
