<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: ScreenBlaster
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="0805.htm" target="UDOcon"><img src="udo_lf.gif" alt="Videoregister" border=0 width="24" height="24"></a>
<a href="080601.htm" target="UDOcon"><img src="udo_rg.gif" alt="BlowUp Hardware" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="ScreenBlaster">8.6 ScreenBlaster</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> ScreenBlaster - Aufl&ouml;sungserweiterung</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Den ScreenBlaster gibt es f&uuml;r den Atari <a href="0302.htm" target="UDOcon">Falcon F030</a> seit
geraumer Zeit.
<br>Es gibt das Ger&auml;t als externe Ausf&uuml;hrung welches
zwischen F030 und einem <a href="080102.htm" target="UDOcon">Monitoradapter</a> angesteckt wird. Ebenso kann
man eine Version f&uuml;r den internen Einbau erhalten. Bei der
externen Steckerversion fallen keinerlei L&ouml;tarbeiten an,
w&auml;hrend dessen die interne Version, das Modul, von Leuten mit
L&ouml;terfahrung eingebaut werden sollte.
<br>
<br>
</p>
<p><b>Eine Tabelle mit einem Teil der erreichbaren
Videoaufl&ouml;sungen.</b>
</p>
<pre>
 Aufl&ouml;sung     Farben    Hor.Khz    Vert. Khz   Interlaced
 __________________________________________________________

 800 * 608      2-4        48          77       no
1280 * 960      2-4        31          64       interlace
1152 * 832       16        38          87       interlace
1024 * 656       16        42          61
 720 * 512      256        38          70
 800 * 608      256        35          55
 800 * 408      256        15          60       interlace
 800 * 576       TC        15          50       interlace
 480 * 400       TC        30          72
 480 * 480       TC        30          58
 __________________________________________________________

</pre>
<p>S&auml;mtliche Einstellungen werden bei beiden ScreenBlaster
Modellen bequem mit einer GEM-Software vorgenommen. Hierzu gibt es
einen VideoMode-Generator in dem man tunlichst genau die Daten seines
VGA/SVGA oder MultiSync-Monitors einstellen sollte.
<br>
</p>
<p>Es l&auml;uft aber auch z.B <a href="1304.htm" target="UDOcon">Videlity</a> von Titan Design LTD
problemlos mit dieser <a href="0305.htm" target="UDOcon">Hardware</a>
<br>
</p>
<p>Die ScreenBlaster-Software l&auml;sst unter normalen
Umst&auml;nden keine &Uuml;ber- oder Unterschreitung der eingegeben
Monitorfrequenzen zu. Die SBIII-Software besitzt hier einen
Sicherheitsmechanismus. Auf der Diskette befinden sich zu den
verschiedensten Monitortypen bereits einige Voreinstellungen die den
eigenen Bed&uuml;rfnissen leicht angepasst werden k&ouml;nnen.
<br>
</p>
<p>Wichtig ist das man beachtet das jeder Monitor andere Horizontal-
bzw. Vertikalfrequenzen ben&ouml;tigt. Werden hier die Bereiche grob
&uuml;berschritten sind Besch&auml;digungen der Monitorhardware nicht
ausgeschlossen. Die ScreenBlaster-Software hat daher eben
Schutzmechanismen die man auch nicht abschalten sollte, obwohl das mit
einem Mausklick m&ouml;glich ist.
<br>
</p>
<p>Die externe SB-<a href="0305.htm" target="UDOcon">Hardware</a> wird einfach durch Aufstecken auf die
Monitorbuchse des Falcons installiert. Der DB15 am Ende des
Flachbandkabels kommt in eine der beiden <a href="0c0c.htm" target="UDOcon">Paddleport</a>-Buchsen auf der
linken Seite des F030. In welche bleibt Ihrer Wahl &uuml;berlassen.
Mein SBIII steckt in Port &quot;B&quot; da ich <a href="0c0c.htm" target="UDOcon">Paddleport</a>
&quot;A&quot; f&uuml;r ein JAGUAR-Pad und einen Videotext-Decoder
nutze. Die Pinbelegung des Flachbandkabels des externen
ScreenBlaster-Moduls ist wie folgt:
<br>
</p>
<pre>
Joypad Anschlu&szlig;pin    ScreenBlaster Signal  Falcon Chip
-------------------------------------------------------
Pin 1                 Pad A  U61 Pin 8 U66 Pin 9   Data
Pin 2                 Pad A  U61 Pin 6 U66 Pin 6   Data
Pin 3                 Pad A  U61 Pin 4 U66 Pin 5   Data
Pin 4                 Pad A  U61 Pin 2 U66 Pin 2   Data
Pin 7                 Pad A  +5 Vcc
Pin 9                 Pad A  GND

Pin 1                 Pad B  U61 Pin 17 U66 Pin 19 Data
Pin 2                 Pad B  U61 Pin 15 U66 Pin 16 Data
Pin 3                 Pad B  U61 Pin 13 U66 Pin 15 Data
Pin 4                 Pad B  U61 Pin 11 U66 Pin 12 Data
Pin 7                 Pad B  +5 Vcc
Pin 9                 Pad B  GND
</pre>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sbiii.gif" border=0 width="170" height="127"></p><br>
<div align=center><tt>Abbildung 1 - ScreenBlaster III externes Modul</tt>
</div>
<p>
<br>
<br>
</p>
<p>Das interne ScreenBlaster Modul kann nur mit vier L&ouml;tpunkten
im <a href="0302.htm" target="UDOcon">Falcon F030</a> eingebaut werden. Das ist leider Unumg&auml;nglich.
Hierzu mu&szlig; der Rechner ge&ouml;ffnet werden, <a href="0f01.htm" target="UDOcon">Netzteil</a> und
Diskettenlaufwerk verbleiben hierzu an Ihrem Platz. Die interne
IDE-Festplatte mu&szlig; abgeschraubt werden. Beachten Sie hier bitte
das das Flachbandkabel nicht besch&auml;digt wird. Einige
L&ouml;tstellen f&uuml;r das Modul befinden sich unter dem
Montagewinkel dieser Festplatte. Im Handbuch zum ScreenBlaster steht
zu diesem Abschnitt unter Punkt 5 das man das Kabel der <a href="060402.htm" target="UDOcon">IDE-Platte</a> von
der Festplatte oder der Falconplatine abziehen sollte. Das IDE-Kabel
war in einem F030 leider mit der Hauptplatine fest verl&ouml;tet, ich
rate hier nur leicht zu ziehen! Sehr schnell ist das Platinenstecker
durch ruppiges ziehen an der Leitung besch&auml;digt. Die <a href="060402.htm" target="UDOcon">IDE-Platte</a>
wird nicht mehr korrekt arbeiten. Ziehen Sie daher immer das Kabel nur
an der Festplatte selber ab! Markieren Sie sich bitte vorher die
Position des Steckers einfach mit einem Filzschreiber!
<br>
</p>
<p>Lesen Sie alle Einbauschritte in Ihrem ScreenBlasterIII-Handbuch
nach!
<br>
</p>
<p>Es gibt f&uuml;r das internen Modul vier Leitungen die mit der
Hauptplatine des Falcon verl&ouml;tet werden. Beachten Sie hier die
genauen Bezeichungen und die Polarit&auml;t dieser Bauteile!
<br>
</p>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<div align=center>Achten Sie in jeder Lage auf sauberes L&ouml;ten!
<br>Nur so kann ein sicher Betrieb gew&auml;hrleistet werden.
<br>Nehmen Sie sich Zeit f&uuml;r den Einbau!
<br>
</div>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>
<br>
<br>
</p>
<p><b>Die einzelnen L&ouml;tpunkte des internen ScreenBlasters</b>
</p>
<pre>
L&ouml;tpunkt    Drahtfarbe    Signal       Bauteil      Pin
__________________________________________________________

  A                        GND         Elko C147    -
  B                        +5 Volt     Elko C147    +
  C                        Videl       SMD-IC U34   Pin 14
  D                        ACIA        IC6850 U52   Pin  5
___________________________________________________________

</pre>
<p>Beachten Sie auch die Bilder im SBIII-Handbuch!
<br>Die Leitung welche zum VIDEL Pin 14 f&uuml;hrt sollte man relativ
kurz halten um St&ouml;rungen zu vermeiden. Vermeiden Sie mechanischen
Zug an dieser Leitung. Die L&ouml;tstelle am VIDEL w&uuml;rde
abreissen und somit die Platine besch&auml;digen. L&ouml;ten Sie nur
Haarfein am VIDEL-Chip, wenn m&ouml;glich lieber vor dem
Anschlu&szlig;pin auf die Leiterbahn an der Sie zu diesem Zweck den
Schutzlack ein wenig abkratzen. Ist der erste Test erfolgreich
fixieren Sie diese L&ouml;tstelle am besten mit Wachs oder eben einen
Tropfen Hei&szlig;kleber. Das ist der sicherste Weg.
<br>
</p>
<p>Bei beiden Installationen, intern oder extern, sollte sich der
Rechner nach dem Einschalten ganz wie gewohnt mit dem <a href="030505.htm" target="UDOcon">Desktop</a> melden.
Tut er das nicht haben Sie vermutlich den Pin 14 des VIDEL von der
Leiterbahn getrennt. Erst nachdem die Software installiert wurde, nach
einen neuen Bootvorgang werden die neuen, h&ouml;heren
Bildschirmaufl&ouml;sungen zur Verf&uuml;gung stehen.
<br>
<br>
</p>
<p align=center><img src="image/screenin.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 2 - ScreenBlaster III internes Modul</tt>
</div>
<p>
<br>
</p>
<p>Sollte sich der Falcon nicht melden schalten Sie das Ger&auml;t
sofort aus.
<br>&Uuml;berpr&uuml;fen Sie alle Ihre Arbeitsschritte die Sie
ebenfalls im Handbuch gelesen haben sollten. Richten Sie ihr Augenmerk
in der Hauptsache auf Pin 14 vom VIDEL.
<br>
</p>
<p>Die Software zu beiden Modulen ist sehr &uuml;bersichtlich und
erkl&auml;rt sich fast von selber. Jeden neu gefundenen Modus kann man
innerhalb der SBIII-Software testen ohne jeweils neu Booten zu
m&uuml;ssen. Das ist eine sehr komfortable Art seinen Bildschirm
einzurichten.
<br>
</p>
<p>SBIII arbeitet jederzeit mit dem SM124 und kompatiblen
Ger&auml;ten. Ebenso wird auch der SM1224 als RGB-Monitor
unterst&uuml;tzt. F&uuml;r viele der &uuml;blichen VGA, SVGA und
MultiSync-Monitore befinden sich im Lieferumfang der Software bereits
einige brauchbare Videosettings. TV-Ger&auml;te oder Genlocks
k&ouml;nnen ebenfalls verwendet werden.
<br>Achten Sie peinlich darauf das Sie mit SB_MONI.PRG genau die
technischen Daten angeben die Sie in dem Handbuch des entsprechenden
Monitors finden werden.
<br>
</p>
<p>Falsche Angaben k&ouml;nnen hier schnell zur Zerst&ouml;rung des
Monitors f&uuml;hren! Moderne VGA-Monitore besitzen idR eine
Schutzschaltung die vor dem gef&uuml;rchteten Abrauchen des
Zeilentransformators sch&uuml;tzen sollte. Man l&auml;sst es eben
nicht darauf ankommen.
<br>
</p>
<p>Sichern Sie alle Einstellungen auch als BackUp.
<br>
</p>
<p>Der ScreenBlaster ist eine sehr brauchbare Erweiterung zum Falcon
F030. In welcher Ausf&uuml;hrung auch immer, leicht Einbaubar und
&Uuml;bersichtlich.
<br>
</p>
<p>
<br><b> ScreenBlaster und MagiC5</b>
</p>
<p>Bei der Benutzung von MagiC5 auf dem FalconF030 sollte f&uuml;r
einen sicheren Betrieb folgende Reihenfolge im Autoorder eingehalten
werden:
<br>
<br>
</p>
<pre>
C:\AUTO

   MAGXBOOT        # Der Booter von MagiC5
   FXDRIVE         # Sollte eine <a href="0b03.htm" target="UDOcon">FX-Karte</a> eingebaut sein
   NVDI 4.11       # oder jede andere Release von NVDI
   METADOS         # CD.ROM Treiber sofern ein <a href="0701.htm" target="UDOcon">CD-ROM</a> vorhanden ist
   SB_AUTO         # Der Treiber f&uuml;r ScreenBlaster 3

   Und ab hier der gesammte Rest welche noch geladen werden sollte.
   Die Reihenfolge der .ACCs spielt keine Rolle.
   MAGXBOOT.PRG f&uuml;hrt nach dem Laden ein Reset durch.
   Alle Programme werden dann noch einmal geladen.
   Um Zeit zu sparen kann man MAGXBOOT.PRG nat&uuml;rlich auch
   an erster Stelle im Autoorder haben.
   Hier beobachte ich allerdings am eigenen System immer wieder
   seltsames Verhalten. Die obenstehende Reihenfolge l&auml;uft
   bei mir seit langem sehr Problemlos.

</pre>
<p>Es mu&szlig; sichergestellt werden das die unter dem
ScreenBlaster3 verwendete Aufl&ouml;sung schon unter TOS 4.04 normal
auf dem Falcon gelaufen ist. Keine Aufl&ouml;sung verwenden bei der
der F030 schon am abkippen ist.
<br>
</p>
<p>Hier meine MAGX.INF f&uuml;r z.B 926*608*16 Farben und MagiC 5.20
<br>15&quot; VGA-Multiscan Monitor
<br>
<br>
</p>
<pre>
#_MAG MAG!X V5.20
#[vfat]
drives=
#[aes]
#_ENV AVSERVER=JINNEE
#_DEV 5 26
#_FLG 16
#_SCP C:\CLIPBRD\
#_TRM C:\GEMSYS\GEMDESK\VT52.PRG
#_ACC C:\
#_APP C:\GEMSYS\MAGIC\START\
; EASE wird neuer <a href="030505.htm" target="UDOcon">Desktop</a>: (von INSTALL.PRG eingetragen)
#_SHL C:\JINNEE\JINNEE.APP
#_ENV OLGAMANAGER=C:\GEMSYS\OLGA\OLGA.APP
#_CTR
#a000000
#b000000
#c7770007000600070055200505552220770557075055507703111103
#d
#K 4F 53 4C 00 46 42 43 57 45 58 00 00 00 00 #_DSK MAGXDESK V3.26 1
#_DSW 928 589 1 0 1 10 0111 0111111110100
#_DS2 1101 3 1 1 1 3 3 7 0 68 10
#_DEX BAT BTP
#_DWN 11 53 235 399 0 C:\*
#_DWN 180 20 296 281 0
#_DWN 200 30 300 160 0
#_DWN 220 40 300 160 0
#_DWN 240 50 300 160 0
#_DWN 260 60 300 160 0
#_DIC 1 A 8 0
#_DIC 1 C 96 0
#_DPG
#_DPG
#_DPG
#_DPG
#_DPG
#_DPP

</pre>
<p>Es mu&szlig; sichergestellt werden das der ScreenBlaster 3 die
gew&uuml;nschte Aufl&ouml;sung bei einem neuen booten auch wirklich
automatisch findet. Zum Einrichten sollte MagiC5 ohne alles unter z.B
16 Farben gestartet werden. Verwenden Sie nach dem Erscheinen des
Magic-Desk den Men&uuml;punkt &quot;Aufl&ouml;sung..&quot; um diese
oder eine &auml;hnliche Aufl&ouml;sung einzustellen. Vergessen Sie
nicht MAGX.INF auf jeden Fall neu abgespeichern! Achten Sie bitte
darauf das das auch wirklich passiert. Die MAGX.INF Datei speichert
man am besten direkt von MAGXDESK oder direkt vom <a href="030505.htm" target="UDOcon">Desktop</a>, der
Oberfl&auml;che eines beliebigen Desktops.
<br>
</p>
<p>Ordnen Sie die Reihenfolge Ihrer Autoordnerprogramm nach meinem
Beispiel.
<br>Notfalls durch Umkopieren.
<br>
</p>
<p>Booten Sie Ihren FalconF030 erneut.
<br>Sollten w&auml;hrend dem booten des ScreenBlasters bereits zwei
Bomben erscheinen und der SBIII wider erwarten nicht geladen werden
sollten Sie Ihre gew&uuml;nschte ScreenBlasteraufl&ouml;sung mit dem
VMG.PRG &uuml;berpr&uuml;fen und ggf. auch zu Sicherheit neu
Abspeichern. Warscheinlich wird es aber so sein das der SBIII seine
.SBR-Files nicht findet. Legen Sie einen Ordner C:/SB_RES/ an und
kopieren Sie ihre .SBR-Files direkt dahinein. Das passiert wenn man
z.B MetaDOS ziemlich fr&uuml;h in den Speicher des Rechner laden
l&auml;sst
<br>
</p>
<p>Es wurde hier der Ablauf beschrieben der es mir erm&ouml;glicht
MagiC5 und den SBIII auf bisher jedem <a href="0302.htm" target="UDOcon">Falcon F030</a> zu installieren. U.a
auch dann wenn auf diesem Rechner MetaDOS verwendet wird.
<br>
</p>
<p>Wenn es unter scheinbar keinen Umst&auml;nden zum laufen zu
bewegen ist sollten Sie sich eine Sicherheitskopie ihres
Bootlaufwerks, in den meisten F&auml;llen wohl das Drive
&quot;C:&quot; anlegen und alles wichtige auf ein leeres Medium, eine
Festplatte oder auf was immer kopieren.
<br>
</p>
<p>Direkt nach dieser Aktion l&ouml;schen sie das Laufwerk
&quot;C:&quot; komplett. Das geht am sichersten durch neu
Partitionieren mit HuSHI oder dem HHDriver. <b> Note: NUR DRIVE C !
</b> also nicht die gesammte Festplatte neu einrichten!!!
</p>
<p>Danach installieren Sie MagiC5 erneut von Diskette oder einer
Festplatte.
<br>
</p>
<p>
<br>
</p>
<pre>
- Stellen Sie fest das MagiC5 korrekt l&auml;uft.
- Installieren Sie danach den SBIII erneut von seiner original Diskette.
- Geben Sie f&uuml;r die .SBR-Files den Ordner C:/SB_RES/ an!
- Verwenden Sie keine einzige .INF-Datei aus Ihrem Backup!
- Booten Sie Ihren Falcon erneut.
- MagiC5 und SBIII sollten nun zusammen korrekt laufen.
- Sichern Sie die MAGX.INF neu aus MagDesk herraus nachdem Sie Ihre
  gew&uuml;nschte Bildschirmaufl&ouml;sung gefunden haben.
- Installieren Sie jetzt die EASE5 und den gesammten Rest.
- Holen Sie Ihre anderen wichtigen Programm zur&uuml;ck nach C:

</pre>
<p>
<br>
</p>
<p>Nach dieser Zugegeben einigermassen umst&auml;ndlichen Session war
es aber bisher m&ouml;glich den SBIII und MagiC5 zusammen auf mehr als
7 Falcons zur korrekten Zusammenarbeit zu bewegen. Das klappt auch mit
&auml;lteren Ausgaben des SB_AUTO.PRG
<br>Das SB_AUTO.PRG sollte hierbei aber mindestens in der Version 1.2
bereitliegen.
<br>
</p>
<p>&Auml;rgerlich ist die Tatsache das SBIII und MagiC bisher bei
jedem Update von MagiC diese Probleme hatten. Man kann nur hoffen das
hier bald ein Ausweg gefunden wird der die bereits genannten
Umst&auml;nde einspart.
<br>
</p>
<p>Selbst mit der neuen SBIII-Release 1.3 ist unter bestimmten
Bedingungen nicht immer ein sofortiger Erfolg garantiert. Nach dem
neuesten Update von MagiC 5.02 auf die Version 5.04 habe ich meine
gew&uuml;nschte Aufl&ouml;sung erst wieder bekommen nachdem ich die
von Installer angelegten MAGX.INF gel&ouml;scht hatte. Unter MAGDESK
habe ich mir dann meine Aufl&ouml;sung eingestellt und die .INF neu
gespeichert. Danach ging es auch bei einem erneuten <a href="030504.htm" target="UDOcon">Systemstart</a> von
alleine.
<br>
</p>
<p>Mit dem letzten MagiC Update auf die Release 5.20 hat es hier
jetzt gut geklappt, es musste nicht mal die MAGX.INF neu angelegt
werden
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li> 8.6.1 <a href="080601.htm" target="UDOcon">BlowUp Hardware</a></li>
<li> 8.6.2 <a href="080602.htm" target="UDOcon">BlowUp HardII</a></li>
<li> 8.6.3 <a href="080603.htm" target="UDOcon">Eclipse PCI Adapter</a></li>
<li> 8.6.4 <a href="080604.htm" target="UDOcon">New Videlity Pixelclock</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="0805.htm" target="UDOcon"><img src="udo_lf.gif" alt="Videoregister" border=0 width="24" height="24"></a>
<a href="080601.htm" target="UDOcon"><img src="udo_rg.gif" alt="BlowUp Hardware" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
