<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Novum Videosignalumschaltung
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0807.htm" target="UDOcon"><img src="udo_up.gif" alt="NOVA Grafikkarte" border=0 width="24" height="24"></a>
<a href="0807.htm" target="UDOcon"><img src="udo_lf.gif" alt="NOVA Grafikkarte" border=0 width="24" height="24"></a>
<a href="0808.htm" target="UDOcon"><img src="udo_rg.gif" alt="SM124 Monitor" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Novum_20Videosignalumschaltung">8.7.1 Novum Videosignalumschaltung</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Umschalter f&uuml;r die NOVA-Grafikkarte im Falcon</tt>
</p>
<div align=center>Beitrag von Werner Frey@D
<br>f&uuml;r DOITF030
<br>
<br>
</div>
<p><tt>Vorwort</tt>
</p>
<p>Alle in dieser Dokumentation genannten Namen k&ouml;nnen
eingetragene Warenzeichen sein. Selbstverst&auml;ndlich werden die
Rechte der Warenzeicheninhabern durch die Nennung nicht
beeinflu&szlig;t.
<br>Weiterhin sollte beachtet werden, da&szlig; Novum im Rahmen eines
<br>Bastelprojektes entstanden ist und damit kein Gewinn erzielt
werden soll.
<br>
</p>
<p><tt>Sinn und Zweck der Novum</tt>
</p>
<p>Novum ist dazu gedacht die Videosignale der Nova-Falcon und des
originalen Videoausgangs vom Atari Falcon 030 automatisch oder per
Software umzuschalten, damit das l&auml;stige umst&ouml;pseln des
Monitorsteckers oder der Anschlu&szlig; eines zweiten Monitors
entfallen kann.
<br>
</p>
<p>Selbstverst&auml;ndlich k&ouml;nnen mit Novum x-beliebige
Monitorsignale umgeschaltet werden. Die Software und die <a href="0305.htm" target="UDOcon">Hardware</a> ist
jedoch f&uuml;r den Betrieb mit der Nova-Falcon und dem Atari Falcon
030 optimiert.
<br>
</p>
<p><tt><a href="0204.htm" target="UDOcon">Installation</a></tt>
</p>
<p>Aus dem Geh&auml;use des Novum kommen zwei Kabel. Eines davon mit
einem Schalter dient zur Umschaltung der Videoausg&auml;nge. Das
andere Kabel wird fest im Falcon 030 installiert. Das rote Kabel wird
mit +5V, das schwarze Kabel mit Masse und das wei&szlig;e Kabel mit
dem Soundchip U17 Pin 15 verbunden. Das wei&szlig;e Kabel dient zur
Steuerung per Software. F&uuml;r einen ersten Test reicht es den Novum
lediglich mit Strom (rotes und schwarzes Kabel) zu versorgen.
<br>
</p>
<p align=center><img src="image/novum3.gif" border=0 width="477" height="345"></p><br>
<div align=center><tt>Abbildung 1 - Platinenausschnitt zur besseren
&Uuml;bersicht</tt>
</div>
<p>Tip: Wenn der Falcon einmal aufgeschraubt ist kann auch direkt das
wei&szlig;e Kabel angel&ouml;tet werden. :-).
<br>
</p>
<p>F&uuml;r den Anschlu&szlig; der Stromkabel eignet sich besonders
die MIDI-Acia MC 6850 U52. Das rote Kabel wird mit Pin 12 und das
schwarze Kabel wird mit Pin 1 verbunden. (Abb. 1)
<br>
</p>
<p>Wie und wo der Schalter eingebaut wird bleibt jedem selbst
&uuml;berlassen. Wenn jedoch der mitgelieferte Aufkleber verwendet
werden und die Beschriftung stimmen soll, so ist der Schalter so
einzubauen das das wei&szlig;e Kabel nach unten zeigt.
<br>
</p>
<p>Jetzt wird nur noch Novum auf der Nova-Falcon aufgesteckt,
da&szlig; mitgelieferte Videokabel wird mit dem Videoausgang des
Falcon verbunden und danach wird der Monitor angeschlossen. Die
Beachtung der Beschriftung auf dem Novum erleichtet das Ganze. :-)
<br>
</p>
<p align=center><img src="image/novum2.gif" border=0 width="399" height="250"></p><br>
<div align=center><tt>Abbildung 2 - NOVUM Videoumschaltung</tt>
</div>
<p><tt>Inbetriebnahme</tt>
</p>
<p>Wenn alle Arbeiten wie in der <a href="0204.htm" target="UDOcon">Installation</a> beschrieben
durchgef&uuml;hrt worden sind steht einer Inbetriebnahme nichts mehr
im Wege. In der Schalterstellung &gt;Auto&lt; wird zun&auml;chst das
Videobild des originalen Videoausgang des Falcon zu sehen sein. Das
auf der Diskette befindliche Programm &quot;NOVA_AN.PRG&quot; ist so
im Autoordner zu kopieren, da&szlig; es physikalisch vor dem
&quot;EMULATOR.PRG&quot;, da&szlig; zum Lieferumfang der Nova-Falcon
geh&ouml;rt, steht.
<br>
</p>
<p>Nun ist der Falcon neu zu booten. Erst sollte das Atari-Symbol und
die Bootmeldungen erscheinen (evtl. Bootselektor etc.), danach wenn
das &quot;NOVA_AN.PRG&quot; gestartet wird klickt es leise (3 Relais
fallen ab) und das Videosignal der Nova-Falcon wird nun sichtbar.
<br>
</p>
<p>Wenn der Schalter nun von der Stellung &gt;Auto&lt; auf die
Stellung &gt;Nova&lt; passiert in diesem Fall nichts. Erst wenn der
Schalter weiter auf &gt;F030&lt; geschaltet wird ist im Normalfall die
letzte Meldung (wahrscheinlich in inverser Schrift &quot;Nova-Falcon
ist jetzt an&quot;) zu sehen.
<br>
</p>
<p>Im Bootselektor ist immer &quot;EMULATOR.PRG&quot; und
&quot;NOVA_AN.PRG&quot; zugleich entweder zu aktivieren oder
deaktivieren.
<br>
</p>
<p><tt><a href="0308.htm" target="UDOcon">Fehlersuche</a></tt>
</p>
<p>Allzuviel kann man eigentlich nicht falsch machen. Da der Protoyp
seit etwa 4 Wochen existiert und seitdem einwandfrei l&auml;uft kann
ich auch nicht auf Erfahrungen negativer Art zur&uuml;ckgreifen. Bei
evtl. Problemen bitte ich um R&uuml;ckmeldung.
<br>
</p>
<p>Die zum NOVUM- Umschalter n&ouml;tige Software erhalten
<br>Sie direkt von Werner Frey@KR.maus.de
<br>
<br>
</p>
<p><tt> NOVUM II - Upgrade </tt>
</p>
<p><tt> Einbauanleitung - Upgrade-Platine Novum -&gt; Novum II </tt>
</p>
<p>Eine kurze Erkl&auml;rung warum das Ganze:
<br>
</p>
<p>Bei Novum habe ich die Umschaltung der Videosignale &uuml;ber die
Steuerleitung der nicht vorhandenen Floppy-B realisiert. Leider sind
einige Programme der Meinung, da&szlig; bei einem Zugriff auf Floppy-A
erst einmal Floppy-B deselektiert werden mu&szlig;, obwohl alle
Systemabfragen eindeutig melden das kein Floppy-B vorhanden ist.
Dieses deselektieren hat zur Folge, da&szlig; Novum teilweise nicht
wie gew&uuml;nscht gearbeitet hat.
<br>
</p>
<p>Funktionsprinzip der Upgrade-Platine: (NOV_DIV.IMG)
</p>
<p align=center><img src="image/nov_div.gif" border=0 width="1200" height="600"></p><br>
<div align=center><tt>Abbildung 3 - NOVUM Upgrade-Platine</tt>
</div>
<p>Die Grafikkarte, die noch nicht intialisiert ist, gibt keine
Synchronisierungssignale zum Monitor aus. Dieses Verhalten macht sich
die Steuerung der Upgrade-Platine zunutze. Das
Horizontal-Synchrionisierungs-Signal (H-Sync oder HS) dient als
Eingang zur Upgrade-Platine. Mit dem Komperator (LM311) wird daraus
ein &quot;astreines&quot; TTL-Signal gemacht. Mit dem Poti kann
eingestellt werden ab welchen Pegel der LM311 ein High- oder
Low-Signal erkennt. Der Ausgang des LM311 steuert den Eingang des
&quot;Retriggerbaren Monoflop&quot; (74LS123). Der 74LS123 wechselt
seinen Ausgangspegel und h&auml;lt ihn konstant solange am Eingang ein
sich st&auml;ndig wechselndes Signal (HS) anliegt. F&auml;llt H-Sync
f&uuml;r mehr als eine halbe Sekunde aus, so wechselt der
Ausgangspegel des 74LS123 (z.B. wenn &quot;Reset&quot; gedr&uuml;ckt
wird).
<br>
</p>
<p>Der Ausgang des 74LS123 ersetzt den Anschlu&szlig;
&quot;Floppy-B&quot; (Soundchip auf Falcon-Platine). Das
angel&ouml;tete Kabel am Soundchip mu&szlig; entfernt oder durchtrennt
werden!.
<br>
</p>
<p>Der Einbau:
<br>
</p>
<p>Aus der Upgrade-Platine kommen vier Kabel:
<br>Wei&szlig;: VGA-Ausgang Grafikkarte Pin 13 (Mitte - untere Reihe)
<br>Violett: Wird anstelle Soundchip angel&ouml;tet und geht zu den
Relais
<br>Rot: Spannungsversorgung +5V
<br>Blau: Masse
<br>
</p>
<p>Der Befestigung der Platine ist so vorzunehmen das keine
Kurzschl&uuml;sse entstehen k&ouml;nnen.
<br>
</p>
<p>Sonstiges:
<br>
</p>
<p>Eine W&auml;rmeentwicklung der Upgrade-Platine ist nicht zu
erwarten. Die Funktion des manuellen Umschalters wird nicht
beeinflu&szlig;t. Das Programm &quot;NOVA_AN.PRG&quot; wird nicht mehr
ben&ouml;tigt.
<br>
</p>
<p align=center><img src="image/novplan.gif" border=0 width="1115" height="674"></p><br>
<div align=center><tt>Abbildung 4 - NOVUM komplette <a href="030806.htm" target="UDOcon">Schaltplan</a> </tt>
</div>
<p>
<br>
<br>
</p>
<p align=center><img src="image/novteil.gif" border=0 width="640" height="600"></p><br>
<div align=center><tt>Abbildung 5 - Ben&ouml;tigte Bauteile</tt>
</div>
<p>
<br>
<br>Werner Frey, 5.2.1997
<br>
<br>
</p>
<p>Weitere Informationen erhalten Sie direkt von Werner
Frey@KR.maus.de
<br>
<br>
<br>
</p>
<p align=center><img src="image/line2.gif" border=0 width="638" height="17"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0807.htm" target="UDOcon"><img src="udo_up.gif" alt="NOVA Grafikkarte" border=0 width="24" height="24"></a>
<a href="0807.htm" target="UDOcon"><img src="udo_lf.gif" alt="NOVA Grafikkarte" border=0 width="24" height="24"></a>
<a href="0808.htm" target="UDOcon"><img src="udo_rg.gif" alt="SM124 Monitor" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
