<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: VGA-Fehlerquellen
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="080c.htm" target="UDOcon"><img src="udo_lf.gif" alt="Video Turtle" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_rg.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="VGA-Fehlerquellen">8.13 VGA-Fehlerquellen</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Falcon VGA und Fehlerquellen</tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><a href="0308.htm" target="UDOcon">Fehlersuche</a> am Falcon VGA-Anschlu&szlig;
<br>
</p>
<p>Auch an der Falcon-Monitorbuchse treten gelegentlich Fehler auf
die durch einfach Wackelkontakte an dieser Buchse selber, oder aber
auch durch die Benutztung fehlerhaften Zubeh&ouml;rs entstehen
k&ouml;nnen. Seltener d&uuml;rften wohl die F&auml;lle sein wo ein
Falcon durch einen angeschlossenen VGA-Monitor Schaden nimmt.
<br>Auch die diversen Bildschirmerweiterungen sind hier eigentlich
sehr roboust so da&szlig; man sagen kann das es eigentlich keinen
Falcon gibt der dadurch besch&auml;digt worden w&auml;hre.
<br>Selbst das abziehen eines Steckers d&uuml;rfte unter normalen
Umst&auml;nden keinen defekt an der <a href="0305.htm" target="UDOcon">Hardware</a> erzeugen. Einzig
Atari-Computer werden in diesem Fall neu booten, das auch ohne
Monitor.
<br>H&auml;ufiger hingegen d&uuml;rften defekte sein die durch den
Unsachgem&auml;ssen Anschlu&szlig; von Monitoradaptern und/oder
Monitorumschaltern sowie selbstgebasteltem Zubeh&ouml;r auftreten.
<br>
</p>
<p>Mir ist kein Falcon bekannt der durch einen Monitor oder durch das
abziehen des VGA-Steckers zerst&ouml;rt oder besch&auml;digt wurde.
<br>
</p>
<p>Eine starke Belastung der Signale welche an der Monitorbuchse
anliegen ist genauso zu vermeiden wie das Kurzschliessen irgendwelcher
Signale gegen +5 / +12V oder GND. Einzig die beiden
Monitordetect-Leitungen M1 und M0 sollten/d&uuml;rfen gegen GND gelegt
werden.
<br>Bei allen anderen Leitungen unter oder gegeneinander k&ouml;nnen
mehr oder weniger gr&ouml;&szlig;ere Defekte an der <a href="0305.htm" target="UDOcon">Hardware</a> des
Falcon auftreten.
<br>
</p>
<p>&Uuml;ber M1 und M0 registriert die Videologik im Falcon das
vorhandensein eines Monitors und dessen Typ.
<br>Erkannt werden prinzipiell drei Typen einmal der SM124, die (S)VGA
und die Gattung der RGB-Monitore.
<br>Ist keine der beiden Leitungen belegt wird angenommen das ein
TV-Ger&auml;t am Modulator des F030 angeschlossen ist.
<br>
</p>
<p>Eine genaue Reihenfolge ist sp&auml;ter aus einer kleinen Tabelle
zu ersehen.
<br>
</p>
<p><tt>Die Pinbelegung der Monitorbuchse am Falcon:</tt>
</p>
<dl>
<dt><b>Pin 1</b></dt><dd> Rot-Farb-Signal
<br>&nbsp;
<dt><b>Pin 2</b></dt><dd> Gr&uuml;n-Farb-Signal
<br>&nbsp;
<dt><b>Pin 3</b></dt><dd> Blau-Farb-Signal
<br>&nbsp;
<dt><b>Pin 4</b></dt><dd> Monochrome-Signal f&uuml;r SM124 od. &auml;hnlich.
<br>&nbsp;
<dt><b>Pin 5</b></dt><dd> GND-Allgemein, Logic
<br>&nbsp;
<dt><b>Pin 6</b></dt><dd> GND/ Rot-Abschirmung
<br>&nbsp;
<dt><b>Pin 7</b></dt><dd> GND/ Gr&uuml;n-Abschirmung
<br>&nbsp;
<dt><b>Pin 8</b></dt><dd> GND/ Blau-Abschirmung
<br>&nbsp;
<dt><b>Pin 9</b></dt><dd> <a href="0907.htm" target="UDOcon">Audio</a> 1Vss max.
<br>&nbsp;
<dt><b>Pin 10</b></dt><dd> GND/ <a href="0907.htm" target="UDOcon">Audio</a>-Abschirmung
<br>&nbsp;
<dt><b>Pin 11</b></dt><dd> GND-Allgemein / Video
<br>&nbsp;
<dt><b>Pin 12</b></dt><dd> Composit (Syncron) Signal
<br>&nbsp;
<dt><b>Pin 13</b></dt><dd> Horizontal Syncron Signal
<br>&nbsp;
<dt><b>Pin 14</b></dt><dd> Vertical Syncron Signal
<br>&nbsp;
<dt><b>Pin 15</b></dt><dd> Clock-In / <a href="0806.htm" target="UDOcon">ScreenBlaster</a> / GenLock
<br>&nbsp;
<dt><b>Pin 16</b></dt><dd> Even_Odd
<br>&nbsp;
<dt><b>Pin 17</b></dt><dd> +12V Steuerspannung (Nur wenige mA erlaubt!)
<br>&nbsp;
<dt><b>Pin 18</b></dt><dd> M1-Monitordetect V1!
<br>&nbsp;
<dt><b>Pin 19</b></dt><dd> M0-Monitordetect V2!
<br>&nbsp;
</dl>
<p>Wichtig ist das die GND Pins auch wirklich zumindestens an dem
verwendeten Monitor korrekt belegt werden. Nur so ist ein
einwandfreies Funktionieren gew&auml;hrleistet. Nur so ist auch
Flimmern ect. zu eliminieren.
<br>&Uuml;ber Pin 9 und GND erreicht man bei denn diversen
Bildschirmen stets den integrierten Lautsprechner, sofern vorhanden.
<br>Die GND-Pins dienen gleichzeitig auch als Abschirmung.
<br>
</p>
<p align=center><img src="image/vgaadapt.gif" border=0 width="235" height="190"></p><br>
<div align=center><tt>Abbildung 1 - VGA-Adapter von Atari</tt>
</div>
<p>Eine M&ouml;glichkeit f&uuml;r Fehlfunktionen sehe ich durch eine
eventuelle andere (falsche) VGA-Steckerbelegung bei den Ger&auml;ten
die so nicht laufen. Das kann idR passieren wenn z.B
&quot;g&uuml;nstige&quot; VGA-Bildschirme von &auml;lteren EDV-Anlagen
abgestaubt wurden.
<br>
</p>
<p>Einige VGA-Adapterkabel finden Sie unter <a href="080102.htm" target="UDOcon">Monitoradapter</a>
<br>
<br><tt>Die normale VGA-Steckerbelegung (Monitor): </tt>
</p>
<p>Beachten Sie bitte das einige Signale im Zusammenhang mit einem
Atari-Computer nicht benutzt werden.
<br>
</p>
<dl>
<dt><b>Pin 1</b></dt><dd> Rot-Signal
<br>&nbsp;
<dt><b>Pin 2</b></dt><dd> Gr&uuml;n-Signal
<br>&nbsp;
<dt><b>Pin 3</b></dt><dd> Blau-Signal
<br>&nbsp;
<dt><b>Pin 4</b></dt><dd> GND am VGA/SVGA/MultiSync-Monitor
<br>&nbsp;
<dt><b>Pin 5</b></dt><dd> Check - am Falcon nicht belegt.
<br>&nbsp;
<dt><b>Pin 6</b></dt><dd> GND/ Rot-Abschirmung
<br>&nbsp;
<dt><b>Pin 7</b></dt><dd> GND/ Gr&uuml;n-Abschirmung
<br>&nbsp;
<dt><b>Pin 8</b></dt><dd> GND/ Blau-Abschirmung
<br>&nbsp;
<dt><b>Pin 9</b></dt><dd> <a href="0907.htm" target="UDOcon">Audio</a>-IN 1Vss (n/c sofern kein Lautsprecher eingebaut ist.
<br>
<br>&nbsp;
<dt><b>Pin 10</b></dt><dd> GND/Logik
<br>&nbsp;
<dt><b>Pin 11</b></dt><dd> GND-Allgemein / Video
<br>&nbsp;
<dt><b>Pin 12</b></dt><dd> n/c nicht belegt
<br>&nbsp;
<dt><b>Pin 13</b></dt><dd> Horizontal Syncron Signal
<br>&nbsp;
<dt><b>Pin 14</b></dt><dd> Vertical Sycron Signal
<br>&nbsp;
<dt><b>Pin 15</b></dt><dd> n/c nicht belegt
<br>&nbsp;
</dl>
<p>
<br>
<br>Pin 5 wird am Falcon nicht ben&ouml;tigt. n/c ist immer unbenutzt.
<br>
</p>
<p>Der Falcon stellt &uuml;ber 2 Pin (18/19) M1/M0 fest welcher
Monitor ihm spendiert wurde. Diese Pins werden vom Adapter/Monitor
entsprechend gegen Masse gelegt und sind zumeist im entsprechenden
Adapter fest verdrahtet.
<br>
</p>
<p>Spannende Momente gibt es :) wenn der Falcon nicht wei&szlig;
welcher Monitor angeschlossen ist weil:
<br>A. Vieleicht die Kabel/Steckerbelegung oder Adapterverdrahtung
falsch ist
<br>B. Wirklich ein defekt am Falcon oder dem Monitor vorliegen kann
<br>
</p>
<p><tt>Hierzu das Bitmuster der beiden Steuerleitungen.</tt>
</p>
<p align=center><img src="image/vgaid.gif" border=0 width="426" height="88"></p><br>
<div align=center><tt>Abbildung 1 - Die Monitor ID-Bits am Falcon</tt>
</div>
<p>Jetzt werden die Steuerleitungen M1/M0 nat&uuml;rlich je nach
angestecktem Adapter &quot;umbelegt' der Falcon wei&szlig; so was er
bei welchem Monitor f&uuml;r Signale an seiner Monitorbuchse liefern
darf.
<br>Falconintern auf dem <a href="030806.htm" target="UDOcon">Schaltplan</a> werden diese Signale unter der
Bezeichnung V1 / V2 gef&uuml;hrt und Enden an einem 74LS244.
<br>
</p>
<p>Es gibt VGA-Monitore die an den Signalleitungen H-Sync. und
V-Sync. Widerst&auml;nde von kleiner als 2 KOhm gegen Masse
eingel&ouml;tet haben, solche Monitore belasten die Signalerzeugung
des Falcons nicht unerheblich. Das kann auch an PC VGA-Karten zu
Problemen f&uuml;hren. Am Falcon ist es m&ouml;glich das solche
Monitore kein korrektes Bild liefern und u.U auch nicht mit z.B dem
<a href="0806.htm" target="UDOcon">ScreenBlaster</a> korrekt laufen werden.
<br>Hierzu sollte man das mit einem Ohmmeter vergleichen.
<br>Notfalls auch nach Pullup-Widerst&auml;nden suchen.
<br>
</p>
<p>Meinen besten Dank hier an Werner Frey f&uuml;r diesen Tip.
<br>
</p>
<p>Die Syncronisationssignale werden dadurch stark Belastet und sind
i.d.R dann in einem Zustand mit denen der Monitor nicht mehr viel
Anfangen kann. Der Monitor syncronisiert sich nicht mehr korrekt was
sich in starkem Flimmern oder sonstigen Streifenmustern &auml;ussern
kann.
<br>
</p>
<p>&Uuml;berpr&uuml;fbar bleiben in jedem Fehlerfall die
Falcon-Monitorbuchse sowie deren L&ouml;tstellen auf der
Platinenunterseite. &Uuml;ber die Entst&ouml;rspulen L26, L28 werden
die beiden Monitorselekt- Leitungen an die Monitorbuchse Pin 18/19
herrangef&uuml;hrt. Die Spulen sollten jeweils 0 Ohm Durchgang haben.
<br>Csync liegt z.B &uuml;ber L22 an Pin 12 der Buchse an. Vsync an
Pin 14 und H-Sync an Pin 13 der Monitorbuchse.
<br>&Uuml;ber den SMD-Widerstand R49, auf der Platinenunterseite,
findet eine externe Takteinspeisung (<a href="0806.htm" target="UDOcon">ScreenBlaster</a> usw.) in den Falcon
statt.
<br>(Pin 15) Ist dieser Widerstand defekt oder Ausgel&ouml;tet kann
kein externes Taktsignal in das Videosystem eingespeist werden.
<br>
</p>
<p>Auch wird diese Stelle gerne von internen Erweiterungen als
Einspeisepunkt benutzt.
<br>IdR passiert das wenn vorher eine andere Bildschirmerweiterung
oder eine SRC und &auml;hnliches eingebaut war/wurde.
<br>Pin 15 sollte &uuml;ber R49 und R81 (4.7K Pullup) an Vcc liegen.
Weiterhin sollte dann eine Verbindung zu Pin 14 des VIDEL bestehen.
Der VIDEL ist U34 auf dem Mainboard.
<br>H-Sycn. sollte zudem sauber an U57 Pin 11 vorhanden sein.
<br>Pin 19 (V0) sollte an U42 Pin 15 zu finden sein (Ohmmeter!)
<br>Pin 18 (V1) sollte an U42 Pin 17 zu finden sein
<br>U42 ist ein eingel&ouml;teter 74LS244.
<br>
</p>
<p>Je nach Monitortyp sollten sich da die Signale &auml;ndern.
<br>Das geht nur wenn ein Monitor angesteckt ist 0/1 Tabelle beachten!
<br>
</p>
<p>Sollte an Pin 4 der Monitorbuchse kein Monochromesignal erscheinen
kann man auf jeden Fall den Transistor Q2 (2N3904) begutachten.
<br>Dessen Basis erh&auml;lt &uuml;ber R152 (1KOhm) seine Ansteuerung
direkt von Pin 8 (MONO) des VIDEL-Chips.
<br>Der Schaltungsausgang l&auml;uft &uuml;ber den Widerstand R35
(27Ohm) zu Pin 4 der Monitorbuchse.
<br>R35 dient hier der Strombegrenzung.
<br>Die R,G,B-Signale liegen an Pin 1-3 in gleicher Reihenfolge an.
<br>Das nur der Vollst&auml;ndigkeit halber, die h&auml;ufigsten
Ursachen wird aber das Fehlen eines oder beider Syc.-Signale bleiben.
An Pin 17 der Monitorbuchse liegen &uuml;ber den Schutzwiderstand R34
(10KOhm) +12V an. Sie dienen u.A auch einem <a href="0806.htm" target="UDOcon">ScreenBlaster</a> oder einem
Genlock als Steuerspannung. Pin 17 darf nur mit wenigen mA Belastet
werden! Pin 5, 10 und 11 bilden zusammen GND.
<br>
</p>
<p>Es soll erw&auml;hnt werden das zu diesen Arbeiten an der
Videologik des Falcons in jeden Fall ein gutes Oszilloskop sehr von
Vorteil ist.
<br>Ein Signalgenerator nur in Aussnahmef&auml;llen. Es gibt nur sehr
wenige teuere <a href="030805.htm" target="UDOcon">Ersatzteile</a>!
<br>
</p>
<p><tt>Sonderfall <a href="0806.htm" target="UDOcon">ScreenBlaster</a></tt>
</p>
<p>Beim <a href="0806.htm" target="UDOcon">ScreenBlaster</a> handelt es sich um eine <a href="0305.htm" target="UDOcon">Hardware</a> die direkt
hinten auf die Monitorbuchse des Falcons aufgesteckt wird.
<br>Man kann so sehr einfach eine Bildschirmerweiterung um 300%
Erreichen.
<br>
</p>
<p>Den <a href="0806.htm" target="UDOcon">ScreenBlaster</a> gibt es mit etwas weniger Leistung auch zum
internen Einbau in F030-Computer.
<br>Eine Steuerleitung belegt einen der beiden Falcon Padports. Der
<a href="0806.htm" target="UDOcon">ScreenBlaster</a> wird von seiner Software, dem (V)ideo(M)ode(G)enerator
VMG bzw. einem Treiber im Autoordner gesteuert.
<br>Mit dem VMG werden die gew&uuml;nschten Aufl&ouml;sungen einmal
erzeugt.
<br>Ein externer <a href="0806.htm" target="UDOcon">ScreenBlaster</a> kann nur Funktionieren sofern das
VGA-Videoteil im Falcon korrekt arbeitet. Per Software werden im
<a href="0806.htm" target="UDOcon">ScreenBlaster</a> Steuerfrequenzen f&uuml;r das Videoteil erzeugt die
&uuml;ber PIN &uuml;ber die Monitorbuche eingespeist werden.
<br>
</p>
<p>Hier kommt es seht selten zu Fehlern. Der <a href="0806.htm" target="UDOcon">ScreenBlaster</a> ist eine
sehr stabile Angelegenheit. Kann aber widerrum nur korrekt laufen wenn
der VideoChip im Falcon das verkraftet. Ausetzer, Bildschirmblitzer
k&ouml;nnen bei wesentlich erh&ouml;htem Systemtakt, bei einer
Pixelfrequenz von 50Mhz auftreten. Das ist aber von Falcon zu Falcon
verschieden und h&auml;ngt nicht am <a href="0806.htm" target="UDOcon">ScreenBlaster</a>! Erw&auml;rmt sich
der Videochip stark kann man hier eine Linderung durch aufsetzen eines
K&uuml;hlk&ouml;rpers erreichen.
<br>
</p>
<p>Das trifft bei stark beschleunigten Computern zu.
<br>(Wobei hier eigentlich durch einen h&ouml;heren Bustakt eigentlich
die Chips vom Datendurchsatz her entlastet werden m&uuml;ssten)
</p>
<p>Eine Schrittweise verkleinerung der Bildschirmaufl&ouml;sung
sollte ebenso dazu f&uuml;hren das die Blitzer weniger werden bzw.
ganz verschwinden. Ganz zu verhindern wird das bei aufgeblasenen
Falcons leider nicht sein.
<br>
</p>
<p>Ein ClockPatch behebt diese Blitzer &uuml;brigens nicht!
<br>
</p>
<p>Ohne Treiber ect. werden die VGA-Signale durch den <a href="0806.htm" target="UDOcon">ScreenBlaster</a>
hindurchgef&uuml;hrt als wenn er nicht vorhanden w&auml;hre. Im
<a href="0806.htm" target="UDOcon">ScreenBlaster</a>-Modul selber k&ouml;nnen Sie nichts Reparieren. Es
befinden sich TTL-ICs, einige passive Bauteile sowie ein PAL in diesem
Hardwaremodul. Hier ist ein Check bei OverScan ratsam.
<br>
</p>
<p>Testen Sie erst Ihren Monitor gr&uuml;ndlich bevor Sie eine
<a href="0806.htm" target="UDOcon">ScreenBlaster</a>-<a href="0305.htm" target="UDOcon">Hardware</a> &ouml;ffnen!
<br>Im innern des externen ScreenBlasters gibt es nichts das Sie
Reparieren k&ouml;nnen. OverScan tauscht die <a href="0305.htm" target="UDOcon">Hardware</a> um.
<br>Es ist keine Bauteilebeschriftung vorhanden!
<br>Meistens liegt es nur am Rechner oder eben am Monitor selber.
<br>
</p>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<div align=center><tt>Note:</tt> Das ist keine vollst&auml;ndige Reparaturanleitung
und erhebt
<br>somit auch keinen Anspruch auf Vollst&auml;ndigkeit sowie
<br>die Darlegung aller Me&szlig;punkte in alphabetischer Reihenfolge.
<br>
</div>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>Bildschirmerweiterungen belasten den Grafikchip des Falcon
reichlich. Pixeltakte von 50Mhz k&ouml;nnen diesen Chip drastisch
Erw&auml;rmen. Teilweise bis zum pl&ouml;tzlichen Bildverlust.
(Blackout)
<br>Abhilfe kann man hier mit kleinen K&uuml;hlk&ouml;rpern oder einem
Ventilator schaffen der diesen Chip direkt anbl&auml;st.
<br>K&uuml;hlk&ouml;rper *m&uuml;ssen* ohne jeden Luftspalt zwischen
Chipoberfl&auml;che und K&uuml;hlk&ouml;rper montiert werden!
<br>
</p>
<p>
<br>
<br><b> Belegung neuerer VGA-Monitore </b>
<br>
</p>
<p>Neuere SubD 15 polige VGA Belegungen:
<br>
</p>
<pre>
01: Rot
02: Gr&uuml;n
03: Blau
04: -
05: GND
06: Rot GND
07: Gr&uuml;n GND
08: Blau GND
09: +5V
10: Sync GND
11: Monitor ID0
12: SDY / IC2-Datenbus
13: HSYNC (CSYNC)
14: VSYNC
15: SCL / IC2-Takt

</pre>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="08.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon Video - VGA/RGB" border=0 width="24" height="24"></a>
<a href="080c.htm" target="UDOcon"><img src="udo_lf.gif" alt="Video Turtle" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_rg.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
