<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Sound-Subsystem
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_lf.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="0902.htm" target="UDOcon"><img src="udo_rg.gif" alt="Soundsubsystem Audio OUT" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Sound-Subsystem">9.1 Sound-Subsystem</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Probleme mit dem Sound-Subsystem des Atari F030</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Zu Bemerken w&auml;re gleich am Anfang das mir dieser Fehler bis
jetzt an einigen Falcons der Revision A und B aufgefallen ist. Diese
Textdatei kann im allgemeinen nicht direkt auf jeden F030 angewendet
werden. F&uuml;r das Soundsubsystem gibt es bereits zwei verschiedene
Beschaltungen des Microfoneinganges und auch existieren zwei
verschiedene Schaltpl&auml;ne. Man sollte die Bauteilebezeichnung
vorher &Uuml;berpr&uuml;fen.
<br>
</p>
<p>In jeden Fall sollte man bei Knack- und Kratzger&auml;uschen
w&auml;hren dem Sampeln, dem Abspielen einer CD ect. immer zuerst sein
Augenmerk auf die Klinkenbuchse werfen. Ein leichtes Nachbiegen der
Kontaktfedern kann hier schon wahre Wunder ausl&ouml;sen. Und hat
meistens auch schon Erfolg ohne das man den Rechner mit nachfolgendem
Garatieverlust &ouml;ffnen mu&szlig;.
<br>Eine gewisse Vorsicht sollte man hier troz allem walten lassen.
<br>Meistens liegt es nicht mal an der Miniklinkenbuchse, sondern eher
an den Steckern die offensichtlich gr&ouml;ssere Unterschiede in den
l&auml;ngen und der Stiftst&auml;rke aufweisen. Bei meinem eigenen
Falcon habe ich die 3.5 mm Klinkenbuchsen z.B gegen richtige
Chinchbuchsen aus der HiFi-Technik ersetzt. Das hat den Voreil das man
sich zum Anschlu&szlig; an einen Verst&auml;rker ect. keine
umst&auml;ndlichen Adapterkabel l&ouml;ten mu&szlig;.
<br>
</p>
<p>Ein noch einfacherer Schritt ist das optimieren der verwendeten
Festplatte.
<br>Durch starke defragmentation der Sektoren auf einer SCSI-Platte
k&ouml;nnen ebenfalls Kister- und Knackger&auml;usche beim Samplen
entstehen!
<br>
<br>
</p>
<p align=center><img src="image/chinch.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 1 - <a href="0302.htm" target="UDOcon">Falcon F030</a> mit Chinchbuchsen am
Soundeingang</tt>
<br>
</div>
<p>
<br>Es wird hierzu die entsprechende Klinkenbuchse mit einem
Entl&ouml;ter oder wenigstens einer guten Entl&ouml;tpumpe von der
Platine entfernt.
<br>Die L&ouml;taugen sollten hinterher ganz sauber sein.
<br>Diese Chinchbuchsen gibt es als ein St&uuml;ck bei dem sich
jeweils
<br>zwei dieser Chinchbuchsen &uuml;bereinander befinden.
<br>Die L&ouml;tanschl&uuml;sse dieser Doppelbuchsen passen bei
leichten biegen genau in das mittlere (GND) L&ouml;tauge und in das
jeweilige ganz linke und/oder ganz rechte L&ouml;tauge. Das original
Falcongeh&auml;use mu&szlig; an dieser Stelle dann eben passend
ausgefeilt werden. Wird das sauber gemacht sieht es nachher so aus als
wenn das schon immer so gewesen w&auml;hre. Zwischen Floppylaufwerk
und der Plastikr&uuml;ckwand des Falcons ist auf jeden Fall Platz
f&uuml;r zwei dieser Doppelbuchsen. So da&szlig; auch der Ausgang
f&uuml;r die Lautsprecher auf solche Buchsen umger&uuml;set werden
kann. Bis eben gibt es mit dieser L&ouml;sung keine Probleme, zumal
man auch noch sehr schnell den linken Kanal gegen den rechten Kanal
vertauschen kann.
<br>
<br>
</p>
<p align=center><img src="image/chinch1.gif" border=0 width="242" height="200"></p><br>
<div align=center><tt>Abbildung 2 - <a href="0302.htm" target="UDOcon">Falcon F030</a> mit Chinchbuchsen.</tt>
</div>
<p>
<br>Bei den beiden Eingangs erw&auml;hnten F030-Computern hatten die
Soundst&ouml;rungen jedoch zwei ganz unterschiedliche Ursachen, die
jedoch am Anfang der <a href="0308.htm" target="UDOcon">Fehlersuche</a> die gleichen Symptome aufzeigten.
<br>
</p>
<p>Bemerkenswert erscheint mir noch die Tatsache das selbst ein
Versuchsweises &ouml;ffnen eines F030 die Garantie erl&ouml;schen
l&auml;sst, also erst Nachdenken ob man wegen diesem Fehler die
Garantie verfallen l&auml;sst oder eben seinen <a href="1604.htm" target="UDOcon">H&auml;ndler</a> daf&uuml;r
konsultiert, sofern man ja noch die Garantie hat.
<br>
</p>
<p>Die Qualit&auml;t von Audioaufnahmen kann man mit einem
<a href="0912.htm" target="UDOcon">Soundlifter</a> verbessern.
<br>
</p>
<p>Nach dem man im Falcon die oberen Abschirmbleche entfernt hat kann
man bereits alle Komponenten eines F030 in Augenschein nehmen.
<br>Zum besseren Handling ist es aber sicherer wenn man die Bleche
komplett entfernt. Dazu mu&szlig; leider auch das Diskettenlaufwerk
gel&ouml;st werden. Hier ist das Flachbandkabel recht vorsichtig zu
bewegen!
<br>Nur so erh&auml;lt man vollen Zugang auf die Platinenunterseite,
die wesentliche Bauteile des Soundsubsystem tr&auml;gt.
Analogverst&auml;rker und <a href="04010a.htm" target="UDOcon">Codec</a> befinden sich nat&uuml;rlich unter dem
Diskettenlaufwerk.
<br>
</p>
<p>Auch ist es gut, wenn man bei dieser Aktion den Lautsprecher
Vorsichtig absteckt, er hat recht kurze Anschlusskabel und ist jetzt
mehr als nur hinderlich.
<br>Zu ersten Messungen und Tests gen&uuml;gt es allerdings wenn das
obere Abschirmblech und das Floppylaufwerk entfernt wird. Das
Floppylaufwerk besitzt auf der Unterseite des Rechners drei lange
Schrauben, die vierte Befestigung ist ein Abstandsbolzen aus Messing
der gleichzeitig zur Zentrierung und zur &Uuml;bertragung der
Rechnermasse zum Laufwerkt fungiert. Ebenso so mu&szlig; bei einem
kompletten Ausbau der Hauptplatine das Schaltnetzteil und die interne
2.5&quot; IDE-Festplatte ausgebaut werden. Man wird nicht extra
Betonen m&uuml;ssen das die Festplatte auch in ausgebautem Zustand
empfindlich gegen Ersch&uuml;tterungen und Schl&auml;ge ist.
</p>
<p>Da nun das Floppylaufwerk entfernt wurde kann man bereits die
Mikrofonbuchse sehen, ebenfalls die drei Spulen mit Ferritmantel und
den LM387 der hier als Analogverst&auml;rker dient.
<br>Viele der zum Analogteil geh&ouml;rigen Bauteile befinden sich auf
der Unterseite der F030-Hauptplatine, um dort Messen zu k&ouml;nnen
mu&szlig; die Platine komplett ausgebaut werden. Also erstes kann nun
mit einen ganz einfachen Digitalmultimeter an der rechten und linken
Ferritspule getestet werden ob die <a href="0907.htm" target="UDOcon">Audio</a>-Signale bis wenigstens am
Ende der Spulen anliegt. Auf den Millivolt-Bereich geschaltet sollten
sich an jedem der beiden Kan&auml;le Spannungsschwankungen gegen die
Rechnermasse messen lassen. Ist das nicht der Fall liegt der Fehler
mit Sicherheit schon an der Buchse. (Das aber seltener)
<br>
</p>
<p>Der Falcon mu&szlig; auch nicht unbedingt In Betrieb sein um
diesen Fehler zu finden. Die Audiosignale lassen sich bei
abgeschaltetem Computer leicht bis zum <a href="04010a.htm" target="UDOcon">Codec</a> verfolgen. Ausserdem
l&auml;uft er auch mit ausgebauter Festplatte und Diskettenlaufwerk
:-)
<br>Auch nach den Spulen, in Richtung des LM387 sollte sich am
Multimeter bei angelegtem Stereo-Audiosignal noch was tun.
<br>Nat&uuml;rlich zeigt das Multimeter keine genauen Werte an,
sondern eben nur das ein Signal vorhanden ist. Das &auml;ussert sich
mit 'h&uuml;pfen' der Anzeige.
<br>Besser w&auml;hre hier ein Oszilloskop, was aber eben leider nicht
jeder hat.
<br>
</p>
<p>Liegen die Sterosignale an den Spulenenden an, ist man einen
Schritt weiter. Die Klinkenbuchse und die Spulen k&ouml;nnen hier
ausgeschlossen werden. Die mittlere der drei Spulen hinter der
Klinkenbuchse liegt &uuml;brigens im Masseanschlu&szlig; der
Klinkenbuchse und dient auch zur Entst&ouml;rung. Man sollte nun am
LM387 an Pin 2 (Microphone Left In) MLI und an PIN7 (Microphone Right
In) MRI feststellen ob die zuvor an den Ferritspulen gefundenen
<a href="0907.htm" target="UDOcon">Audio</a>-Signale hier auch noch ankommen.
<br>
</p>
<p>Ist das nicht der Fall verschwindet das Signal bereits auf dem Weg
zu eben diesem Analogverst&auml;rker. Das war bei einem Falcon der
Revision B der Fall. Wenn man von oben auf den Rechner dr&uuml;ckte
(Floppyseite) war der rechte Kanal mit Kratzger&auml;uschen und
Aussetzern verseucht. Nach dem Ausbau der Platine konnte man sehen das
sich die L&ouml;tanschl&uuml;sse der Spulen und einer der
Klinkenbuchse bereits durch die Pappe einen Weg zum Masse
f&uuml;hrenden unteren Abschirmblech gebahnt hatten. Was
nat&uuml;rlich sofort zu einem Kurzschlu&szlig; des rechten
Audiosignals f&uuml;hrte.
<br>Abhilfe konnte ich dadurch schaffen das ich die Bauteilebeinchen
einfach entsprechen gek&uuml;rzt und die Bauteile erneut
eingel&ouml;tet habe. Die L&ouml;tbatzen waren an den Auflagestellen
schon eingedr&uuml;ckt. Das Floppy war in diesem Rechner &uuml;brigens
nur original ganz leicht Angeschraubt, ein festziehen der
Floppyschrauben h&auml;tte den Fehler wohl eher an den Tag gebracht.
So z.B schon bei der Endkontrolle des Falcons!
<br>
</p>
<p>Die Abschirmbleche liegen &uuml;brigens schon in der
M&uuml;lltonne ! Die braucht kein Mensch :-) (Au&szlig;er vielleicht
einigen abgeschirmten Postkaspern)
<br>
</p>
<p>Bei dem zweiten Falcon hatte ein Aussetzter des linken Kanals die
Rechner&ouml;ffnung zur Folge. Nach dem ich alle Schritte die ich
bereits Erl&auml;utert habe durchgef&uuml;hrt hatte blieb ich wieder
an der Befestigung des Diskettenlaufwerkes h&auml;ngen, auch dieses
Laufwerk war nur lauwarm Angeschraubt.
<br>Bei korrekten Anschrauben und ca. 5 Min. Samplen war dem linken
Kanal kein Ger&auml;usch mehr zu entlocken. Um sicher zu gehen kann
man die Ausganssignale des LM387 (U9) am F030 <a href="04010a.htm" target="UDOcon">Codec</a> (U28) messen, und
zwar ist Pin 25 des CODEC &uuml;ber die SMD-Bauteile C128, C124 und
R133 f&uuml;r den rechten Kanal zust&auml;ndig (MRO) Pin 27 des <a href="04010a.htm" target="UDOcon">Codec</a>
&uuml;ber die Bauteile C131, C129 und R145 f&uuml;r eben den linken
Kanal verantwortlich, erst der CODEC &uuml;bernimmt die Wandlung in
die digitale Form.
<br>
</p>
<p>Bei diesem Falcon war es offensichtlich nun so das sich durch das
ebenfalls Verspannt eingebaute Diskettenlaufwerk auf der
Platinenunterseite die Bauteile C40, C26 nicht mehr so ganz korrekt
verhalten haben.
<br>C40 hatte nur bei kaltem Rechner Verbindung mit seinen
L&ouml;tstellen, C26 mu&szlig;te durch einen neuen SMD-Kondensator
ersetzt werden.
<br>Das Audiosignal des linken Kanals lag an der Spule L33 korrekt an,
auch am Spulenausgang in Richtung des LM387. Leider konnte man aber
dort am Pin 2 kein Audiosignal messen, also mu&szlig;ten alle Bauteile
die sich in diesem Schaltungszweig befinden unter die Lupe genommen
werden. Das mit der Lupe &uuml;brigens im wahrsten Sinn des Wortes !
<br>
</p>
<p>Man sollte Beachten das man die SMD-Bauteile in einer passenden
Baugr&ouml;&szlig;e kauft, gr&ouml;&szlig;erer Kondensatoren u.
Widerst&auml;nde passen meistens nicht auf die vorhandenen
L&ouml;dpads.
<br>
</p>
<p>Ben&ouml;tigt habe ich hierzu nur das Multimeter, bzw. den darin
eingebauten elektronischen Durchgangspr&uuml;fer. Das Oszilloskop habe
ich erst nach der eigentlichen Reparatur genommen um zu sehen das die
Signale auf beiden Kan&auml;len auch noch nach dem LM387 (U9) korrekt
aussehen.
<br>Nur damit es nachher keinen h&ouml;rbaren Unterschiede zwischen
beiden Kan&auml;len gibt.
</p>
<p>Bei dieser Gelegenheit ist mir dann auch aufgefallen das beide
Falconplatinen auf der Unterseite aussehen als wenn die kein Fachman
gel&ouml;tet h&auml;tte.. Viele der SMD-Bauteile sitzten entweder
total schief auf ihrem Platz oder sind so Mangelhaft verl&ouml;tet das
man sich &uuml;ber sonst nichts zu Wundern braucht.
<br>
</p>
<p>Eine genaue Beschreibung aller Bauteile die sich in diesen
Signalwegen befinden w&uuml;rde sicher den Rahmen dieser einfachen
Fehlerbeschreibung bei weitem Sprengen. Deshalb hier nur kurz eine
Zusammenstellung der Bauteile vom Klinkeneingang bis zum <a href="04010a.htm" target="UDOcon">Codec</a> (U28).
<br>
</p>
<dl>
<dt><b>Linker <a href="0907.htm" target="UDOcon">Audio</a>_IN-Kanal:</b></dt><dd> -L33, -R57, -R58, -C21, -C26, -R58, -R87, -C40, -R55, -LM387 -Pin
2 vom LM387
<br>-Pin 4 bis zum CODEC: -C131, -R133, -C124 -CODEC Pin 25
<br>&nbsp;
<dt><b>Rechter <a href="0907.htm" target="UDOcon">Audio</a>_IN-Kanal:</b></dt><dd> -L35, -R92, -R90, -C81, -C79, -R84, -R88, -C55, -R87, -LM387 -Pin
7 vom LM387
<br>-Pin 5 bis zum CODEC: -R145, -C129, -R131 -CODEC Pin 27
<br>&nbsp;
</dl>
<p>Die Beschreibung dieser Bauteile bezieht sich auf die Revison B
(OLD) Es gibt meines Wissens bis jetzt zwei verschiedene Schaltungen
bez&uuml;glich des Soundeingangs am Atari <a href="0302.htm" target="UDOcon">Falcon F030</a>. Die meisten
Ger&auml;te werden aber die Version haben die ich hier Beschrieben
habe. Beachten Sie bitte das diese Angaben nicht mehr stimmen wenn
Modifikationen im analogen Audiosubsystem des Falcons vorgenommen
wurden oder gar ein <a href="0912.htm" target="UDOcon">Soundlifter</a> eingebaut ist.
<br>
</p>
<pre>  Vorsicht: Diese Beschreibung kann erhebliche Abweichungen zu neueren
            C-LAB MKI + MKII Falcons aufweisen!
            Hier sind Modifikationen vorgenommen worden.
</pre>
<p>Zu Bemerken w&auml;hre noch das sich neben Pin 25/27 am <a href="04010a.htm" target="UDOcon">Codec</a>
jeweils eine Durchkontaktierung befindet an denen sich besser Messen
l&auml;sst als an den eng zusammenliegenden Anschlu&szlig;beinchen des
<a href="04010a.htm" target="UDOcon">Codec</a> selber.
<br>Sollte diese Aktion jemand nachstellen m&uuml;ssen so sei noch zu
sagen das es unumg&auml;nglich ist alle Sicherheitsvorschriften
bez&uuml;glich der Netzspannung, dem Umgang mit einem SMD geeigneten
L&ouml;tkolben dem Werkzeug und der Schutzvorschriften bez&uuml;glich
statischer Ladungen einzuhalten. Ihr Falcon und die sechsfache
Multilayerplatine werden es Ihnen Danken :-)
<br>
</p>
<p>Alle Leiterbahnen der <a href="0907.htm" target="UDOcon">Audio</a> IN Schaltung befinden sich zum
Gl&uuml;ck auf der Ober- oder auf der Unterseite der F030 Platine,
sogesehen als noch ein recht einfaches und schnelles Unterfangen.
Sollen alle Versuche in dieser Richtung fehlschlagen, da einer der
beiden Kan&auml;le nur einen sporadische Aussetzer hat, der sich
eventuell auch noch mit Knistern und Rauschen ank&uuml;ndigt, ist es
ein guter Tip Sicherheitshalber alle SMD-Kondensatoren in diesem
Schaltungszweig durch eben neue zu Ersetzten. Diese Teile sind nicht
teuer und es geht schneller als eben jeden einzelnen unter die Lupe zu
nehmen.
<br>
</p>
<p>Ein weiterer Tip, alle SMD-Widerst&auml;nde und Kondensatoren kann
man z.B bei Conrad-Elektronik kaufen, bei l&auml;ngerem suchen auf der
Platinenunterseite habe ich in der gleichen Zeit alle
SMD-Kondensatoren auf einen Schlag gegen neue ersetzt. Nat&uuml;rlich
ist das keine &quot;Reparatur&quot; erschl&auml;gt aber in 98% aller
F&auml;lle das Problem und erspart eventuell eine wesentlich
l&auml;ngere suche. SMD-Kondensatoren kosten eben nur wenige Pfennige,
die Zeit kostet mehr.
<br>
</p>
<p><tt> Bauteilebeschreibung Analogteil: </tt>
</p>
<p>Bauteilebeschreibung von der Klinkenbuchse aus in Richtung CODEC
U28
<br>
</p>
<p>J7 3.5mm Klinkenbuchse
</p>
<pre>
Left <a href="0907.htm" target="UDOcon">Audio</a> IN:

Part:   Pin:   Description:
---------------------------
L122    3+4    Filtercoil
C606           1000pF
C26            0.47uF
C603           1000pF
R58            10KOhm
C616           470pF
R67            33KOhm
C40            0.15uF
U9      2+1    LM387 OpAmp
C615           100pF
R66            47KOhm
R145           150Ohm
C129           0.01uF
C131           0.47uF
U28     27     CODEC A/D


Right <a href="0907.htm" target="UDOcon">Audio</a> IN:

Part:   Pin:   Description:
---------------------------
L122    1+2    Filtercoil
C607           1000pF
C602           1000pF
C79            0.47uF
R84            10KOhm
C618           470pF
R88            33KOhm
C55            0.15uF
U9             LM387 OpAmp
C617           100pF
R87            47KOhm
R133           150Ohm
C124           0.01uF
C128           0.47uF
U28     25     CODEC A/D


</pre>
<p>M&uuml;ssen SMD-Bauteile gewechselt werden sollten Sie daruf
achten die neuen Bauteile die gleichen Abmessungen wie die alten
Bauteile besitzen.
<br>Per Augenmass kann ich die selber auch nicht bestellen. Entweder
per Codeliste oder das Teil entl&ouml;ten. Es ist g&uuml;nstig wenn
man sich vorher die Platinenposition und Bauteilebezeichnung notiert!!
<br>
</p>
<p>An dieser Stelle m&ouml;chte ich nochmals eindringlich vor dem
Verbiegen, Verspannen oder starkem mechanisch Belasten der 6-fach
Multilayerplatine warnen.
<br>Gleiches gilt f&uuml;r sp&auml;ter gefertigte 4-fach Multilayer.
<br>Viele andere Verbindungen liegen in den inneren Schichten der
Platine, da hift auch Anbohren nicht weiter. Einzige hilfe w&auml;hre
hier vieleicht eine Rolle WireWrap-Draht mit dem man die fehlende
Verbindung wieder herstellen kann sofern man die passenden
L&ouml;tstellen und Durchkontaktierungen gefunden hat. Die frage nach
dem L&ouml;tkolben, nat&uuml;rlich sollte nur ein kleiner feiner
L&ouml;tkolben verwendet werden. 15 Watt und eine Nadell&ouml;tspitze
sind aussreichend. Zu Begr&uuml;ssen w&auml;hre eine Pinzette und eine
Vacuum-Entl&ouml;tpumpe mit der man das &uuml;berfl&uuml;ssige
L&ouml;tzinn entfernt. In vielen F&auml;llen gen&uuml;gt es den
entsprechenden Kondensator mit der Pinzette in der Mitte zu packen,
beide Seiten kurz Erhitzen, und den Kondensator dann einfach abheben.
Danach kann man die beiden L&ouml;tpads eben noch mit der
Entl&ouml;tpumpe s&auml;ubern. Die Pads sollten vor dem aufl&ouml;ten
des neuen Kondensators frisch verzinnt werden. Man braucht glaube ich
nicht extra zu Betonen das es hier auf extrem kurze L&ouml;tzeiten mit
einer sehr feinen Spitze ankommt. Wer das noch nie gemacht hat sollte
die Finger davon lassen!
<br>
</p>
<p>Ein gut gemeinter Tip!!!
<br>
</p>
<p>Viel Erfolg!
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_lf.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="0902.htm" target="UDOcon"><img src="udo_rg.gif" alt="Soundsubsystem Audio OUT" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
