<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Soundsubsystem Audio OUT
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="0901.htm" target="UDOcon"><img src="udo_lf.gif" alt="Sound-Subsystem" border=0 width="24" height="24"></a>
<a href="0903.htm" target="UDOcon"><img src="udo_rg.gif" alt="Speaker Wire" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Soundsubsystem_20Audio_20OUT">9.2 Soundsubsystem Audio OUT</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Probleme mit dem Sound-Ausgang des Atari F030</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Es soll gleich am Anfang bemerkt werden das Fehler in den Sound
Ein- und Ausgangsschaltungen des Falcons nicht immer leicht zu beheben
sind. Die meisten Bauteile sind in SMD-Technik und so nicht f&uuml;r
jederman leicht Aufzufinden geschweige den durch Neuteile zu ersetzen.
<br>Viele dieser Bauteile habe nicht mal einen vern&uuml;nfigen
Aufdruck mit dem man sie immer korrekt Identifizieren k&ouml;nnte.
<br>
</p>
<p>Sie sind gut beraten wenn Sie sich einen solchen Artikel vor dem
ruml&ouml;ten an Ihrem Computer erst einmal ganz bis zum Ende
durchzulesen, es wird sich so die ein oder andere Frage
er&uuml;brigen.
<br>
</p>
<p>Soundprobleme traten bisher an allen Falcons auf die im Umlauf
sind. Diese Textdatei kann im allgemeinen auf jeden F030 angewendet
werden. Eine Ausnahme sind C-LAB Falcons, hier sollte man vorher
Vergleichen ob die Bauteile noch vorhanden sind.
<br>
</p>
<p>Bisher sind mir alleine bei der Beschaltung des Microfoneinganges
schon zwei verschiedene Schaltungsvarianten bekannt.
<br>
</p>
<p>Pr&uuml;fen Sie ob die Bauteilebezeichnung mit Ihrem Ger&auml;t
&uuml;bereinstimmt.
<br>
</p>
<p>Werfen Sie immer zuerst ein Auge auf die Klinkenbuchsen welche den
Kopfh&ouml;rerausgang und somit den Tonausgang Ihres Falcons
darstellen. Ein leichtes Nachbiegen der Kontaktfedern kann hier schon
wahre Wunder ausl&ouml;sen. Und hat meistens auch schon Erfolg ohne
das man den Rechner mit nachfolgendem Garatieverlust &ouml;ffnen
mu&szlig;. Eine gewisse Vorsicht sollte man hier troz allem walten
lassen. Meistens liegt es nicht mal an der Miniklinkenbuchse, sondern
eher an den Steckern die offensichtlich gr&ouml;ssere Unterschiede in
den l&auml;ngen und der Stiftst&auml;rke aufweisen.
<br>
</p>
<p>Auch ein Nachl&ouml;ten der Anschlu&szlig;pins dieser Buchsen kann
Hilfreich sein. Allerdings mu&szlig; hierzu der Rechner schon
ge&ouml;ffnet werden. Bei einigen Falcons habe ich die 3.5 mm
Klinkenbuchsen auf Kundenwunsch z.B gegen richtige Chinchbuchsen aus
der HiFi-Technik ersetzt. Das hat den Vorteil das man sich zum
Anschlu&szlig; an einen Verst&auml;rker ect. keine umst&auml;ndlichen
Adapterkabel l&ouml;ten mu&szlig; und man so eben einen relativ
normalen Anschlu&szlig; an seinem Rechner hat.
<br>
</p>
<p>Es wird hierzu die entsprechende Klinkenbuchse mit einem
Entl&ouml;ter oder wenigstens einer guten Entl&ouml;tpumpe von der
Platine entfernt. Die L&ouml;taugen sollten hinterher ganz sauber
sein. Diese Chinchbuchsen gibt es als ein St&uuml;ck bei dem sich
jeweils zwei dieser Chinchbuchsen &uuml;bereinander befinden. Diese
Buchsen k&ouml;nnen u.a bei der Fa. Conrad Electronic bezogen werden.
Die Adresse finden sie unter ' <a href="1604.htm" target="UDOcon">H&auml;ndler</a> ' in DOITF030.
<br>
<br>
</p>
<p align=center><img src="image/chinch.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 1 - <a href="0302.htm" target="UDOcon">Falcon F030</a> mit Chinchbuchsen am
Soundeingang</tt>
<br>
</div>
<p>
<br>Die L&ouml;tanschl&uuml;sse dieser Doppelbuchsen passen bei
leichten biegen genau in das mittlere (GND) L&ouml;tauge und in das
jeweilige ganz linke und/oder ganz rechte L&ouml;tauge. <a href="0907.htm" target="UDOcon">Audio</a> GND
befindet sich auf dem mittleren L&ouml;tauge der Falconplatine.
<br>
</p>
<p>Das original Falcongeh&auml;use mu&szlig; an dieser Stelle dann
eben passend ausgefeilt werden. Das geht bei dem Plastikgeh&auml;use
sehr gut mit einer Rundfeile. Wird das sauber gemacht sieht es nachher
so aus als wenn das schon immer so gewesen w&auml;hre. Den
&uuml;berstehenden Feilgrat kann man mit einem Messer einfach
abschaben. Das Entgratet und bricht die Kante.
<br>Zwischen Floppylaufwerk und der Plastikr&uuml;ckwand des Falcons
ist auf jeden Fall Platz f&uuml;r zwei dieser Doppelbuchsen. So
da&szlig; auch der Eingang f&uuml;r das Mikrofon auf solche Buchsen
umger&uuml;stet werden k&ouml;nnte.
<br>
</p>
<p>Bis heute gibt es mit dieser L&ouml;sung keine Probleme, zumal man
auch noch sehr schnell den linken Kanal gegen den rechten Kanal
vertauschen kann, sollte das mal n&ouml;tig werden.
<br>
</p>
<p>Bei den meisten F030-Computern hatten die Soundst&ouml;rungen im
Ausgangsteil meistens immer einen defekten Kondensator als Ursache.
Die Symtome der Ger&auml;te reichten hier von einem Totalausfall eines
Kanals oder dem kr&auml;chzen eines Kanals oder eben auch beider
Kan&auml;le. Sie sollten vorher Ihren Kopfh&ouml;rer oder die
Aktivboxen an einer anderen Tonquelle testen!
<br>
</p>
<p>Bemerkenswert erscheint mir noch die Tatsache das selbst ein
Versuchsweises &ouml;ffnen eines F030 die Garantie erl&ouml;schen
l&auml;sst sofern noch vorhanden, also erst Nachdenken ob man wegen
diesem Fehler die Garantie verfallen l&auml;sst oder eben seinen
<a href="1604.htm" target="UDOcon">H&auml;ndler</a> daf&uuml;r konsultiert, sofern man ja eben noch Garantie
hat.
<br>
</p>
<p>Nach dem man im Falcon die oberen Abschirmbleche entfernt hat kann
man bereits alle Komponenten eines Falcons gut sehen. Zum besseren
Handling ist es aber sicherer wenn man die Bleche komplett entfernt.
Dazu mu&szlig; leider auch das Diskettenlaufwerk gel&ouml;st werden.
Hier ist das Flachbandkabel recht vorsichtig zu bewegen! Nur so
erh&auml;lt man vollen Zugang auf die Platinenstelle, die wesentliche
Bauteile des Soundsubsystem tr&auml;gt. Analogverst&auml;rker und
CODEC befinden sich nat&uuml;rlich direkt unter dem Diskettenlaufwerk.
<br>
</p>
<p>Auch ist es gut, wenn man bei dieser Aktion den internen
Lautsprecher Vorsichtig absteckt, er hat recht kurze Anschlusskabel
und ist jetzt mehr als nur hinderlich. J12 ist hier die passende
Steckverbindung die sich zwischen interner <a href="060402.htm" target="UDOcon">IDE-Platte</a> und dem
Diskettenlaufwerk befindet.
<br>
</p>
<p>Das Diskettenlaufwerk besitzt auf der Unterseite des Rechners drei
lange Schrauben, die vierte Befestigung ist ein Abstandsbolzen aus
Messing der gleichzeitig zur Zentrierung und zur &Uuml;bertragung der
Rechnermasse zum Laufwerkt fungiert.
<br>Ebenso so mu&szlig; bei einem kompletten Ausbau der Hauptplatine
das Schaltnetzteil und die interne 2.5&quot; IDE-Festplatte ausgebaut
werden. Man wird nicht extra Betonen m&uuml;ssen das die Festplatte
auch in ausgebautem Zustand empfindlich gegen Ersch&uuml;tterungen und
starke Schl&auml;ge ist.
<br>
</p>
<p>Es ist besonders bei der <a href="060402.htm" target="UDOcon">IDE-Platte</a> ratsam sich das Kabel mit
einem Filzschreiber VOR dem Abziehen zu markieren. Es passt zwar
eigentlich nur so, immerhin schaffen es aber einige Leute trozdem
dieses Kabel nachher falsch Aufzustecken.
<br>
</p>
<p>Da nun das Floppylaufwerk entfernt wurde kann man bereits die
Ausgangsbuchse sehen, ebenfalls die Spule die hier als Filter dient.
<br>
</p>
<p>Die Spule ist eine Doppelspule, beide Stereokan&auml;le werden
hier durchgef&uuml;hrt. Pin 1 und Pin 2 f&uuml;hre das rechte
Tonsignal, Pin 3 und Pin 4 das linke Signal. Der Pin mit der
jeweiligen kleinsten Nummer ist der Spuleneingang von der
Elektronikseite aus gesehen. Beide Tonsignale liegen zwischen der
Anschlu&szlig;buchse und der Spule &uuml;ber jeweils einen
Kondensator, C 608 und C609 gegen GND (Ger&auml;temasse)!. Die
Kondensatoren haben eine Kapazit&auml;t von 1000pF.
<br>
</p>
<p>Gleichfalls gibt es eine &quot;Tonmasse&quot; im Falcon, diese
liegt &uuml;ber die Spule L37 an der gleichen Klinkenbuchse an.
<br>
</p>
<p>Einige der zum Analogteil geh&ouml;rigen Bauteile befinden sich
auf der Unterseite der F030-Hauptplatine, um dort Messen zu
k&ouml;nnen mu&szlig; die Platine komplett ausgebaut werden. Also
erstes kann nun mit einen ganz einfachen Digitalmultimeter an der
rechten und linken Ferritspule getestet werden ob die <a href="0907.htm" target="UDOcon">Audio</a>-Signale
bis wenigstens am Ende der Spulen anliegt. Auf den Millivolt-Bereich
geschaltet sollten sich an jedem der beiden Kan&auml;le
Spannungsschwankungen gegen die Rechnermasse messen lassen. Ist das
der Fall liegt der Fehler mit Sicherheit schon an der Buchse. (Das
aber meist seltener)
<br>
</p>
<p>Der Falcon mu&szlig; hierzu nicht unbedingt in Betrieb sein um
diesen Fehler zu finden. Die Audiosignale lassen sich aber leichter
verfolgen wenn der Computer auf beiden Kan&auml;len ein gleiches
Signal ausgeben kann. Hier w&uuml;rde sich ein leiser Sinuston
anbieten den mal leicht mit einem Basicprogramm erzeugen kann.
<br>
</p>
<p>F&uuml;r jeden der Tonkan&auml;le gibt es einen LM386, U23
f&uuml;r links und U22 f&uuml;r den rechten Tonkanal, die hier als
Ausgangsverst&auml;rker geschaltet sind. An beiden Bauteilen kann man
hier mit dem Multimeter jeweils an Pin 5 feststellen ob es
Spannungsschwankungen gibt. Ist das nicht der Fall wird die
<a href="0308.htm" target="UDOcon">Fehlersuche</a> leider wesentlich Umfangreicher. Wenn der Falcon also ein
Stereo-Audiosignal erzeugt sollte sich an diesen beiden Bausteinen
schon noch was tun.
<br>Selbstredend ist hier ein Oszilloskop von gro&szlig;em Nutzen.
<br>
</p>
<p>Bleibt der jeweilige Pin 5 &quot;tot&quot; wechselt man den
entsprechenden LM386 oder konzentriert die Suche auf Bauteile die eben
vor und um diesen Audioverst&auml;rker herrum liegen.
<br>Es gibt hier dann nur noch passive Bauteile. Nat&uuml;rlich zeigt
das Multimeter keine genauen Werte an, sondern eben nur das ein Signal
vorhanden ist. Das &auml;ussert sich mit &quot;h&uuml;pfen&quot; der
Anzeige.
<br>
</p>
<p>Von beiden Audioverst&auml;rkern, U22 und U23 l&auml;uft nun das
Tonsignal auf direktem Weg &uuml;ber einen Elko, C83 f&uuml;r links
und C84 f&uuml;r den rechten Kanal zu der Eingangs erw&auml;hten
Doppelspule. Beide Elkos sollten einen Wert von 47uF aufweisen und
auch 16Volt aushalten k&ouml;nnen. Messen kann man Kondensatoren
leider nur mit einer passenden Me&szlig;br&uuml;cke. (Z.b
ELV-Elektronik) Schneller und billiger ist hier allerdings der
Austausch des Bauteils.
<br>
</p>
<p>Elektrolytische Kondensatoren in welcher Bauform auch immer haben
den Nachteil im laufe der Zeit innerlich zu &quot;vertrocknen&quot;
hierbei &auml;ndert sich nat&uuml;rlich leider auch die Kapazit&auml;t
bis sogar hin zum Kurzschlu&szlig;. Hier k&ouml;nnte schon mal ein
&quot;auf Verdacht&quot; gewechselter Kondensator wahre Wunder
bewirken.
<br>
</p>
<p>Die beiden Stereosignale kommen im Falcon vom CODEC, das ist Chip
U28. Der linke Kanal HRI kommt an Pin 15, der rechte Kanal HRI an Pin
16 aus diesem Baustein herraus. Im gleichen Baustein werden auch die
Mikrofonsignale verarbeitet. An Pin 15 und 16 kann man wirklich nur
kleine Spannungsschwankungen registrieren. Dieser Baustein war bisher
noch in keinem der zahlreichen Falcon defekt. Aus HLI und HRI wird
Falcon intern &uuml;brigens auch das Signal f&uuml;r den internen
Lautsprecher erzeugt. Bleibt auch dieser Stumm beschr&auml;nkt sich
die <a href="0308.htm" target="UDOcon">Fehlersuche</a> zuerst auf den Bereich um U21, das ist ein LF347 und
erzeugt das SPEAKER Signal welches sp&auml;ter &uuml;ber eine
Transistor-Gegentaktendstufe dem internen Lautsprecher zugef&uuml;hrt
wird. &Uuml;ber R119 und R120, beide 10K, werden HLI und HRI U21
zugef&uuml;hrt. Beide Signale werden nach diesem beiden
Widerst&auml;nden in U21 zusammen Vorverst&auml;rkt. D.h das linke und
das rechte Signal liegen nach R 119 und R120 zusammen und bilden ein
einziges Signal. Nur so erh&auml;lt man alle Toninformationen.
<br>
</p>
<p>Pin 3 (+) von U21 liegt direkt an Pin 21 des CODEC.
<br>Pin 22 des CODEC bildet die &quot;Soundmasse&quot; (AGND) im
Falcon.
<br>Zwischen Pin 21 und 22 des CODEC liegen die beiden Kondensatoren
C123 mit 0.1uF und Elko C127 mit 3.3uF.
<br>Hier sollte wohl eine gewisse Filterung von CODEC Pin 21
stattfinden.
<br>St&ouml;rungen laufen sich hier an den Kondensatoren tot.
<br>
</p>
<p><tt>Folgende passive Bauteile geh&ouml;ren zum Verst&auml;rker
U21:</tt>
<br>
</p>
<p>R121 10K,R109 1K,R602 10K,C54 47uF,C89 810pF. Pin 11 von U21 liegt
an der &quot;Soundmasse&quot; des Falcon. An Pin 4 des LF347 sollten
ca. 9V Versorgungsspannung anliegen die von U8 erzeugt werden. GND
dieser Spannung sind mit der &quot;Soundmasse&quot; gleich, ein
Potential also.
<br>U21 ist der Vorverst&auml;rker f&uuml;r den internen Bl&ouml;ker
der &uuml;ber J12 angesteckt ist.
<br>
</p>
<p>An U8, das ist ein 9V Spannungsregler, sitzt direkt C1214, das ist
ein Elko mit 220UF. Sollten hier keine +9V zu finden sein ist das
zuerst zu Reparieren. Es kann ein &quot;normaler&quot; 9V
Spannungsregler als Ersatztyp eingesetzt werden. &nbsp;(!nl) (Pin 3 IN
+12V, Pin 2 &quot;Soundmasse&quot;, Pin 1 OUT +9V)
<br>
</p>
<p>Die +9V werden &uuml;brigens auch f&uuml;r den Mikrofoneingang
ben&ouml;tigt! Sollte Ihr Falcon also auch nichts
&quot;h&ouml;ren&quot; kann das i.d.R eine schnelle Reparatur werden.
<br>
</p>
<p>Sind keine +12V zu finden mu&szlig; das Falcon <a href="0f01.htm" target="UDOcon">Netzteil</a>
&uuml;berpr&uuml;ft werden!
<br>
</p>
<p>Man sollte Beachten das man die SMD-Bauteile in einer passenden
Baugr&ouml;&szlig;e kauft, gr&ouml;&szlig;ere Kondensatoren u.
Widerst&auml;nde passen meistens nicht auf die vorhandenen
L&ouml;dpads.
<br>
</p>
<p>Eine genaue Beschreibung aller Bauteile die sich im HLI, HRI
Signalweg befindet w&uuml;rde sicher den Rahmen dieser einfachen
Fehlerbeschreibung bei weitem Sprengen. Deshalb hier nur kurz eine
Zusammenstellung der Bauteile vom CODEC bis zur
Klinken-Ausgangsbuchse, passend f&uuml;r <a href="0907.htm" target="UDOcon">Audio</a> OUT.
<br>
<br>
</p>
<pre>Linker <a href="0907.htm" target="UDOcon">Audio</a>_OUT-Kanal HLI:
---------------------------

 -C122  0.47uF, -R132  50K an Pin 3 -U23, -R131  10K, -C613  560pF Pin 3 -U23.
 -R130  15K, -C95 1K, -C83  47uF, -R126  10K, -C86  0.033uF, -C91  10uF, -L123 Pin 3

Rechter <a href="0907.htm" target="UDOcon">Audio</a>_OUT-Kanal HLR:
----------------------------

 -C94  0.47uF, -R125  50K an Pin 3 -U22. -R124  10K, -C614  560pF Pin 3 -U22.
 -R123  15K,-C90 1K,-C84  47uF,-R121  10k,-C85  0.033uF,-C88  10uF, -L123 Pin 1
</pre>
<p>
<br>In beiden Kan&auml;len befinden sich noch vor der Spule L123
Kondensatoren mit jeweils 1000pF, im einzelnen sind das: C59, C604,
C58, C605.
<br>
</p>
<p>Die Beschreibung dieser Bauteile bezieht sich auf die Revison D.
Es gibt meines Wissens bis jetzt zwei verschiedene Schaltungen
bez&uuml;glich des Soundsoubsystems am Atari <a href="0302.htm" target="UDOcon">Falcon F030</a>. Auf die
meisten Ger&auml;te wird diese Beschreibung aber doch passen.
<br>Suchen mu&szlig; man so oder so.
<br>
<br>
</p>
<pre>            --------------------------------------------------------------
  Vorsicht: Diese Beschreibung kann erhebliche Abweichungen zu neueren
            C-LAB MKI + MKII  sowie Mark X Falcons aufweisen!
            Hier sind z.T umfangreiche Modifikationen vorgenommen worden.
            --------------------------------------------------------------
</pre>
<p>
<br>Sollte diese Aktion jemand nachstellen m&uuml;ssen so sei noch zu
sagen das es unumg&auml;nglich ist alle Sicherheitsvorschriften
bez&uuml;glich der Netzspannung, dem Umgang mit einem SMD geeigneten
L&ouml;tkolben dem Werkzeug und der Schutzvorschriften bez&uuml;glich
statischer Ladungen einzuhalten sind. Ihr Falcon und die sechsfache
Multilayerplatine werden es Ihnen Danken :-)
<br>
</p>
<p>Es ist zugegeben nicht sonderlich leicht alle Leiterbahnen der
Soundsubsysteme ausfindig zu machen, viele der Leitungen liegen aber
zum Gl&uuml;ck auf der Ober- oder auf der Unterseite der F030 Platine,
sogesehen als noch ein recht einfaches und schnelles Unterfangen.
Sollen alle Versuche in dieser Richtung fehlschlagen, da einer der
beiden Kan&auml;le nur einen sporadische Aussetzer hat, der sich
eventuell auch noch mit Knistern und Rauschen ank&uuml;ndigt, ist es
ein guter Tip Sicherheitshalber alle SMD-Kondensatoren und Elkos in
diesem Schaltungszweig auf Verdacht durch eben neue Bauteile zu
Ersetzten. Diese Teile sind nicht teuer und es geht schneller als eben
jeden einzelnen unter die Lupe zu nehmen.
<br>
</p>
<p>Ein weiterer Tip, alle SMD-Widerst&auml;nde und Kondensatoren kann
man z.B bei Conrad-Elektronik kaufen, bei l&auml;ngerem suchen auf der
Platinenunterseite habe ich in der gleichen Zeit alle
SMD-Kondensatoren auf einen Schlag gegen neue ersetzt. Nat&uuml;rlich
ist das keine &quot;Reparatur&quot; erschl&auml;gt aber in 98% aller
F&auml;lle das Problem und erspart eventuell eine wesentlich
l&auml;ngere suche. SMD-Kondensatoren kosten eben nur wenige Pfennige,
die Zeit ansich kostet mehr.
<br>
</p>
<p>An dieser Stelle sein nochmals eindringlich vor dem Verbiegen,
Verspannen oder starkem mechanisch Belasten der Multilayerplatine
gewarnt. Viele andere Verbindungen liegen in den inneren Schichten der
Platine, da hift auch Anbohren nicht weiter. Einzige hilfe w&auml;hre
hier vieleicht eine Rolle WireWrap-Draht mit dem man die fehlende
Verbindung wieder herstellen kann sofern man die passenden
L&ouml;tstellen und Durchkontaktierungen gefunden hat. Die frage nach
dem L&ouml;tkolben, nat&uuml;rlich sollte nur ein kleiner feiner
L&ouml;tkolben verwendet werden. 15 Watt und eine Nadell&ouml;tspitze
sind aussreichend. Zu Begr&uuml;ssen w&auml;hre eine Pinzette und eine
Vacuum-Entl&ouml;tpumpe mit der man das &uuml;berfl&uuml;ssige
L&ouml;tzinn entfernt. In vielen F&auml;llen gen&uuml;gt es den
entsprechenden Kondensator mit der Pinzette in der Mitte zu packen,
beide Seiten kurz Erhitzen, und den Kondensator dann einfach abheben.
Danach kann man die beiden L&ouml;tpads eben noch mit der
Entl&ouml;tpumpe s&auml;ubern. Die Pads sollten vor dem aufl&ouml;ten
des neuen Kondensators frisch verzinnt werden. Man braucht glaube ich
nicht extra zu Betonen das es hier auf extrem kurze L&ouml;tzeiten mit
einer sehr feinen Spitze ankommt. Wer das noch nie gemacht hat sollte
die Finger davon lassen!
<br>
</p>
<p>Und das war ein gutgemeinter Tip!!!
<br>
</p>
<p>Die ICs U21-U23 kann man leicht Handhaben, sollte es hier einen
defekt gegeben haben k&ouml;nnte man hier auch leicht einen IC-Sockel
einl&ouml;ten. Das Erleichert die Arbeit beim &quot;n&auml;chsten
mal&quot;
<br>
</p>
<p>Der interne Lautsprecher steckt an der Buchse J12 im Falcon. Pin 1
ist hierbei Aktiv, Pin 2 hingegen GND.
<br>Das bereits weiter oben erscheinende Signal SPEAKER wir hier
&uuml;ber C78 2.2uF und R86 2.2K an Pin 6 von U21 angelegt. U21 ist
ein LF347 wie bereits weiter oben Erw&auml;hnt. XSPKON welches von
Port IOA6 des Soundchip (PSG) Pin 10 kreiert wird sorgt bei H-Pegel
&uuml;ber R89 4.7K daf&uuml;r das Ihr interner Lautsprecher schweigt
wenn Sie das per Software oder Kontrollfeld verlangen.
<br>
</p>
<p>Der Transistor Q6, ein 2N3904 ist hier der passende Schalter bzw.
der Lautst&auml;rkeregler in dieser Schaltung.
<br>Die bereits Beschriebenen +9V liegen hier &uuml;ber R122 10K an
Pin 5 von U21 an. Ebenso liegt dieser Pin &uuml;ber R111 10K auf der
Audiomasse. (AGND) Direkt liegen die +9V an Pin 4 von U21 an, sollten
hier also leicht zu Kontrollieren sein.
<br>Pin 7 ist mit den beiden Basen der Endstufentransistoren
verbunden, diese wird aus den beiden Transistoren Q4 und Q5 gebildet.
Beide jeweils ein 2N3904.
<br>
</p>
<p>C138 wird &uuml;ber R110 10K &quot;geladen&quot; so da&szlig; die
Endstufe arbeiten kann.
<br>
</p>
<p>&Uuml;ber C139 47uF liegt das so verst&auml;rkte Audiosignal
direkt an Pin 1 von J12 an.
<br>
</p>
<p>Dieser Schaltung macht es nichts aus wenn Sie den Rechner ohne
internen Lautsprecher betreiben, nur sollten Sie den J12 nach
M&ouml;glichkeit nicht Kurzschliessen.
<br>Nach einer Weile w&uuml;rde Sie das minimal Q4 und Q5 kosten.
<br>
</p>
<p>Viel Erfolg!
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="0901.htm" target="UDOcon"><img src="udo_lf.gif" alt="Sound-Subsystem" border=0 width="24" height="24"></a>
<a href="0903.htm" target="UDOcon"><img src="udo_rg.gif" alt="Speaker Wire" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
