<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Audio direct In
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="0907.htm" target="UDOcon"><img src="udo_lf.gif" alt="Audio" border=0 width="24" height="24"></a>
<a href="0909.htm" target="UDOcon"><img src="udo_rg.gif" alt="Sound &uuml;ber Mic-Eingang" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Audio_20direct_20In">9.8 Audio direct In</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Falcon Sound direct In </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Der <a href="0302.htm" target="UDOcon">Falcon F030</a> besitzt an seiner R&uuml;ckwand einen
niederohmigen Mikrofoneingang in Form einer 3.5mm Klinkenbuchse. Viele
Leute haben ein <a href="0701.htm" target="UDOcon">CD-ROM</a> das auf der R&uuml;ckseite einen extra
rausgef&uuml;hrten analogen Audioanschlu&szlig; in Form von zwei
Chinchbuchsen besitzt.
<br>
</p>
<p>Ist das der Fall benutzen Sie das Kabel von <a href="0907.htm" target="UDOcon">Audio</a> IN.
<br>
</p>
<p>Es gibt hier nun mehrere m&ouml;glichkeiten <a href="0907.htm" target="UDOcon">Audio</a>-Signale in den
Falcon zu bringen. Entweder Sie bauen sich das passende Chinch Kabel,
welches hier in DOITF030 unter AudioIN zu finden ist, oder sie
benutzen diese Schaltung mit einem entsprechend modifiziertem Kabel,
sofern Sie ihr <a href="0701.htm" target="UDOcon">CD-ROM</a> mit samt dem Falcon sowieso in einem
Towergeh&auml;use benutzen. Es bleiben so die externen
Falcon-Schnittstellen frei. Vielen CD-ROMs liegt ein Kabelchen bei
welches auf den hinteren internen Audioanschlu&szlig; passt. Dieses
Kabel ist zu verl&auml;ngern und mit den entprechenden Pin direkt auf
dem Mainboard zu verbinden. Selbstredend kann diese Verbindung auch
mit einem Steckanschlu&szlig; direkt am Chip versehen werden. Dazu
Verbinden Sie <a href="0907.htm" target="UDOcon">Audio</a> links mit Pin 2, <a href="0907.htm" target="UDOcon">Audio</a> rechts mit Pin 7 <a href="0907.htm" target="UDOcon">Audio</a> GND
sollten Sie ausschliesslich mit Pin 3 verbinden. Die beiden
Audiokan&auml;le sind immer &uuml;ber Schutzwiderst&auml;nde
anzuschlie&szlig;en. Die Widerst&auml;nde dienen gleichzeitig einer
billigen Pegelanpassung.
<br>
</p>
<p>Beachten Sie bitte das sie an den Audioausg&auml;ngen eines
CD-ROMs, eines CD-Recorders niemals einen direkten Kurzschlu&szlig;
erzeugen! Das Ger&auml;t wird dadurch dauerhaft besch&auml;digt!
Achten Sie auf kurze L&ouml;tzeiten an dem Chip. Er ist nicht teuer,
es ist aber &auml;rgerlich wenn er Ersetzt werden m&uuml;sste.
<br>
</p>
<p>Beachten Sie bitte das dieser Chip mit +9V betrieben wird!
<br>
</p>
<p>Die nachfolgende Zeichnung zeigt einen Teil der
<a href="0907.htm" target="UDOcon">Audio</a>-Eingangsschaltung des <a href="0302.htm" target="UDOcon">Falcon F030</a>. Beachten Sie bitte das sie
nur die farbigen Leitungen und Bauteile fliegend in ihren Falcon
nachr&uuml;sten m&uuml;ssten. Generell kann leider kein Tip zur einer
100% Soundanpassung gegeben werden. Dazu sind Falcon Computer leider
zu unterschiedlich Best&uuml;ckt, sprich mit hohen Bauteiletoleranzen
vorbelastet. Das ist im Einzelfall manuell zu Testen
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/audiodir.gif" border=0 width="466" height="360"></p><br>
<div align=center><tt>Abbildung 1 - Direkter Soundanschlu&szlig; am <a href="0302.htm" target="UDOcon">Falcon F030</a></tt>
<br>
</div>
<p>
<br>
</p>
<p>Beachten Sie bitte bei diesem direkten Eingriff in den Rechner die
Bestimmungen zur Verh&uuml;tung von statischen Entladungen. Die
w&uuml;rden an dieser Stelle das Soundsubsystem des Falcon nachhaltig
Besch&auml;digen. Die in der Zeichnung eingef&uuml;gten 2K
Widerst&auml;nde zur Anpassung dienen als Beispiel, nicht alle
CD-Recorder und CD-ROMs liefern einen Audiopegel in der gleichen
H&ouml;he. Hier ist also mir der gr&ouml;&szlig;e der Widerst&auml;nde
zu experimentieren. Als Richtwert dienen eben 2K Ohm. L&ouml;ten sie
NICHT an den diversen passiven SMD-Teilen sofern es nicht unbedingt
Notwendig ist!
<br>
</p>
<p>Verbinden Sie GND der Audiosignale des CD-Ger&auml;tes mit
AudioGND des Falcons. Verbinden Sie AudioGND nicht mit der
&auml;usseren breiten Massebahn der Falcon Platine. Das f&uuml;hrt u.U
zu St&ouml;rger&auml;uschen beim Abspielen.
</p>
<p>Beachten Sie bitte das kein Microfon am Falcon betrieben werden
sollte solange ein so angeschlossenes <a href="0701.htm" target="UDOcon">CD-ROM</a> ein Audiosignal liefert.
</p>
<p>Mit dem Falcon Kontrollfeld SOUND.CPX k&ouml;nnen Sie die
Eingangsempfindlichkeit und die Lautst&auml;rke in gewissen Grenzen
regeln. Drehen Sie den Lautst&auml;rkeregler am CD-Drive niemals bis
zum Anschlag auf. Das bringt idR nur eine schlechte Tonwiedergabe.
</p>
<p>
<br>
<br>
</p>
<p><b> St&ouml;rger&auml;usche elimieren </b>
<br>
</p>
<p>Eventuell besteht an dem <a href="0f01.htm" target="UDOcon">Netzteil</a>, an welches das <a href="0701.htm" target="UDOcon">CD-ROM</a> betreibt,
eine Verbindung zwischen der Masse (GND, 5V Return) und dem
Schutzleiter des Netzanschlu&szlig;. Da die meisten anderen
Ger&auml;te ebenfalls am Schutzleiter angeschlossen sind entstehen so
schnell sog. Brumm-oder Erdschleifen. IdR funktioniert es wenn diese
Verbindung getrennt wird.(!nl)
</p>
<p>Experimentieren Sie mit der Eingangsbeschaltung des LM387
<br>Siehe eingezeichnete Kondensatoren
<br>
</p>
<p>Schliessen Sie das Geh&auml;use des CD-ROMs an die
Geh&auml;usemasse des Towergeh&auml;uses an. Das CD-Drive besitzt dazu
einen Flachstecker-Anschlu&szlig; auf der R&uuml;ckseite.
<br>
</p>
<div align=center><tt> Arbeiten an Netzteilen sind nur von geschulten
Fachkr&auml;ften auszuf&uuml;hren </tt>
<br><tt> Beachten Sie hierzu die einschl&auml;gigen VDE-Vorschriften
</tt>
<br>
</div>
<p>
<br>
<br><b> Modifikation Mikrofoneingang </b>
<br>
<br>
</p>
<p align=center><img src="image/f30audio.gif" border=0 width="600" height="500"></p><br>
<div align=center><tt>Abbildung 2 - Modifikation des Audioteils </tt>
<br>
</div>
<p>
<br>
</p>
<p>Beachten Sie bitte das bei dieser Modifikation keine
Mikrofon-Spannung mehr am Mikrofon-Eingang des Falcon anliegt und hier
kein Mikrofon betrieben werden kann das mit einer Phantomspannung
versorgt wird.
<br>
</p>
<p>Die Modifikation passt den Toneingang auf Line Level-Pegel an.
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="0907.htm" target="UDOcon"><img src="udo_lf.gif" alt="Audio" border=0 width="24" height="24"></a>
<a href="0909.htm" target="UDOcon"><img src="udo_rg.gif" alt="Sound &uuml;ber Mic-Eingang" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
