<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Audio Brummen
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="090f.htm" target="UDOcon"><img src="udo_lf.gif" alt="Tonquellen koppeln" border=0 width="24" height="24"></a>
<a href="0911.htm" target="UDOcon"><img src="udo_rg.gif" alt="Soundpool Interfaces" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Audio_20Brummen">9.16 Audio Brummen</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Audio Brummen am Computer </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Viele Anwender haben bei Aufnehmen oder &Uuml;berspielen von
Audiosignalen von der Stereoanlage, einem TV-Ger&auml;t oder sonstiger
externer Audioquellen auf den Computer St&ouml;rger&auml;usche oder
gar ein Rauschen oder Netzbrummen in der Aufnahme. Oft tritt auch
beides zusammen auf.
<br>
</p>
<p>Das hat meistens die gleiche Ursache und ist nur richtig zu
beheben wenn man diese Ursache auch korrekt lokalisieren kann.
<br>
</p>
<p>Der erste Punkt der die St&ouml;rungen beseitigen kann ist das sie
ihre Audioger&auml;te komplett vom Wechselstromnetz trennen und mit
Batterien arbeiten.
<br>
</p>
<p>Der zweite Punkt sind teuere &quot;Mantelfiler&quot;, die immer
wieder von von echten &quot;Profis&quot; in Audiokabel eingeschleift
werden. Beide L&ouml;sungen k&ouml;nnen das Problem minimieren oder
auch ganz verschwinden lassen, jedoch garantiert nicht die eigentliche
Ursache dieses Problems.
<br>
</p>
<p>
<br>
<br><b> Die drei wichtigsten Punkte: </b>
<br>
</p>
<dl>
<dt><b>Stromversorung</b></dt><dd> Netzbrummen bei <a href="0907.htm" target="UDOcon">Audio</a>&uuml;bertragungen tritt immer dann auf wenn
eine uralte, nicht mehr zeitgem&auml;sse Elektoinstallation in dem
Geb&auml;ude, -Geb&auml;udeteil vorhanden ist in dem die
Audioaufnahmen stattfinden sollen.
<br>
<br>&nbsp;
<dt><b>Erd- oder Brummschleifen</b></dt><dd> Audiobrummen, Netzbrummen tritt immer dann auf wenn mehrere
Audioger&auml;te oder Computer &uuml;ber Audiokabel miteinander
verbunden werden, dabei aber doppelt und zudem meistens dann auch noch
falsch geerdet sind.
<br>
<br>&nbsp;
<br>Ursache daf&uuml;r k&ouml;nnen auch falsch entkoppelte
Audioanschl&uuml;sse oder Ger&auml;te sein die einfach nur zu dicht
beieinander aufgestellt wurden.
<br>
<br>&nbsp;
<br>Halten Sie Audiokabel von den Netzteilen ihrer Halogenbeleuchtung
fern!
<br>
<br>&nbsp;
<br>Vermeiden Sie &uuml;berlange Audioverbindungen
<br>
<br>&nbsp;
<br>Betreiben Sie -alle- notwendigen Ger&auml;te an der gleichen
Steckdose.
<br>
<br>&nbsp;
<br>Vermeiden Sie magnetisch induktive beeinflussung ihrer Audiokabel.
<br>Verlegen Sie daher Mikrofon-, Lautsprecher- und
&Uuml;berspielkabel generell nicht zusammen mit Netzteitungen. Gemeint
sind hierbei mehrere Meter in Kabelkan&auml;len oder sonstigen
Sammeleinrichtungen. Ein Meter hinter ihrer <a href="0305.htm" target="UDOcon">Hardware</a> spielt keinerlei
Rolle.
<br>
<br>&nbsp;
<dt><b>Falsche Erdung &uuml;ber Antennenkabel</b></dt><dd> Audiobrummen tritt auf wenn ihr Empfangsger&auml;t &uuml;ber die
daran angeschlossene Antennenleitung, deren Abschirmgeflecht, einen
besseren Erdanschlu&szlig; hat als die restliche Anlage oder gar ihr
Computer. Das passiert immer dann wenn Sie direkt von einem TV oder
Radioger&auml;t, einer Stereoanlage aufnehmen m&ouml;chten welche
direkt eine Verbindung zu einer Antenne oder einen Kabelanschlu&szlig;
hat.
<br>
<br>&nbsp;
</dl>
<p>In vielen &auml;lteren Geb&auml;uden wird auch heute noch
bez&uuml;glich der Netzstromversorgung die &quot;klassische
Nullung&quot; verwendet. Das ist zwar nicht Verboten, nur in Neubauten
ist es generell verboten, aber es ist immerhin nicht mehr
Zeitgem&auml;ss und deutet nur darauf hin das sich jemand 30 Jahre
lang Sanierungskosten gespart hat.
<br>
</p>
<p>Generell, seit einigen Jahren, werden elektrische Netzverbraucher,
nach VDE, nur noch an einem Dreileiter- bzw. einem F&uuml;nfleiternetz
betrieben. Alles andere ist mehr oder weniger nur noch geduldet. Neu
aber nicht mehr Erlaubt.
<br>
</p>
<p>Eine korrekte Elektroinstallation finden Sie in Abbildung 1
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/brummen1.gif" border=0 width="500" height="400"></p><br>
<div align=center><tt> Abbildung 1 - zul&auml;ssige Stromverteilung </tt>
</div>
<p>
<br>
<br>
</p>
<p>Wie Sie aus dieser Zeichnung entnehmen k&ouml;nnen wird der dritte
Leiter, der Schutzleiter in ihrem Geb&auml;ude, im Keller, erzeugt und
verbindet letztendlich die Mittenkontakte, die Schutzleiterkontakte
ihrer Steckdosen mit dem Potentialausgleich, der Erde. Negativer
Bezugspunkt der elektrischen Energie die Sie kaufen. Korrekt
funktioniert das nur bei einer modernen Elektroanlange.
<br>
<br>
<br>
</p>
<p align=center><img src="image/brummen2.gif" border=0 width="500" height="400"></p><br>
<div align=center><tt> Abbildung 2 - klassische Nullung </tt>
</div>
<p>
<br>
<br>
</p>
<p>Wie Sie der Abbildung 3 entnehmen k&ouml;nnen fehlt hier komplett
der Schutzleiter und zwar vermutlich im ganzen Geb&auml;ude. Da der
blaue &quot;Null&quot;, &quot;N&quot; oder auch Neutralleiter nie von
R&uuml;ckstr&ouml;men ihrer elektrischen Verbraucher frei ist kann es
daher auch zu diversen St&ouml;rungen beim &Uuml;berspielen von
Audiosignalen kommen. Im &uuml;brigen trifft das auch Ger&auml;te die
ausschliesslich ab Werk mit sog. Eurosteckern, also nur einer
zweipoligen Netzverbindung hergestellt wurden. Beachten Sie in diesem
Zusammenhang auch die folgenden Zeichnungen.
<br>
</p>
<p>Sind diese Ger&auml;te trozdem in einem Metallgeh&auml;use
eingebaut, haben diese Geh&auml;use eine k&uuml;nstliche, aber dennoch
zugelassene Erdung.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/brummen3.gif" border=0 width="640" height="400"></p><br>
<div align=center><tt> Abbildung 3 - falsche Erdschleifen.. </tt>
</div>
<p>
<br>
<br>
</p>
<p>Falsch Erdschleifen entstehen Grunds&auml;tzlich immer dann wenn
&uuml;ber die Abschirmungen der <a href="0907.htm" target="UDOcon">Audio</a>- und Antennenkabel kleine
Ableitstr&ouml;me fliessen die dort nichts zu suchen haben und bei
normalen Bedingungen auch nicht vorhanden sind. Jedes Ger&auml;t das
an den Netzstromkreis angeschlossen ist erzeugt &uuml;ber den
Nulleiter auch einen R&uuml;ckstrom genau wie auch
Induktionsstr&ouml;me. Diverse Ger&auml;tenetzteile haben sogar einen
netzspannungsfesten Kondensator zwischen dem Netzanschlu&szlig; und
dem eigenen Metallgeh&auml;use verschaltet, eben die zuvor
angesprochene &quot;k&uuml;nstliche Erdung&quot;. Ebenso dienen solche
Ger&auml;te, trotz angeklebtem VDE-G&uuml;tezeichen, auch als
Empf&auml;nger solcher kleinen Ableitstr&ouml;me und dessen
anh&auml;ngenden St&ouml;rungen. Je mehr Ger&auml;te sie verwenden
desto h&ouml;her werden die Ableitst&ouml;me, um so lauter sind die
St&ouml;rungen.
<br>
</p>
<p>Mantelfiler tun nun nichts anderes als an eben diesem Kabel, in
das Sie diesen Mantelfiler einf&uuml;gen, das Schirmgeflecht des
Kabels zu unterbrechen und diese Stelle mit einem Kondensator zu
&uuml;berbr&uuml;cken, so das eben keine Ableit- und
Ausgleichstr&ouml;me mehr fliessen k&ouml;nnen. Den niederfrequenten
Audiosignalen tut das keinen Abbruch, sie &uuml;berwinden den so
eingef&uuml;gten Kondensator spielend.
<br>
</p>
<p>Die St&ouml;rungen lassen sich so minimieren, aber eben nicht
eliminieren.
<br>
</p>
<p>Wie sie in Abbildung 3 ersehen k&ouml;nnen bildet in diesem
Beispiel das Abschirmgeflecht des Antennenanschlu&szlig; die bessere
Erdleitung, Strom sucht sich generell immer den k&uuml;rzesten uns
einfachsten Weg, in diesem Fall laufen alle sich in den Ger&auml;tem
addierenden Ableitst&ouml;mchen &uuml;ber diesen Anschlu&szlig; zur
Erde und verursachen dabei das Ger&auml;usch das sie als
&quot;St&ouml;rung&quot; ihrer Audioaufnahme erkannt haben.
<br>
</p>
<p>M&ouml;glicherweise haben Sie einen kleinen Erfolg wenn Sie an
einem oder mehreren Netzverbrauchern den Netzstecker ziehen und um 180
Gard gedreht wieder einstecken. Lt. den Zeichnungen w&uuml;rde das
Blau und Schwarz vertauschen.
<br>
</p>
<p>Das w&uuml;rde in diesem Fall die internet Netzverschaltung eines
ihrer Ger&auml;te &auml;ndern und eventuelle eine Reduzierung des
Ableitstomes mitbringen. Der Gesamtableitstrom ihrer Anlage w&uuml;rde
geringer, und somit ihre &quot;St&ouml;rungen&quot; leiser.
<br>
</p>
<p>Beachten Sie bitte das an den Stellen in Abbildung 3, welche mit
einem kleinen Blitz markiert sind, leicht Spannungen von mehr als 120V
entstehen k&ouml;nnen!
<br>Sie k&ouml;nnen das messen in dem Sie die Antennenleitung abziehen
und zwischen Ger&auml;te- und Antennenschirm ein Me&szlig;ger&auml;t
mit dem Me&szlig;bereich AC 750V einf&uuml;gen.
<br>Finden Sie hierbei eine Spannung h&ouml;her als 3Volt k&ouml;nnen
Sie auch leichtes Rauschen oder Brummen bei ihrer
<a href="0907.htm" target="UDOcon">Audio</a>&uuml;berspielung vernehmen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/brummen4.gif" border=0 width="640" height="400"></p><br>
<div align=center><tt> Abbildung 4 - falsche Erdschleifen und L&ouml;sungen.. </tt>
</div>
<p>
<br>
<br>Wie Sie hier sehen, d&uuml;rften sie im Betrieb aller Ger&auml;te,
nicht mal einen Stecker abziehen ohne Gefahr zu laufen eines oder
mehrere Ger&auml;te zu zerst&ouml;ren. Insbesondere trifft das die
Kammeraden die auch heute noch der Meinung sind das z.B
SCSI-Ger&auml;te, Audiokarten zu den &quot;HotPlug&quot;- Baugruppen
z&auml;hlt. Lassen Sie sich an dieser Stelle gesagt sein das der
kleinste Fehler schnell teuer werden kann.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/brummen5.gif" border=0 width="640" height="400"></p><br>
<div align=center><tt> Abbildung 5 - falsche Erdschleifen und L&ouml;sungen.. </tt>
</div>
<p>
<br>
<br>Es geht so. Aber es ist letztendlich keine Ursachenbehebung.
<br>Nur eine Minimierung eines vorhandenen Problems.
<br>
<br>
<br>
</p>
<p align=center><img src="image/brummen6.gif" border=0 width="640" height="400"></p><br>
<div align=center><tt> Abbildung 6 - Die 100% fachgerechte L&ouml;sung des Problems
</tt>
</div>
<p>
<br>
<br>Wie Sie der Abbildung 6 entnehmen k&ouml;nnen tritt so ein Fall
bei einer 100% fachgerechten Elektroinstallation, einer korrekten
Ger&auml;teverdrahtung und einem korrekt ausgef&uuml;hrtem
Erdanschlu&szlig; -ALLER- Verbraucher normalerweise gar nicht erst
auf. Unter anderem ist das auch die sicherste L&ouml;sung, f&uuml;r
-ALLE- beteiligten, also nicht nur der verwendeten Ger&auml;te.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="090f.htm" target="UDOcon"><img src="udo_lf.gif" alt="Tonquellen koppeln" border=0 width="24" height="24"></a>
<a href="0911.htm" target="UDOcon"><img src="udo_rg.gif" alt="Soundpool Interfaces" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
