<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: MAGNUM Falcon
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0a.htm" target="UDOcon"><img src="udo_up.gif" alt="Speichererweiterungen" border=0 width="24" height="24"></a>
<a href="0a06.htm" target="UDOcon"><img src="udo_lf.gif" alt="CENTRam" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_rg.gif" alt="Beschleuniger f&uuml;r den F030" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="MAGNUM_20Falcon">10.7 MAGNUM Falcon</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Falcon Magnum Ram Karte </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Der Einbau stellte keine gr&ouml;ssere H&uuml;rde dar, da man ja
eignentlich gar nichts falsch einbauen kann. Die Karte passt
ausschliesslich nur auf den interen Prozessor-Erweiterungsbus.
<br>
</p>
<p>Die Karte ben&ouml;tigt einen Treiber im Autoordner!
<br>
</p>
<p>Wenn Sie Karte vom Bus entfernen m&uuml;ssen Sie auch wieder den
Jumper auf die Erweiterunsleiste stecken, ansonsten bootet der Falcon
nicht.
<br>
<br>
<br>
</p>
<p><b> <a href="030702.htm" target="UDOcon">Expansionsport</a> im Atari Falcon </b>
<br>
</p>
<p>J19(J16), die l&auml;ngere Stiftleiste befindet sich direkt vor
dem internen <a href="0f01.htm" target="UDOcon">Netzteil</a>. Auf der k&uuml;rzeren Stiftleiste J20 befindet
sich ein Jumper, welcher in der hinteren Reihe so steckt das in
Richtung CPU genau 4 Pin freibleiben. Die Stelle ist normalerweise bei
allen neueren Falcon mit einem wei&szlig;en &quot;U&quot; markiert.
<br>
</p>
<p>Vorserienger&auml;ten fehlt diese Markierung!
<br>
</p>
<p>
<br>
<br>
</p>
<pre>
           J19 (J16)

           o o o o o o o o o o o o o o o o o o o o o o o o o 50
         1 o o o o o o o o o o o o o o o o o o o o o o o o o

                                                   ---------
        -----     -----                           |
        |    |    |    |                          |
        -----     -----                           |   CPU
          U49        U59                          |


J20                  Jumper
                    ###
  o o o o o o o o o o o o o o o 30
1 o o o o o o o o o o o o o o o

</pre>
<p>
<br>
<br>
</p>
<p>Beachten Sie diesen Jumper!
<br>
</p>
<p>Die Magnum ist eine Fastram-Karte - der Speicher liegt zwar
unterhalb der 16MB im Falcon, da&szlig; geht mit der CPU im Falcon
nicht anders, ist aber nicht f&uuml;r das Videoram benutzbar, bringt
daf&uuml;r aber mehr als den doppelten Durchsatz des ST-RAM in hohen
Farbaufl&ouml;sungen des Falcon.
<br>
</p>
<p>Im Atari Falcon ist ab Werk kein Fastram vorgesehen. Die Karte
kann daher generell ohne Treiber oder gepatchtes TOS nicht
funktionieren. Da niemand das TOS Patchen m&ouml;chte, also dann
lieber einen kleinen Treiber im Autoordner.
<br>
</p>
<p>Zur Qualit&auml;t der von Seidel zusammengel&ouml;teten Karten
sage ich jetzt lieber nichts, aber prinzipiell ist die Magnum nach
meinen Erfahrungen ziemlich problemlos.
<br>
</p>
<p>
<br>
<br><b> Einbaubericht </b>
<br>
</p>
<p>Email: mailto:PhilippDonze@gmx.ch
<br>Homepage: http://philippdonze.atari-computer.de
<br>
</p>
<dl>
<dt><b>Magnum Fast-RAM Karte f&uuml;r Falcon030</b></dt><dd>
<br>&nbsp;
<br>Da mir nach knapp 7 Jahren pl&ouml;tzlich mehr und mehr der
Speicher auszugehen schien, entschied ich mich im Februar 2000 eine
Magnum Fast-RAM Karte f&uuml;r meinen Falcon030 zu kaufen. Ich
entschied mich f&uuml;r diese Karte, weil ich keine Werbung f&uuml;r
eine andere Karte gesehen habe.
<br>
<br>&nbsp;
<br>Nach langem warten hatte ich die Karte jedoch in meinen
H&auml;nden. Aber das war's dann auch schon. Der <a href="1604.htm" target="UDOcon">H&auml;ndler</a>, der mir
die Karte verkauft hatte, legte mir keine Einbauanleitung und auch
keine Diskette mit Software bei! Also begann das grosse
R&auml;tselraten.
<br>
<br>&nbsp;
<dt><b>Frage: Welche SIMM Module kann man verwenden?</b></dt><dd>
<br>&nbsp;
<br>Die Karte hat einen Sockel f&uuml;r 1*72 Pin PS/2 Modul. Laut
Werbung kann man 4 MB und 8 MB Module einsetzen. Dieser Speicher kommt
dann zu den eingebauten X MB (bei mir 4) original Atari-RAM. Es ist
aber nicht m&ouml;glich das 14MB Limit zu durchbrechen! Von meinem
Vater hatte ich 2*8 MB PS/2 SIMM Module erhalten (die er in seinem PC
schon lange nicht mehr brauchen konnte), von denen ich ein Modul in
den Sockel dr&uuml;ckte. Dank der Bauweise der Module und des Sockels
ist es nicht mOglich das Modul falsch in den Sockel einzusetzen.
<br>&nbsp;
<dt><b>2. Frage: Und wo geh&ouml;rt nun die Karte hin?</b></dt><dd>
<br>&nbsp;
<br>Da ich meinen Falcon030 fr&uuml;her schon, zwecks <a href="0701.htm" target="UDOcon">CD-ROM</a>
Erweiterung, in einen Big-Tower umgebaut habe, war das &ouml;ffnen des
Computers keine grosse Sache. Also, wenn man das Motherboard vor sich
hat, dann muss man die Karte auf den Prozessorerweiterungs-Slot
stecken. Dieser befindet sich auf der linken, unteren Seite des
Motherboards. Es handelt sich dabei um 2 Stiftleisten. Falls der Slot
noch nie benutzt wurde (und das wird wohl so sein, wenn man diese
Karte gekauft hat) befindet sich auf der einen Stiftleiste einen
Jumper, den man entfernen muss. Nun dr&uuml;ckt man dir Karte
vorsichtig auf die Stiftleisten. Auch hier kann es nicht passieren,
dass man dies falsch macht, denn die Leisten sind nicht gleich lang
und auch nicht parallel zueinander gebaut. Das war's dann auch
schon... Den Falcon wieder zusammengeschraubt und mit Strom versorgt,
fragt man sich...
<br>&nbsp;
<dt><b>3. Frage: Und wo ist nun der neue Speicher?</b></dt><dd>
<br>&nbsp;
<br>Das Falcon030 TOS erkennt die Speichererweiterung nicht
automatisch. Daher wird man nach wie vor keinen Unterschied beim
Memory-Test des TOS bemerken. Das war dann auch vorl&auml;ufig das
Ende meiner H&ouml;henfl&uuml;ge. Da mir mein <a href="1604.htm" target="UDOcon">H&auml;ndler</a> keine
Software mitgab, musste ich mir selbst helfen. In der
Mausgruppe-Software war man sehr hilfsbereit und schickte mir das
Programm per Email zu. Ausserdem ist das Programm auf der <a href="http://www.uweschneider.de" target="_top">Homepage</a> von Uwe
Schneider zu finden.
<br>&nbsp;
<dt><b>4. Frage: Und was mit der Software?</b></dt><dd>
<br>&nbsp;
<br>Bei meinem Softwarepacket, das ich erhalten habe, lagen folgende
Dateien bei:
<br>
<br>&nbsp;
<br>MAGNUM.PRG = Das AUTO-Ordnerprogramm (=Treiber)
<br>MAGNCONF.PRG = dient zum Konfigurieren des MAGNUM.PRG
<br>SETFLAGS.PRG = dient zum Anpassen des Programmheaders
<br>COOKIE.TXT = Beschreibung des MAGN-Cookies
<br>CUBASE\MAGMALOC.PRG = Ein Patchprogramm f=r Cubase u.a.
<br>CUBASE\MAGMALOC.TXT = die Beschreibung dazu
<br>LINUX\AUTO_OFF.TOS = ???
<br>LINUX\BOOTSTRA.TTP = ??? Damit Linux den Speicher erkennt ?
<br>
<br>&nbsp;
<br>Das Programm MAGNUM.PRG kopierte ich in den AUTO-Ordner und
konfigurierte die AUTOEXEC.BAT von MagiC entsprechend. Es ist darauf
zu achten, dass das Programm m&uuml;glichst fr&uuml;h gestartet wird
(also an 1. Stelle der AUTOEXEC.BAT eintragen), so dass der Speicher
so fr&uuml;h wie m&ouml;glich dem System zur Verf&uuml;gung steht.
<br>
<br>&nbsp;
<br>Mit dem Programm MAGNCONF.PRG kann man MAGNUM.PRG konfigurieren.
Zur Auswahl stehen:
<br>
<br>&nbsp;
<br>-Ausf&uuml;hrlicher RAM-Test:
<br>Wird dieser Punkt aktiviert, wird bei jedem Neustart das RAM nicht
nur schnell durchgez&auml;hlt sondern ausf&uuml;hrlich getestet.
<br>
<br>&nbsp;
<br>-Blitter auf 8 MHz schalten:
<br>Wozu das gut ist??
<br>&nbsp;
<br>-NOVA-Kompatibilit&auml;t
<br>Dieser Punkt dient wohl dazu, dass einen bestimmten Adressbereich
f&uuml;r die <a href="0807.htm" target="UDOcon">NOVA Grafikkarte</a> frei zulassen. (ohne Gew&auml;hr)
<br>
<br>&nbsp;
<br>Ist alles so konfiguriert wie man m&ouml;chte (meist, muss man
nichts &auml;ndern), kann der Computer neu gestartet werden. Beim
Booten kann man beobachten, dass der Magnum-Treiber wie das Atari-TOS
einen wachsenden Balken beim Speichertest darstellt. Sind keine Fehler
aufgetreten und wurde das PS/2 Modul korrekt erkannt, steht der
Speicher dem n&auml;chsten Programm zur Verf&uuml;gung.
<br>
<br>&nbsp;
<br>Die <a href="0204.htm" target="UDOcon">Installation</a> ist vollendet.
<br>
<br>&nbsp;
<dt><b>Zu beachten:</b></dt><dd>
<br>&nbsp;
<br>-Falls man MagiC installiert hat, n&uuml;tzt es nichts, wenn
MAGNUM.PRG vor MAGXBOOT.PRG steht. Da MagiC einen Reset
durchf&uuml;hrt, muss der Treiber danach erneut gestartet werden. Der
Treiber sollte an erster Stelle in der AUTOEXEC.BAT eingetragen sein.
<br>
<br>&nbsp;
<br>-Tests von mir haben gezeigt, dass keine Systemvariable vom
Treiber angepasst werden. D.h. unter der Systemvariable RAMTOP ($5A4)
findet man nicht, wie zu erwarten w&auml;re, das Ende des Fast-RAMs.
Der Treiber scheint lediglich den Speicher mittels Maddalt() dem
GEMDOS bekannt zu machen.
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0a.htm" target="UDOcon"><img src="udo_up.gif" alt="Speichererweiterungen" border=0 width="24" height="24"></a>
<a href="0a06.htm" target="UDOcon"><img src="udo_lf.gif" alt="CENTRam" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_rg.gif" alt="Beschleuniger f&uuml;r den F030" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
