<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: F030 Beschleunigen
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_up.gif" alt="Beschleuniger f&uuml;r den F030" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_lf.gif" alt="Beschleuniger f&uuml;r den F030" border=0 width="24" height="24"></a>
<a href="0b0101.htm" target="UDOcon"><img src="udo_rg.gif" alt="Speed Resolution Karte" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="F030_20Beschleunigen">11.1 F030 Beschleunigen</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>F030 - C P U - Beschleuniger</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Falcon-Computer sind aufgrund ihrer <a href="0305.htm" target="UDOcon">Hardware</a> und des eigentlich
guten Betriebssytems doch schon sehr leistungsf&auml;hig, was
Computergrafiken angeht. Leider wird diese Sparte meiner Meinung nach
noch nicht gen&uuml;gend unterst&uuml;tzt, so fehlen schon seit langem
Programme wie z.B Video f&uuml;r Windows oder &Auml;hnliche. Einfache
.AVI und .MOV-Player gibt es ja seit einiger Zeit von Dieter
Fiebelkorn. Auch die DSP_MPEG-Player erreichen erstaunliche
Geschwindigkeiten, wenn man den DSP mit einem h&ouml;heren Takt
versorgt. Was immer noch fehlt, sind z.B. ein richtiges ElektroCAD und
Software, die es z.B erm&ouml;glicht die IC Kataloge (<a href="0701.htm" target="UDOcon">CD-ROM</a>) einiger
Halbleiterhersteller zu lesen
<br>
</p>
<p>Da uns hier wie eigentlich sonst auch immer die Fa. Atari im Regen
stehen l&auml;sst, sind hier die wenigen, noch vorhandenen
Programmierer gefragt. Programmierer, die in der Lage sind, so etwas
zu schreiben ohne sich dabei an schon vorhandenen schlechten
Beispielen zu orientieren
<br>
</p>
<p>Um die Leistungsf&auml;higkeit eines F030 noch um einiges zu
steigern, bieten einige Hardwarehersteller sog. Beschleuniger an. Zwei
Beispiele sind hier z.B. PowerUP2 von Catch oder die wesentlich
bessere MightySonic, welche leider so ohne weiteres nicht mehr
erh&auml;ltlich ist. Als weitere Module, die zu empfehlen sind, gibt
es hier noch die verschiedenen <a href="0b0107.htm" target="UDOcon">Skunk</a>-Modelle, um einige der
g&uuml;nstigen Vertreter genannt zu haben. Beschleuniger wie den
&quot;Barracuda&quot; kennt man ja bisher leider nur als
&quot;Anschauungsobjekt&quot; und kann darauf hoffen, da&szlig; der
irgendwann auch mal verkauft wird. Der <a href="0b04.htm" target="UDOcon">Afterburner</a> ist seit der ProTos
'95 f&uuml;r ca. 1200 DM zu beziehen und hat recht erstaunliche
Leistungsdaten, die bereits mehrfach im Mausnetz publiziert wurden.
Leider ist aber auch diese Erweiterung wohl nur noch gebraucht zu
erhalten. Die letzten Exemplare wurden Anfang 1998 noch von Titan
Design LTD in England verkauft. Es wird vermutlich auch keine
Nachfolgemodelle laut Titan Design geben
<br>
</p>
<p>Zum <a href="0b04.htm" target="UDOcon">Afterburner</a> findet man bei mir auf dem Rechner ein gesondertes
Textfile im Verzeichnis &quot;Beschleuniger&quot;
<br>Filename: AFTER040.ZIP
<br>
</p>
<p>Mit einem Beschleuniger kann man auf relativ einfach Art u. Weise
die Rechenleistung der CPU um ein Mehrfaches steigern. Alle
Beschleuniger verdoppeln hierzu den Takt f&uuml;r die CPU. So werden
aus 16Mhz z.B. einfach 32Mhz gemacht, um diese dann eben der CPU
zuzuf&uuml;hren. Nat&uuml;rlich geht es noch wesentlich schneller,
wenn man die CPU gegen z.B. eine 68040er Version tauscht. Die im
Falcon eingebaute <a href="040109.htm" target="UDOcon">68030 CPU</a> verkraftet ein gutes St&uuml;ck
h&ouml;heren Takt, hier also keine Panik. Andere Beschleuniger heben
den Takt auch bis auf 40Mhz CPU und auch schon 50Mhz DSP-Takt an. Hier
ist zu bemerken, da&szlig; wenn der DSP kr&auml;fig beschleunigt wird,
die CPU 'nachhinkt'. Es sollte also gleichzeitig auch die CPU
h&ouml;her getaktet werden. Eine noch relativ neue Entwicklung ist der
<a href="0b02.htm" target="UDOcon">Nemesis</a>- Beschleuniger, welcher auch den gesamten Bustakt des Falcons
auf 25Mhz anhebt. Das bringt eine deutlichere Leistungssteigerung als
das einfache Anheben des CPU-Taktes.
<br>
</p>
<p>Nach dem <a href="0b02.htm" target="UDOcon">Nemesis</a> ist noch bei CENTEK der CenTurbo2-Beschleuniger
nach langer Entwicklungszeit entstanden. Mit einem Takt von bis zu
50Mhz stellt dieser Beschleuniger wohl das momentane obere Ende des
Leistungsspektrums dar.
<br>
</p>
<p>Einige der gr&ouml;&szlig;eren Beschleuniger machen das so und
stellen gleichzeitig auch noch eine gr&ouml;&szlig;ere Portion von
schnellem RAM-Speicher zur Verf&uuml;gung. Ein Falcon kann hier ohne
Weiteres um ein Vielfaches schneller werden als z.B. ein normaler
Atari TT-Rechner. Andere Prozessoren gibt es bedingt durch den
h&ouml;heren Schaltungsaufwand nur auf Erweiterungskarten, die den
internen <a href="030702.htm" target="UDOcon">Expansionsport</a> belegen. Weitere Karten k&ouml;nnen hier dann
Huckepack aufgesteckt werden, ein neues Rechnergeh&auml;use wird dann
in jedem Fall f&auml;llig.
<br>
</p>
<p>Weitere M&ouml;glichkeiten bestehen darin, auch die FPU und den
DSP getrennt mit einen h&ouml;heren Takt zu versorgen. Nicht ganz
unerw&auml;hnt sollte beleiben, da&szlig; es hierbei bei den
verschiedenen F030-Computern zu unterschiedlichen Reaktionen kommen
kann. Die einen Boards verkraften das, ohne zu Murren w&auml;hrend
andere nach 2 Betriebsstunden anfangen, irgendwelche dummen Sachen zu
machen. Die einfachsten Probleme sind einfache Systemh&auml;nger oder
simple Abst&uuml;rze, besonders wenn der Bustakt erh&ouml;ht wird.
Nimmt man den erh&ouml;hten Systemtakt weg, wird man sehen, da&szlig;
der Rechner danach wieder einwandfrei arbeitet. Bei dem Einbau z.B.
des PowerUP2 wird aus diesem Grund ebenfalls gleich der sog.
ClockPatch mit vorgenommen. Das ist die L&ouml;sung mit dem 74F04
Huckepack auf U63 unter dem <a href="0c02.htm" target="UDOcon">Keyboard</a>. Eine genauere Beschreibung dazu
finden Sie unter ClockPatch hier in diesem Archiv.
<br>
</p>
<p>Einzigartig finden Sie hier farbige Bilder und Photos der
Einbaustelle.
<br>Neben den Bildern finden Sie dort auch die verschiedenen Varianten
des ClockPatches und eine genaue Beschreibung inkl. den passenden
Einbauanleitungen
<br>
</p>
<p>Man sollte bei einem solchen Umbau peinlichst genau die jeweilige
Arbeitsanleitung des Herstellers bzw. die einzelnen Schritte in dessen
Anleitungen befolgen. Dennoch kann leider niemand eine 100%ige
Funktionsgarantie &uuml;bernehmen. Bei sp&auml;teren Abst&uuml;rzen
oder Systemh&auml;ngern kann schon das Aufkleben eines kleinen
K&uuml;hlk&ouml;rpers auf die CPU, die FPU oder eben die DSPs richtige
kleine Wunder wirken. Abh&auml;nging davon, welchen Teil man
beschleunigt hat. Zu beachten ist auf jeden Fall, da&szlig; der
Rechner gen&uuml;gend Luftdurchsatz zum K&uuml;hlen hat, ja schon eine
ganz einfache Bildschirmerweiterung treibt die Innentemperatur des
Rechner weit nach oben, da hier der Videochip eben reichlich warm
wird. Auch Zusatzl&uuml;fter k&ouml;nnten hier eine wesentliche
Verbesserung bringen.
<br>
</p>
<p>Siehe Speed-Resolutioncard
<br>Siehe L&uuml;ftersteuerung
<br>
</p>
<p>K&uuml;hlk&ouml;rper sollten niemals anderen Teile im Falcon
ber&uuml;hren und auch nur mit einem speziellen W&auml;rmeleitkleber
auf die entsprechenden Bauteile aufgeklebt werden. Der
K&uuml;hlk&ouml;rper sollte schon genau passen, gr&ouml;&szlig;ere
K&uuml;hlk&ouml;rper verhindern nachhaltig das Arbeiten in der
n&auml;heren Umgebung. W&auml;rmeleitkleber bekommt man im
einschl&auml;gigen Elektronikfachhandel. Ein K&uuml;hlk&ouml;rper
f&uuml;r z.B. die CPU sollte schon eine relativ flache Ausf&uuml;hrung
haben, da es sonst Platzprobleme mit Erweiterungskarten geben kann.
S&auml;mtliche Leitungen, die von einem Beschleunigermodul zur
Falconplatine f&uuml;hren, sollten so kurz wie m&ouml;glich gehalten
werden. Diese Leitungen, einige davon, f&uuml;hren in jedem Fall den
hohen Systemtakt und wirken im ung&uuml;nstigsten Fall wie eine
Antenne. Hier auch gleich in zwei Richtungen. Zum einen wird der Takt
abgestrahlt und von der anderen Seite jede gr&ouml;&szlig;ere
St&ouml;rung 'empfangen'. Ganz gut geht das z.B. mit einem Handy in
der N&auml;he. Taktleitungen verlegt man am besten immer sehr dicht
auf der Falconplatine. Nach dem Einbau und dem erfolgreichen Testen
der Erweiterung h&auml;tte man da die M&ouml;glichkeit, die Leitungen
hin und wieder mit einem winzigen Tr&ouml;pfchen Hei&szlig;kleber auf
der Platine anzukleben. So sieht das ganze dann auch noch sehr sauber
aus, vorausgesetzt, der Kleber wird sparsam verwendet.
<br>
</p>
<p>Einfacher ist ein Einbau, bei dem der Beschleuniger auf den
Erweiterungsbus gesteckt wird. Hier sind die meisten Leitungen
vorhanden und man braucht nur sehr wenig bis &uuml;berhaupt nicht zu
l&ouml;ten. Das erleichtert die Sache ungemein und ist eigentlich auch
von jedem Anwender selbst auszuf&uuml;hren. Kritische Umbauten wie
z.B. den Takt der FPU oder des DSPs zu erh&ouml;hen sollte Leuten
vorbehalten beleiben, die wisssen, wie ein Computer von innen aussieht
und die auch genau wissen, was sie da machen. Bei der FPU geht es in
den meisten F&auml;llen nur, in dem man am Pin 11 des FPU-Sockels
hantiert. Welche Folgen das haben kann, darf sich jeder selbst
ausmalen, wenn er sich den Sockel genauer ansieht. Der Sockel befindet
sich direkt unter dem internen <a href="0f01.htm" target="UDOcon">Netzteil</a> des Falcon und ist i.d.R. bei
einen Neuger&auml;t leer. Wurde der Sockel besch&auml;digt, ist in den
meisten F&auml;llen kein korrekter Betrieb einer FPU mehr
m&ouml;glich; ein neuer Sockel mu&szlig; in jedem Fall eingel&ouml;tet
werden. Man sollte seinen Umbau so planen, da&szlig; der Rechner
jederzeit wieder in seinen Ursprungszustand zur&uuml;ckversetzt werden
kann. Hat man hier Leiterbahnen unterbrochen oder Beinchen an
irgendwelchen Bauteilen abgeschnitten, sieht man recht dumm aus,
sollte die Erweiterung aus welchen Gr&uuml;nden auch immer nicht
arbeiten.
<br>
</p>
<p>Sehr erfreulich, wenn man den alten Zustand wieder herstellen
kann.
<br>
</p>
<p>Neigt der Beschleuniger zum Rumspinnen, kann schon eine einfach
Ferritperle auf der Leitung, welche den Takt in den Rechner einspeist,
wahre Wunder bewirken. K&uuml;rzen der Taktleitung bis auf das
wirklich ben&ouml;tigte Minimum an L&auml;nge nat&uuml;rlich auch. Aus
thermischen Gr&uuml;nden sollte ein Beschleunigermodul niemals auf
einem Chip im Rechner aufgeklebt werden.
<br>
</p>
<p>Einige dieser Beschleuniger werden von einem .CPX-Modul aus dem
Kontrollfeld heraus aktivert. Das hat den Vorteil, da&szlig; man hier
keinen extra Schalter einbauen mu&szlig;. Bei einem Towergeh&auml;use
kann man hierzu allerdings den sowieso vorhanden
&quot;Turbo-Schalter&quot; an der Vorderfront des Geh&auml;uses
verwenden. Auch gibt es hier die dazu passende Anzeige-LED, mit der
man sofort sehen kann, mit welchem Takt die Maschine l&auml;uft. Auch
das Ansteuern der eigentlichen Taktfrequenenzanzeige ist hiermit in
den meisten F&auml;llen kein Problem.
<br>
</p>
<p>Hier gen&uuml;gt es meistens, eine einzige Steuerleitung mit
entweder +5 oder GND zu verbinden. Einige Beschleuniger haben zu
diesem Zweck extra einen eigenen Anschlu&szlig;, mit dem man entweder
eine einfache LED oder eben die Umschaltleitung einer <a href="1002.htm" target="UDOcon">Taktanzeige</a>
ansteuern kann. Beim Ansteuern einer LED ist auf jeden Fall ein
entsprechender Vorwiderstand n&ouml;tig, abh&auml;ngig nat&uuml;rlich
von der verwendeten Leuchtdiode. Bei positiver Steuerung kann man mit
einem Transistor oder einem IC-Gatter negieren oder eben umgekehrt.
<br>
<br>
</p>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<div align=center>Da&szlig; diese L&ouml;tarbeiten ein gewisses Ma&szlig; an
Grundwissen mit
<br>sich bringen, kann man nie laut genug sagen, prinzipiell wird
<br>am Rechner nur gearbeitet, wenn der Netzstecker gezogen ist.
<br>L&ouml;tarbeiten sind sehr sauber und gewissenhaft
auszuf&uuml;hren.
<br>L&ouml;tzinnreste werden nicht durch Wegblasen entfernt!
<br>
</div>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>
<br>
</p>
<p>Wichtige Eingriffspunkte f&uuml;r einen Beschleuniger bleiben die
jeweiligen Quarzoszillatoren im Falcon, bei einem reinen
CPU-Beschleuniger die gleiche Stelle, an der auch der sog. ClockPatch
ausgef&uuml;hrt wird, also die SMD-Widerst&auml;nde R216, R221 und
R222 sowie R217. Per .CPX-Modul kann man auch &uuml;ber die ACIAs 6850
die Speeder Ein- bzw. ausschalten. Hierf&uuml;r d&uuml;rfte meistens
Pin 5 in Betracht kommen. +5 Volt und GND f&uuml;r die Versorgung
k&ouml;nnen eigentlich an jedem beliebigen Punkt im Rechner entnommen
werden. Es befindet sich z.B. eine GND-Leiterbahn rund um die
Falconplatine an deren Rand. Mehr oder weniger unterscheiden sich die
verschiedenen Einbauvarianten, herstellerabh&auml;nging eigentlich nur
geringf&uuml;gig. Bei dem Einbau sollte man die Ruhe bewahren und sich
auch mindestens mal 2 Stunden Zeit nehmen. Ein weiterer wichtiger
Punkt ist es, nach dem Einbau alles genau zu kontrollieren.
S&auml;mtliche Leitungen von A nach B nochmals nachsehen und sehen, ob
die auch wirklich am richtigen Punkt angel&ouml;tet wurden. Wenn der
Rechner nach dem Einschalten nicht korrekt bootet, ist in den meisten
F&auml;llen nur eine Leitung nicht am richtigen Punkt oder aber
einfach nicht richtig angel&ouml;tet. Keine Panik, an diesem Teil des
Rechners kann unter normalen Umst&auml;nden eigentlich nichts
zerst&ouml;rt werden. Ausnahmen best&auml;tigen allerdings auch hier
die Regel. Bootet das Ger&auml;t nicht, ist auf jeden Fall zuerst zu
kontrollieren, ob &uuml;berhaupt die Versorgungsspannung richtig am
Beschleunigermodul anliegt. Als n&auml;chsten Schritt nimmt man sich
nochmals die Taktleitungen vor. In den meisten F&auml;llen ist hier
der Ein- bzw. der Ausgang vertauscht worden. Liegt die
Versorgungsspannung am Beschleuniger falsch an, ist hier mit einem
Defekt desselben zu rechnen. In jeden Fall sollte der Falcon aber im
urspr&uuml;nglichen Zustand wieder laufen.
<br>
</p>
<p>Nicht ganz unwichtig ist das eigentliche 32 Mhz Taktsignal,
da&szlig; im Falcon mit einem Quarz analog erzeugt wird und im COMBEL
auf 16Mhz geteilt wird. Unten finden Sie dazu einen
Oszilloskop-Schnappschu&szlig;, der ein sauberes Signal anzeigt.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/takt1.gif" border=0 width="320" height="240"></p><br>
<div align=center><tt> Abbildung 1 - 16Mhz Taktsignal, sauber und zackig </tt>
</div>
<p>
<br>
<br>Wenn alle Stricke rei&szlig;en, gibt es noch die M&ouml;glichkeit,
in die Leitung, welche den h&ouml;heren Takt aus dem
Beschleunigermodul wieder zum Mainoard transportiert, wieder einen
Widerstand in der Gr&ouml;ssenordnung von 22-33 Ohm einzul&ouml;ten.
Das begrenzt die Signalbelastung und kann unter Umst&auml;nden sehr
schnell zum gew&uuml;nschten Erfolg f&uuml;hren. Ebenso l&auml;sst man
auch schon mal die Ferritperle weg, die hat eine fast gleiche
Auswirkung auf die Taktleitung. Noch eine M&ouml;glichkeit ist es, den
Takteingang des Beschleunigers von R216 auf Pin 8 vom 74F04 (Huckepack
auf U63) umzul&ouml;ten. Einige Versuche sind hier schon angesagt,
ansonsten ist es der beste Weg, die Hotline des entsprechenden
H&auml;ndlers anzurufen. Hier gibt es in den meisten F&auml;llen eine
sehr kompetente Hilfe, wenn erst mal auch nur per Telefon. Ist der
Umbau gegl&uuml;ckt und der Falcon l&auml;uft auch &uuml;ber mehrere
Stunden stabil kann man seinen Erfolg mit z.B. dem Programm GEMBENCH
austesten; alleine an diesen Me&szlig;werten kann man sehen, wie
leistungsf&auml;hig der Rechner mit einem h&ouml;heren Systemtakt
geworden ist. Im Grafikbereich ist eine erneute Berechnung alter
Raytracersequenzen mit dem POV-Raytracer angesagt. Man wird ganz
erstaunliche Ergebnisse erzielen. Benutzt man einen Beschleuniger, der
zus&auml;tzlich noch &uuml;ber einen Cache bzw. FastRam verf&uuml;gt,
macht sich der Zuwachs noch wesentlich st&auml;rker bemerkbar.
Prinzipiell kann man jedem den Einbau eines Speeders empfehlen.
Keinerlei Auswirkungen hat das St&uuml;ck <a href="0305.htm" target="UDOcon">Hardware</a> auf
Terminalprogramme ;-)
<br>
</p>
<p>Ein g&uuml;nstiges Preis-Leistungsverh&auml;ltniss hat die
<a href="0b03.htm" target="UDOcon">FX-Karte</a> von BlowUp, diese Karte tr&auml;gt FastRam bis zu 32Mb und
stellt gleichzeitig eine Bildschirmerweiterung mit eingebautem CPU,
FPU &amp; DSP-Beschleuniger dar. Die Karte wird mit
handels&uuml;blichen 30 poligen SIMM-Modulen best&uuml;ckt. Bei einem
Preis von momentan 298.- ohne Ram sicherlich aber eine gute
Alternative zu den ansonst f&auml;llig werdenen drei einzelnen
Erweiterungen. Die &quot;FX&quot; wird einfach auf den internen
Erweiterungsport des F030 gesteckt. Wird keine Bildschirmerweiterung
oder ein Beschleuniger ben&ouml;tigt, fallen auch keinerlei
L&ouml;tarbeiten an. Sie dient dann lediglich als FAST-Ram
Erweiterung. Weitere Informationen erteilt sicher gerne die
<br>
</p>
<p>Zur <a href="0b03.htm" target="UDOcon">FX-Karte</a> finden Sie in diesem Archiv neuere Informationen!
<br>Siehe unter <a href="0b03.htm" target="UDOcon">FX-Karte</a> und <a href="0b0302.htm" target="UDOcon">FX-Board</a>.
<br>
</p>
<p>Hier im DOITF030 Archiv findet man die ungef&auml;hre Lage der
Bauteile und auch den schematischen Anschlu&szlig; am Beispiel eines
Speedermoduls. Viele dieser Speedermodule arbeiten nach genau dem
gleichen Prinzip. Die genauen Anschlu&szlig;punkte entnimmt man in
jedem Fall der entsprechenden Einbauanleitung des Beschleunigers.
Sollte z.B. eine MightySonic aufzutreiben sein, trifft diese Zeichnung
nicht zu, da dieser Einbau wesentlich umfangreicher ist.
<br>Eine komplette Einbauanleitung zur MightySonic finden Sie auf
meinem Rechner und auf der Homepage von Werner_Frey
<br>
</p>
<ul>
<li> <a href="http:come.to/wfrey" target="_top">MightySonic Einbauanleitung</a>
<br>&nbsp;
</li>
</ul>
<p>
<br>
<br>
</p>
<p align=center><img src="image/f030sped.gif" border=0 width="600" height="350"></p><br>
<div align=center><tt>Abbildung 2 - schematische Verdrahtung eines Falcon
Speeders</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p><b> Sonderfall SRC </b>
<br>
<br>
</p>
<p>Wie oft zu lesen ist gibt es bei der Verwendung der
SpeedResolutionCard von Hard &amp; Soft das Problem mit dem Abfragen
der JAGUAR-Joypads an eben dem Padports. Sofern einer der beiden nicht
sowieso schon durch einen externen <a href="0806.htm" target="UDOcon">ScreenBlaster</a> belegt ist. Leute,
die eine SRC im Rechner haben, werden sich sicher wundern, da&szlig;
an Ihrem Rechner selten Spiele korrekt laufen, die die Padbuchsen
abfragen. Das liegt daran, da&szlig; man an manchen Stellen offenbar
glaubt, da&szlig; diese Buchsen nur zum Spass in den Falcon eingebaut
wurden und man dieses daher f&uuml;r irgendwelche obskuren
Umschaltarbeiten f&uuml;r einen CPU-Beschleuniger vergewaltigen
k&ouml;nnte.
<br>
</p>
<p>Beim Einbau der SRC wird an einem der Padports ein Kabel
angel&ouml;tet. Diese Leitung wieder entfernen oder &uuml;ber einen
einfachen Schalter f&uuml;hren. Sollte der SRC-Takt ge&auml;ndert
werden, so ist dieser Schalter zu schlie&szlig;en, ansonsten kann er
offen verbleiben. Der Padport kann bei offenem Schalter wieder normal
benutzt werden.
<br>
</p>
<p>Oder man entscheidet sich gleich f&uuml;r eine andere
Erweiterung..
<br>
</p>
<p>Probleme mit der Taktumschaltung entstehen hier auch, wenn CPU und
FPU nicht mit der gleichen Taktfrequenz betrieben werden. Stellen Sie
dann sicher, da&szlig; CPU und FPU mit der gleichen Geschwindigkeit
arbeiten.
<br>
</p>
<p>Have Speed and Fun...
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li>11.1.1 <a href="0b0101.htm" target="UDOcon">Speed Resolution Karte</a></li>
<li>11.1.2 <a href="0b0102.htm" target="UDOcon">Mighty Sonic</a></li>
<li>11.1.3 <a href="0b0103.htm" target="UDOcon">MM32</a></li>
<li>11.1.4 <a href="0b0104.htm" target="UDOcon">DSP - Beschleuniger</a></li>
<li>11.1.5 <a href="0b0105.htm" target="UDOcon">Barracuda &amp; Hawk</a></li>
<li>11.1.6 <a href="0b0106.htm" target="UDOcon">40Mhz FPU</a></li>
<li>11.1.7 <a href="0b0107.htm" target="UDOcon">Skunk</a></li>
<li>11.1.8 <a href="0b0108.htm" target="UDOcon">PowerUp2</a></li>
<li>11.1.9 <a href="0b0109.htm" target="UDOcon">Centurbo 1</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_up.gif" alt="Beschleuniger f&uuml;r den F030" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_lf.gif" alt="Beschleuniger f&uuml;r den F030" border=0 width="24" height="24"></a>
<a href="0b0101.htm" target="UDOcon"><img src="udo_rg.gif" alt="Speed Resolution Karte" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
