<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Skunk
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b01.htm" target="UDOcon"><img src="udo_up.gif" alt="F030 Beschleunigen" border=0 width="24" height="24"></a>
<a href="0b0106.htm" target="UDOcon"><img src="udo_lf.gif" alt="40Mhz FPU" border=0 width="24" height="24"></a>
<a href="0b0108.htm" target="UDOcon"><img src="udo_rg.gif" alt="PowerUp2" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Skunk">11.1.7 Skunk</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Falcon Beschleunigermodul Skunk </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Ein Beschleuniger der Fa. Comtex
<br>
</p>
<p>Ein 36 Mhz-Beschleuniger f&uuml;r den Falcon030 von der Fa.
Comtex. Ein Einbau von h&ouml;her als 32 MHz getakteten
Falcon-Beschleunigern erweist sich normalerweise als recht schwierig
da gleichzeitig auch der Bustakt angepasst werden m&uuml;sste.
<br>
</p>
<p>Ist das nicht der Fall mu&szlig; nicht nur der CPU-Takt bei jedem
Zugriff auf die Peripherie ge&auml;ndert werden, auch behindert der
h&ouml;here Bustakt die stark Timingabh&auml;ngige Communikation
zwischen den einzelnen Komponenten des Falcon.
<br>
</p>
<p>Nicht selten kommt es zu Bildst&ouml;rungen oder einer sehr
schlechten Bilddarstellung z.B im R,G,B- bzw. im TV-Modus. Bei
erh&ouml;htem Bustakt, ohne weitere Eingriffe, laufen auch andere
Prozesse im Falcon schneller ab, z.B auch die Bilderzeugung &uuml;ber
den TV-Modulator.
<br>
</p>
<p>Zum Einbau eines Skunk sind Kenntnisse &uuml;ber die
Falcon-<a href="0305.htm" target="UDOcon">Hardware</a> sowie gute L&ouml;terfahrungen gefragt. Laien ist vom
Einbau generell abzuraten da im schlimmsten Falle Zerst&ouml;rung des
Falcon nicht zu verhindern ist.
<br>
</p>
<p>Ein Skunk 36 Beschleuniger kostete vor Jahren inkl. Einbau und
einem halben Jahr Garantie DM 398.-
</p>
<p>Die Leistungsdaten:
<br>
<br>
</p>
<p>CPU Takt: 9/ 18/ 36 schaltbar (1 6)
<br>FPU Takt: 36/ 50 wahlweise (16)
<br>DSP-Takt: 50 (32)
<br>Blitter Takt: 9/ 18 (16)
<br>RAM/ BUS Takt: 18 (16)
<br>IKBT: 4/ 4,434 (4)
<br>
</p>
<p>Ehemalige Bezugsquelle:
<br>Comtex Computersysteme
<br>Rehlingstra&szlig;e 7
<br>79100 Freiburg
<br>
</p>
<p>Warum Atari, nach dem 32Mhz Atari TT, bei der
Prozessorgeschwindigkeit am Falcon wieder auf 16MHz ausgewichen ist,
es war damals wahrlich schon nicht mehr Stand der Dinge, ist mir bis
heute verschlossen geblieben.
<br>
</p>
<p>Fakt jedoch ist das genau dies einige Hersteller dazu bewog
Beschleunigermodule f&uuml;r den Atari Falcon zu produziern, die
bekanntesten sind <a href="0b0108.htm" target="UDOcon">PowerUp2</a> und eben der Skunk. Sp&auml;ter werden sich
hier noch wesentlich leistungsf&auml;higere Beschleuniger einreihen.
<br>
</p>
<p>32Mhz statt 16MHz CPU-Takt, 50Mhz anstelle 16MHz FPU-Takt, 50Mhz
statt 32MHz DSP-Takt w&auml;ren schon 1994 der Stand der Technik
gewesen. H&auml;tte man nicht geschlafen und besser selektierte
Bauteile verwendet h&auml;tte der Falcon schon bei seinem erscheinen
schneller als der vorher erschienene Atari TT sein k&ouml;nnen. Zum
Gl&uuml;ck hat der Chefentwickler bei Atari, Richard Miller, den
Falcon so konstruiert das die Taktsignale zu den einzelnen Komponenten
wie CPU, FPU und DSP quasi sternf&ouml;rmig verlegt sind. Nur diese
Tatsache erm&ouml;glich den Einbau eines Beschleunigers und das
einspeisen schneller Taktsignale auf die Hauptplatine des Falcon.
<br>
</p>
<p>Von diesem Umstand werden alle nach dem Skunk und
<a href="0b0108.htm" target="UDOcon">PowerUp2</a>-Beschleuniger erschienen Hardwarebeschleuniger pofitieren.
Ein weiteres Faktum ist die Tatsache da&szlig; Motorola-Prozessoren
hohe Betriebssicherheiten bei der &Uuml;bertaktung aufweisen. Nur das
bef&auml;higt diese Bauteile meist auch bis zur doppelten Takten
betrieben werden zu k&ouml;nnen.
</p>
<p>Man achte aber bitte stets darauf das kein Hersteller f&uuml;r den
korrekten Betrieb eines Bauteils garantiert bzw. das dieses
Bestriebsspezitikationen einh&auml;lt, wenn das Teil mit dem doppelten
Takt, als ausgewiesen, versorgt und betrieben wird. Das alles ist ein
-kann- funktionieren, mu&szlig; es aber nicht.
<br>
</p>
<p>Damit sind wir auch beim Kernpunkt. Niemand, werder ein
CPU-Hersteller noch ein Hersteller eines Beschleunigermoduls kann
f&uuml;r den korrekten Betrieb bei einer doppelten Taktrate
garantieren. Die Werbung hat das bis zum heutigen Tage elegant
verschwiegen.
<br>
</p>
<p>
<br>
<br><b> Benchmark </b>
<br>
</p>
<p>Mit dem bekannten Quick-Index, auf einem normalen Falcon030 und
auf dem Skunk, sieht man das der der Skunk anscheinend die doppelte
CPU-Leistung bringt. In der Praxis ist das aber wenig da diese
L&ouml;sung weder einen ausreichenden Cache benutzt noch das der Takt
des Arbeitsspeicher, dem Falcon Ram, erh&ouml;ht wird. Um
Speicherzugriffe zu erm&ouml;glichen schaltet die CPU bei jedem
Speicherzugriffe auf 16Mhz herunter, was die Performance gewaltig
dr&uuml;ckt. Dabei entsteht kein Geschwindigkeitsgewinn.
</p>
<p>Programme, die auf CPU-Cache optimiert sind, k&ouml;nnten davon
profitieren.
<br>
</p>
<pre>
ST-Hoch/NVDI

CPU memory       476    649
CPU register 406        811
CPU divide       504    1014
CPU shifts       1737   3534
TOS text            553 591
TOS string       274    299
TOS scroll       241    252
GEM dialog       605    683

VGA, 16 Farben/NVDI

CPU memory       408    568
CPU register 406        811
CPU divide       504    1014
CPU shifts       1737   3534
TOS text            167 190
TOS string       155    178
TOS scroll       45   47
GEM dialog       415    450

VGA, 256 Farben/NVDI

CPU memory       358    454
CPU register 402        811
CPU divide       502    1014
CPU shifts       1737   3534
TOS text            79  99
TOS string       86     109
TOS scroll       17     18
GEM dialog      252     281

</pre>
<p>
<br>
<br>
</p>
<p align=center><img src="image/skunk.gif" border=0 width="808" height="722"></p><br>
<div align=center>
<br><tt> Abbildung - 1 Skunk32 auf Falcon Mainboard </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Die <a href="0305.htm" target="UDOcon">Hardware</a> dieser Beschleuniger steckt in einem kleinen,
vergossenen K&auml;stchen und wird &uuml;ber farbige Kabel mit der
Hauptplatine verbunden. So sieht niemand den Logic-Chip der &uuml;ber
einen freien ACIA-Port des Falcon angesteuert, die Taktumschaltung
initiiert
</p>
<p>Vorteil dieser Methode ist, da&szlig; der interne
Erweiterungs-Port des Falcon030 frei bleibt und z.B f&uuml;r ein
<a href="0804.htm" target="UDOcon">ScreenEye</a> oder einen FalconSpeed benutzt werden kann.
</p>
<p>Das Beschleunigermodul sollte, entgegen der Anleitung, niemals auf
einen Chip, schon gar nicht auf der CPU, des Falcon befestigt werden.
Die Luftzirkulation im Falcon ist schon ab Werk stark behindert, was
bedeutet das der Skunk bei h&ouml;heren Umgebungstemperaturen
aussteigen wird. Unmotivierte Systemabst&uuml;rze sind die besten
Anzeichen daf&uuml;r.
</p>
<p>Die FPU im Falcon, es sollte schon ein 32Mhz-Typ sein, kann mit
50MHz-Takt versorgt werden. Der DSP kann auf 50MHz beschleunigt
werden.
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b01.htm" target="UDOcon"><img src="udo_up.gif" alt="F030 Beschleunigen" border=0 width="24" height="24"></a>
<a href="0b0106.htm" target="UDOcon"><img src="udo_lf.gif" alt="40Mhz FPU" border=0 width="24" height="24"></a>
<a href="0b0108.htm" target="UDOcon"><img src="udo_rg.gif" alt="PowerUp2" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
