<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Nemesis Modifikation
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b02.htm" target="UDOcon"><img src="udo_up.gif" alt="Nemesis" border=0 width="24" height="24"></a>
<a href="0b0201.htm" target="UDOcon"><img src="udo_lf.gif" alt="Nemesis Accelerator" border=0 width="24" height="24"></a>
<a href="0b0203.htm" target="UDOcon"><img src="udo_rg.gif" alt="Mighty&amp;Nemesis" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Nemesis_20Modifikation">11.2.2 Nemesis Modifikation</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Nemesis Modifikation</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><tt> Modifikationen f&uuml;r den <a href="0b02.htm" target="UDOcon">Nemesis</a> Beschleuniger </tt>
<br>
</p>
<p>Wir erinnern uns das vor einiger Zeit der <a href="0b02.htm" target="UDOcon">Nemesis</a>-Beschleuniger
auf den Markt kam und die Sache mit Falcon-SpeedUp so auf einen
gewissen Punkt brachte. Technische Daten zum Beschleuniger finden sie
im vorherigen Artikel in englischer Sprache.
<br>
</p>
<p>Hier geht es um einige kleine Modifikationen die den Einbau des
Beschleunigers f&uuml;r Tower-Besitzer ein wenig erleichtern sollen.
<br>
</p>
<p>Als erstes besch&auml;ftigen wir uns daher mit dem
VGA/RGB-Umschalter den man halt schon aus
Kompatibilit&auml;tsgr&uuml;nden gleich mit Einbauen sollte wenn man
den <a href="0b02.htm" target="UDOcon">Nemesis</a>-Beschleuniger in seinen Falcon einbaut.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/rgbswitc.gif" border=0 width="354" height="250"></p><br>
<div align=center><tt> Picture - a simple plug in RGB/VGA Switch </tt>
</div>
<p>
<br>
<br>
</p>
<p>Wie man der englischen Einbauanleitung entnehmen kann sollte
hierzu ein Umschalter mit einem einfachen Umschaltkontakt verwendet
werden. Im originalen Plastikgeh&auml;use ist hierzu ein Loch zu
bohren damit der entsprechende Umschalter eingebaut werden kann.
Anders so die Tower-Besitzer. Die sind fein raus, k&ouml;nnen diese
doch einen der nicht benutzten Schalter bzw. Taster des
Towergeh&auml;uses verwenden. In vielen Geh&auml;usen befindet sich
daher hinter der Front ein B&uuml;ndel mit bunten Kabeln und 2-4
poligen Miniatursteckern. In vielen F&auml;llen sind diese sogar auch
fertig Beschriftet. Das erleichert die Arbeit.
<br>
</p>
<p>Wie sie sicher der Grafik entnehmen k&ouml;nnen habe ich auf dem
Mainboard des Falcons zu diesem Zweck eine zweipolige Stiftleiste
angel&ouml;tet, je nach Platzverh&auml;ltnissen kann diese Stiftleiste
liegend oder stehend aufgel&ouml;tet werden. Als GND dient hierzu die
&auml;ussere breite Massefl&auml;che des Falcon. Ein genauer Punkt
spielt keine Rolle. Der &auml;ussere Pin wird wie gehabt fest mit GND
verl&ouml;tet w&auml;hrend der zweite Pin vorerst frei bleibt. Wenn
sie das in der N&auml;he von L117 vornehmen k&ouml;nnen sie dann den
10K Widerstand wie beschrieben zwischen den rechten Pin von L117 und
dem noch freien Ende der Stiftleiste einl&ouml;ten. Das ist auch der
richtige Punkt f&uuml;r den Pink-farbenen Draht der <a href="0b02.htm" target="UDOcon">Nemesis</a>-Platine.
<br>
</p>
<p>Beachten Sie bitte das diese Seite der Stifleiste keinen Kontakt
zu anderen Teilen im Falcon erhalten darf!
<br>Es w&uuml;rde ansonsten nicht Funktionieren.
<br>
</p>
<p>Auf den so geschaffenen Anschlu&szlig; steckt man nun z.B den
Turbo-Switch oder sonstige nicht verwendete Schalter des
Towergeh&auml;uses. In der gleichen Art k&ouml;nnte man mit jeder
weiteren Sonderfunktion/Erweiterung verfahren. In vielen F&auml;llen
sind eben einige Bedienelemente eines Towergeh&auml;uses ansonsten
Zwecklos.
<br>
<br>
<br>
</p>
<p><b> Fehler in der Einbauanleitung </b>
<br>
</p>
<p>Weiterhin befindet sich in vielen Ausgaben der englischen
Einbauanleitung unter dem Abschnitt 9.2 DSP-Modifikationen ein Fehler
unter (d). Es wird hier nicht der braune Draht sondern der GELBE Draht
des <a href="0b02.htm" target="UDOcon">Nemesis</a> angel&ouml;tet!
<br>
</p>
<p>Eine echt dumme Fehlerquelle.
<br>
</p>
<p>Ebenso stellte sich bei einigen Falcons heraus das es besser geht
wenn man die beschriebenen L&ouml;tarbeiten unter 'DMA-Patch' gemeint
ist hier die Sache mit dem Kondensator zwischen Pin 14 von U20 und der
DMA-Taktleitung (Pin 110) erst einmal ganz komplett weg l&auml;sst.
<br>
</p>
<p>Mehrere Ger&auml;te arbeiten so WESENTLICH stabiler als mit der
von Titan wohl &uuml;berhastet entworfenen Modifikation.
<br>
</p>
<p>Noch ein Tip f&uuml;r <a href="0b02.htm" target="UDOcon">Nemesis</a>-Interessierte bei denen es nicht
sofort klappt:
<br>
</p>
<p>Aus vielen Emails zu diesem Thema kann ich entnehmen das die
meisten Einbaufehler offensichtlich schon beim Modifizieren der
ACIA-Anschl&uuml;sse gemacht werden. Das betrifft hier also den Punkt
8 der Einbauanleitung. Hier gibt es vermutlich aber nur sprachliche
Missverst&auml;ndnisse. Die Einbauanleitung selber ist hier
Fehlerfrei.
<br>
</p>
<p>Einige Leute sollten sich auch vieleicht die Seite 24 der
Anleitung nochmals sehr genau durchsehen! Auch hier ist schnell der
Bock drin. Weitere gute Tips befinden sich auf der Seite 35!
<br>
</p>
<p>
<br>
<br><b> Leuchtanzeigen </b>
<br>
</p>
<p>Wer es denn recht bunt braucht macht dann noch das hier:
<br>
</p>
<p>Pin 5 von U24 zeigt 48Mhz (LED und 1K Widerstand in Reihe nach
GND) Pin 5 von U52 zeigt 40Mhz (LED und 1K Widerstand in Reihe nach
GND)
</p>
<p>Sollten sie hierbei einen Kurzschlu&szlig; verursachen, also einen
Pin einer ACIA direkt gegen GND legen, zerst&ouml;ren sie die
entsprechende ACIA direkt und sofort! Ersatz ist in Deutschland
mittlerweile recht problematisch.
<br>
</p>
<p>Zu finden auf der letzten Seite der Einauanleitung. Die
Anschl&uuml;sse der LED(s) k&ouml;nnen wie weiter oben Beschrieben
ausgef&uuml;hrt werden.
<br>
</p>
<p>Bilder (c) 1997-2001 by Robert Schaffner
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/rgbswitc.gif" border=0 width="354" height="250"></p><br>
<div align=center><tt> Picture - a simple plug in RGB/VGA Switch </tt>
</div>
<p>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b02.htm" target="UDOcon"><img src="udo_up.gif" alt="Nemesis" border=0 width="24" height="24"></a>
<a href="0b0201.htm" target="UDOcon"><img src="udo_lf.gif" alt="Nemesis Accelerator" border=0 width="24" height="24"></a>
<a href="0b0203.htm" target="UDOcon"><img src="udo_rg.gif" alt="Mighty&amp;Nemesis" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
