<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: FX-Karte
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_up.gif" alt="FX-Karte" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_lf.gif" alt="FX-Karte" border=0 width="24" height="24"></a>
<a href="0b0302.htm" target="UDOcon"><img src="udo_rg.gif" alt="FX-Board" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="FX-Karte">11.3.1 FX-Karte</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Einbau der Falcon-FX Erweiterung </tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>FX-Extender Karte
<br>
</p>
<p>Seit kurzer Zeit bietet die Fa. BlowUp den Falcon FX-Extender an.
Die Karte stellt gleich drei brauchbare Erweiterungen auf einer
einzigen Platine zur Verf&uuml;gung. Die bis zum 1.7.95 289.- DM
kostende Erweiterung beinhaltet einen komplexen Beschleuniger der
neben der CPU auch in der Lage ist den DSP sowie die FPU gleichzeitig
zu beschleunigen. Zus&auml;tzlich erh&auml;lt man die
Bildschirmerweiterung BlowUP <a href="0305.htm" target="UDOcon">Hardware</a> I. In der Hauptsache ist man mit
dieser Karte in der Lage seinen Falcon neben dem Beschleuniger auch
noch mit FastRam zu best&uuml;cken.
<br>
</p>
<p>BlowUp spricht mit Recht von einer 'Three in one' Erweiterung.
<br>
</p>
<p>Die Karte wird Problemlos auf den internen Erweiterungsbus des
Falcons gesteckt, soll nur das FastRam zum Einsatz kommen ist nicht
eine einzige L&ouml;tarbeit beim Einbau auszuf&uuml;hren. Lediglich
der der auf J20 vorhandene Jumper mu&szlig; entfernt werden um die
Karte auf den Bus zu stecken. Der Jumper solle aufbewahrt werden da er
seinen neuen Platz auf den gleichen Pins der <a href="0b03.htm" target="UDOcon">FX-Karte</a> bekommt sofern
da nicht sofort noch ein <a href="0804.htm" target="UDOcon">ScreenEye</a> ect.pp aufgesteckt wird.
<br>
</p>
<p align=center><img src="image/fx_8.gif" border=0 width="180" height="82"></p><br>
<div align=center><tt>Abbildung 1 - <a href="0b03.htm" target="UDOcon">FX-Karte</a> im FalconF030</tt>
<br>
</div>
<p>Neue Rechner verlieren bei der Geh&auml;use&ouml;ffnung Ihre
Garantie!
<br>Lassen Sie die Karte von jemanden Einbauen der das kann, sollten
Sie
<br>sich in diesem Fall nicht sicher sein.
<br>
</p>
<p align=center><img src="image/fx_4.gif" border=0 width="180" height="75"></p><br>
<div align=center><tt>Abbildung 2 - <a href="0b03.htm" target="UDOcon">FX-Karte</a></tt>
</div>
<p>Die Karte kann mit handels&uuml;blichen Simm-Modulen zu 1MB oder
4Mb best&uuml;ckt werden. Die Zugriffszeit der verwendeten Simm-Module
sollte bei 60-70nS liegen. So sind also z.B auch Kombinationen aus
beiden m&ouml;glich. Die Karte wird mit 30 poligen Simms
best&uuml;ckt. Die <a href="0b03.htm" target="UDOcon">FX-Karte</a> besitzt aus diesem Grund genau 4 freie
Simm-Sockel die also frei Best&uuml;ckbar sind. Welche Simm-Module am
besten geeignet sind k&ouml;nnen Sie einer auflistung weiter hinten im
Text entnehmen.
</p>
<p>Sp&auml;ter sollte es hierzu wohl noch eine Erweiterung geben die
noch mehr FastRam erlaubt. Der Falconbus ist bei der <a href="0b03.htm" target="UDOcon">FX-Karte</a>
durchverdrahtet so da&szlig; weitere Karten z.B ein <a href="0804.htm" target="UDOcon">ScreenEye</a> ect.
direkt &uuml;ber der <a href="0b03.htm" target="UDOcon">FX-Karte</a> aufgesteckt werden k&ouml;nnten.
<br>
</p>
<p>Hierbei sollte beachtet werden das schmale Simm-Module verwendet
werden m&uuml;ssen, insbesondere in der Bank 0. Neuere Module mit nur
3 Chips sind hier am besten geeignet.
<br>
</p>
<p align=center><img src="image/4msimm.gif" border=0 width="268" height="69"></p><br>
<div align=center><tt>Abbildung 3 - ein zu breites 4Mb Simm</tt>
</div>
<p>Aus Platzgr&uuml;nden funktioniert das allerdings nicht im
originalen Falcongeh&auml;use. Ein <a href="0d02.htm" target="UDOcon">Desktopper</a> oder ein
Towergeh&auml;use sollte hier schon vorhanden sein. Man kann
nat&uuml;rlich auch vorerst das Geh&auml;useoberteil weglassen was
aber der Betriebssicherheit des Rechners nicht zugute kommt. Zumal die
Tastatur nicht mehr an ihren alten Platz passen wird.
<br>
</p>
<p>Ein kleiner Nachteil bleibt die Tatsache das die RAM Bank 0 der
<a href="0b03.htm" target="UDOcon">FX-Karte</a> nur mit ausgew&auml;hlt schmalen Simm-Modulen best&uuml;ckt
werden kann. Bei breiteren Modulen mit 9 Chips ist der
weiterf&uuml;hrende Falconbus durch das Simm welches dem <a href="0f01.htm" target="UDOcon">Netzteil</a> am
n&auml;chsten steckt leider verbaut. Eine Pinreihe der 50poligen
Erweiterungs-Stiftleise wird dabei verdeckt. Ein Einbau/Aufstecken
einer weiteren Karte ist so dann leider nicht m&ouml;glich.
<br>
</p>
<p>Telefonisch versprach man hier schon Abhilfe bei einem noch
kommenden Update der Treibersoftware. Hier kann dann auch die Bank 1
best&uuml;ckt werden. Bank 0 k&ouml;nnte dann so auch Notfalls leer
bleiben. Der Softwaretreiber finden das Ram in jeden Fall und meldet
es korrekt an.
<br>
</p>
<p>Werden die Beschleuniger oder die Bildschirmerweiterung der
<a href="0b03.htm" target="UDOcon">FX-Karte</a> mitverwendet sind einige L&ouml;tarbeiten erforderlich die
wie &uuml;blich mit einer besonderen Vorsicht auszuf&uuml;hren sind.
Bei der Bildschirmerweiterung liegt eine L&ouml;tstelle auf der
Platinenunterseite des Falcons, die Platine m&uuml;sste hierbei
komplett aus dem original Geh&auml;use ausgebaut werden. Einzig die
Entfernung eines SMD-Widerstandes macht den Ausbau der Platine
erforderlich. Im Towergeh&auml;use kann man hoffenlich die
Platinenunterseite auch ohne Ausbau erreichen. Bei der Intergration
der Beschleuniger sollte man sich die mitgelieferte Einbauanleitung
sehr genau durchlesen. Es wird auch hier der sog. ClockPatch
nahegelegt der vor dem Einbau der Beschleuinger in den Falcon
eingebaut werden sollte. Material hierzu ist der <a href="0b03.htm" target="UDOcon">FX-Karte</a> schon
beigelegt. Diese ClockPatch-<a href="0305.htm" target="UDOcon">Hardware</a> besteht aus einem IC 74LF04 und
zwei Widerst&auml;nden. Sollte der verwendete Falcon bereits einen
ClockPatch besitzen ist man fein raus. Man spart sich so einige
Arbeitsg&auml;nge da hier nur der vorhandene, bereits
eingel&ouml;tetete ClockPatch leicht modifiziert werden mu&szlig;. Die
FX-Anleitung beschreibt den Einbau des Patches sehr genau so das
eigentlich jeder mit ein wenig Erfahrung den Einbau selber vornehmen
kann.
<br>
</p>
<p>Es gibt verschiedene Anweisungen je nachdem ob das Falcon eine FPU
besitzt oder nicht.
<br>
</p>
<p>Wer seinen <a href="0e.htm" target="UDOcon">Clockpatch</a> selber gel&ouml;tet hat kann sich auch hier
Erfolgreich bet&auml;tigen. Eine Anleitung zum normalen ClockPatch
finden Sie ebenfalls hier im DOITF030 Archiv inklusive einiger
erkl&auml;render Grafiken. Beim Einbau der <a href="0b03.htm" target="UDOcon">FX-Karte</a> ist der Patch aus
der Einbauanleitung von BlowUp zu verwenden.
<br>
</p>
<p>Bei Verwendung der Beschleuniger r&auml;t BlowUp dem Anwender die
<a href="040109.htm" target="UDOcon">68030 CPU</a> mit einem aufklebbaren K&uuml;hlk&ouml;rper zu versehen und
auch einen eventuell stillgelegten L&uuml;fter in jedem Fall sofort
wieder in Betrieb zu nehmen. Meiner Meinung nach ein sehr guter Tip da
sich einige Bauteile nach dem Einbau des/der Beschleuniger(s) mehr
Erw&auml;rmen werden. U.a so auch die CPU die ohne gro&szlig;e
Anstrengung sehr schnell warm werden kann. Immerhin wird die CPU/FPU
mit einem wesentlich h&ouml;heren Takt betrieben. Das f&uuml;hrt auch
zu einer st&auml;rkeren Erw&auml;rmung. Gibt es beim h&ouml;heren Takt
des DSP, immerhin wird dieser Baustein nach dem Umbau mit 50Mhz
versorgt, Probleme mit Soundprogrammen, Mod-Playern die den DSP
benutzen gibt es eine relativ einfache M&ouml;glichkeit den DSP mit
dem sog. Systemtakt zu versorgen. Dazu wird die neugezogene
DSP-Taktleitung welche sich am unteren Pin der zweipoligen Stiftleiste
rechts an der BlowUp-Platine befindet einfach mit dem rechten (freien)
Anschlu&szlig; der Spule L102 verbunden. Die Verbindung zur <a href="0b03.htm" target="UDOcon">FX-Karte</a>
entf&auml;llt dann dadurch.
<br>
</p>
<p align=center><img src="image/dsp1.gif" border=0 width="255" height="132"></p><br>
<div align=center><tt>Abbildung 4 - DSP mit fremder Taktzuf&uuml;hrung</tt>
</div>
<p>Der obere Pin bleibt f&uuml;r die Aufl&ouml;sungserweiterung
BloWUp 1 erhalten!! Hier wird nichts ge&auml;ndert.
<br>
</p>
<p>Der DSP erh&auml;lt dann &uuml;ber den rechten Anschlu&szlig; der
Spule L102 in jedem Fall den gleichen Takt den auch das System von der
<a href="0b03.htm" target="UDOcon">FX-Karte</a> bekommt. Unvertr&auml;glichkeiten mit DSP-Soundprogrammen
sollten somit dann verschwunden sein.
<br>
</p>
<p>Bemerkbar macht sich das Problem im &uuml;brigen wenn sich
.MOD-Files beim Abspielen verschrabbelt anh&ouml;ren. Logischerweise
kann man nat&uuml;rlich auch einen anderen Player verwenden, das
Problem liegt daran das einige Programmierer einfach davon Ausgehen
das die Geschwindigkeit im Rechner immer die gleiche ist. Alles in
allem ist die Beschreibung der <a href="0b03.htm" target="UDOcon">FX-Karte</a> eigentlich sehr gut und gibt
in jedem Fall die geeignete Antwort.
<br>
</p>
<p>Sollte nach dem Umbau des DSP z.B APEX nicht mehr Arbeiten ist es
sicher das der DSP kein Taktsignal erh&auml;lt. Ebenso w&uuml;rden
dann DSP-Player nicht arbeiten.
<br>
</p>
<p>Notfalls kann man bei BlowUp telefonisch nachfragen. Der Service
ist seht gut und die Bedienung sehr freundlich. Auch ist BlowUp per
<a href="15.htm" target="UDOcon">Internet</a> E-Mail zu erreichen.
<br>
</p>
<pre>
E-Mail: acher@informatik.tu-muenchen.de
Das klappt auch vom Mausnetz aus.

</pre>
<p>Mit der <a href="0b03.htm" target="UDOcon">FX-Karte</a> wird eine Diskette geliefert die die gesammte
Steuersoftware der <a href="0b03.htm" target="UDOcon">FX-Karte</a> enth&auml;lt. Die <a href="0204.htm" target="UDOcon">Installation</a> ist sehr
einfach und die Software erkl&auml;rt sich praktisch auch selber. Man
kann eigentlich kaum etwas falsch machen. S&auml;mtliche Einstellungen
f&uuml;r jeden Teil der insgesammt drei Erweiterungen wird per
Software vorgenommen. Selbst bei einem '<a href="0305.htm" target="UDOcon">Hardware</a>'-Update braucht hier
nur die Software entsprechend ge&auml;ndert werden. Sogesehen also
eine sehr gute Erweiterung.
<br>
</p>
<p>War bei Einstellen etwas falsch oder bootet der F030 nicht wie
gewohnt gen&uuml;gt es w&auml;hrend dem Bootvorgang die linke
Shift-Taste festzuhalten. Es wird dabei kein FastRam/Treiber
installiert.
<br>
</p>
<p>Das so erweiterte RAM wird in der gleichen Weise wie beim Atari TT
/ Medusa / Eagle eingebunden und kann von Anwender auch in fast der
gleichen Art benutzt werden. Im Falcon sind RAM und Videologik durch
einem 32-Bit breiten Datenbus verbunden. Die CPU ist an diesen Bus
aber nur 16-Bit breit angeschlossen und mu&szlig; sich zudem beim
RAM-Zugriff der Videologik unterordnen. D.h je mehr Farben und
Aufl&ouml;sung auf dem Bildschirm zu sehen ist, desto weniger
Bus-Bandbreite bleibt f&uuml;r die CPU. Der Erweiterungsport im
Falcon, auf den die <a href="0b03.htm" target="UDOcon">FX-Karte</a> gesteckt wird ist direkt 16-Bit breit mit
der CPU verbunden. Die Videologik bleibt dabei ausgeschlossen. Die
Zugriffsgeschwindigkeit auf das FX-Ram ist nicht von der eingestellten
Grafikaufl&ouml;sung abh&auml;ngig und in jedem Fall schneller als auf
das normale RAM im Falcon.
<br>
</p>
<p>Es ist ein Programm zum Einstellen der entsprechenden
Programmflags in der Anwendersoftware vorhanden. Bank 0 und Bank 1
m&uuml;ssen mit jeweils gleichen Simms best&uuml;ckt werden 1 MB und
4MB Kombinationen in einer Bank sind nicht Zul&auml;ssig. Bleibt noch
abzuwarten was der noch einzubauende PageModus an zus&auml;tzlicher
Geschwindigkeit bringen wird. Den PageMode erwartet man zu einem der
n&auml;chsten Updates der Treibersoftware.
<br>
</p>
<p>Unvertr&auml;glichkeiten sind mir bis jetzt bis auf 2-3
Falcon-Demos keine Bekannt. Alle mir bekannten Programme, bis auf den
Upoint, laufen mit dieser Erweiterung relativ problemlos. Treten beim
Bildaufbau St&ouml;rungen auf oder werden die Icons nicht immer
korrekt gezeichnet so ist es ratsam den Blitter abzuschalten. Das kann
man mit den .CPX-Modulen erledigen die sich im Lieferumfang von NVDI 3
oder 4 befinden rasch erledigen.
<br>
</p>
<p>Treten bei der Verwendung des neueren FX-Treiber 1.1 erneut
Probleme auf, so setzt man sich am besten mit der Firma BlowUp in
Verbindung. Hierzu sollte eine m&ouml;glichst genaue
Fehlerbeschreibung geliefert werden. Nur so ist ein m&ouml;glich einen
Softwaretreiber zu Entwickeln der auf allen Falcons korrekt arbeitet.
<br>
</p>
<p><tt> PS/2 Adapterplatine </tt>
</p>
<p>Eine Auflistung getesteter PS2-Simm Module von Ilja Rateiczak.
<br>
</p>
<pre>Hier mal eine etwas pr&auml;zisere Liste, was mit meiner FX l&auml;uft:
------------------------------------------------------------
16 MB PS/2 SIMM o.P. 60ns
8 Chips mit der Aufschrift:

LGS
GM71C17004AJS
9601 KOREA

Auf der Platine steht: WKS16NPD123T Made in U.S.A.
Zus&auml;tzlich ist da noch ein Aufkleber drauf:
Siemens Schweiz AG 4M32-08-60-T

Obiges SIMM l&auml;uft seit ein paar Monaten bei mir.
------------------------------------------------------------
16 MB PS/2 SIMM o.P. 60ns
8 Chips mit der Aufschrift:
TI KOREA -60
Z41700     6
GA 66Z230  G

Auf der Platine steht: LD81B16M
Zus&auml;tzlich noch ein Aufkleber mit Strichcode auf der R&uuml;ckseite: GC15418

L&auml;uft seit einer halben Stunde l&auml;uft bei mir.
------------------------------------------------------------
8 MB PS/2 SIMM o.P. 60ns
16 Chips (doppelseitig best&uuml;ckt) mit der Aufschrift:
TI     -60
TMS44400DJ
OE  62  A4HV1

Auf der Platine steht: Made in Italy, Texas Instruments, T120A+ 94V 0
Zus&auml;tzlich ist noch ein Aufdruck auf der Platine: TM248CBK32S -60 9609I

Das SIMM wurde nur kurz getestet, zeigte aber keine Auff&auml;lligkeiten.
------------------------------------------------------------
4 MB PS/2 SIMM o.P. 60ns
2 Chips  mit der Aufschrift:
TI      -60
TMS418160DZ
2B 64A43E P

Auf der Platine steht: Texas Instruments, Singapore
Zus&auml;tzlich noch ein Aufkleber mit Strichcode auf der R&uuml;ckseite: GC10602

Das SIMM wurde nur kurz getestet, zeigte aber keine Auff&auml;lligkeiten
------------------------------------------------------------
Das schlechte SIMM hat 16MB o.P. 60ns, mit 8 Chips von IBM. Die genaue
Chipaufschrift habe ich Georg Acher durchgegeben. Sie enthielt die Ziffernfolge
5351.

Kann jemand hier noch was dranh&auml;ngen? Je l&auml;nger (vollst&auml;ndiger) die Liste ist,
desto kleiner die Gefahr beim SIMM Kauf auf die Nase zu fallen!

</pre>
<p><tt> Bildprobleme mit dem SM 124 + SM 1224</tt>
</p>
<div align=center>Ein Beitrag von Bernd Roecklein
</div>
<p>Tja, es ist schon traurig, da geht mein guter alter Graustufen
Multisync so langsam vor die Hunde und ich muss wieder den noch
aelteren SM124 oder den Superalten RGB anschliessen. Mit beiden kann
ich die <a href="0b03.htm" target="UDOcon">FX-Karte</a> leider nur mir 32Mhz laufen lassen und ausserdem ist
das Bild auf dem SM124 ziemlich krieselich (steht in einem readme bei
der Fx Karte, dass das bei Systemtakt=Pixeltakt passieren kann).
<br>Und da kam mir der geniale Einfall: Warum den Video-Chip nicht
ueber die externe Leitung (normaleweise 50Mhz) mit 32 Mhz zu versorgen
und damit unabh&auml;ngig vom Systemtakt machen.
<br>Gesagt, getan:
<br>Die Pixeltaktleitung an der <a href="0b03.htm" target="UDOcon">FX-Karte</a> abgeloetet und an 32Mhz auf
der Falcon-Platine (da wo mal der DSP dran war) angeloetet. Und
schwupdiwup kann ich den Falcon auch am RGB und SM124 wieder mit 40Mhz
Takten.
<br>Und das Bild auf dem SM124 sieht auch schon viel besser aus.
<br>
</p>
<p>Da frage ich mir doch, wenn das so einfach ist, warum ist das auf
der <a href="0b03.htm" target="UDOcon">FX-Karte</a> nicht direkt schon so eingebaut. Man koennte dann dazu
noch den Video-Chip mit 36 oder 40 Mhz (unabhaengig vom Systemtakt)
versorgen und damit noch etwas mehr Aufloesung aus dem SM124
rauskitzeln.
<br>
<br>
</p>
<p>
<br><tt> Einstellung der FX-Treibersoftware</tt>
<br>
<br>
<br>
</p>
<p>Bei falsch eingestellter Treibersoftware k&ouml;nnen z.B
Bildschirmblitzer zu sehen sein. Allerdings treten die auch bei stark
erweitertem Bildschirm auf. Siehe BlowUp und Screenblaster.
<br>
</p>
<p>Bildschirmblitzer k&ouml;nnen auch von einer falschen Einstellung
des CPU-Timings im FX-Control Panel kommen. Wenn man mit der
Defaulteinstellung im FX Control Probleme hat, solltest man
_systematisch_ alle Einstellungen durchtesten, bis es eben korrekt
Funktioniert.
</p>
<pre>
M&ouml;gliche Einstellungen im FX-Kontrollfeld

Schalter 1  2  3  I DM1 DM2
-----------------------------
         0  0  0  0  0   0
         1  0  0  0  0   0
         0  1  0  0  0   0
         0  0  1  0  0   0
         0  0  0  1  0   0
         1  1  0  0  0   0
         1  0  1  0  0   0
         0  1  1  0  0   0
         1  0  0  1  0   0
         0  1  0  1  0   0
         0  0  1  1  0   0
         1  1  1  0  0   0
         1  1  0  1  0   0
         1  0  1  1  0   0
         0  1  1  1  0   0
         1  1  1  1  0   0

</pre>
<p>Es ergeben sich so also insgesamt 48 Einstellm&ouml;glichkeiten.
Das Setzen von DM1 _und_ DM2 brachte nie brauchbare Einstellungen,
kann jedoch auch ausprobiert werden. Nur, wenn man nach einem
derartigen Schema vorgeht, kann man auch sicher sein, da&szlig; man
die passende Einstellung nicht &uuml;bersehen hat.
</p>
<p>Man sollte sich auf einem Raster (hinter jeder
Einstellm&ouml;glichkeit) das Verhalten vermerken. Dann braucht man
nicht immer alles durchzuprobieren, wenn man mal eine
&quot;leichte&quot; Modifikation an der <a href="0305.htm" target="UDOcon">Hardware</a> vorgenommen hat. Die
stabilen Einstellungen &auml;ndern sich nach meinen Erfahrungen auch
bei ver&auml;ndertem <a href="0e.htm" target="UDOcon">Clockpatch</a> nicht.
</p>
<p>Ein Beitrag von Dieter K&ouml;nig
<br>
<br>
<br>
</p>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<div align=center>Weitere Informationen zur <a href="0b03.htm" target="UDOcon">FX-Karte</a>, deren Einbau und
Hilfestellungen
<br>bei Problemen mit freundlicher Genehmigung
<br>von Georg Archer - Firma BlowUp / M&uuml;nchen.
<br>
</div>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>Wichtige Anmerkung zu Benutzung von BlowUP030 oder anderer
Bildschirm-aufblas-Software mit FX:
<br>
</p>
<p>* Wird als Pixeltakt in BlowUP030 der Systemeigene 32MHz-Takt
verwendet, so ist dieser nur dann 32MHz, wenn das System nicht
beschleunigt l&auml;uft. Wenn im FX-CPX als Systemtakt 36MHz
eingestellt wird, so sind alle angezeigten Frequenzwerte f&uuml;r
Horizontal- frequenz und Vertikalfrequenz mit 1.125 (=36/32) zu
multiplizieren. Bei 40MHz-Systemtakt ist der Faktor 1.25. D.h. werden
z.B. 40kHz und 76Hz angezeigt, so sind dies in Wirklichkeit bei
40MHz-Systemtakt 50kHz und 96Hz! Insbesondere bei Festfrequenz-
Monitoren und eingeschr&auml;nkten Multiscan-Typen mu&szlig; darauf
geachtet werden, da&szlig; die tats&auml;chlichen Frequenzen noch den
Spezifikationen des Monitors entsprechen.
<br>
</p>
<p>* Angenehmer Nebeneffekt: In 256 und 65536 Farben k&ouml;nnen
durch Erh&ouml;hung des Systemtakts h&ouml;here Aufl&ouml;sungen bzw.
h&ouml;here Bildwiederholraten erreicht werden.
<br>
</p>
<p>+++
</p>
<p>Die gro&szlig;e Anzahl von Clockpatchvarianten, die im F030
bereits eingebaut sein kann, f&uuml;hrt manchmal zu Verwirrungen beim
Einbau des FX-Beschleunigers.
<br>
</p>
<pre>Zum besseren Verst&auml;ndnis hier ein grober <a href="030806.htm" target="UDOcon">Schaltplan</a>
des Bereichs:

                  |  - zentrale Einspeisung von 16MHz-CPU-Takt
                  R                         vom COMBEL U56
    (1)    (2)    R  - R217
     |      |     |
   R216    R221   :
     |      |     :
     :......:.....:
                 :
                 |
               R222
                 |
                (3)

.:. bedeutet unsichtbare Leiterbahn
(1) f&uuml;hrt zum Expansionslot
(2) f&uuml;hrt zum DMA-Chip und zur FPU
(3) f&uuml;hrt zur CPU
</pre>
<p>Bei allen Clockpatchvarianten sind mindestens R216/R221 entfernt
und stattdessen der 74F04/08 eingeschleift. Dazu f&uuml;hren ein/zwei
Dr&auml;hte vom R217 oder den unteren Anschl&uuml;ssen von R216/R221
ZUM <a href="0e.htm" target="UDOcon">Clockpatch</a>.
<br>
</p>
<p>Variante 1:
<br>EIN Draht vom 74F04/08 verbindet die beiden oberen Anschl&uuml;sse
(1) und (2) von R216/R221.
<br>
</p>
<p>Variante 2:
<br>ZWEI Dr&auml;hte f&uuml;hren getrennt vom 74F04/08 zu den oberen
Anschl&uuml;ssen von R216 (1) bzw. R221 (2).
<br>
</p>
<p>Zus&auml;tlich zu Variante 1 und 2 gibt es noch:
<br>Variante A:
<br>
</p>
<p>R222 ist entfernt und ein Draht geht vom 74F04/08 zu (3). dann
mu&szlig; dieser Draht entfernt werden und der mitgelieferte 33-Ohm
Widerstand bei R222 eingel&ouml;tet werden.
<br>
</p>
<p>Wenn bereits ein <a href="0e.htm" target="UDOcon">Clockpatch</a> eingebaut ist, sollte er erstmal drin
gelassen werden, m&ouml;glicherweise muss er aber etwas modifiziert
werden:
<br>
</p>
<p>Bei Variante 1 UND FPU-Einbau:
<br>Den Draht so uml&ouml;ten, da&szlig; er nur noch mit (1) Kontakt
hat. An diesen Anschlu&szlig; sollte dann auch das Kabel zum DMA-Chip.
<br>
</p>
<p>Sonst kann der <a href="0e.htm" target="UDOcon">Clockpatch</a> unver&auml;ndert &uuml;bernommen werden.
Erst wenn im beschleunigten Zustand DMA-Probleme auftreten und diese
auch nicht wie in DMA_PROB.TXT beschrieben behoben werden k&ouml;nnen,
sollte der Umbau auf den in der Anleitung beschriebenen <a href="0e.htm" target="UDOcon">Clockpatch</a>
erwogen werden.
<br>
</p>
<p>Anmerkungen zur Benutzung von Cubase <a href="0907.htm" target="UDOcon">Audio</a>:
<br>
</p>
<p>* CAF scheint f&uuml;r seinen Samplespeicher nur das ST-RAM zu
verwenden, egal wie die Programmflags sind. Laut Aussage von Steinberg
soll dieses Verhalten (das wohl mal einen guten Grund hatte, der aber
inzwischen vergessen wurde (siehe Douglas Adams :-)) im n&auml;chsten
Update beseitigt sein.
<br>
</p>
<p>Wenn man aber die Programmflags auf TT-RUN und TT-Malloc stellt,
wird das Programm selbst in das FX-RAM geladen. Da dieses sich auf ca.
1Mbyte auspackt und man ja alle Autoordnerprogramme und Accessories
ins FX-RAM legen kann (und sollte) sind dann doch je nach
Aufl&ouml;sung ca. 3.5MB f&uuml;r den Samplespeicher frei, was keine
schwerwiegende Einschr&auml;nkung mehr sein sollte.
<br>
</p>
<p>* Es ist m&ouml;glich (ich habe noch keine Systematik entdeckt,
allerdings ist es in letzter Zeit nicht mehr aufgetreten) das Cubase
bei 50MHz-DSP-Takt den linken <a href="0907.htm" target="UDOcon">Audio</a>-Kanal verliert, bzw.
'merkw&uuml;rdige' Audioprobleme/Abst&uuml;rze auftreten. Sollte dies
bei Ihnen ebenfalls zutreffen, so k&ouml;nnen Sie die DSP-Taktleitung
an die abgetrennte Leitung der Ferritperle L102 l&ouml;ten:
<br>
</p>
<pre>
             +---------------- DSP
             |
O-----HHHH---+-   --O
      L102
</pre>
<p>Damit wird der DSP dann mit dem Systemtakt getaktet, also 32, 36
oder 40MHz. Damit ist er immer noch schneller als die CPU (deshalb
&uuml;berhaupt die ganze DSP-Beschleunigung) aber es geht kein Kanal
mehr verloren.
<br>
</p>
<p>* Auf unserem Test-Falcon arbeitet Cubase mit allen CPU-Takt-
Einstellungen einwandfrei (also auch mit 40MHz CPU).
<br>
</p>
<p>Georg Acher/BlowUP 030795/111195
<br>
</p>
<p>Bei manchen Falcons (meist Revision C/D) kann es (mu&szlig; aber
nicht) zu Problemen mit dem DMA-System (also SCSI-Probleme,
Sound-Probleme) f&uuml;hren, wenn der Einbau so wie in der Anleitung
beschrieben voll- zogen wird. Bei diesen Falcons hat sich folgende
&Auml;nderung bew&auml;hrt:
<br>
</p>
<p>-Ohne FPU:
<br>Es f&uuml;hrt ein Draht vom oberen Anschlu&szlig; von R221 zum
<a href="0e.htm" target="UDOcon">Clockpatch</a>-IC 74F04. L&ouml;ten Sie diesen Draht _am_ IC ab und
l&ouml;ten Sie ihn an den oberen Anschlu&szlig; von R217 an (da, wo
auch die gelbe Litze weggeht!). Es besteht dann also eine Verbindung
von R221/oben zu R217/oben.
<br>
</p>
<p>-Mit FPU:
<br>Dort f&uuml;hrt eine Litze vom 74F04 direkt zum DMA-Chip.
L&ouml;ten Sie diese _am_ 74F04 ab und am oberen Anschlu&szlig; von
R217 an (dort geht schon die gelbe Litze weg). Es besteht dann also
eine Verbindung R217/oben zum DMA-Chip.
<br>
</p>
<p>Sollten (insbesondere bei 40MHz-CPU-Takt) immer noch Probleme
auftreten, k&ouml;nnte folgende &Auml;nderung evtl. helfen:
<br>
</p>
<p>-Wiederherstellung der Verbindung R221/oben zum 74F04 bzw. 74F04
zum DMA-Chip. (R&uuml;ckg&auml;ngigmachen des obigen Patches :-)
<br>
</p>
<p>- Mit/ohne FPU:
<br>Es f&uuml;hrt eine Litze vom unteren Anschlu&szlig; von R221 zum
74F04. L&ouml;ten Sie diese vom R221 ab und an den oberen
Anschlu&szlig; von R217 (gelbe Litze...)
<br>
</p>
<p>F&uuml;r den Interessierten:
<br>Alle diese Modifikationen ver&auml;ndern das <a href="030503.htm" target="UDOcon">Timing</a> des Taktes,
mit dem der DMA-Chip l&auml;uft. Dies ist die empfindlichste Stelle im
Falcon-Design, soda&szlig; brutale <a href="030503.htm" target="UDOcon">Timing</a>-&Auml;nderungen (wie z.B.
Beschleuniger ;-) hier die st&auml;rksten Auswirkungen zeigen...
<br>
</p>
<p>Georg Acher / BlowUP 110895
<br>
</p>
<p>Anmerkungen zum Falconspeed:
<br>
</p>
<p>Leider erkennt das Startprogramm den zus&auml;tzlich vorhandenen
Speicher nicht an. Daher sind trotz 8MB FX-RAM nur ca 2.4MB nutzbar.
Sollte jemand den Sourcecode des Treibers haben ( ;-) sollte es nicht
schwer sein, die feste Lage des Bildschirm- speichers zur
RAM-Obergrenze zu l&ouml;sen und ihn ins ST-RAM zu plazieren.
<br>
</p>
<p>* Folgende Features sind leider (noch) nicht in der aktuellen
Version der <a href="0b03.htm" target="UDOcon">FX-Karte</a> enthalten:
<br>
</p>
<p>- Pagemode
<br>Wir haben uns entschieden, die Beschleunigerhardware lieber nicht
ganz so schnell, daf&uuml;r aber umso stabiler zu machen. Der Pagemode
kommt aber garantiert und kann mit einem einfachen Softwareupdate
installiert werden.
<br>
</p>
<p>- Umschaltung des DSP-Beschleunigers von 32 auf 50MHz
<br>Aus technischen Gr&uuml;nden ist die geplante
softwarem&auml;&szlig;ige Umschaltung geplatzt: Der Falcon reagiert
unverst&auml;ndlicherweise extrem instabil darauf. Daher wird der DSP
jetzt immer mit 50MHz getaktet, wenn der Einbau so vorgenommen wird,
wie in der Anleitung beschrieben. F&uuml;r Programme die keinen mit
50MHz laufenden DSP vertragen (m&ouml;glicherweise Cubase <a href="0907.htm" target="UDOcon">Audio</a>) gibt
es eine Ausweichm&ouml;glichkeit (siehe CUBASE.TXT).
<br>
</p>
<p>- EMS (mehr als 10MB FX-RAM)
<br>Diese Eigenschaft wurde ebenfalls (vorerst!!!) der Stabilit&auml;t
des Beschleunigers geopfert. Da dieses Feature aller Voraussicht nach
nicht von Cubase <a href="0907.htm" target="UDOcon">Audio</a> unterst&uuml;tzt wird, ist diese Implementation
nicht ganz so dringend.
<br>
</p>
<p>* Wichtig:
<br>Wenn die Art der SIMM-Best&uuml;ckung mit FXCONF ge&auml;ndert und
abgespeichert wird, MUSS vor dem n&auml;chsten Booten der Falcon
ABGESCHALTET werden, damit die &Auml;nderung wirksam wird. Ein Reset
(egal wie) reicht NICHT aus!!!!
<br>
</p>
<p>* Sollten Sie bei 36/40MHz-CPU Probleme mit der <a href="060402.htm" target="UDOcon">IDE-Platte</a> haben
(insb. mit der 65MB-Seagate), so teilen Sie uns das bitte mit. Es
befindet sich zwar schon eine Schaltung zu Korrektur des extrem
merkw&uuml;rdigen Falcon-IDE-Zugriffs im FX. M&ouml;glicherweise gibt
es noch einige Platten, die eine weitergehende Korrektur
ben&ouml;tigen.
<br>
</p>
<p>* So ein Beschleuniger an sich ist schon eine recht heikle Sache,
erst recht, wenn er im Falcon funktionieren soll. Daher kann es leider
durchaus sein, da&szlig; der Beschleuniger mit 36/40MHz-CPU bei Ihnen
einfach nicht will. Durch die Einstellm&ouml;glichkeiten im FX-CPX
(Kn&ouml;pfe 1/2/3/I) kann man zwar noch so manche Toleranz
ausgleichen, aber eben nicht alles. Sollten Sie so einen Falcon haben,
teilen Sie uns, wenn m&ouml;glich, mit, welche Board-Revision und
Seriennummer der Falcon hat (aber erst nach erfolglosem Spielen mit
1/2/3/I!). M&ouml;glicherweise k&ouml;nnen wir dem Problem nachgehen.
<br>
</p>
<p>* Um die Frage nach der NOVA-Benutzung im Installprogramm
aufzukl&auml;ren:
<br>
</p>
<p>Die Nova benutzt den Addressraum ab 10MB f&uuml;r den
Videospeicher. Daher kann (darf!!) sich dort kein FX-RAM angesprochen
f&uuml;hlen, d.h. das FX-RAM darf dann nur noch von 4MB bis 9.999MB
gehen. Deshalb gibt es eine Extra-Konfiguration (FXSETSNV.FXB), die
die Speichernutzung so einschr&auml;nkt. Bei der <a href="0204.htm" target="UDOcon">Installation</a> wird die
Datei FXSETSNV.FXB in FXSETS.FXB umbenannt in den FXUTIL-Ordner
kopiert.
<br>
</p>
<p>* Obwohl das FX-RAM als 'Alternate-RAM' angemeldet wird, ist bis
auf die fehlende Videom&ouml;glichkeit kein Unterschied zum normalen
Falcon-RAM vorhanden. D.h. SCSI- und Sound-DMA laufen ganz normal aus
dem FX-RAM. Daher k&ouml;nnen alle Programme, die RAM f&uuml;r
Soundspeicher ben&ouml;tigen, auch FX-RAM benutzen (wenn die
Startaddresse unter 16MB liegt).
<br>
</p>
<p>* Die gesamte <a href="0305.htm" target="UDOcon">Hardware</a> wird durch die Datei FXSETS.FXB definiert.
Ohne diese Datei l&auml;uft nichts! Daher ist sie auch mit
Pr&uuml;fsummen vor Besch&auml;digung gesch&uuml;tzt. Bei
zuk&uuml;nftigen Updates wird (h&ouml;chstwahrscheinlich) nur diese
Datei wirklich ge&auml;ndert werden. In dieser Datei steckt also fast
die gesamte Entwicklungsarbeit f&uuml;r das FX, also f&auml;llt sie
damit (obwohl evtl. nicht so ganz ersichtlich) unter das Urheberrecht
und darf nicht so einfach kopiert und weitergeben werden. Auch eine
nicht abgesprochene Nutzung bzw. Modifikation dieser Datei (wof&uuml;r
auch immer) ist untersagt.
<br>
</p>
<p>Georg Acher/BlowUP 050795
<br>
</p>
<p><a href="1307.htm" target="UDOcon">MiNT</a> und das FX-RAM...
<br>
</p>
<p>Aus nicht gekl&auml;rten Gr&uuml;nden arbeitet <a href="1307.htm" target="UDOcon">MiNT</a> nur ohne
Memory-Protection (MINTNP.PRG) mit dem FX-RAM zusammen. Mit
Memory-Protection wird es entweder nicht akzeptiert (FXDRIVE nach MINT
gestartet) oder es gibt einen Crash.
<br>
</p>
<p>Georg Acher/BlowUP 290695
<br>
</p>
<p>Hinweis zum Betrieb der NOVA mit FX:
<br>
</p>
<p>Aufgrund eines kleinen Designfehlers (kein Open-Collector- Ausgang
des EXPAND-Signals) der NOVA-Adapterkarte arbeitet die NOVA unter
Umst&auml;nden (bei h&ouml;heren Temperaturen) nicht mit der <a href="0b03.htm" target="UDOcon">FX-Karte</a>
zusammen: Nach dem Start von FXDRIVE.PRG st&uuml;rzt der Rechner ab
und auf dem Bildschirm entsteht Pixelm&uuml;ll. Wir empfehlen Ihnen
nicht, damit zu arbeiten, da selbst bei scheinbarer Fehlerlosigkeit
des RAMs schwerste Fehler in Programmen und auch auf der Festplatte
entstehen k&ouml;nnen. Um dieses Problem zu beseitigen, ist folgende
kleine &Auml;nderung auf der NOVA-Adapterkarte notwendig: Es mu&szlig;
eine Schottky-Diode BAT41 (oder &auml;hnlich) in die Expand- leitung
eingef&uuml;gt werden, die in folgender Skizze markiert ist:
<br>
</p>
<pre>U=Expand-Leiterbahn auf der Unterseite
O=Expand-Leiterbahn auf der Oberseite
V=Durchkontaktierung
*=Steckeranschl&uuml;sse

--------------------------------------------------------------+
*  50pol-Stecker  * * * * * * * * * * * * * * * * * * * * * * |
                                                              |
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * |&lt;-Pin 49
                                                            U |
                                                           U  |
                                                          U   |
                                  VUUUUUUUUUUUUUUUUUUUUUUU    |
                                 O              X             |
     ..OOOOOOOOOOOOOOOOOOOOOOOOOO                             |
                                                              |
                                                              |

Trennen Sie die Leiterbahn auf der Unterseite (U) an der Stelle X
durch.
L&ouml;ten Sie dann auf der Oberseite die Diode BAT41 mit der Anode
an Pin 49 und mit der Kathode (dunkler Ring) an die
Durchkontaktierung.
Es sollte dann so aussehen:

--------------------------------------------------------------+
*  50pol-Stecker  * * * * * * * * * * * * * * * * * * * * * * |
                                                              |
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * |&lt;-Pin 49
                                   Kathode      Anode      /U |
                                  __________|/|___________/U  |
                                 |          |\|           U   |
                                 |VUUUUUUUUU     UUUUUUUUU    |
                                 O                            |
     ..OOOOOOOOOOOOOOOOOOOOOOOOOO                             |
                                                              |


</pre>
<p>Hier die Beschreibung und L&ouml;sung einiger Probleme, die mit
dem FX auftreten k&ouml;nnen (aber nicht m&uuml;ssen!!!):
<br>
</p>
<p>Da dies eine Menge Text ist, empfiehlt sich es, diesen Text
auszudrucken.
<br>
</p>
<p>- Allgemeine Instabilit&auml;t auch bei 16MHz
<br>- Allgemeine Instabilit&auml;t bei 32/36/40MHz-CPU
<br>- FPU-Probleme
<br>- IDE-Probleme
<br>- RAM/SIMM-Probleme
<br>- SCSI/DMA-Probleme/Soundknackser
<br>- W&auml;rmeprobleme und dadurch entstehende Instabilit&auml;t
<br>
</p>
<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<br>-Allgemeine Instabilit&auml;t auch bei 16MHz
<br>
</p>
<p>- M&ouml;glicherweise vertr&auml;gt der DSP die 50MHz nicht.
<br>Abhilfe: Die Taktleitung, die zum DSP geht, statt am FX am
rechten, in die Luft stehenden Draht-Ende von L102 anl&ouml;ten. Dann
bekommt der DSP den Systemtakt (32,36,40MHz).
<br>
</p>
<p>- M&ouml;glicherweise ist der Haupttakt von 32Mhz (der dem Falcon
entnommen wird) etwas schwach, soda&szlig; er durch das Durchschleifen
durch das FX zu stark gest&ouml;rt wird. Abhilfe: Die rote Leitung am
rechten Pin von L102 abl&ouml;ten und mit einem
Verl&auml;ngerungsdraht an den rechten unteren Anschluss des
32-Mhz-Quarzes beim DSP anl&ouml;ten. Dies ist der L&ouml;tpunkt,
dessen zum DSP f&uuml;hrende Leiterbahn f&uuml;r den DSP-
Beschleuniger durchgetrennt werden muss.
<br>
</p>
<p>- Alle Leitungen soweit wie m&ouml;glich k&uuml;rzen.
<br>
</p>
<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<br>
</p>
<p>- Allgemeine Instabilit&auml;t bei 32/36/40MHz-CPU
<br>
</p>
<p>- Andere Einstellung der 123I-Kn&ouml;pfe im CPX
<br>Damit der CPU-Beschleuniger bei 'doppeltem' Takt (32/36/40 CPU)
einwandfrei arbeitet, mu&szlig; vom FX ein ganz bestimmtes Phasen-
verh&auml;ltnis zwischen Systemtakt und CPU-Takt eingehalten werden.
Es ist so eng, da&szlig; eine Abweichung von mehr als 8
Nanosekunden(!!!) zum sofortigen Absturz f&uuml;hren kann. Dummerweise
ist das 'richtige' Verh&auml;ltnis nicht bei jedem Falcon gleich, weil
Bauteiltoleranzen im Falcon und im FX dieses Verh&auml;ltnis um einige
Nanosekunden ver&auml;ndern k&ouml;nnen. Um dies zu korrigieren, ist
im FX eine Art Verz&ouml;gerungsleitung integriert, um den Systemtakt
einigermassen frei w&auml;hlbar im Verh&auml;ltnis zum CPU-Takt zu
verschieben:
<br>Knopf 1 verz&ouml;gert ca. 9ns.
<br>Knopf 2 verz&ouml;gert ca. 4ns.
<br>Knopf 3 verz&ouml;gert ca. 2ns.
<br>Knopf I invertiert den Takt (entspricht also ca. 12.5ns bei
40Mhz).
<br>Damit kann man das Phasenverh&auml;ltnis fein genug einstellen.
Wenn der Rechner bei 32/36/40Mhz mit der Standardeinstellung
gleich/nach kurzer Zeit abst&uuml;rzt, lohnt es sich, etwas mit 123I
zu spielen.
<br>Ist z.B. der Defaultwert '123I' k&ouml;nnte ` besser gehen, evtl.
mit DM2 (s.u).
<br>
</p>
<p>- Nur ab V1.1: Setzen von DM2 im CPX.
<br>Durch Bauteiltoleranzen kann es sein, da&szlig; die
Taktumschaltung im FX nicht bei jedem Buszugriff sauber den CPU-Takt
von 40 auf 20MHz umschaltet, sondern dabei 'flattert'. Das kann zu
instabilem Verhalten und/oder zu Bildschirmblitzern f&uuml;hren. Ab
V1.1 ist es m&ouml;glich, mit 'DM2' eine andere Art der
Taktumschaltung einzuschalten, die in einem solchen Fall diesen Jitter
eliminiert. Dies f&uuml;hrt aber zu einem Performance- verlust von ca.
2%.
<br>
</p>
<p>
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<br>
</p>
<p>- FPU-Probleme:
<br>Sollte die FPU nicht oder unzuverl&auml;&szlig;ig arbeiten (gut
mit dem 'echten' FPU-Test von Gembench zu &uuml;berpr&uuml;fen), gibt
es zwei M&ouml;glichkeiten:
<br>
</p>
<p>- FPU versagt schon bei 32/36MHz:
<br>16MHz-FPUs sollten nicht h&ouml;her als 25MHz getaktet werden. Man
kann daf&uuml;r z.B. den Takt, anstatt von L102, vom oberen
Anschlu&szlig; von R217 abgreifen. Dann bekommt die FPU immer den
halben Systemtakt (16(18/20MHz). Alternativ kann die Leitung auch an
den freien oberen rechten Anschlu&szlig; des 25Mhz-Quarzes (U41) unter
der <a href="060402.htm" target="UDOcon">IDE-Platte</a> l&ouml;ten.
<br>
</p>
<p>- FPU versagt erst bei 40MHz Systemtakt:
<br>H&ouml;chstwahrscheinlich ist die Amplitude des Taktes zu klein.
Abhilfe:
<br>-K&uuml;rzeres Kabel vom 68-Ohm-Widerstand zu R221.
<br>
</p>
<p>-Anstelle des 68-Ohm Widerstands zur FPU einen kleineren Wert
nehmen (56, 47 oder 39Ohm). Durch Ataris unergr&uuml;ndliche Wege kann
es aber dann sein, da&szlig; bei der Benutzung einer
BlowUP/Screenblaster-Aufl&ouml;sung mit Pixeltakt=Systemtakt einige
Blitzer auf dem Bildschirm auftauchen...
<br>
</p>
<p>
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<br>
</p>
<p>- IDE-Probleme:
<br>Da die <a href="060402.htm" target="UDOcon">IDE-Platte</a> im Falcon mit einer gar grausligen Logik
angesprochen wird, ist unter ung&uuml;nstigen Umstanden (diese sind
haupts&auml;chlich &auml;ltere Seagate-Platten mit 40-65MB)
m&ouml;glich, da&szlig; bei 40MHz-CPU die Platten M&uuml;ll liefern.
Das l&auml;&szlig;t sich bei 40MHz-CPU im <a href="030505.htm" target="UDOcon">Desktop</a> durch
ESC-Dr&uuml;cken in einem gr&ouml;&szlig;eren Verzeichnis testen: Wenn
sich die Gesamtanzahl der Bytes ab und zu &auml;ndert, sollte man auf
keinen Fall Programme starten! Auch das Tool MEMTEST.TTP, das Kobold
beiliegt, eignet sich sehr gut dazu, diese Probleme zu lokalisieren.
<br>
</p>
<p>Abhilfe bei V1.01:
<br>In Version 1.01 kann durch Anschalten von 'DM1' im CPX eine
Taktverlangsamung bei IDE-Zugriffen eingeschaltet werden. Das ist aber
eine recht brutale Methode, die auch zu SOFORTIGEM Absturz f&uuml;hren
kann...Sollte dies nicht passieren, empfiehlt es sich, das korrekte
Funktionieren mit MEMTEST o.&auml;. zu &uuml;berpr&uuml;fen.
<br>Alternative:
<br>Das Miniprogramm IDEAL.PRG starten. Es macht zwar auch eine
&auml;hnliche Umschaltung, aber etwas sanfter. Dies ist dann
nat&uuml;rlich aber nur in TOS/GEM oder kompatiblen OS m&ouml;glich,
da es sich in rw_abs einh&auml;ngt. IDEAL.PRG mu&szlig; im AUTO-Ordner
nach FXDRIVE.PRG ausgef&uuml;hrt werden!
<br>
</p>
<p>
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<br>
</p>
<p>- RAM/SIMM-Probleme:
<br>
</p>
<p>- Meldet FXDRIVE bei Booten keinen Speicher oder weniger als
eingesteckt, sollte mit FXCONF die Konfiguration &uuml;berpr&uuml;ft
werden. Vor allem MUSS nach Ver&auml;ndern der Konfiguration der
Falcon ABGESCHALTET werden!!!!
<br>
</p>
<p>- Meldet FXDRIVE defekte SIMMs, so gibt die Fehlermeldung einen
Hinweis auf Fehlerbank und Bitfehlermaske. Sind in der Maske nur 1 bis
2 Bits gesetzt, so ist es wahr- scheinlich ein Kontaktproblem der
Fassungen. Leichtes(!) Runterbiegen der Fassungskontakte und Reinigung
der SIMM-Kontakte mit einem Glasfaserpinsel oder der blauen Seite
einen Radiergummis sollte helfen. Sind gleich 8 Bits auf einmal '1',
so stimmt mit dem SIMM an sich etwas nicht.
<br>
</p>
<p>
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<br>
</p>
<p>- SCSI/DMA-Probleme:
<br>- Soundknackser:
<br>
</p>
<p>Treten meist nur bei 40MHz-Systemtakt auf. Diese Probleme
k&ouml;nnen am besten mit MEMTEST &uuml;berpr&uuml;ft werden. Wenn der
<a href="0e02.htm" target="UDOcon">Clockpatch mit dem 74F04</a> o.&auml;. nicht eingel&ouml;tet ist, sollte
zuerst das zuerst geschehen!
<br>
</p>
<p>Abhilfe:
<br>Wird in DMA_PROB.TXT beschrieben.
<br>
</p>
<p>
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
<br>
</p>
<p>- W&auml;rmeprobleme und dadurch entstehende Instabilit&auml;t
<br>
</p>
<p>Durch zu gro&szlig;en Temperaturanstieg der CPU wird das kritische
Phasenverh&auml;ltnis (s.o.) ebenfalls ver&auml;ndert, was zu
zunehmender Instabilit&auml;t f&uuml;hren kann. Dies hat nichts mit
'&ouml;berhitzung' der CPU an sich zu tun. In einem vern&uuml;nftig
designten 68030-System w&uuml;rde das gar nichts ausmachen...
<br>
</p>
<p>'Kostenneutrale' Abhilfen:
<br>1) oberes Abschirmblech weglassen.
<br>2) Falconl&uuml;fter ausbauen und so zwischen ROM-Port und
STE-Joystickports 'legen', da&szlig; er unter das FX bl&auml;st, und
somit die CPU optimal k&uuml;hlt. Die f&uuml;r den L&uuml;fter
notwendigen +12V finden sich am rechten Anschlu&szlig; von C110
&uuml;ber dem rechten unteren Fu&szlig; des Netzteils. Dort kann man
also die rote Litze des L&uuml;fters anl&ouml;ten. Die schwarze kann
irgendwo an den verzinnten Masserand der Platine gel&ouml;tet werden.
<br>
</p>
<p>Georg Acher / BlowUP 111195
<br>
</p>
<p>&Auml;nderung zum Erh&ouml;hen der Schreibgeschwindigkeit
(optional):
<br>
</p>
<p>Diese &Auml;nderung ist leider erst in allerletzter Minute
entstanden, und wurde daher auch nicht im Platinenlayout vorgesehen:
<br>
</p>
<p>Dazu mu&szlig; ein ca. 15cm langer Draht von einem Pin des
FX-Controller-Chips zu einem Pin von U63 gel&ouml;tet werden.
<br>
</p>
<p>Um den L&ouml;tpunkt auf der FX-Platine zu finden, hier eine
kleine Skizze. Der Pin, an dem der Draht angel&ouml;tet werden soll,
ist unterhalb mit einem ^ und einem o markiert.
<br>
</p>
<pre>
<a href="0b03.htm" target="UDOcon">FX-Karte</a> von unten:
                                   | | | | | Beschleunigerstecker
                                   | | | | |
+-------------------------------------------+
|                                           |
|                                      #### |
|                                      #### |
|      . . . . . . . . . . .           #### |
|    . . . . . . . . . . . . .         #### |
|    . .                   . .         #### |
|    . .                   . .         #### |
|    . . Sockel-Pins       . .         #### |
|    . .                   . .         #### |
|    . .                   . .         #### |
|    . .                   . .         #### |
|    . .                   . .         #### |
|    . .                   . .         #### |
|    . .                   . .         #### |
|    . . . . . . . . . . . . .         #### |
|      . . . o . . . . . . .           #### |
|            ^   M                     #### |
|        M       MM                    #### |
| MMMMMMMMMMMMMMMMMMMMMMM              #### |
|                MMMMMMMMMMMMMMMMMMMM       |
                 Masse-Leiterbahn

Der Draht wird vom markierten FX-Pin zum Pin 19 von
U63 gef&uuml;hrt:

    1
 |  9  |  |  |  |  |  |  |  |  |
---------------------------------
|                               |
 ]    U63                       |
|                               |
---------------------------------
 |  |  |  |  |  |  |  |  |  |  |

</pre>
<p>Kurze Erl&auml;uterung des Wieso&amp;Warum:
<br>
</p>
<p>Die Falconlogik in den ICs U63/U68 bremst die 68030-Zugriffe auf
68000-Geschwindigkeit ab, d.h. ein Buszugriff dauert immer mindestens
4 Takte. Durch den angebrachten Draht wird diese Logik umgangen und
dem 68030 direkt mitgeteilt, da&szlig; er den Zugriff beenden darf.
Damit kann ein FX-Zugriff nur noch 3 Takte dauern. Das dies (vorerst)
nur bei einem Schreibzugriff geschieht, liegt daran, da&szlig; bei
einem Lesezugriff je nach RAM-Typ m&ouml;glicher- weise noch nicht die
korrekten Daten auf dem Bus liegen, und der 68030 somit 'M&uuml;ll'
liest.
<br>
</p>
<p>Achtung: GEMBENCH macht bei RAM-ACCESS nur Lesezugriffe und zeigt
somit diese Beschleunigung gar nicht an. MEMSPEED.TTP ist geeigneter
daf&uuml;r...
<br>
</p>
<p>Georg Acher / BlowUP 111195
<br>
</p>
<p>Mehr zum ClockPatch:
<br>
</p>
<p>Ich habe gestern eine ganz neue Art des Clockpatches bei einem
widerspenstigen Falcon ausprobiert, der bei 40Mhz auch SCSI-Probs
hatte: Man nehme ein Poti mit 470 Ohm, ins eine Ende kommt der Takt
von R217 oben, das andere Ende kommt auf Masse und der Schleifkontakt
geht zum DMA-Chip. Jetzt wirds lustig: je mehr der Abgriff Richtung
Masse geht, umso weniger SCSI-Fehler treten auf, bis sie schliesslich
ganz weg sind. Dreht man ein bischen weiter, stuerzt der Falcon ab :-)
Kurz davor laeuft alles einwandfrei, Stundenlang und ohne Fehler. Es
mag sein, dass es dafuer eine logische Erklaerung gibt, aber ich tippe
eher auf ATARI-Esotherik :-)
<br>
</p>
<p>Bye
<br>Georg Acher
<br>Georg Acher, acher@informatik.tu-muenchen.de
<br>
</p>
<div align=center>
<br><tt>Hilfestellungen zur <a href="0b03.htm" target="UDOcon">FX-Karte</a>: Mit freundlicher Genehmigung von
Georg Archer pers&ouml;nlich.
<br>(c) BlowUP - M&uuml;nchen.</tt>
</div>
<p>
<br>
<br><b> Eine &Auml;nderung f&uuml;r den ClockPatch </b>
<br>
</p>
<p>Entfernen Sie den SMD-Widerstand R221, sofern nicht schon beim
Einbau des 74F04-ClockPatch geschehen, anderfalls entfernen Sie die
Leitung die am oberen Ende von R221 angel&ouml;tet ist. Diesen
L&ouml;tpunkt verbinden Sie mit Punkt 1 des 500-Ohm Potentiometer.
<br>
</p>
<p>Punkt 3 des Potis verbinden Sie bitte auf dem k&uuml;rzesten Weg
mit GND, z.B dem &auml;usseren Rand der Platine oder Pin 10 von U62
ect.
<br>
</p>
<p>L&ouml;ten Sie Punkt 1 mit einer neuen Leitung an den oberen
Anschlu&szlig; von R217. Dort befindet sich bereits die gelbe Leitung
der <a href="0b03.htm" target="UDOcon">FX-Karte</a>.
<br>
</p>
<p>Ohne FPU:
<br>
</p>
<p>L&ouml;ten Sie Punkt 1 an den oberen Anschlu&szlig; von R221
<br>
</p>
<p>Mit FPU:
<br>
</p>
<p>Die Leiterbahn zum DMA-Chip wie in der Anleitung beschrieben,
durchtrennen und mit einer passenden Leitung mit Punkt 2 des Potis
verl&ouml;ten.
<br>
</p>
<p>Einstellung:
<br>
</p>
<p>Der Poti sollte so plaziert werden das sie ihn auch im eingebauten
Zustand der <a href="0b03.htm" target="UDOcon">FX-Karte</a> leicht bedienen k&ouml;nnen. Drehen Sie das Poti
bis zum Anschlag bei Punkt 1. Nehmen Sie den Falcon dann in Betrieb.
Sollte der Rechner dabei normal laufen drehen Sie das Poti solange in
Richtung Punkt 3 bis der Rechner abst&uuml;rzt. Danach drehen Sie das
Poti bitte wieder ca. 20-30 Grad in Richtung Punkt 1. Neu booten. Der
Rechner sollte danach wirklich neu booten. Treten dann immer noch
DMA/SCSI-Probleme auf drehen Sie das Poti etwas weiter. Testen Sie
dabei beide Richtungen vorsichtig aus.
<br>
<br>
<br>
</p>
<p align=center><img src="image/potpatch.gif" border=0 width="140" height="140"></p><br>
<div align=center><tt> Einbau des PotiPatch </tt>
</div>
<p>
<br>
<br>Beachten Sie dazu bitte die Einbauanleitung und den ClockPatch
<br>ClockPatch mit dem 74F04
<br>
</p>
<p>
<br>
<br><b> R&uuml;ckbauen der BlowUp-Bildschirmerweiterung </b>
<br>
</p>
<p>Wer nach einiger Zeit auf die Idee kommt wegen einer Grafikkarte
oder aus sonstigen Gr&uuml;nden die Bilschirmerweiterung wieder zu
entfernen wird sicher bemerken das ihm dazu R49, ein keiner
SMD-Widerstand fehlt. Er wird nicht mal wissen wie gro&szlig; dieser
Widerstand war. Dazu gibt es DOITF030 !
<br>
<br>R49 = 68 Ohm 1/10 Watt 5% Toleranz
<br>
<br>
</p>
<p>R49 (ausgel&ouml;tet) trennt nur Pin 15 der 19 poligen
Monitorbuchse ab.
<br>Womit von aussen kein externer Videotakt mehr kommen kann.
<br>
</p>
<p>Ansonsten h&auml;tte man direkt am VIDEL Pin 14 einspeisen
m&uuml;ssen, und wer will das schon. Es mu&szlig; ja kein
SMD-Widerstand sein, ein 'normaler' Widerstand im Isolierschlauch tut
es auch. Und bitte dort keine Kurzschl&uuml;sse machen!
<br>
<br>
<br><b> Damals, aus der Fachpresse.. </b>
<br>
</p>
<p>Kurz nach Erscheinen des ATARI Falcon ver&ouml;ffentlichte die
Firma Blow Up eine hervorragende und preiswerte Bildschirmerweiterung,
die im Laufe der letzten Jahre gepflegt und weiterentwickelt wurde.
Da&szlig; die drei Blow-Upper in den vergangenen Monaten nicht
unt&auml;tig gewesen sind, beweist deren neuster Streich. Das Ergebnis
der intensiven Forschung- und Entwicklungsarbeit ist &quot;Three in
one The Falcon Extender&quot;. In diese Erweiterungskarte wurden die
drei wichtigsten Erweiterungen eingebaut, die den Falcon f&uuml;r eine
gesicherte Zukunft r&uuml;sten und ihm auch das Schritthalten mit der
gro&szlig;en Konkurrenz erm&ouml;glichen. Ber&uuml;cksichtigt wurden
folgende Komponenten:
<br>
<br>
</p>
<p>1) Speichererweiterung
<br>2) Beschleuniger
<br>3) Bildschirmerweiterung
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Die Speichererweiterung </b>
<br>
</p>
<p><a href="0a.htm" target="UDOcon">Speichererweiterungen</a> sind f&uuml;r den Falcon grunds&auml;tzlich
nichts neues mehr. Die bisher erschienenen Modelle hatten jedoch
allesamt den Nachteil, da&szlig; sie im Austausch zur bestehenden
Falcon-Karte aufgesetzt werden mu&szlig;ten. Zwar kann die interne
Falcon-Karte bei den meisten H&auml;ndlern in Zahlung gegeben werden,
doch h&auml;ufig erh&auml;lt man f&uuml;r die immerhin 4 MB nur gut
50.- DM. De facto macht man also beim Aufr&uuml;sten des Rechners
stets Verlust. Die Blow-Up Speichererweiterung umgeht dieses Problem,
das sie auf den internen CPU- Erweiterungssteckplatz gesetzt wird.
Auch hierbei haben die Entwickler der Karte an die vielen User
gedacht, die bereits eine Erweiterung wie z.B. Grafikkarten, PC-Karten
oder Digitizer eingebaut haben, denn die <a href="0b03.htm" target="UDOcon">FX-Karte</a> ist
gl&uuml;cklicherweise durchgeschleift. Wer allerdings zwei
Erweiterungen &uuml;bereinander nutzen will, der sollte sich ein
gr&ouml;&szlig;eres Geh&auml;use zulegen, da das Original
selbstverst&auml;ndlich nicht hoch genug ist. Auf der Karte befinden
sich vier Slots f&uuml;r Standard-Simms (Speichermodule), die in den
Speichergr&ouml;&szlig;en 1 MB oder 4 MB jeweils paarweise einzusetzen
sind. Der hier installierte Speicher wird additional zum internen
Falcon-Speicher genutzt! M&ouml;gliche Ausbaustufen sind z.B.
<br>
<br>
</p>
<p>4x 1 MB (insges. 8 MB), oder
<br>2 x 1 plus 2 x 4 MB (insges. 14), oder auch nur
<br>2 x 1 MB (6 MB).
<br>
</p>
<p>Gegen&uuml;ber der herk&ouml;mmlichen 4 x 4 MB Erweiterung werden
hierbei also auch nicht 2 MB verschenkt. Diese
Aufr&uuml;stflexibilit&auml;t l&auml;&szlig;t das schrittweise
Erweitern des Rechners zu, was nicht zuletzt auch aus
Kostengr&uuml;nden sehr interessant sein d&uuml;rfte. Wer mit dem
Gedanken spielt, die Karte ausschlie&szlig;lich zur
Speichererweiterung zu verwenden, braucht nichteinmal L&ouml;tarbeiten
vorzunehmen. Nachdem die Karte also installiert wurde, zeigt der
Falcon nach dem erneuten Starten den erweiterten Gesamtspeicher an.
Dieser Speicher wird von der Software entsprechend dem TT-RAM
behandelt. Die meisten Programme haben keine Probleme, auf dieses RAM
zuzugreifen, das k&ouml;nnen TT-Besitzer best&auml;tigen. Nichts desto
trotz kann es zu gelegentlichen Problemen beim Bildschirmaufbau
kommen. Dies ist darauf zur&uuml;ckzuf&uuml;hren, da&szlig; ATARI
f&uuml;r den Falcon kein Fast-Ram vorgesehen hat. Das Problem ist,
da&szlig; das Falcon-(TT)-RAM im Adre&szlig;bereich des
Falcon-Blitters liegt, der wiederum dazu genutzt wird, um z.B. Icons
auf dem Bildschirm zu kopieren (also darauf darzustellen).
Ungl&uuml;cklicherweise (das liegt wohl daran, da&szlig; der TT keinen
Blitter besa&szlig;) kann dieser Grafik-Chip aber nicht auf das
Fast-RAM zugreifen. Hieraus resultieren gelegentliche
Bildschirmprobleme. Diese k&ouml;nnen jedoch wie folgt behoben werden:
Entweder Sie haben z.B. NVDI installiert (und der Blitter wurde
ausgeschaltet), oder sie verwenden das von der Fa. Blow Up im
Lieferumfang enthaltene Patch-Programm. Zwar ist der Blitter dann
nicht mehr aktiv, doch die faktisch von einigen Programmen genutzte
Beschleunigung ist einerseits sehr gering, andererseits wird der
Verlust spielend vom Beschleuniger kompensiert.
<br>
<br>
<br>
</p>
<p><b> Der Beschleuniger </b>
<br>
</p>
<p>Auf der <a href="0b03.htm" target="UDOcon">FX-Karte</a> ist u.a. ein Beschleuniger f&uuml;r CPU, FPU und
DSP integriert. F&uuml;r den Betrieb der Speichererweiterung ist
keiner dieser Beschleuniger notwendig, die Nutzung scheint jedoch sehr
sinnvoll. Um den Beschleuniger einbauen zu k&ouml;nnen, werden jedoch
gute L&ouml;terfahrungen und entsprechendes Werkzeug ben&ouml;tigt.
Der Beschleuniger kann den Systemtakt wahlweise auf 18 MHz oder 20 MHz
beschleunigen. Dies ist in sofern sinnvoll, da ein langsames System
nichts mit schnellen Daten der Zulieferer anfangen kann. Die CPU
selbst kann auf &uuml;ber das Doppelte, also 40 MHz beschleunigt
werden.
<br>
</p>
<p>Nach dem Einbau k&ouml;nnen die verschiedenen Taktfrequenzen mit
Hilfe eines CPX-Modules im Kontrollfeld softwarem&auml;&szlig;ig
eingestellt werden. &ouml;ber das Feld &quot;System&quot; (siehe Bild
1) k&ouml;nnen Sie bestimmen, mit welcher Taktrate die CPU angesteuert
wird. Das System arbeitet eigentlich mit einer Taktfrequenz von 32
MHz, wobei die meisten Komponenten, wie z.B. die CPU jedoch nur die
H&auml;lfte, also 16 MHz bekommen. Der hier ver&auml;nderte Wert wirkt
sich also direkt auf die CPU aus. Gleicherma&szlig;en wird das gesamte
System in der Geschwindigkeit verdoppelt, da bei jedem Zugriff auf
Speicher oder Peripherie-Ger&auml;te die CPU wieder heruntergeschaltet
wird. Die h&ouml;here Taktfrequenz des Systemtaktes kommt der CPU
immer dann zugute, wenn diese mit dem internen Cache arbeitet. Bei
Umschaltung auf 36 MHz arbeitet das System folglicherweise mit 18 MHz,
bzw. 36 MHz usw. Dieser Beschleuniger bringt grunds&auml;tzlich die
gleichen Vor- und Nachteile, wie die Konkurrenzmodelle. Das komplexe
<a href="030503.htm" target="UDOcon">Timing</a> des Falcon l&auml;&szlig;t eine perfekte L&ouml;sung nur sehr
selten zu.
<br>
</p>
<p>Daher kann es bei einigen Rechnern zu Abst&uuml;rzen in
h&ouml;heren Taktraten kommen. Um jedoch eine individuelle
Konfiguration zu erm&ouml;glichen, haben Sie im Kontrollfeld weiterhin
die M&ouml;glichkeit, eine Feinabstimmung durch die Buttons 1,2,3,1,
DM1, DM2 zu treffen.
<br>
</p>
<p>Dar&uuml;ber hinaus kann eine &uuml;berhitzte CPU zu
Systemabst&uuml;rzen f&uuml;hren. Zwar wird von Blow Up ein
CPU-K&uuml;hler mitgeliefert, doch im Original-Geh&auml;use des Falcon
kann es bei Langzeitbetrieb dennoch zu Hitzestauungen kommen, die
evtl. wiederum zu Abst&uuml;rzen des Rechners f&uuml;hren. Dies alles
mu&szlig; nicht sein und kann durch den dosierten Einsatz des
Beschleunigers (bei einfachen Nutzungen herunterschalten, bei
komplexen Anwendungen h&ouml;her takten) weitestgehend umgangen
werden. Die softwarem&auml;&szlig;ige Anpassung tr&auml;gt ihr Bestes
zum komfortablen Arbeiten bei.
<br>
</p>
<p>
<br>
<br><b> Die Bildschirmerweiterung </b>
<br>
</p>
<p>Diese ist eigentlich aus den fr&uuml;heren Revisionen der Blow-Up-
Aufl&ouml;sungserweiterungen bekannt. Daher werden wir in diesem
Abschnitt auch nur relativ kurz auf diese Komponente eingehen. Ein
&uuml;bersichtliches Boot-Men&uuml; l&auml;&szlig;t vielseitige
Einstellungen direkt beim Booten zu. M&ouml;gliche Aufl&ouml;sungen
sind z.B.: Multiscan-Monitor: bis zu 640 x 480 in True-Colour und
256-Farben - interlace. VGA-Monitor: bis zu 880 x 480 bei 256-Farben
non interlaced. und bis zu 1152 x 912 bei 16-Farben interlace. SM 124:
bis zu 640 x 480 bei 2 Farben.
<br>
</p>
<p>Die Boot-Software ist so ausgestattet, da&szlig; die bekanntesten
Monitor-Typen mit jeweils einer Menge Einstellungs-M&ouml;glichkeiten
zur Auswahl stehen, so da&szlig; keine komplizierten Fein-Abstimmung
getroffen werden m&uuml;ssen. Wer jedoch einen Monitor mit seltenen
oder gar exotischen technischen Daten besitzt, der hat die
M&ouml;glickeit, diverse Parameter individuell einzustellen und so zu
speichern, da&szlig; diese direkt nach dem Booten aufgerufen und
aktiviert werden. In allen F&auml;llen ist jedoch zu beachten,
da&szlig; gr&ouml;&szlig;te Vorsicht geboten wird, denn
unsachgem&auml;&szlig;es Behandeln kann schnell zu einem Monitor-Tod
f&uuml;hren. Das ausf&uuml;hrliche Handbuch ist aber in jedem Falle
eine n&uuml;tzliche Hilfe beim Finden der geeigneten Einstellungen.
<br>
</p>
<p>Fazit Die Entwickler von Upgrade-<a href="0305.htm" target="UDOcon">Hardware</a> f&uuml;r den Falcon
haben es stets mit vielen Schwierigkeiten zu tun, da es von der
Falcon-<a href="0305.htm" target="UDOcon">Hardware</a> seitens ATARI stets viele verschiedene Revisionen
gegeben hat, die Erweiterung jedoch f&uuml;r alle Rechner gleichzeitig
funktionieren mu&szlig;. Umso erfreulicher ist die Laufsicherheit der
<a href="0b03.htm" target="UDOcon">FX-Karte</a>. Sie macht vom ersten bis zum letzten Moment einen
durchdachten und sauber (v)erarbeiteten Eindruck. Bei unseren Tests
lief die Karte durchweg felherfrei, wobei sie in einem Tower-Falcon
eingebaut und mit der notwenigen Vorsicht dosiert eingesetzt wurde.
Hinzu kommt ein ausreichendes Handbuch und ein umfangreiches
Softwarepaket, welches auf nahezu alle St&ouml;rf&auml;lle eine
L&ouml;sung zu bieten scheint. Die <a href="0204.htm" target="UDOcon">Installation</a> ist spielend einfach:
Sie m&uuml;ssen lediglich die Installationssoftware direkt von der
Diskette starten und die Grundeinstellungen wie z.B. die Anzahl der
(wie) belegten Simm-B&auml;nke angeben. Nach Eingabe des
Installationspfades legt das Programm automatisch alle notwendigen
Ordner usw. an, so da&szlig; einem reibungslosen Ablauf nichts mehr im
Wege steht.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/line2.gif" border=0 width="638" height="17"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_up.gif" alt="FX-Karte" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_lf.gif" alt="FX-Karte" border=0 width="24" height="24"></a>
<a href="0b0302.htm" target="UDOcon"><img src="udo_rg.gif" alt="FX-Board" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
