<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Afterburner040
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b04.htm" target="UDOcon"><img src="udo_up.gif" alt="Afterburner" border=0 width="24" height="24"></a>
<a href="0b04.htm" target="UDOcon"><img src="udo_lf.gif" alt="Afterburner" border=0 width="24" height="24"></a>
<a href="0b0402.htm" target="UDOcon"><img src="udo_rg.gif" alt="How not to fit an Afterburner" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Afterburner040">11.4.1 Afterburner040</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Afterburner040 - Fragen und Antworten</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Der Einbau eines Afterburner040 in den Falcon.
<br>Der Falcon befindet sich hier noch im Orginalgeh&auml;use.
Beachten Sie bitte das dieser Umbau nicht mit dem originalem
Geh&auml;use des Falcons durchgef&uuml;hrt werden kann. Auf dem
<a href="0b04.htm" target="UDOcon">Afterburner</a> sehen Sie ein MATRIX-Screeneye welches leider nicht mehr
Hergestellt wird und eigentlich nur noch gebraucht aufzutreiben ist
<br>
</p>
<p>Die Kombination <a href="0b04.htm" target="UDOcon">Afterburner</a> + Screeneye ist mehrfach erfolgreich
getestet
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/ab04001.gif" border=0 width="357" height="240"></p><br>
<div align=center><tt> Abbildung 1 - <a href="0b04.htm" target="UDOcon">Afterburner</a> 040 im <a href="0302.htm" target="UDOcon">Falcon F030</a> </tt>
</div>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ab040_3.gif" border=0 width="160" height="100"></p><br>
<div align=center><tt> Abbildung 2 - <a href="0b04.htm" target="UDOcon">Afterburner</a> 040 Mainboard </tt>
</div>
<p>
<br>Letzte &Auml;nderung: 04.12.95
<br>-------
</p>
<p>Dieser Text enth&auml;lt h&auml;ufig gestellte Fragen (F:) und
Antworten (A:) zum Afterburner040 (AB040), dem Beschleuniger f&uuml;r
alle ATARI Falcon030 (F030). Er wird st&auml;ndig erweitert.
<br>
</p>
<pre>F: Was ist Afterburner040?
A: Afterburner040 ist eine <a href="0305.htm" target="UDOcon">Hardware</a>-Erweiterung f&uuml;r den ATARI Falcon030.
   Der Falcon wird dadurch mit einer schnellen 68(LC)040-CPU und optionalem
   Fast-RAM (max. 128 MB) ausgestattet.

F: Wie kann der Fast-RAM aufger&uuml;stet werden?
A: Auf dem AB040 sind zwei handels&uuml;bliche PS2-RAM-Sockel vorhanden, die auch
   einzeln best&uuml;ckt werden k&ouml;nnen. So sind zwischen 4 und 128 MB RAM m&ouml;glich.

F: Kann der Original-RAM weiterbenutzt werden, wenn Fast-RAM auf dem AB040
   installiert ist?
A: Ja, das schnelle Fast-RAM auf dem AB040 liegt im hohen Adressbereich
   jenseit der 16MB-Grenze des Falcon030. Deshalb ist es nicht nur schnell,
   sondern kollidiert auch nicht mit bereits vorhandenen 4MB- oder 14MB
   Falcon-(ST)-RAM-Erweiterungen.

F: L&auml;uft der AB040 zusammen mit Bus-Beschleunigern wie Skunk36, der Speed-
   ResolutionCard (SRC), der <a href="0b03.htm" target="UDOcon">FX-Karte</a>, dem ddd-Beschleuniger oder Skunk36?
A: Ja. Der Afterburner040 ist synchron an den System-Bus des Falcon030
   gekoppelt und l&auml;uft immer mit der vierfachen Busgeschwindigkeit:
   +-----------------+------------------------------------------------------+
   |                 | Falcon030  Falcon030  F030-&gt;AB040  AB040     AB040   |
   |      Takt [MHz] | Bus        CPU (*1)   Koppelung    Bus       CPU (*2)|
   +-----------------+------------------------------------------------------+
   | Normaler Falcon |   16         16         16           32      64 / 32 |
   | Mit Speeder(*3) |   18         36         18           36      72 / 36 |
   | Mit Speeder(*4) |   20         40         20           40      80 / 40 |
   +-----------------+------------------------------------------------------+
   *1) Theoretischer Wert, da original-CPU stillgelegt wird.
   *2) Die Motorola 68(LC)040-CPU wird mit zwei Taktsignalen versorgt, die
       intern verschiedene Verwendung finden. In Anlehnung an die DX2-CPUs von
       Intel nennt Motorola gerne den h&ouml;heren Takt als CPU-Takt, obwohl dies
       nicht ganz korrekt ist.
   *3) Getestet mit SRC.
   *4) Bis jetzt nicht getestet.

F: Wie schnell wird der Falcon030 mit Afterburner040?
A: Subjetiv beurteilt wird der Rechner durch AB040 ca. drei- bis viermal so
   schnell. Der Geschwindigkeitszuwachs ist abh&auml;ngig von der Anwendung, denn
   CPU-lastige Programme werden besonders beschleunigt. Auch Programme, die
   das Fast-RAM benutzen, profitieren davon, denn das Fast-RAM-Interface auf
   dem AB040 ist 14mal so schnell, wie der ST-RAM auf dem Falcon-Mainboard.
   Hier einige Benchmark-Werte, die ein Afterburner040-Benutzer f&uuml;r uns
   zusammengestellt hat (alle Angaben ohne Gew&auml;hr, Konfiguration: NVDI 3.02,
   640*400*2, kein BLiTTER, Gemram, WinX):
   +-----------------------+----------------------+-------------------------+
   | Gembench-Werte        | Bus-Takt  CPU-Takt   | Display  CPU  Mittelwert|
   +-----------------------+----------------------+-------------------------+
   | Falcon030 normal      |    16       16       |   247%   100%   205%(*) |
   |     &quot;     mit Speeder |    16       32       |   253%   122%   215%(*) |
   |     &quot;     mit Speeder |    18       36       |   567%   176%   456%    |
   |     &quot;     mit Speeder |    20       40       |   635%   216%   510%    |
   |     &quot;     mit AB040   |    16       64 / 32  |   909%   603%   836%    |
   |     &quot;     mit AB040   |    18       72 / 36  |  1010%   687%   936%    |
   +-----------------------+----------------------+-------------------------+
   *) Gemessen ohne Chache.

F: Wie wird AB040 eingebaut?
   AB040 wird in den Erweiterungssteckplatz des F030 gesteckt. Zus&auml;tzlich
   m&uuml;ssen neu Kabel im Rechner an zug&auml;nglicher Stelle angel&ouml;tet werden
   (leichte L&ouml;tareit). Die original 68030-CPU wird durch abl&ouml;ten von zwei
   Pins und Verbindung eines Pins mit Masse deaktiviert (L&ouml;terfahrung und
   SMD-L&ouml;twerkzeug erforderlich).

F: Kann bei installiertem AB040 zwischen 68(LC)040 CPU und <a href="040109.htm" target="UDOcon">68030 CPU</a>
   umgeschaltet werden?
A: Ja und nein. AB040 macht aus dem Falcon030 einen &quot;Falcon040&quot;. Die alte
   CPU wird dabei stillgelegt. Durch zus&auml;tzliche Beschaltung ist es aber
   m&ouml;glich, zwischen alter CPU und AB040-Betrieb umzuschalten. Diese
   Umschaltung ist aber nur besonders ge&uuml;bten Bastler geeignet.

F: Ist AB040 auch ohne CPU lieferbar?
A: Ja. Es k&ouml;nnen 68040 und 68LC040-CPU best&uuml;ckt werden. Je nach Takt (oder
   &Uuml;bertaktung) ist ein zus&auml;tzlicher K&uuml;hlk&ouml;rper mit L&uuml;fter notwendig.

F: Wo ist der Unterschied zwischen 68LC040 und 68040-CPU?
A: Der 68LC040 enth&auml;lt keine mathematischen CoPorzessor (FPU). Allerdings
   unterst&uuml;tzen nur sehr wenige TOS-Programme eine vorhandene FPU, so da&szlig;
   der Preisvorteil der 68LC040 gegen&uuml;ber der 68040 eine wichtige Rolle
   bei der Anschaffung spielt.

F: Reicht das Original-<a href="0f01.htm" target="UDOcon">Netzteil</a> des F030 f&uuml;r AB040-Betrieb aus?
   Ja.

F: Pa&szlig;t der AB040 in das Original-Geh&auml;use des F030?
A: Nein. Die Tastatur pa&szlig;t bei installiertem AB040 nicht mehr in das Original-
   Falcon-Geh&auml;use. Es sind aber von verschiedenen Herstellern Aufsatz-Geh&auml;use
   und Tower-Umbauten lieferbar. Aufsatz-Geh&auml;use f&uuml;r den Original-Falcon-
   Unterbau gibt es von (digital data deike) ddd und Lighthouse. Tower-Umbauten

   liefern zahlreiche Hersteller: ddd, Lighthouse, Betz, Team, Rocke, Eickmann
   u.a.

F: Wie gut ist die Kompatibilit&auml;t des AB040?
A: Der Motorola 68(LC)040 Chip ist der Nachfolger der im Falcon verwendeten
   68LC030-CPU. Praktisch alle GEM-Anwendungen laufen aber ohne &Auml;nderung
   mit dem AB040 problemlos zusammen. Dazu geh&ouml;ren Calamus(SL), Cubase <a href="0907.htm" target="UDOcon">Audio</a>,
   praktisch alle Textverarbeitungen (incl. Signum und Tempus Word) usw.
   Nur wenige Spiele und Anwendungen, die sehr hardwarenah programmiert sind,
   k&ouml;nnen u.U. mit dem AB040 nicht zusammenarbeiten.
   Den optionalen Fast-RAM des AB040 nutzen auch viele Programme, da die
   Technik des Fast-RAM bereits im ATARI TT von ATARI eingef&uuml;hrt wurde.

F: Ist der Erweiterungssteckplatz des F030 weiterhin verwendbar?
A: Ja. Der AB040 f&uuml;hrt den Erweiterungssteckplatz des Falcon030 unver&auml;ndert
   nach oben durch. Erweiterungen wie <a href="0804.htm" target="UDOcon">ScreenEye</a>, FalconSpeed und der Nova-
   Grafikadapter laufen so ohne &Auml;nderung.

F: Sind spezielle Erweiterungen f&uuml;r den AB040 vorgesehen?
A: Der AB040 verf&uuml;gt &uuml;ber einen Steckplatz, der die Original-Erweiterungs-
   steckplatz des F030 auf volle 32 Bit erg&auml;nzt. Damit ist die Grundlage
   f&uuml;r schnelle 32-Bit-Erweiterungen geschaffen, die nicht auf die 16 MB-
   Grenze des F030 angewiesen sind.

Fragen zu Preisen, Lieferbarkeit und Upgrade-Konditionen
--------------------------------------------------------

F: Was kostet Afterburner040?
A: Afterburner040 ohne CPU ...................................... DM 1098,-
   Afterburner040 mit 68LC040 ................................... DM 1298,-
   Afterburner040 mit 68040 ..................................... DM  a.A.

   Afterburner040 Einbauservice normal .......................... DM  150,-
    (Nur bei unver&auml;ndertem Falcon030-Mainboard)
   Afterburner040 Einbauservice normal .......................... DM  a.A.
    (Bei ver&auml;ndertem Falcon030-Mainboard, z.B. Bus-Speeder)

F: Wann ist AB040 lieferbar?
A: Seit dem 25.11.95.

F: Erhalten offizielle ATARI-Entwickler Verg&uuml;nstigungen?
A: Ja. ATARI-Entwickler, die uns ihren Status nachweisen k&ouml;nnen
   (z.B. duch Faxkopie des NDA mit ATARI), erhalten Afterburner040 zum
   verg&uuml;nstigten Entwicklerpreis.

F: Wie liefert OverScan?
A: Wir liefern mit Post oder UPS. UPS ben&ouml;tig f&uuml;r den Transportweg zwei Tage,
   die Post neuerding abh&auml;ngig von der Postleitzahl ein oder maximal zwei
   Tage (und es funktioniert sogar).

F: Wie sind die Zahlungskonditionen?
A: Es gibt verschiedene Wege, Afterburner040 zu bezahlen:
   - Vorkasse (&Uuml;berweisung oder Scheck)
   - Nachnahme
   - VISA Kreditkarte
   - Lastschrift von Ihrem Konto (Bestellung per Fax oder Brief n&ouml;tig)

F: Wie erreicht man OverScan?
A: Adresse: OverScan
            Elbestr. 28-29
            12045 Berlin
   Telefon: 030-623 82 92 (Verkauf, 10-17 Uhr)
   Telefon: 030-623 12 67 (Hotline, 14-17 Uhr)
   Telefax: 030-623 83 47
   Mailbox: 030-624 65 10
   eMail:   info@overscan.com
   WWW:     http://www.overscan.com
</pre>
<p>
<br>
</p>
<p>Beachten Sie bitte das die Fa. Overscan nicht mehr existiert und
der <a href="0b04.htm" target="UDOcon">Afterburner</a> meines Wissens nach nur noch bei Titan Design LTD in
England zu erhalten ist. Der Preis ist in etwa gleich
<br>Alle Bezugsquellen finden Sie unter <a href="1604.htm" target="UDOcon">H&auml;ndler</a>.
<br>
</p>
<p>Beachten Sie bitte das die Fa. OverScan-Berlin nicht mehr existent
ist!!
<br>
</p>
<p>
<br>
<br><b> Die eigentliche Einbauanleitung zum Afterburner040 </b>
<br>
</p>
<p>Verbinden Sie folgene Leitungen anhand der Kabelfarbe mit dem
entsprechenen Punkt auf ihrer Falcon Hauptplatine. Beachten Sie bitte
genau die Angaben der L&ouml;tstellen. Fehler k&ouml;nnen hier zur
Zerst&ouml;rung des Falcons f&uuml;hren.
<br>
</p>
<pre>
Kabelfarbe   Anl&ouml;ten an
--------------------------------------------------------------
Braun        an Pin  3 von U 62
Rot          an Pin  9 von U 62
Orange       an Pin 12 von U 62
Gelb         an Pin 19 von U 67
Gr&uuml;n         an Pin  2 von U 63 (nicht am ClockPatch! Chip 74F08)
Blau         an Pin 19 von U 63 (nicht am ClockPatch Chip 74F08)
Lila         an Pin  4 von U 68
Grau         an Pin 13 von U 62

Kabel 9 + 10 sind nicht belegt.

</pre>
<p>
<br>
<br>Die F030 CPU mit der Chipbezeichnung U55
<br>
</p>
<p>Alle Leitungen sollen so kurz wie m&ouml;glich gehalten werden
<br>
</p>
<p>Pin 17 vom Pad l&ouml;sen und gegen Masse l&ouml;ten. Das passiert
am besten mit einem kurzen St&uuml;ck isoliertem Draht. Pin 16 vom
L&ouml;tpad l&ouml;sen und leicht nach oben biegen, soweit das kein
Kontakt zum L&ouml;tpad darunter besteht.
<br>Pin 17 kann leicht gegen Pin 10 von U62 gel&ouml;tet werden,
dieser Pin ist GND
<br>
</p>
<p>Die beiden Pins befinden sich an der linken unteren Ecke der CPU.
Pin 17 ist beschriftet. Pin 1 befindet sich in der Mitte des Chips!
Beachten Sie daher dringlich die offizielle Z&auml;hlrichtung.
<br>
</p>
<p>Die original Falcon CPU ist ein SMD-Chip, bedenken Sie bitte genau
was sie da machen. Die Pins der CPU, in diesem Fall, Pin 16 und Pin
17, brechen sehr schnell direkt am Geh&auml;use ab. Ihr Falcon ist an
dieser Stelle sehr schwer zu Reparieren da die gesammte CPU
ausgel&ouml;tet werden mu&szlig;. Das kann nur mit Spezialwerkzeug
geschehen. U.a ist eine SMD-L&ouml;teinrichtung dringend anzuraten. Es
geht wenn man sich einen winzigen Drahhaken biegt, den entsprechenden
Pin erw&auml;mt um den Haken dann leicht unter dem SMD-Beinchen
hindurchzieht. Dabei mu&szlig; aber der L&ouml;tkolben schon weg sein.
Nur so kann man ein &uuml;berm&auml;ssiges verbiegen der Beinchen
vermeiden und trozdem die Pins von den L&ouml;tpads l&ouml;sen.
<br>
</p>
<p>Sollte Pin 17 abgebrochen sein d&uuml;rfen sie nur hoffen das der
<a href="0b04.htm" target="UDOcon">Afterburner</a> nach dem Einsetzen in ihren Falcon korrekt arbeitet. Ein
R&uuml;ckbau ist ohne Pin 17 leider nicht mehr m&ouml;glich.
<br>
<br>
</p>
<p><b> <a href="0305.htm" target="UDOcon">Hardware</a>-Modifikation des Mainboards </b>
<br>
</p>
<p>Sollte der Falcon nicht mit dem sog. ClockPatch modifiziert sein,
sollten sie das rasch nachholen. Ohne ClockPatch wird der <a href="0b04.htm" target="UDOcon">Afterburner</a>
leider nicht korrekt Funktionieren. Es sollte in diesem Falle die
Modifikation mit dem 7408 vorgenommen werden da diese hier am besten
Funktioniert. Eine Garantie darauf gibt es jedoch nicht.
</p>
<p>Verwenden Sie hierzu die ClockPatch - Anleitungen in DOITF030.
<br>
<br>
</p>
<p><b> Softwaretreiber f&uuml;r den Betrieb </b>
<br>
</p>
<dl>
<dt><b>AB40_MMU.PRG</b></dt><dd> Autoordner: MMU Initialisierung mu&szlig; als erstes im
AUTO-Ordner stehen
<br>&nbsp;
<dt><b>AB40_RAM.PRG</b></dt><dd> Autoordner: zum Anmelden des Alternate-RAM sucht sich die
Speichergr&ouml;&szlig;e selbst
<br>&nbsp;
<dt><b>AB40_FPU.PRG</b></dt><dd> Autoordner: Emultionssoftware f&uuml;r die FPU. Sie sollte nach
M&ouml;glichkeit im Fastram laufen.
<br>&nbsp;
</dl>
<p>Leider laufen nicht alle Atari-Programme im Fastram, besonders
trifft das einige lieb gewonnene Veteranen aus alten Zeiten. Beachten
Sie hierzu bitte das die Programmflags stets korrekt von ihnen gesetzt
werden. PRGFLAG und andere Verteter dieser Gattung sollte Ihnen
eigentlich ein Begriff sein.
<br>
</p>
<p>Gelegentlich kann es n&uuml;tzlich sein auch mal den Cache
abzuschalten!
<br>
</p>
<p>Beachten Sie bitte das sie die Motorola 68040-CPU niemals ohne
aktivem L&uuml;fter betreiben sollen. Dieser CPU Typ wird sehr
hei&szlig;. Vor allem gilt das f&uuml;r die RC-Version dieser CPU.
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/abfalcon.gif" border=0 width="2255" height="1843"></p><br>
<div align=center><tt> Der <a href="0b04.htm" target="UDOcon">Afterburner</a> Falcon </tt>
</div>
<p>
<br>
<br>
</p>
<p><b> Fast-Ram </b>
<br>
</p>
<p>Das <a href="0b04.htm" target="UDOcon">Afterburner</a> Board enth&auml;lt Fassungen f&uuml;r PS/2 Simms.
<br>Hier k&ouml;nnen ein oder zwei Module auf das Board gesteckt
werden. Das erste Modul sollte unbedingt in dem &auml;usseren
Steckplatz stecken! Das FastRam wird erst durch die mitgelieferte
Software initalisiert. Sie m&uuml;ssen dazu erst den Treiber
installieren.
<br>
</p>
<p>Die gr&ouml;sste Geschwindigkeit erreicht der <a href="0b04.htm" target="UDOcon">Afterburner</a> wenn
m&ouml;glichst alle Programme im FastRam laufen k&ouml;nnen. Hierzu
sind leider eigene Tests dringend Notwenig.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b04.htm" target="UDOcon"><img src="udo_up.gif" alt="Afterburner" border=0 width="24" height="24"></a>
<a href="0b04.htm" target="UDOcon"><img src="udo_lf.gif" alt="Afterburner" border=0 width="24" height="24"></a>
<a href="0b0402.htm" target="UDOcon"><img src="udo_rg.gif" alt="How not to fit an Afterburner" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
