<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: CENTurbo2 Accelerator
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b05.htm" target="UDOcon"><img src="udo_up.gif" alt="Centurbo2" border=0 width="24" height="24"></a>
<a href="0b05.htm" target="UDOcon"><img src="udo_lf.gif" alt="Centurbo2" border=0 width="24" height="24"></a>
<a href="0b0502.htm" target="UDOcon"><img src="udo_rg.gif" alt="CENTurbo2 B Accelerator" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="CENTurbo2_20Accelerator">11.5.1 CENTurbo2 Accelerator</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Der CENTurbo II Falcon Beschleuniger von CENTEK </tt>
<br>
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Aus dem Prototyp des CENTurboII Beschleunigers, welcher schon
Anfang des Jahres auf der TOS4You in Schaafheim gezeigt wurde, ist ein
fertiges Produkt mit sehr beachtlichen Leistungsdaten geworden.
<br>
</p>
<p>Die CENTEK-Entwickler um Rodolphe Czuba haben ganzes geleistet.
<br>
</p>
<p>Die Beschleuniger <a href="0305.htm" target="UDOcon">Hardware</a> ansich besteht aus einer einzigen
Platine die gr&ouml;sser als eine normale Falcon-Ramkarte ist und
direkt auf den interen Erweiterungssbus des Atari Falcon gesteckt
wird. Neben einigen Modifikationen an der <a href="030502.htm" target="UDOcon">Busemulation</a> des Falcons und
einigen L&ouml;tarbeiten f&uuml;r 12 zus&auml;tzliche
Verbindungsleitungen fallen keine weiteren Arbeiten an. Am
Beschleunigerboard selber mu&szlig; eigentlich nie gel&ouml;tet
werden, alle Verbindungen werden &uuml;ber Stecker und Flachbandkabel
zur Hauptplatine gef&uuml;hrt. Auf dem Beschleuniger befindet sich ein
64K Flash Eprom und ein Sockel f&uuml;r eine <a href="040108.htm" target="UDOcon">68882 FPU</a>.
<br>
</p>
<p>Weitere Hinweise zum Einbau finden sie in der englischen
Einbauanleitung.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cent1.gif" border=0 width="320" height="240"></p><br>
<div align=center><tt> Abbildung 1 - CENTurbo2 Beschleuniger Board </tt>
</div>
<p>
<br>
<br>
</p>
<p>Wie also z.B auch bei der englischen <a href="0b02.htm" target="UDOcon">Nemesis</a>-L&ouml;sung von Titan
Design sind hier also einige Steuerleitungen mit dem Rechner zu
verl&ouml;ten. Ein vieleicht wichtiger Punkt ist die Tatsache das der
Centurbo II vollst&auml;ndig und fast vollsteckbar in ein originales
Falcongeh&auml;use passt. Auch die zu l&ouml;tenden Steuerleitungen
sind bis auf zwei Leitungen, was sich vermutlich bei der n&auml;chsten
Release noch &auml;ndern wird, komplett absteckbar.
<br>
</p>
<p>Das CENTurbo Board tr&auml;gt seinen Namen mit vollem Recht,
wesentlich kleiner als das deutsche <a href="0b04.htm" target="UDOcon">Afterburner</a>-Projekt dr&auml;ngt
sich der Gedanke an einen Turbolader direkt und f&ouml;rmlich auf. Wie
Sie hier aus den technischen Daten und den GEMBench Testl&auml;ufen
weiter hinten selber leicht entnehmen k&ouml;nnen tifft diese Aussage
auch zu, selbst dann wenn eine <a href="040109.htm" target="UDOcon">68030 CPU</a> immer noch langsamer als eine
68040 CPU bleibt. Weiterhin ist dieser Beschleuniger so ausgelegt das
man immer wieder auf einen normalen Falcon umschalten kann.
<br>
</p>
<p>Diese Erweiterung sollte alles enthalten worauf der PowerUser
schon l&auml;nger gewartet hat, was seitens Atari als unm&ouml;glich
deklariert wurde:
<br>
<br>
</p>
<p>68030 32-Bit CPU mit permanentem Takt von 50 MHz!
<br>32-Bit Standard SIMM Sockel f&uuml;r 32-Bit EDO Fast-RAM (16 or 32
MB)
<br>Mit einem 7! mal schnelleren Zugriff als es das original 16 MHz
ST-Ram erlaubt.
<br>(6.2.2.2 BURST Zugriff auf den 030 (32 MB/s) bei 50 MHz)
<br>
</p>
<p>Sockel f&uuml;r eine 32-Bit FPU (68882-33) bei 50 MHz
<br>
</p>
<p>50 MHz Takt auf dem Falcon DSP
<br>
</p>
<p>Falcon Bus mit 50 MHz Takt (CPU Zugriffe bei vollen 50 MHz)
<br>
</p>
<p>32-Bit direkt CPU Bus Slot, ein kompatibler Falcon-Expansionsbus
welcher erlaubt einige alte Erweiterungen weiter zu verwenden.
<br>(Nicht im Originalgeh&auml;use)
<br>
</p>
<p>Laut Hersteller:
<br>
</p>
<p>100% Original Falcon durch zur&uuml;ckschalten.
<br>Keine Floppy probleme.
<br>Keine SCSI probleme.
<br>Keine <a href="0907.htm" target="UDOcon">Audio</a> probleme (Klicks oder Kackser !)
<br>
</p>
<p>TURBO Modus bei allen an geschlossen Bildschirmen verwendbar:
<br>
<br>
</p>
<p>VGA, TV, RGB and MONO (SM Monitore).
<br>
</p>
<p>Beispiele nutzbarer Bildschirmaufl&ouml;sungen:
<br>
<br>896*672*2/16/256 Farben bei 66 Hz
<br>1024*768*16/16/256 Farben bei 99 Hz
<br>
</p>
<p>Interlace:
<br>640*480*TC bei 66 Hz
<br>800*600*TC bei 90 Hz
<br>
</p>
<p><b> - Der CENTurbo2 Einbau </b>
<br>
<br>
</p>
<p>Der Einbau ist bis auf einige Kleinigkeiten nicht unwesentlich
komplizierter als bei anderen Beschleunigern auch, am ehesten lassen
sich die anfallenden Arbeiten mit dem Einbau einer <a href="0b03.htm" target="UDOcon">FX-Karte</a>
vergleichen, sind aber trozdem unterschiedlich. Sollten Sie einen
Falcon besitzen der einer recht fr&uuml;hen &quot;Rev B&quot; Version
entspricht, rate ich ihnen direkt den CENTEK-Einbauservice zu
benutzen. Bei dieser Platinenrevision ist idR mit Problemen zu
rechnen. U.u wird hier kein FAST-Ram akzeptiert.
<br>
</p>
<p>Also keine Arbeit f&uuml;r Laien.
<br>
</p>
<p>Eine Abstriche m&uuml;ssen erfolgen da der orignale
Fastplattenhalter f&uuml;r 2.5&quot; Festplatten nach dem Einbau des
CENTurbo2 (Rev.A) nicht mehr in dieser Form verwendet werden kann, der
Platz reicht wegen dem Prozessork&uuml;hler mit aufgeflanschtem
L&uuml;fter einfach nicht mehr aus. Ebenso gibt es hakeleien mit dem
internen <a href="0f01.htm" target="UDOcon">Netzteil</a> des Falcon. Hier kommt der K&uuml;hlk&ouml;rper der
CENTurbo CPU gef&auml;hrlich nahe dem -12V Anschlu&szlig; des
Netzteiles. H&auml;tte man den K&uuml;hlk&ouml;rper vor dem aufkleben
auf die empfindliche CPU an dieser Ecke abgeschliffen m&uuml;sste das
hier nicht erw&auml;hnt werden. IdR passiert so nichts, solange der
K&uuml;hlk&ouml;rper eben keine weiteren Teile ber&uuml;hrt. Ebenso
mu&szlig; die rechte vordere Befestigungsschraube der Netzteilplatine
entfernt werden damit sich der K&uuml;hlk&ouml;rper beim Einstecken
des CENTurbo Boards nicht von der CPU abhebelt. Ebenso bleibt die
Montage des internen Lautsprechers fraglich. Sicher kann man den
einfach weglassen, besitzt dann aber ohne externe Boxen eben leider
einen stummen Falcon.
<br>
</p>
<p>Besitzer von Tower- oder Desktopgeh&auml;usen haben diese Probleme
nicht da sich hier gen&uuml;gend andere Platzm&ouml;glichkeiten
ergeben.
<br>
</p>
<p>Zum befestigen einer internen 2.5&quot; Festplatte gibt es in der
knappen Anleitung keine weiteren Hinweise. Bei genauer betrachtung des
orignalen Laufwerkstr&auml;gers ist eigene Phantasie angesagt.
<br>
</p>
<p>Ben&ouml;tigt wird eine Metalls&auml;ge, eine Flachfeile und
geschickte H&auml;nde. Passende Bilder hierzu finden Sie unter:
<br>
</p>
<ul>
<li> <a href="http://www.rhein-main.de/people/robert/ftp.htm" target="_top">DOITF030 Download</a>
<br>&nbsp;
</li>
</ul>
<p>Es werden wie bei vielen anderen Beschleunigern auch hier die
beiden ACIAs (68B50), <a href="0c02.htm" target="UDOcon">Keyboard</a>-ACIA (U24) und der Midi-ACIA (U52) mit
jeweils Pin 3+4 verwendet um den Beschleuniger zu steuern. Wie bei
anderen Erweiterungen auch sind hier die entsprechenden Pins an den
ACIA's vorsichtig mit einem flachen Elektronik-Seitenschneider von der
Platine zu trennen. Besitzen Sie dieses Werkzeug nicht, lassen Sie es!
<br>
</p>
<p>Freunde des ClockPatches werden aufatmen, dieser wird in seiner
Form endlich nicht mehr ben&ouml;tigt. Ebenso die Busemlulation,
bestehend aus dem PAL U62 / U63 und U67 / U68. Diese PALs sollten Sie
allerings gut aufbewahren. Die IC-Sockel U62 und U63 bekommen ein
Modul eingesteckt das diese Arbeit erledigt. Die schmale Platine passt
nach der Beschreibung nur in einer einzigen Position korrekt in diese
beiden Sockel und ersetzt so die ansonsten &uuml;blichen ClockPatch
Basteleien.
<br>
<br>
<br><b> Anmerkung zum ClockPatch </b>
<br>
</p>
<p>Mit dem CT2 Umbau verliert man alle bisher bekannten <a href="0907.htm" target="UDOcon">Audio</a>- und
SCSI-Probleme zu deren Behebung bisher immer ein TTL-Chip Huckepack
auf U63 unter der Tastatur gel&ouml;tet wurde. Da das CT2-System die
bekannten Falcon <a href="0305.htm" target="UDOcon">Hardware</a>-Enp&auml;sse umgeht, gemeint ist z.B der
lausige DMA-Teil, treten auch bei hohen Bildschirmaufl&ouml;sungen
keinerlei St&ouml;rungen mehr auf.
<br>
</p>
<p>Ein bischen fizzelig ist das modifizieren des IDE-Flachbandkabel.
Sie m&uuml;ssen in diesem Kabel nahe dem Mainbordstecker die
Kabeladern 23 und 25 lokalisieren, vorsichtig aus dem Kabel
heraustrennen, abisolieren und mit den beiden d&uuml;nnen Leitungen
des CENTurbo2 (Rev.A) Beschleunigers korrekt verl&ouml;ten. Verwenden
Sie zum isolieren, anders als bei den Prototyen gezeigt, einfach ein
wenig Schrumpfschlauch. Das sieht nicht nur besser aus, es ist auch
noch wesentlich stabiler, betrachtet man die F&auml;deldr&auml;hte.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/idemod.gif" border=0 width="640" height="400"></p><br>
<div align=center><tt> Abbildung 2 - CENTurbo2 IDE Modifikation </tt>
</div>
<p>
<br>
<br>
</p>
<p>Durch diese Modifikation sind keine l&auml;ngeren IDE-Kabel
m&ouml;glich! Maximal 35cm betr&auml;gt die bisher erfolgreich
getestete Kabell&auml;nge.
<br>
</p>
<p>CENTurbo2 liefert hier die IDE-Signale Read und Write die
normalerweise vom orignal Falconbus stammen. Da das so nicht mehr
m&ouml;glich ist, die orignal Falcon CPU ja nicht mehr benutzt wird,
wird diese Modifikation leider Notwendig wenn sie weiterhin eine
IDE-Hardddisk betreiben m&ouml;chten. Die original CPU wird durch
abl&ouml;ten von Pin 17, wie auch beim CENTurbo1, dauerhaft
deaktiviert.
<br>
</p>
<p>Wie vom ClockPatch gewohnt werden auch die SMD-Widerst&auml;nde
R221, R222 f&uuml;r den Einau des CENTurbo2 von der Hauptplatine
entl&ouml;tet. Wurde auch R216 vorher schon entfernt, besorgen sie
sich vor dem Einbau einen 33 Ohm SMD-Widerstand dieser Bauform oder
verwenden Sie R222 daf&uuml;r. Dieser SMD-Widerstand wird nicht
mitgeliefert!
<br>Ohne R216 (33 Ohm) arbeitet der CENTurbo II Beschleuniger nicht.
<br>
</p>
<p>Weitere modifikationen sind bis auf die Taktleitung f&uuml;r den
DSP und den VIDEL eigentlich nicht so das man sie hier extra
erw&auml;hnen m&uuml;sste. Dazu gibt es ja eben die Einbauanleitung.
Leute die noch nie ihren Falcon von innen gesehen haben und nicht
genau wissen wo sich die entsprechenden L&ouml;tpunkte oder Bauteile
befinden sollten auf jedem Fall den Einbauservice von CENTEK nutzen.
Das kann man nur anraten.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cent7.gif" border=0 width="600" height="208"></p><br>
<div align=center><tt> Abbildung 3 - vorbereiten des Anschlu&szlig;kabels </tt>
</div>
<p>
<br>
<br>
</p>
<p>Wie von ClockPatch gewohnt werden auch die SMD-Widerst&auml;nde
R221, R222 f&uuml;r den Einau des CENTurbo2 von der Hauptplatine
entl&ouml;tet. Wurde auch R216 vorher entfernt, besorgen sie sich vor
dem Einbau einen 33 Ohm SMD-Widerstand. R222 mu&szlig; wieder
eingel&ouml;tet werden!
<br>
</p>
<p>Weitere modifikationen sind bis auf die Taktleitung f&uuml;r den
DSP und den VIDEL eigentlich nichts mehr besonders das man hier
erw&auml;hnen m&uuml;sste. Dazu gibt es ja eben die Einbauanleitung.
Leute die noch nie ihren Falcon von innen gesehen haben und nicht
genau wissen wo sich die entsprechenden L&ouml;tpunkte oder Bauteile
befinden sollten den Einbauservice von CENTEK nutzen. Insbesondere
tifft dieser Rat Leute die ein altes &quot;Rev. B&quot; Mainboard
besitzen!
<br>
<br>
<br>
</p>
<p><b> Einige aufkl&auml;rende Worte zu Prozessorgeschwindigkeiten
</b>
<br>
<br>Die korrekten Taktraten eines MC68030
<br>
</p>
<p>Hier finden Sie eine kleine Demonstration als Beispiel mit einem
Atari Falcon 030 und einem <a href="0b04.htm" target="UDOcon">Afterburner</a> 040 Beschleuniger. Alle Tests
wurden mit GEMBENCH 4.03 ermittelt. Integer DIVU-Werte stammen aus den
Datenbl&auml;ttern der entsprechenden Motorola 030- und 040
Prozessoren.
<br>
</p>
<p>For the 030 : 44 clock cycles. For the 040 : 27 clock cycles. We
launch GEMBENCH 4.03 and the INTEGER DIV test (ref. FALCON) on:
<br>FALCON STANDARD 16 MHz : 100 % (normal !). FALCON + AB040 32 MHz :
312 % (414 % at 40 MHz).
<br>
</p>
<p>Hier ist das Ergebniss, ohne weiteren Kommentar.
<br>
</p>
<p>68040 at 32 MHz = (44/27) x (32/16) = 3.26 or 326 %
<br>
</p>
<p>Es liegt auf der Hand, wir haben hier die theoretischen Werte aus
den Datenbl&auml;tten, da einige Leute diese Angaben leider gerne
unterschiedlich interpretieren, steht CENTEK dazu gerne auch
telefonisch Rede und Antwort. Ein Testlauf auf unserer Maschine ergibt
den Wert 312! Was also zeigt das die Hypotese von CENTEK f&uuml;r
einen 040er Prozessor bei 32Mhz Takt vollkommen richtig ist. Wird ein
040 mit 64Mhz getaktet w&auml;re die Angabe von GEMBENCH 652 = (44/27
x /64/16)
<br>
</p>
<p>Alle Me&szlig;werte und technischen Daten mit freundlicher
Genehmigung von CENTEK France. (!n l)
<br>
<br>
</p>
<p><b> Benchmarks mit dem CENTurbo II - Beschleuniger </b>
<br>
</p>
<p>Sie finden hier den Orignaltext des Herstellers, da die Daten
f&uuml;r sich selber sprechen fehlt hier auch die &Uuml;bersetzung und
jeglicher Kommentar.
<br>
</p>
<p>Two features are different with the final version of the CENTurbo
II :
<br>
</p>
<blockquote>
<p>- the FPU is actually accessed by a 16-Bit DATA bus on the Falcon
motherboard. It will be placed on the CT2 and accessed by a 32-Bit
DATA bus... This increases the FPU performances of about 20%.
</p>
<p>- the AES of DOLMEN is not the final version.
</p>
</blockquote>
<p><b> RAM RATE measured with NEMBENCH (TITAN) and DAVEBENCH
(CENTEK): </b>
<br>
</p>
<p>ORIGINAL FALCON 4,5 MB/s
<br>F030 + CT1 e2/e3 (ST-Ram) 7,5 MB/s
<br>F030 + CT2 Rev A FAST-Ram 31.7 MB/s
<br>F030 + AB40 FAST-Ram 34.5 MB/s
<br>
<br>
</p>
<p>400 % MANDELBROT FRACTAL COMPUTING with FRACTAL.PRG :
<br>
<br>
</p>
<pre>
Time in seconds :                CPU     FPU     DSP
ORIGINAL FALCON                 39.7    63.5    4.3
F030 + CT1 25MHz ST-RAM         24.3      30.1    2.7
F030 + CT2 50MHz FAST-Ram       10.0    18.1    1.9
AB040                             7.2     5.0    2.6

</pre>
<p>
<br>
<br>
</p>
<p align=center><img src="image/centurbo.gif" border=0 width="633" height="223"></p><br>
<div align=center><tt> Abbildung 5 - CENTurbo2 schematische Darstellung </tt>
</div>
<p>
<br>
<br>
</p>
<p><b> GEMBENCH 4.03 TESTS </b>
<br>
<br>
</p>
<p>Hier bei ist zu bemerken das die folgenden Tests stark davon
abh&auml;ngen wie hoch der CPU-Cache eingestellt ist. Wichtig ist,
mehr Cache-Ram vorhanden ist, um so h&ouml;her liegt die Prozentrate
des Zugriffs. Ebenso &auml;ndern sich bei GEMBENCH die gemessenen
Werte f&uuml;r eine FPU sobald man den Cachespeicher ver&auml;ndert.
Wenn Sie reale Werte messen m&ouml;chten verweist CENTEK auf seine
Demo-Diskette auf der Sie eine menge verschiedener FreeWare-Programm
finden. U.a befinden sich hier auch Bezier-Tests mit denen man die
Aussage des Herstellers leicht nachpr&uuml;fen kann.
<br>
<br>
</p>
<pre>
GEM Bench v4.03      &#169; Ofir Gal - 3 March 95
============================================
Blitter not present
Run and Malloc from FastRAM

Video Mode:      640*480*2 colors
Ref: F030 + FPU, 640*480*2
HARDWARE                  AB40    CT2     CT2
CPU CLOCK (MHz)           32      50      50
OPERATING SYSTEM          TOS +   TOS +   DOLMEN
                          NVDI4   NVDI4
================================================
GEM Dialog Box:           522%    786%    564%
VDI Text:                1789%   2060%   1888%
VDI Text Effects:        1971%   2171%   1804%
VDI Small Text:           914%   1973%   2419%
VDI Graphics:            1003%   1051%    877%
GEM Window:               217%    466%    411%
Integer Division:         329%    314%    314%
Float Math:               133%    226%    234%
RAM Access:               977%    392%    392%
ROM Access:               177%    375%    375%
Blitting:                 123%    167%    200%
VDI Scroll:               226%    475%    338%
Justified Text:           407%    486%    509%
VDI Enquire:             1215%    790%    854%
New Dialogs:              502%    649%    514%
================================================
Graphics:                 808%   1006%    943%
CPU:                      404%    326%    328%
Average:                  700%    825%    779%


Video Mode:      640*480*16 colors
Ref: F030 + FPU, 640*480*16
HARDWARE                  AB40    CT2     CT2
CPU CLOCK (MHz)           32      50      50
OPERATING SYSTEM          TOS +   TOS +   DOLMEN
                          NVDI4   NVDI4
================================================
GEM Dialog Box:           251%    588%    502%
VDI Text:                1103%   1920%   1655%
VDI Text Effects:         907%   1348%   1589%
VDI Small Text:          1393%   1260%   2421%
VDI Graphics:             456%    766%    744%
GEM Window:               142%    346%    338%
Integer Division:         329%    315%    315%
Float Math:               100%    238%    238%
RAM Access:              1108%    455%    455%
ROM Access:               184%    383%    383%
Blitting:                 101%    136%    173%
VDI Scroll:               137%    336%    335%
Justified Text:           207%    416%    407%
VDI Enquire:              760%    833%    945%
New Dialogs:              286%    515%    453%
================================================
Graphics:                 522%    769%    869%
CPU:                      430%    346%    347%
Average:                  497%    656%    730%


Video Mode:      640*480*256 colors
Ref: F030 + FPU, 640*480*256
HARDWARE                  AB40    CT2     CT2
CPU CLOCK (MHz)           32      50      50
OPERATING SYSTEM          TOS +   TOS +   DOLMEN
                          NVDI4   NVDI4
================================================
GEM Dialog Box:           214%    482%    436%
VDI Text:                 903%   1817%   1446%
VDI Text Effects:         682%   1131%   1319%
VDI Small Text:          1441%   1441%   2296%
VDI Graphics:             300%    624%    644%
GEM Window:               117%    306%    302%
Integer Division:         329%    316%    317%
Float Math:               140%    244%    244%
RAM Access:              1400%    575%    575%
ROM Access:               189%    398%    401%
Blitting:                  76%    153%    174%
VDI Scroll:               119%    324%    324%
Justified Text:           168%    388%    360%
VDI Enquire:             1518%    976%   1051%
New Dialogs:              243%    454%    405%
================================================
Graphics:                 525%    736%    796%
CPU:                      514%    383%    384%
Average:                  522%    641%    686%



Video Mode:      640*480*65536 colors
                 Made with CENTscreen 3
Ref: F030 + FPU, 640*480*256  No 65536 colors REF
                 available in Gembench !
HARDWARE                  AB40    CT2     CT2
CPU CLOCK (MHz)           32      50      50
OPERATING SYSTEM          TOS +   TOS +   DOLMEN
                          NVDI4   NVDI4
================================================
GEM Dialog Box:           209%    335%    295%
VDI Text:                 459%    784%    823%
VDI Text Effects:         357%    611%    619%
VDI Small Text:           905%    932%   1550%
VDI Graphics:             233%    374%    337%
GEM Window:                75%    138%    140%
Integer Division:         329%    316%    316%
Float Math:               129%    166%    166%
RAM Access:              1431%    564%    575%
ROM Access:               190%    398%    401%
Blitting:                  69%    121%    117%
VDI Scroll:                52%     99%     99%
Justified Text:            78%    136%    142%
VDI Enquire:             1576%    803%    931%
New Dialogs:              225%    344%    304%
================================================
Graphics:                 385%    425%    487%
CPU:                      519%    361%    364%
Average:                  421%    408%    454%

</pre>
<p>
<br>
<br>
</p>
<p><b> - technisches zum CENTurbo2 </b>
<br>
<br>
</p>
<p>CENTurbo2 ist das erste Beschleunigerboard das einen Falcon auf
reale 50 Mhz Takt und 25Mhz Bustakt bei vollst&auml;ndiger
Systemstabilit&auml;t bringt. Bei dieser Entwicklung wurden mehrere
Wege eingeschlagen, Wege die u.a auch schon bei einigen anderen
Entwicklungen ansatzsweise ausprobiert wurden, hierbei wurde
allerdings nicht nur einfach die vorhandene 030 CPU durch einen
anderen Prozessor ersetzt. CENTurbo2 ersetzt an den richtigen Stellen
die <a href="0305.htm" target="UDOcon">Hardware</a> des bekannten Falcon. 32Bit breite Systembusse
er&ouml;ffnen hier eine ungeahnte Performance. Ich unterliege hier der
Versuchung diesen Beschleuniger als den Hardwareknaller der letzten 4
Jahre zu bezeichen.
<br>
</p>
<p>Auf der Messe vom 3.10 bis 4.10.98 war CENTEK in Neuss anwesend.
Hier konnte man sich die technischen Details erkl&auml;ren lassen,
einen CENTurbo 2 kaufen oder auch seinen Falcon zwecks Einbau gleich
abgeben. Es gab hier sogar Leute die sich extra zu diesem Zweck einen
gebrauchten Falcon gekauft hatten.
<br>
<br>
<br>
</p>
<p><b> - Die Kompatibilit&auml;t </b>
<br>
<br>
</p>
<p>Mit dem CENTurbo2 Beschleuniger kann der Falcon mit einem in das
Flash-Eprom eingebautem Bootmanager auf vier verschiedenen Wegen
booten:
<br>
</p>
<p>
<br>- normaler Modus (ohne Beschleuniger)
<br>- Turbo Modus, normal mit TOS 4.01 - TOS 4.04
<br>- Turbo Modus mit CENTEK TOS 7.0x
<br>- Turbo Modus unter dem CENTEK DOLMEN OS
<br>
<br>
</p>
<p>Im normalen Modus, unter TOS 4.0x, verh&auml;lt sich das the
CENTurbo II 100% kompatibel zu einem ganz normalen Atari <a href="0302.htm" target="UDOcon">Falcon F030</a>.
Als <a href="0304.htm" target="UDOcon">Betriebssystem</a> l&auml;uft das regul&auml;r bekannte TOS 4.0x
welches sich im ROM des Falcons befindet. In diesem Modus werden auch
weiterhin alle speziell f&uuml;r den Falcon gemachten Programme
korrekt laufen.
<br>
<br>
</p>
<dl>
<dt><b>Turbo Modus mit TOS 4.0x</b></dt><dd>
<br>&nbsp;
<br>Beim booten in diesem Modus landet der Benutzer in einem Setup in
welchem verschiedene Optionen w&auml;hlbar gemacht werden die unter
TOS 4.0x so nicht mehr verwendbar sind. Momentan ist die hier
einzigste Option das benutzen von TOS 4.0x .In diesem Modus, unter TOS
4.0x kann das Fast-Ram nicht benutzt werden. Der Falcon bootet nicht
im Turbo-Mode und nach einen Reset blockiert Hardwarebedingt der
Rechner. Leider l&auml;sst sich dieser Umstand bisher nur mit dem
Netzschalter oder einem erneuten Kaltstart umgehen.
<br>
<br>&nbsp;
<br>Wenn man Bildschirmerweiterungen und Grafikbeschleunigung wie z.b
NVDI, MagiC benutzt darf der Falcon-Bitter nicht benutzt werden, es
ist der einzigste Weg f&uuml;r das System das Fast-Ram im Mixted-Mode
auch auch f&uuml;r Bildschirmdaten zu verwenden. Eine enorme
Geschwindigkeitssteigerung schlechthin. Der Falcon-Blitter
erm&ouml;glicht Herstellungsbedingt ja leider keinen Zugriff auf
Fast-Ram. Das war f&uuml;r den Falcon nie geplant. Man l&auml;sst den
Blitter daher am besten gleich immer aus.
<br>
<br>&nbsp;
<dt><b>Turbo Modus mit TOS 7.0</b></dt><dd>
<br>&nbsp;
<br>Dieses TOS ist eine modifizierte Version des bekannten TOS 4.0x.
Das Setup-Programm kontrolliert das System w&auml;hren das <a href="030505.htm" target="UDOcon">Desktop</a>
geladen wird. Wenn Sie mit TOS 7.0x booten, man sieht es am blauen
Hintegrund, requriert das TOS einen Bereich im Fast-Ram und kopiert
das gesamte OS in diesen Speicherbereich. Hier arbeitet auch der
Keyboardreset als Warm- oder Kaltstart. Harddisktreiber und <a href="030505.htm" target="UDOcon">Desktop</a>
k&ouml;nnen von einer w&auml;hlbaren Partition ihrer Festplatte
gestartet werden. Sie k&ouml;nnen NVDI und MagiC unter diesem TOS
verwenden. Die Modifikationen des TOS 7.0x beschr&auml;nken sich auf
die konvertierung von TOS 4.0x nach TOS 7.0x Nicht integriert werden
alle grafischen Routinen des alten TOS 4.0x Sie k&ouml;nnen daher hier
auch keinen Atari-Blitter oder Blitterroutinen verwenden. Mit dem
Centurbo II erhalten Sie DOLMEN, einzig damit k&ouml;nnen Sie das
Fast-Ram im Turbomodus benutzen. DOLMEN befindet sich bisher noch
nicht im Flash-Eprom.
<br>
<br>&nbsp;
<dt><b>Turbo Modus mit Dolmen</b></dt><dd>
<br>&nbsp;
<br>Mit dem von CENTEK hergestellem DOLMEN <a href="0304.htm" target="UDOcon">Betriebssystem</a> k&ouml;nnen
Sie von jeder Festplatte und deren Partitionen booten. Die
gr&ouml;&szlig;e der verwendeten Festplatten spielt dabei keine Rolle.
Es mu&szlig; dazu allerdings eben DOLMEN auf einer bootf&auml;higen
Partition installiert sein. In allen F&auml;llen kann ebenso der
<a href="1302.htm" target="UDOcon">HDDriver</a> von Uwe Seimet zum Einsatz kommen. Das geht Problemlos.
Default wird eine Cecile Version 1.78 benutzt.
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p><b> Die Softwarekompatibilit&auml;t: </b>
<br>
<br>
</p>
<p>Es existiert unter www.centek.fr eine laufend aktualisierte Liste
von Software die bereits Erfolgreich unter DOLMEN bzw. mit dem
Beschleuniger getestet werden konnte. Die Liste ist keinesfalls
komplett. Beachten Sie bei der Software die Unterschiede ob die
Sofware unter TOS, oder nur in bestimmten Modi l&auml;uft.
Normalerweise sollte allerdings all das laufen das sich an die
elementaren Regeln der GEM-Programmierung gehalten hat. Wenn Sie ein
Software haben die von Anfang an als &quot;TT-Kompatibel&quot;
eingestuft ist k&ouml;nnen Sie davon ausgehen das dieses Programm auch
unter DOLMEN / TOS 7 laufen wird. Software die als &quot;Falcon
only&quot; deklariert ist sollte auch nur in einem Falcon-Modus
betrieben werden. In erster Line wird es eine Reihe von
<a href="0907.htm" target="UDOcon">Audio</a>-Programmen geben die weder das Fast-Ram noch den Turbo-Modus
verkraften k&ouml;nnen. Weiterhin sollte aber auch das im normalen
Modus laufen.
<br>
</p>
<p>CENTurboII und dessen Betriebsysteme k&ouml;nnen kein Wasser
teilen und auch keine Wunder aus alter Software erzeugen oder herbei
beten.
<br>
</p>
<p>Ein Problem ist eben Software die nicht Fast-Ram geeigent ist oder
die es auch nicht vertr&auml;gt das sich der Bereich des
Bildschimspeichers eben in diesem Fast-Ram befindet. Das gleiche
trifft auf die <a href="0907.htm" target="UDOcon">Audio</a>-Buffer verschiedener Programme zu. Mit diesen
bereits bekannten Dingen, z.B vom TT her, wird man auch hier
&Auml;rger haben. Ebenfalls sei hier noch mal auf die Blitter-Routinen
verwiesen, diese f&uuml;hren unweigerlich zu einem Crash. Schalten Sie
den Blitter daher einfach ab..
<br>
</p>
<p>Software die empfindlich auf hohe CPU-Geschwindigkeiten im
Verh&auml;ltniss zum DSP reagiert kann auch hier Problematisch werden.
Erfahrungsgem&auml;ss liegt das aber an einem zu knapp ausgelegtem
<a href="030503.htm" target="UDOcon">Timing</a> eben in dieser Software.
<br>
</p>
<p>Angesprochen werden sollte auch hier noch das 64 KB FLASH Eprom
welches sich ebenfalls auf dem CENTurbo II befindet und das - SetUp -
(<a href="040101.htm" target="UDOcon">NVRAM</a>) und die Booteinstellungen, auch f&uuml;r DOLMEN beinhaltet.
CENTEK liefert auf Diskette diverse Programme mit dem die Settings im
<a href="040101.htm" target="UDOcon">NVRAM</a> gesetzt werden k&ouml;nnen.
<br>
</p>
<p>Die jeweils aktuellen Ausgaben finden Sie unter:
www.centek.fr/centurbo/software
<br>
<br>
<br>
</p>
<p><b> Speicher </b>
<br>
<br>
</p>
<p>Sie k&ouml;nnen in ihrem Falcon ihre vorhandene Speicherkarte
stecken lassen. Sie sollten aber ein Auge auf dessen Geschwindigkeit
haben. Chips mit einer Zugriffszeit von 60nS werden hier Pflicht.
Gleiches trifft auf EDO-Simm zu das sie auf die CENTurbo 2 Karte
stecken werden, sofern sie das nicht gleich mitgekauft haben. Beachten
Sie hier bitte dringend eine flache Bauform, ansonsten wird die Falcon
Tastatur auf das EDO-Modul dr&uuml;cken!
<br>
</p>
<p>Vergessen Sie <a href="0a.htm" target="UDOcon">Speichererweiterungen</a> wie &quot;FalconWings&quot;
und &auml;hnlichem!
<br>
</p>
<p>CENTEK benutzt den vorhandenen Speicher als &quot;Chip-Ram&quot;,
Speicher der auf dem Beschleuniger als EDO bereitgestellt wird
f&auml;llt ohne Abstriche komplett in den &quot;FAST-Ram&quot; Bereich
und kann so entsprechende genutzt werden. Beachten Sie das bei zu
langsamen &quot;Chip-Ram&quot; Betriebsst&ouml;rungen auftreten
k&ouml;nnen.
<br>
</p>
<p>Beachten Sie bitte dringlichst das CENTurbo2 ein wirklich
schnelles Fast-RAM (EDO Simm) mit einer Zugriffzeit von 60nS
ben&ouml;tigt um die vollen Geschwindigkeiten entwickeln zu
k&ouml;nnen! Normale PS2-Module k&ouml;nnen und sollten NICHT
verwendet werden.
<br>
</p>
<p>Im Turbomodus kann man beim booten beide Speicherbereiche anzeigen
lassen.
<br>
</p>
<p>Beachten Sie bitte das es auch unterschiedliche Atari
Speicherkarten gibt. Es funktionieren nicht alle, das ist leider vom
Layout abh&auml;ngig. Es betrifft daher original 14MB- und 4MB-Karten.
Die vielen Chips auf den Atari <a href="0a.htm" target="UDOcon">Speichererweiterungen</a> sorgen in
Verbindung mit CT2 f&uuml;r Unregelm&auml;&szlig;igkeiten. Mit den 4MB
Karten l&auml;uft die CT2 besser, mit 14MB Karten nicht immer!
</p>
<p>Wenn 14MB ST-Ram gebraucht wird sollten sie auch da auf EDO-Ram
ausweichen. Dort sind auch weniger Speicherchips drauf. Sie
k&ouml;nnen dazu <a href="0a06.htm" target="UDOcon">CENTRam</a> der Firma CENTEK verwenden. Diese Karte ist
speziell f&uuml;r schnelles ST-Ram hergestellt worden und arbeiten
perfekt mit dem CT2 zusammen da hier auch wert auf die
Leiterbahnf&uuml;hrung gelegt wurde.
<br>
</p>
<p>Das Problem aller, einem gewissen Anteil aller Speicherkarten, ist
das die Leiterbahnen auf der Platinenoberseite, also die die vom
SIMM-Sockel wegf&uuml;hren, sich mit denen auf der Unterseite kreuzen.
Rodolphe Scuba erwartet deswegen idR bei solchen Speicherkarten immer
Daten&uuml;bertragungsprobleme zwischen CPU und Speicher im 50
MHz-Modus.
<br>
</p>
<p>Beachten Sie bitte zwingen das als &quot;FAST-Ram&quot; auf dem
CT2 Board auschliesslich 32MB EDO 72pin(32bit) 4x16MBit 60ns 5v SIMM
verwendbar ist. Andere Simms arbeiten schlecht oder gar nicht.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Bereits getestete Software </b>
<br>
<br>
</p>
<p>Hier finden Sie eine von CENTEK zusammengestellte Liste mit
Software die bereits mit dem CENTurbo ausf&uuml;hrlich getestet werden
konnte. Deutlich ist hier sauberer Programmierstil ersichtlich.
<br>
</p>
<p>Legende:
<br>
</p>
<p>x l&auml;uft perfekt
<br>! l&auml;uft mit Problemen
<br>? l&auml;uft momentan nicht
<br>
</p>
<pre>
Programmname          TOS 4.0x   TOS 7.0x    DOLMEN   Bemerkungen
---------------------------------------------------------------------------
ADEBUG 2.13           x          x           x
AFM                   x          x           x
ANIPLAY 2.0           !          !           !        Probleme mit dem DSP
APEX 2                x          x           x
ARTIS 4               x          x           !        Bildschirmprobleme
ATARI WORKS 1.2       x          x           x
AUTOSORT 3.6          x          x           x
BIG CONVERT 1.77      x          !           !        Schaltet den Blitter an!
C2D 1.02              x          !           !        Nicht im Fast-Ram
CAB 2.5 / 2.7         x          x           x
CALAMUS SL 93&amp;96      x          x           !        Ein Patch ist verf&uuml;gbar
Cecile 1.xx           x          x           !
CENTScreen 3.xx       x          x           !
CENTVidel 3. xx       x          x           x
CENTview 2.xx         x          x           x
CONTRASTE 1.1         x          x           x
CHARLY                x          x           x
CKBD 1.3              x          x           !
CUBASE 2.06           x          !           !        Patch in Herstellung
CRAZY SOUND MACHINE   !          !           !        In keinem Turbo-Modes
DA'S LAYOUT           x          x           ?
DA'S PICTURE 1.1      x          x           x
DAVECTOR PRO 2.0      x          x           x
DESERT DRAIN 1.52     x          x           x
DEVPAC 3.1            x          x           x
DIGIPOINT 4.10        x          x           x
DIGITAL HOME STUDIO   ?          !           !        Inkompatibel, <a href="0201.htm" target="UDOcon">Autor</a> verst&auml;ndigt
DIGITAL TRACKER       ?          !           !        Inkompatibel, <a href="0201.htm" target="UDOcon">Autor</a> verst&auml;ndigt
DYNACAD 1.64          x          x           x
EBMODEL 3.29          x          x           x
EDGE 2.03             x          x           x
EDITH 1.221           x          x           x
EVEREST 3.4           x          x           x
EXTENDOS              x          !           !        Nicht im Fast-Ram, <a href="0201.htm" target="UDOcon">Autor</a> arbeitet daran
FD2D                  x          !           !        Nicht im Fast-Ram
FPLOTTER 2.7          x          x           x
FRACTALS 2.1          x          x           x
La Cuisine            x          x           x
GEMBENCH 4.03         x          x           x
GEM_FLH               x          x           x
GEMVIEW 3.06          x          x           x
GRAOUMF TRACKER 0.87  x          x           !        Es wird daran gearbeitet
HEXEDIT 1.1           x          x           x
HSMODEM 7 (SCC)       x          x           !
INTERFACE 2.23        x          x           x
IMAGE COPY 4 CD       x          x           !        Patch verf&uuml;gbar
IMAGE STUDIO          x          x           x
JINEE 1.02            x          x           !
JOE 1.42              x          x           x
JPEG DECODER 0.92     !          !           !        DSP Probleme
JPEGVIEW 2.22         x          x           x
KANDINSKY 2.51        x          x           x
KOBOLD 3              x          x           x
LZHSHELL              x          x           x
ASH MagiC 5 -&gt;        !          !           !        Patch erh&auml;ltlich
<a href="040101.htm" target="UDOcon">NVRAM</a> 1.x             x          x           x
OCR 1.3               x          x           x
PAGESTREAM 2.2        x          x           x
PAPYRUS 4 -&gt;          x          x           x
PARCP 2.5             x          x           x
PHOENIX O-RENDER 2.0  x          x           x
QUINCY 2.01           !          !           !        Probleme mit dem DSP
PHOTOLINE 2.2         x          x           x
PixArt 2.2 -&gt;         x          x           x
PLATON                x          x           !        Bildschirmprobleme
QED 4 -&gt;              x          x           !        Diverse Probleme
RUNNING               x          x           x
SANDRINE 2.xx         x          x           x
SCRIPT 5.0            x          x           !        Es wird daran gearbeitet
SELECTRIC 1.10        x          x           !
SEMPRINI 1.0          x          x           x
SPECTRAL TOOL KIT 1.5 !          !           !        DSP Probelme, Chip Ram
ST-Guide              x          x           !
STING                 x          x           ?
STZIP 2.6             x          x           x
SUPERSAM 1.08         x          !           !        Nicht im Fast-Ram
TIXTAX                x          x           x
True Paint 1.02       x          x           x
Two in One 1.51       x          x           x
UPSIS 14/96           x          x           x
UTRACK 2.51           x          x           x
VIDEOMOD              x          x           !
VISION 2 / 3          x          x           x
WENSUITE 2            x          x           ?        In Entwicklung
WINREC 1.41           x          x           x
WORD PLUS 5.04        x          x           ?        In Arbeit
XACT 3.01             x          x           x
XCONTROL              x          x           x
ZZ-VOLUME 1.7         x          x           x

</pre>
<p>
<br>
<br>
</p>
<p><b> - Die CENTurbo 2 Systemarchitektur </b>
<br>
<br>
</p>
<p>Wie Sie in dem Bild weiter unten sehen k&ouml;nnen besteht die
Architektur des CENTurbo2 in der Hauptsache aus zwei 32-Bit breiten
Systembussen die eben die verschiedenen Systemkomponenten breiter und
somit schneller untereinander verbinden. Im Vergleich hierzu besitzt
der 'normale' Falcon lediglich einen 16-Bit breiten Datenbus zwischen
dem ansich langsamen ST-RAM und dem VIDEL (Grafikchip). CENTurbo
verbindet eben nun diese nicht ganz unwichtigen Systemteile des
Falcons neu, und zwar 32-Bit breit.
<br>
</p>
<p>Das FAST-Ram des CENTurbo2 erh&ouml;ht so nun die Performance
drastisch, ganz im Gegensatz zu einem Falcon der nur eben eine 16 Bit
breiten Zugriff auf das ST-Ram erlaubt, welches dort ja dann auch noch
f&uuml;r Video und <a href="0907.htm" target="UDOcon">Audio</a> gleichzeitig mi&szlig;braucht wird.
<br>
</p>
<p>Im Klartext bedeutet das, das Sie als Benutzer ihre Programme in
TrueColor in einer Geschwindigkeit laufen lassen k&ouml;nnen die sie
ansonsten nur vom 16 Farben Modus her gewohnt waren. Ebenso gibt es
keine Ausbremsungen mehr wenn Sie hier auch gerne h&ouml;here
Bildschirmaufl&ouml;sungen verwenden m&ouml;chten. Programme werden
nicht mehr vom langsamen Falcon-Video gebremst. Ebenso wird der BURST
Mode der <a href="040109.htm" target="UDOcon">68030 CPU</a> benutzt um vier Langw&ouml;rter in nur 12 Zyklen
bei 50Mhz Takt zu lesen und zu 'cachen' Ebenso sollten <a href="0907.htm" target="UDOcon">Audio</a>-Krackler
bei hohen Bildschirmaufl&ouml;sungen der Vergangenheit angeh&ouml;ren.
Ein weiteres gro&szlig;es Plus dieser Entwicklung.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/architec.gif" border=0 width="700" height="330"></p><br>
<div align=center><tt> Abbildung 6 - CENTurbo 2 Systemarchitektur / Blockschaltbild
</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Das FAST-Ram des CENTurbo 2 erh&ouml;ht so nun die Performance
drastisch, ganz im Gegensatz zu einem Falcon der nur eben eine 16 Bit
breiten Zugriff auf das ST-Ram erlaubt, welches dort ja dann auch noch
f&uuml;r Video und <a href="0907.htm" target="UDOcon">Audio</a> gleichzeitig mi&szlig;braucht wird.
<br>
</p>
<p>Im Klartext bedeutet das, das Sie als Benutzer ihre Programme in
TrueColor in einer Geschwindigkeit laufen lassen k&ouml;nnen die sie
ansonsten nur vom 16 Farben Modus her gewohnt waren. Ebenso gibt es
keine Ausbremsungen mehr wenn Sie hier auch gerne h&ouml;here
Bildschirmaufl&ouml;sungen verwenden m&ouml;chten. Programme werden
nicht mehr vom langsamen Falcon-Video gebremst. Ebenso wird der BURST
Mode der <a href="040109.htm" target="UDOcon">68030 CPU</a> benutzt um vier Langw&ouml;rter in nur 12 Zyklen
bei 50Mhz Takt zu lesen und zu 'cachen' Ebenso sollten <a href="0907.htm" target="UDOcon">Audio</a>-Krackler
bei hohen Bildschirmaufl&ouml;sungen der Vergangenheit angeh&ouml;ren.
Ein weiteres Plus dieser Entwicklung.
<br>
</p>
<p>Fazit:
<br>
</p>
<p>Der Falcon wird zu einer einfachen 16-Bit Super I/O Karte
degradiert die vom CENTurboII Board vollst&auml;ndig gesteuert wird.
:-&gt;
<br>
</p>
<p>Das eigentliche ST-Ram wird zum Video und Sound Speicher, also zu
dem was in der AMIGA-Welt eben halt schon l&auml;nger als 'CHIP-Ram'
bekannt ist. Dieser Speicher wird von allen Systemkomponenten wie dem
BLITTER-, dem VIDEO- und eben dem SOUNDCHIP benutzt. Das FAST-RAM
erh&auml;lt bei diesem Beschleuniger den Status
&quot;Hauptspeicher&quot; welcher eben dann auch wirklich in der
Hauptsache von der CPU benutzt wird. Diese Architektur entspricht fast
einer Architektur die man von modernen PCs her kennt.
<br>
</p>
<p>Das Herz des CENTurbo 2 ist ein Chipsatz mit dem Namen
&quot;SYL&quot; (SAEIL) Der SYL-Chipsatz enth&auml;lt folgende
Features:
<br>
</p>
<p>50 MHz Interface f&uuml;r den FAST-Ram Controller
<br>CPU VL-BURST (6,2,2,2)
<br>schnelle FPU kommunikation
<br>logisches Interface zum Zugriff auf den Falcon 68000 Bus bei 50
MHz Takt
<br>Daten und Addressen Buffer
<br>FLASH Zugriff bei 50 MHz
<br>DSP Zugriff bei 50 MHz
<br>Zugriff auf die beiden ACIAs bei 50 MHz
<br>SDMA Zugriffe im SLAVE/MASTER Modus
<br>INT Level 6 und 3 vom Bus Slot
<br>INT Level 4 und 2 (VBL and HBL)
<br>alle Taktraten
<br>einen <a href="0305.htm" target="UDOcon">Hardware</a> Watchdog
<br>die <a href="0305.htm" target="UDOcon">Hardware</a> Register
<br>
<br>
<br>
</p>
<p><b> - Die <a href="0305.htm" target="UDOcon">Hardware</a> des CENTurbo 2 Bus </b>
<br>
<br>
</p>
<p>Alle Entwickler finden auf der Homepage von CENTEK frei
verf&uuml;gbare Informationen bez&uuml;glich des Prozessor Bus des
CENTurbo 2. Der Busanschlu&szlig; des CENTurbo 2 ist ein HE10 mit 120
Anschlu&szlig;pins. Acht Pin dieses Busses sind zur besonderen
Verwendung reseviert. Alle Bema&szlig;ungen und das Pinlayout
k&ouml;nnen aus dem unteren Bild entnommen werden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/exbus.gif" border=0 width="816" height="536"></p><br>
<div align=center><tt> Abbildung 7 - CENTurbo 2 Systembus </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Die Verf&uuml;gbaren Adressen des CENTurboII Bus befinden sich
zwischen $F0000000 und $F3FFFFFF, das macht zusammen lockere 64MBytes!
Adressen ausserhalb dieses Bereichs f&uuml;hren sofort zum
Systemabsturz!
<br>
</p>
<p>Weitere technische Details zum Entwickeln weiterer <a href="0305.htm" target="UDOcon">Hardware</a>
erfahren Sie direkt beim Hersteller. Das ist f&uuml;r Hardwaredesigner
interessant. Im eigenen Intresse m&ouml;chte ich hier ein neues
&quot;<a href="0804.htm" target="UDOcon">ScreenEye</a>&quot; als Beipiel anregen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cent3.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 8 - CENTurbo 2 </tt>
<br>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p align=center><img src="image/cent4.gif" border=0 width="320" height="162"></p><br>
<div align=center><tt> Abbildung 9 - CENTurbo 2 / Plainenunterseite </tt>
<br>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p align=center><img src="image/cent5.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 10 - CENTurbo 2 Flachbandanschlu&szlig; und
Quarzoszilatoren </tt>
<br>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p align=center><img src="image/cent6.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 11 - CENTurbo 2 FPU Fassung und F030 Systembus </tt>
<br>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p align=center><img src="image/cent2.gif" border=0 width="320" height="162"></p><br>
<div align=center><tt> Abbildung 12 - CENTurbo 2 Mainboard &amp; CPU Cooler </tt>
<br>
</div>
<p>
<br>
<br><b> - Die technischen Daten. </b>
<br>
<br>
</p>
<p>Die technischen Daten des CENTurbo2 wurden direkt von CENTEK
&uuml;bernommen.
<br>
</p>
<pre>
- a new CPU 68030 32-Bit Highway at 50 MHz permanently !

- a SIMM 32-Bit standard socket offers 32-Bit EDO Fast-RAM (16 or 32 MB)
  acceded 7 times  quicker than on original 16 MHz ST-Ram thanks to the 6.2.2.2
  BURST accesses of the 030 (32 MB/s) at 50 MHz.

- a socket for a 32-Bit COPROCESSOR (68882-33) at 50 MHz.

- the DSP of the Falcon is clocked at 50 MHz.

- the BUS of the Falcon is clocked at 50 MHz (the CPU accesses at 50 MHz !).

- a 32-Bit Direct CPU BUS Slot, compatible extension of the Falcon BUS Slot will
   be available allowing you to use your 'old' cards (but not in the original case).
   <a href="0305.htm" target="UDOcon">Hardware</a> documentation AVAILABLE for <a href="0305.htm" target="UDOcon">Hardware</a> Designers !

- on board 64 KB FLASH Eprom containing a new SET UP (<a href="040101.htm" target="UDOcon">NVRAM</a>) and the BOOT of DOLMEN FALCON.

- DOLMEN FALCON. The new and ultra powered MULTITASKING Operating Sytem.
  DOLMEN FALCON is 100% ASM and TOS (AES &amp; VDI) compatible !

- a hardware switch enables you to come back to the 100% Falcon original mode.

- Wonderfully designed, the CENTurbo II fits in the original case
  within being embedded in the bus slot, needing only 14 wires soldering.

</pre>
<p>
<br>
</p>
<p>Der CENTurbo 2 Beschleuniger wird unterst&uuml;tzt duch ein
Softwarepaket das der Hersteller mit diesem Beschleuniger liefert. So
wird hier ebenfalls das DOLMEN - Multitasking <a href="0304.htm" target="UDOcon">Betriebssystem</a>
beigelegt. DOLMEN wurde zu 100% in Assembler geschrieben und ist daher
troz voller AES &amp; VDI Kompatibilit&auml;t rasend schnell. DOLMEN
besitzt mit CECILE einen neuen und eigenen IDE/SCSI Festplatten- u.
CD-Rom Treiber &uuml;ber den wir zu einem anderen Zeitpunkt berichten
werden. Ebenso betrifft das die beigelegte Software CENTScreen 3,
CENTvidel und CENTview
<br>
<br>
<br>
</p>
<p><tt> Ram Speicher f&uuml;r ST- und FAST-Ram, <a href="0a06.htm" target="UDOcon">CENTRam</a> </tt>
<br>
<br>Beachten Sie bitte dringlichst das CENTurbo 2 wirklich schnelles
FAST-Ram mit einer Zugriffzeit von 60nS ben&ouml;tigt um die vollen
Geschwindigkeiten entwickeln zu k&ouml;nnen! Als Ram-Baustein f&uuml;r
das FAST-Ram wird unbedingt ein 16 oder 32MB EDO Modul ben&ouml;tigt.
Andere Bausteine werden nicht oder nicht korrekt erkannt. Sollten in
den Turbo-Modis bei 16 oder 256 Farben irgendwelche vertikale Streifen
auf dem Bildschirm zu sehen sein m&uuml;ssen sie Ver&auml;nderungen am
ST-RAM vornehmen. IdR ist das ein sicheres Zeichen f&uuml;r ein zu
langsames oder gar fehlerhaftes ST-Ram. Mit den original
Atari-Speicherkarten sind mir bisher keine Probleme bekannt. Speziell
f&uuml;r den CENTurbo2 Beschleuniger konzipiert ist <a href="0a06.htm" target="UDOcon">CENTRam</a>.
<br>
</p>
<p>Laut Hersteller ist die <a href="0a06.htm" target="UDOcon">CENTRam</a> Karte sofort lieferbar.
<br>
<br>
<br>
</p>
<p><b> Bildschirmanschlu&szlig; am CENTurbo2 Falcon </b>
<br>
<br>
</p>
<p>In dem Bild unten sehen sie einen Zwischenstecker, der auch so im
Anleitungsheftchen zum CT2-Beschleuniger beschrieben ist. Alle
relevanten Verbindungen, bis auf Pin 15, sind bei diesem
Zwischenadapter 1:1 durchverbunden. Im normalen Atari VGA-Adaptor ist
dieser Pin 15 leider dauerhaft auf GND geschaltet so das an Pin 14 des
VIDEL kein externer Videotakt eingespeist werden kann. Sie erinnern
sich an den grauen Draht er am VIDEL, Pin 14, angel&ouml;tet wurde?
Hier legt das CT2 Board 50Mhz Videotakt an. Weiterhin besteht von
diesem Pin 14 eine direkte Verbindung zu eben Pin 15 der
Monitorbuchse. Sparen kann man sich den Adapter auch wenn man auf der
Unterseite der Falcon-Platine den SMD-Widerstand R49 entfernt. Eine
verl&auml;ngerung dieser beiden L&ouml;tpunkte zu einem einfach
EIN-/AUS-Schalter istnicht zu empfehlen da es hier zumeist zu
Bildst&ouml;rungen kommt.
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/vgaad3.gif" border=0 width="575" height="347"></p><br>
<div align=center><tt> Abbildung 13 - VGA Zwischenstecker f&uuml;r Multiyscnc </tt>
</div>
<p>
<br>
<br>
</p>
<p>Der Adapter wird einfach direkt zwischen Falcon Monitorport und
dem normalen grauen Atari VGA-Adaptor gesteckt. Es ist danach leicht
m&ouml;glich relativ hohe Bildschirmaufl&ouml;sungen in jedem
Bildschirmmodus zu erzeugen. Beachten Sie dabei aber dringend die
technischen Daten des verwendeten Monitors!
<br>
<br>
</p>
<p><b> Besonderheiten &quot;Rev B Falcon Mainboard&quot; </b>
<br>
<br>
</p>
<p>Mit der ersten Generation der sog. &quot;Rev B&quot; Serie und der
Rev. A des CENTurbo-Beschleunigers werden sie eventuell festestellen
m&uuml;ssen das ihr Fast-Ram auf dem CT2-Board nicht erkannt wird. Das
kann und hat verschiedene Ursachen. Zum einen Spukt der deaktivierte
alte original Falcon-Prozessor trotz abgel&ouml;tetem Pin 17 auf dem
Bus herum wenn er noch wie gehabt mit dem langsamen 16Mhz Takt
versorgt wird. Hier werden sie nicht drumherum kommen die gesamte alte
SMD CPU zu entl&ouml;ten. Eine arbeit die nur Fachleuten vorbehalten
bleibt!
<br>
</p>
<p>Der Prozessor wird sowieso nicht mehr ben&ouml;tigt.
<br>Ein R&uuml;ckbau wird dann allerdings auch unm&ouml;glich!
<br>
</p>
<p>Auf diesen Mainboards kann auch die Leitung vom linken Pin der
Spule L65 zum vorderen Pin des SMD-Widerstandes R222 entfallen. Ebenso
entf&auml;llt beim entfernen der alten CPU die Leitung von Pin 17 zu
Pin 10 an U59.
<br>
</p>
<p>Lassen sie diese arbeiten am besten direkt von CENTEK erledigen!
<br>
</p>
<p>Unter gewissen Umst&auml;nden ist es damit noch nicht erledigt.
CENTEK nimmt bei diesen Mainboards eine &Auml;nderung im SYL-Logikchip
des CT2 Boards vor!
<br>
</p>
<p>Das ist nichts das sie Zuhause selbstst&auml;ndig erledigen
k&ouml;nnten! Sparen sie sich Zeit, schonen sie ihre Nerven, senden
sie das Board mit dem CT2-Beschleuniger zu CENTEK. IdR kostet Sie das
nur den Versand!
<br>
<br>
<br>
</p>
<p><b> Besonderheiten &quot;<a href="040101.htm" target="UDOcon">NVRAM</a>&quot; </b>
<br>
<br>
</p>
<p>Wenn Sie den CENTurbo2-Beschleuniger eingebaut haben sollten Sie,
um unangenehme &Uuml;berraschungen zu vermeiden, auf bew&auml;hrte
Tools wie z.B BOOTKONF.PRG von Uwe Seimet verzichten. Benutzen Sie nur
die von CENTEK mitgelieferten Programme um &Auml;ndernungen im
Flash/<a href="040101.htm" target="UDOcon">NVRAM</a> dieses Falcons vorzunehmen.
<br>
<br>
<br>
</p>
<p><b> MagiC5-6 / HDDriver7.x geht nicht </b>
<br>
<br>
</p>
<p>Wenn Sie den CENTurbo2-Beschleuniger eingebaut haben werden Sie
sicherlich versuchen MagiC6, sofern Sie es besitzten und nutzten, auf
dem CT2 Falcon installieren zu wollen. Meistens befindet es sich ja in
dem Fall sowieso schon auf der Festplatte. Patchen Sie also MAGX.RAM
mit dem entsprechenden Programm aus dem Ordner &quot;PATCHES.CT2&quot;
ihrer Utilitie-Diskette. MagiC sollte nach einen reboot im Turbomodus
normal geladen werden, ist das nicht der Fall habe ich hier gleich
mehrere schlechte Nachrichten f&uuml;r Sie parat:
<br>
</p>
<dl>
<dt><b>Symtome:</b></dt><dd> - MagiC startet nicht unter Cecile
<br>- MagiC startet nicht unter <a href="1302.htm" target="UDOcon">HDDriver</a>
<br>- <a href="1302.htm" target="UDOcon">HDDriver</a> findet die Platten im Turbomodus nicht
<br>- MagiC l&auml;d verschiedentlich jinnee nicht
<br>- MagiC h&auml;ngt bevor MagXDesk geladen wird
<br>
<br>&nbsp;
<dt><b>Ursachen:</b></dt><dd> - Bei mir stelle sich nach einer Weile heraus das offensichtlich
eine alte
<br>Conner 2.5 IDE 65MB in der Lage war mit dem <a href="1302.htm" target="UDOcon">HDDriver</a> MagiC6 bis zu
MagXDesk
<br>zu laden. Das klappte aber auch nicht immer.
<br>
<br>&nbsp;
<br>- Eine Hitachi 2.5&quot; IDE 540MB war nicht in der Lage
&uuml;berhaupt mit einem anderen Treiber
<br>ausser Cecile im Turbomode das System zu booten. Mit im dem im
Setup aktiviertem
<br>externen Treiber, also hier auch <a href="1302.htm" target="UDOcon">HDDriver</a> 7.6, konnte ebenfalls im
Turbomode
<br>nicht gebootet werden. Das klappte nur mit Cecile. Die Platten
werden zwar als
<br>bootf&auml;higes Device erkannt, leider scheint das aber auch
alles zu sein.
<br>
<br>&nbsp;
<dt><b>Abhilfe:</b></dt><dd> - Nach einigen Tests, man staunt, bin ich auf eine Toshiba
2110MAT 2.5&quot; IDE
<br>gestossen. Diese Platte weist laut den Benchmarks eine
Transferrate von
<br>ca. 9MB/Sec.! im Turbomode aus. Mit dieser Platte kann ich
pl&ouml;tzlich meinen
<br>unver&auml;nderten <a href="1302.htm" target="UDOcon">HDDriver</a> 7.6 und MagiC6 am unver&auml;nderten
Falcon benutzen. Die
<br>Hitachi und die noch &auml;ltere Conner bringen es laut der
Anzeige lediglich auf 1.8MB/Sec.
<br>CENTEK schrieb mir dazu das diese alten Platten u.U genau solche
und &auml;hnliche
<br>Probleme verursachen k&ouml;nnen und das l&auml;ge darin
begr&uuml;ndet das der CENTUrbo-Beschleuniger
<br>dahingehend Modifiziert ist sicher mit Festplatten zu arbeiten die
de ATA-4 norm
<br>entsprechen. Dadurch wird offensichtlich auch eine wesentlich
h&ouml;here Transferrater
<br>erreicht. Die IDE Timingroutinen ersetzen nat&uuml;rlich das
vorhandene aus dem COMBEL, so
<br>bleiben leider &auml;ltere Festplatten auf der Strecke.
<br>
<br>&nbsp;
<br>Vern&uuml;nfig w&auml;re das entsprechend in der Dokumentation zu
vermerken!
<br>Meines Wissens nach kann man das aber leider bisher nur auf deren
WebPage erfahren!
<br>
<br>&nbsp;
<br>Orignaltext:
<br>
<br>&nbsp;
<br>The hardware IDE timings was new-designed onto the CT2 and replace
the old ones of the
<br>original Falcon (done by COMBEL). This last minute modification
was became necessary
<br>because some IDE HDD was not correctly or NOT running with the
CT2. This problem was already
<br>existing with the CT1 about some rare IDE HDD.
<br>
<br>&nbsp;
<br>Now, the last models of IDE HDD (PIO 4) exploit fully their
capacities and the transfert
<br>rates are fanstastic ! Sure, V-TRAX, the new AUDIO DtD software
exploits this potential...
<br>
<br>&nbsp;
<br>Here are some tests we have done with the last QUANTUM FIREBALL
IDE,the ECLIPSE model (very noiseless). The ECLIPSE is existing with
2.5, 5.1, 7.6 and 8.5 GB (available at CENTEK).
<br>The driver used on Falcon is CECILE.
<br>
<br>&nbsp;
<br>Vieleicht hilft es dem einen oder anderen der &auml;hnliche
Probleme hat.
<br>Wenn Sie sich mit ihrer internen IDE nicht sicher sind, fragen Sie
daher vorher die Fa. CENTEK, das kostet nichts, spart Zeit und
&Auml;rger.
<br>
<br>&nbsp;
<br>Soviel also zu den &quot;last minute modifications&quot;!
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p><b> Festplatten </b>
<br>
</p>
<p>Eine Besonderheit ist mir noch mit extenen <a href="0605.htm" target="UDOcon">SCSI-Festplatten</a>
aufgefallen.
<br>
</p>
<p>Wenn man den alten, im Flash eingebauen, Cecile-Treiber 1.75
benutzt wird z.B eine extern angeschlossene IBM DPES-31080
-einwandfrei- erkannt und man kann perfekt damit arbeiten.
<br>
</p>
<p>Besitzt das eingebaute Flash aber einen neueren Cecile-Treiber,
z.B die V1.84, ist das nicht mehr m&ouml;glich! Mit einer Quantum
Fireball klappt es hingegen mit V1.75 und der Release 1.84 bis hin zu
der momentan aktuellen Release 2.01 im Flash-Rom.
<br>
</p>
<p>Vermutlich h&auml;ngt das mit der Release der Plattenfirmware
zusammen oder eben mit der Sache von einem Abschnitt h&ouml;her,
obwohl dort ausschliesslich bei CENTEK von &quot;IDE Festplatten&quot;
die Rede ist...
<br>
</p>
<p>Auf Anfragen deswegen bei CENTEK habe ich als Anwort erhalten:
<br>&quot;Kaufen Sie sich eine neue Platte&quot;!
<br>
</p>
<p>Kein weiterer Kommentar hierzu.
<br>
</p>
<p>Dieser Abschnitt soll daher als Anhaltspunkt f&uuml;r &auml;hnlich
gelagerte Probleme dienen.
<br>
</p>
<p>Hier finden Sie eine Liste von IDE- und SCSI Ger&auml;ten die mit
<a href="1302.htm" target="UDOcon">HDDriver</a> und eben auch MagiC 6.01 perfekt im Turbomodus laufen:
<br>
</p>
<p>
<br>
</p>
<div align=center><table border=1 frame=box>
<caption align=bottom>Tabelle 19: Ger&auml;teliste / Working Devices</caption>
<tr>
  <td align=left valign=top>Bus</td>
  <td align=left valign=top>Hersteller</td>
  <td align=left valign=top>Typ</td>
  <td align=left valign=top>Format</td>
  <td align=left valign=top>Gr&ouml;sse</td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>IDE</td>
  <td align=left valign=top>Toshiba</td>
  <td align=left valign=top>2110MAT</td>
  <td align=left valign=top>2.5&quot;</td>
  <td align=left valign=top>2.1   GB</td>
</tr>
<tr>
  <td align=left valign=top>IDE</td>
  <td align=left valign=top>Quantum Eclipse</td>
  <td align=left valign=top></td>
  <td align=left valign=top>3.5&quot;</td>
  <td align=left valign=top>2.1-&gt; GB</td>
</tr>
<tr>
  <td align=left valign=top>IDE</td>
  <td align=left valign=top>IBM</td>
  <td align=left valign=top>DKLA-2340</td>
  <td align=left valign=top></td>
  <td align=left valign=top>3.1   GB</td>
</tr>
<tr>
  <td align=left valign=top>SCSI</td>
  <td align=left valign=top>Quantum Fireball</td>
  <td align=left valign=top></td>
  <td align=left valign=top>3.5&quot;</td>
  <td align=left valign=top>1.0   GB</td>
</tr>
<tr>
  <td align=left valign=top>SCSI</td>
  <td align=left valign=top>Quantum Maverick</td>
  <td align=left valign=top></td>
  <td align=left valign=top>3.5&quot;</td>
  <td align=left valign=top>540   MB</td>
</tr>
<tr>
  <td align=left valign=top>SCSI</td>
  <td align=left valign=top>IOMEGA ZIP 100</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top>100   MB</td>
</tr>
<tr>
  <td align=left valign=top>SCSI</td>
  <td align=left valign=top>Yamaha</td>
  <td align=left valign=top>CDRW 4260</td>
  <td align=left valign=top>3.5&quot;</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>SCSI</td>
  <td align=left valign=top>Toshiba</td>
  <td align=left valign=top>XM5301</td>
  <td align=left valign=top>3.5&quot;</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>SCSI</td>
  <td align=left valign=top>Toshiba</td>
  <td align=left valign=top>XM5703</td>
  <td align=left valign=top>3.5&quot;</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>SCSI</td>
  <td align=left valign=top>Toshiba</td>
  <td align=left valign=top>XM4101</td>
  <td align=left valign=top>3.5&quot;</td>
  <td align=left valign=top></td>
</tr>
</table></div>

<p>
<br>
</p>
<p>
<br><b> Ein Trick noch </b>
<br>
</p>
<p>Wenn man an einen HDDRIVER bzw. an eine Platte unter HDDRIVER
nicht mehr drankommt, weil die in der Ger&auml;tekonfiguration
abgeschaltet ist, einfach die Platte mit Cecile hochfahren, dann den
HDDRIVER mit HDDRUTIL entsprechend konfigurieren (das geht!), beenden
= abspeichern und neu mit HDDRIVER booten.
<br>
</p>
<p>Dieser Trick stammt von Hansj&ouml;rg Widmer
<br>
<br>
<br>
</p>
<p><b> Und der DMA-Patch.. </b>
<br>
</p>
<p>Bei einigen Falcons scheint es, entgegen der Aussage von CENTEK,
wohl doch diverse Probleme mit dem SDMA und extern angeschlossenen
Festplatten zu geben.
<br>
</p>
<p>Hauptsymtome bei allen mir bekannten F&auml;llen sind fimmernde
Streifen auf dem Monitor und fehlerhaftes Verhalten der externen
Festplatten beim einlesen von Programmen. Programme st&uuml;rzen mit
Busfehlern oder andern obskuren Fehlermeldungen ab. Auch kann der
Falcon einfach so im <a href="030505.htm" target="UDOcon">Desktop</a> h&auml;ngen bleiben.
<br>
</p>
<p>In allen diesen F&auml;llen, es mu&szlig; nicht direkt die
Ramkarte sein, besteht die M&ouml;glichkeit das Sie ein wenig mit dem
DMA-Patch experimentieren m&uuml;ssen. L&ouml;ten Sie anstelle des
Widerstands einfach ein 470 Ohm Potentiometer ein und ver&auml;ndern
sie damit den Wert des Widerstand. Sie k&ouml;nnen runter bis ca.
180Ohm kommen, danach h&auml;ngt der Rechner aber immer.
Ver&auml;ndern sie das Potentiometer solange bis der Rechner -stabil-
l&auml;uft. Testen Sie das auch wenn der Rechner kalt ist!
<br>
</p>
<p>Haben Sie den perfekten Arbeitspunkt gefunden, entfernen Sie das
Potentiometer. Messen sie den Widerstand zwischen dem Mittenabriff und
dem Anschlu&szlig; den sie verwendet haben. Ersetzen Sie dann das
Potentiometer durch einen Festwiderstand mit dem eben gemessenen Wert.
<br>
</p>
<p>Verwenden Sie daf&uuml;r einen hochwertigen Widerstand, 0.01%
Toleranz!
<br>
</p>
<p>Das sollte es dann gewesen sein.
<br>
</p>
<p>Treten -danach- noch immer Streifen auf dem Bildschirm auf,
speziell unter 256 Farben, m&uuml;ssen Sie die eingebaute Falcon
Ramkarte (ST-RAM) leider ersetzen. Sie ist einfach zu langsam oder hat
Fehler die eben erst bei h&ouml;herem Takt auftreten.
<br>
</p>
<p>Noch ein kleines Geheimniss am Schlu&szlig;:
<br>
</p>
<p>Mein CT2-Falcon besitzt diesen DMA-Patch gar nicht, er ist dadurch
in diesem Bereich zwar ein klein wenig langsamer, daf&uuml;r
h&auml;ngt er aber auch nicht und er st&uuml;rzt auch nicht einfach
mal so, ganz unvermittelt ab.
<br>
</p>
<p>Im Klartext:
<br>
</p>
<p>Diese Maschine bezieht den DMA-Takt genau daher woher Sie ihn im
Urzustand auch herbekommt. Das geht perfekt. Auch das Ram arbeitet so
Einwandfrei.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> CPU K&uuml;hler </b>
<br>
<br>
</p>
<p>Beachten Sie bitte das der Hersteller den K&uuml;hlk&ouml;rper
inkl. dem netten L&uuml;fter auf die empfindliche <a href="040109.htm" target="UDOcon">68030 CPU</a> nur mit
doppelseitigem Klebeband aufgeklebt hat. Bei einigen Exemplaren hat
man daher den K&uuml;hler schneller alleine in der Hand als einem lieb
ist, kleben Sie ihn in diesem Fall dann halt einfach wieder auf.
Entfernen Sie dazu vorsichtig den verbrauchten Klebestreifen und
versuchen Sie einen neuen aufzutreiben der u.a auch
W&auml;rmeleitf&auml;higkeiten besitzt. Ansonsten ist der gesammte
K&uuml;hlblock &uuml;berfl&uuml;ssig. Beachten Sie bitte das die CPU
sehr hei&szlig; wird und u.U bei schlechter K&uuml;hlung
besch&auml;digt wird.
<br>
</p>
<p>Sollte der K&uuml;hler abgefallen sein, befestigen Sie ihn gleich
so das zum internen Falconnetzteil hin etwas mehr Platz bleibt. Im
Fachhandel gibt es fl&uuml;ssigen W&auml;rmeleitklebstoff, der ist
teuer und sollte nicht nur deswegen auch sparsam verwendet werden.
<br>
</p>
<p>Bedenken Sie das der K&uuml;hlk&ouml;rper mit diesem Klebstoff
nicht mehr leicht l&ouml;sbar sein wird! &Uuml;berlegen Sie sich also
vorher genau was sie da gerade machen!
<br>
</p>
<p>Der L&uuml;fter selber ist nur mit vier Klippsen befestigt, kann
also leicht ersetzt werden. Die L&ouml;tststellen des
L&uuml;fteranschlu&szlig; befindet sich unter dem
K&uuml;hlk&ouml;rper.
<br>
</p>
<p>Der Rechner wird bei l&auml;ngerem Betrieb ordentlich warm. Daher
kann man z.B oberhalb der K&uuml;hlk&ouml;rper des internen Netzteils
auch einen zus&auml;tzlichen L&uuml;fter im Geh&auml;usedeckel
anbringen. (12V, CPU-L&uuml;fter). Angel&ouml;tet wird dessen
Stromversorgung einfach an +12V (blau) und einem der
GND-Anschl&uuml;sse (schwarz) des Netzteiles. Sie &ouml;ffnen ja nicht
jeden Tag das Geh&auml;use, denken Sie aber an diesen
zus&auml;tzlichen L&uuml;fter wenn Sie es &ouml;ffnen!
<br>
</p>
<p>Enf&auml;llt im Tower- oder Desktopgeh&auml;use!
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> CENTurbo Software, Goodies und Patches </b>
<br>
<br>
</p>
<p>Nachdem Sie ihren CENTurbo2 Beschleuniger erfolgreich eingebaut
haben werden Sie nach und nach die verschiedenen Softwaretools
ausprobieren wollen die Sie auf der beigelegten Diskette gefunden
haben.
<br>
</p>
<p>Die CENTurbo-Tools befinden sich auf einer HD-Diskette im
gepackten Zustand. Kopieren Sie dieses Archive auf ihre Festplatte und
benutzen Sie STZIP zum entpacken.
<br>
</p>
<p>Nach dem Entpacken finden sie folgende Struktur vor:
<br>
</p>
<pre>
C:/CT2.US -
           |
            CENTEK.DOC
            DEMO  .CTK
            TOOLS
            TOOLS .CTK-
                       |
                       CBOOT
                       CENTSCRN
                       CENTVIDL
                       CENTVIEW
                       <a href="040101.htm" target="UDOcon">NVRAM</a>
                       PATCHES.CT2
                       PUTFLASH
                       SETUP
                       TIXTAX
                       VIDEOMOD

</pre>
<p>Die Ordner enthalten folgende Programme:
<br>
</p>
<p>
<br>
</p>
<p><b> CBOOT </b>
<br>
</p>
<p>Enth&auml;lt das Setupprogramm f&uuml;r das Falcon <a href="040101.htm" target="UDOcon">NVRAM</a>. Hier
stellen sie den RAM-Test und die Wartezeit f&uuml;r die Festplatte
ein. Die Dialogboxen sind durch Anklicken verschiebbar.
<br>
</p>
<p>Im <a href="040101.htm" target="UDOcon">NVRAM</a> Hauptdialog stellen Sie Landessprache und die
Tastaturbelegung ein. Alle Einstellungen werde &uuml;bernommen wenn
Sie diese Dialoge mit dem schwarzen Kreu in der linken oberen Ecke
verlassen. Das gilt f&uuml;r alle CENTurbo-Tools.
<br>
</p>
<p>Bei der &quot;Startup Sequence&quot; und dem &quot;Operating
System&quot; sowie dem Men&uuml;punkt &quot;Hard Disk Driver&quot;
w&auml;hlen Sie die wichtigsten Voreinstellungen aus.
<br>
<br>
</p>
<p><b> CENTSCRN </b>
<br>
</p>
<p>Dieser Ordner enth&auml;lt die Bildschirmerweiterung CENTSCREEN.
Beachten Sie hier bitte das CENTSCREEN ein Autoorderprogramm
enth&auml;lt das auch im Autoordner installiert sein mu&szlig;.
CENTSCRN3.RSC geh&ouml;rt in das Root-Verzeichniss ihrer
Bootpartition. Befolgen Sie die Anweisungen im Textfile des
entsprechenden Ordners.
<br>
<br>
</p>
<p><b> CENTVIDL </b>
<br>
</p>
<p>CENTVIDEL ist das Setupprogramm f&uuml;r den Falcon Videochip.
Dieses Programm erkl&auml;rt sich von selber. Es hat die Funktion von
z.B VMG.PRG aus dem <a href="0806.htm" target="UDOcon">ScreenBlaster</a>-Paket oder dem BlowUP.PRG der
<a href="0b03.htm" target="UDOcon">FX-Karte</a>. Mit CENTVIDEL nehmen sie wichtige Voreinstellungen f&uuml;r
das Videosystem, bzw. f&uuml;r ihre gew&uuml;nschen
Bildschirmaufl&ouml;sungen vor.
<br>
</p>
<p>CENTVIDEL V 3.1.9 bietet die m&ouml;glichkeit &Auml;nderungen am
Videosetup direkt zwecks Test umzusetzen. Dazu k&ouml;nnen Sie den
Button &quot;Real Time&quot; einschalten. Mit den Tasten SHIFT+UNDO
k&ouml;nnen Sie gemachte Einstellungen wieder verwerfen, sollten Sie
sich das Display ausgeschossen haben. Die von ihnen gemachten
Bildschirmeinstellungen k&ouml;nnen mit einem Kommentar versehen aus
diesem Programm heraus dauerhaft abgespeichert werden. Unter
&quot;Clock&quot; stellen Sie den Pixeltakt ein, bedenken Sie bitte
das CENTVIDEL, sofern installiert, auch Funktioniert wenn der CT2
Turbomodus abgeschaltet ist, hier dann allerdings mit geringerem
Pixeltakt. U.u f&uuml;hren ihre Einstellungen dann zu einer
Bildwiedergabe mit nur geringer Bildwiederholfrequenz. Auch sollten
Sie sich vor Augen f&uuml;hren das Sie &auml;ltere Monitore mit zu
hohen Frequenzen u.U zerst&ouml;ren k&ouml;nnen, besitzten diese keine
eigene Schutzschaltung. Wenn Sie sich an die Gegebenheiten ihres
VGA-Monitors halten wird idR nichts passieren.
<br>
<br>
</p>
<p><b> CENTVIEW </b>
<br>
</p>
<p>CENTView ist ein Bildbetrachter. Eine nette und schnelle Beigabe.
Dieser Bildbetrachter kann .TGA,.GIF,.PCX.,SEF,.IMG,.XIMG,.IFF sowie
.XGA,.PI1-PI3,.PI9,.PC3,.MUR,.DOC,.PIC,.ESM,.IIM,.ART und
.NEO,.MTV,.FTC,.12B,.RGH,.MAC,.MGF,.TIFF,.PSD,.APX,.TG1,.PBM,.BMP
.PAC,.PNT-Formate in jeglicher Form darstellen. Ein kleines
Multitalent. Neben dem reinen betrachten der Bilder kann auch eine
SlideShow mit Bilden in den genannten Bildformaten veranstaltet
werden.
<br>
<br>
</p>
<p><b> <a href="040101.htm" target="UDOcon">NVRAM</a> </b>
<br>
</p>
<p>Wie der Name schon sagt, <a href="040101.htm" target="UDOcon">NVRAM</a> ist das Setupprogramm f&uuml;r das
CENTurbo-<a href="040101.htm" target="UDOcon">NVRAM</a>. Hier nehmen Sie die System-Grundeinstellung, auch die
Tastaturbelegung und die Landessprache vor. Datum &amp; Uhrzeit in
bekannten Formaten ist eine Selbstverst&auml;ndlichkeit. Beachten Sie
bitte das Sie mit <a href="040101.htm" target="UDOcon">NVRAM</a>-Tools die sie die ganze Zeit vor ihrem CT2
Beschleuniger benutzt haben, u.U mehr Schaden anrichten als die Sache
wert ist. Benutzten Sie nach dem Einbau des Beschleunigers am besten
ausschliesslich die <a href="040101.htm" target="UDOcon">NVRAM</a>-Tools von CENTEK. U.u kann es passieren,
verwenden Sie andere Tools, das beim &auml;ndern der Wartezeit
hinterher das CT2 Festplattensetup verstellt ist und keine Festplatten
mehr gefunden werden. Mit den CENTurbo-Tools kann man sich solche
Umst&auml;nde leicht ersparen.
<br>
<br>
</p>
<p><b> PUTFLASH </b>
<br>
</p>
<p>In diesem Ordner finden Sie das Programm mit dem man
Softwareupdates in das 64K-Flash Eprom auf dem CENTurbo2 Board
schreibt. Hiermit sind Sie in der Lage die Updates der Fa. Centek in
eigener Regie an der richten Stelle zu plazieren. Der Funktionsablauf
ist einfach und gestaltet sich bis auf das Ausw&auml;hlen der
entstprechenden .BIN-Datei vollkommen automatisch. PUTFLASH besitzt
einen &quot;Updatez&auml;hler&quot; und zeigt die aktuelle
Softwareversion nebem dem Datum der Softwareversion direkt an.
<br>
<br>
</p>
<p>Updates gibt es von CENTEK per Diskette oder im <a href="0203.htm" target="UDOcon">Download</a> von
www.centek.fr Das Update vom 31.10.98 enth&auml;lt u.A die Cecile
Version 1.78 und das CT2 Men&uuml; in deutscher Sprache. Dazu
m&uuml;ssen Sie die Datei FLASH_D.BIN in das CT2 Flashrom
&uuml;bertragen. Das dauert nur wenige Sekunden. Unter der
einstellbaren Pfadangabe der Flash-Datei sehen sie die aktuelle
Version und das Datum der neuen Datei. Rechts finden Sie angaben
dar&uuml;ber welche Release sich im Flashrom befindet. Nach einem
Update sollten beide Anzeigen das gleiche beinhalten. Bleibt
abzuwarten was die Softwareentwicklung noch mit sich bringt.
<br>
<br>
</p>
<p><b> VIDEOMOD </b>
<br>
</p>
<p>Hier drin finden Sie den VMG, den (V)ideo (M)ode (G)enerator
f&uuml;r CENTSCREEN. Sie benutzten hier die mitgelieferten
Aufl&ouml;sungen, kreieren neue Bildschirmaufl&ouml;sungen oder
&auml;ndern die mitgelieferten Aufl&ouml;sungen zu ihren eigenen
Bed&uuml;rfnissen ab. Der VMG enth&auml;lt die M&ouml;glichkeit neue
Bildschirmaufl&ouml;sungen zu testen. Nach dem Abspeichern ihrer neuen
Aufl&ouml;sungen in der Datei VIDEO.DAT, welche sich ebenfalls auf C:/
befinden sollte, stehen diese Aufl&ouml;sungen nach erneutem booten
zur dem Benutzer zur freien Verf&uuml;gung. Sie k&ouml;nnen die
Bildschirmaufl&ouml;sungen jederzeit an der gewohnten Stelle im
<a href="030505.htm" target="UDOcon">Desktop</a> wechseln. Anstelle der bekannten Dialogbos von Atari erscheint
einfach der CENTSCREEN-Dialog. Von diesem k&ouml;nnen sie dann in jede
gew&uuml;nschte Aufl&ouml;sung und Farbtiefe umschaltet.
<br>
<br>
</p>
<p><b> SETUP </b>
<br>
</p>
<p>Enth&auml;lt die franz&ouml;sische Beschreibung des Men&uuml;s das
sie zu Gesicht bekommen wenn Sie ihren Falcon im Turbomodus gebootet
haben. Neben dem Text finden Sie die einzelnen Men&uuml;s als .GIF
Bild.
<br>
<br>
</p>
<p><b> TIXTAX </b>
<br>
</p>
<p>Eine nette Uhr die als .ACC installiert eben die Systemuhrzeit
anzeigt.
<br>
</p>
<p>Alles in allem finden Sie hier all das was Sie zum
vern&uuml;nfigen Arbeiten mit dem CENTurboII Beschleuniger
ben&ouml;tigen. Alle Programme sind mehr oder weniger Eindeutig und
Selbsterkl&auml;rend mit lustigen Bildchen versehen. Weitere
Erkl&auml;rungen sind daher eigentlich unn&ouml;tig. Die wichtigen
Tools sollten Sie sich immer Griffbereit, auch auf einer Diskette,
bereithalten. Insbesondere betrifft das die <a href="040101.htm" target="UDOcon">NVRAM</a>-Tools. CBOOT und
<a href="040101.htm" target="UDOcon">NVRAM</a> enthalten noch die Funktion Disketten &uuml;berpr&uuml;fen zu
k&ouml;nnen. Eine n&uuml;tzliche Erweiterung.
<br>
</p>
<p>
<br>
<br><b> - Die Preise, Lieferumfang und Support </b>
<br>
<br>
</p>
<pre>
                                              EG           EG ausserhalb

CENTurbo II  (Ohne FASTRam)      1990 FF     1650 FF
48 Stunden Einbauservice          300 FF      250 FF
Soforteinbau                      400 FF      330 FF
CENTurbo II  + 16 MB             2190 FF     1815 FF
CENTurbo II  + 32 MB             2390 FF     1980 FF
Falcon BUS Adapter                200 FF      170 FF

</pre>
<p>Ausserhalb der EG enthalten die Preise in dieser Aufstellung noch
keine franz&ouml;sische Steuer. Alle Preisangaben k&ouml;nne sich ohne
Warnung &auml;ndern.
<br>
</p>
<p>Aktuelle Preise in DM am 20.09.1998 laut CENTEK Homepage. Beachten
Sie bitte das sich die genannten Preis mit dem Wechselkurs verschieben
k&ouml;nnen. Erfragen Sie daher immer die aktuellen Preise &uuml;ber
www.centek.fr
<br>
</p>
<pre>
CENTurbo II ohne RAM        585 DM

Mit 16 MB                 +  50 DM
Mit 32 MB                 + 103 DM

Falcon Bus Adapter        +  59 DM

Einbau in 48 Stunden      +  89 DM
Soforteinbau              + 120 DM

</pre>
<p>Deutsche Preisangaben ohne Versandkosten und H&auml;ndlerzuschag!
<br>Software befindet sich ausser einigen Demos noch keine im
Lieferumfang.
<br>Die Steuersoftware befindet sich im Lieferumfang der <a href="0305.htm" target="UDOcon">Hardware</a>.
<br>
</p>
<p>Eingeschickte Falcon Hauptplatinen werden idR innerhalb einer
Woche bearbeitet. Montags zu deutschen Post, das kostet ca. 45 DM,
Samstags aus Frankreich zur&uuml;ck.
<br>
<br>
<br>
</p>
<p><b> - Entwickler </b>
<br>
<br>
</p>
<p>F&uuml;r Soft- &amp; Hardwareentwickler bietet CENTEK Sonderpreise
an die Sie dort, direkt beim Hersteller, erfragen sollten. CENTEK
unterh&auml;lt f&uuml;r wichtige Anfragen eine telefonische Hotline
die unter den unten aufgef&uuml;hrten Rufnummern in Frankreich,
vorzugsweise in franz&ouml;sicher oder englischer Landessprache
erreichbar sind:
<br>
</p>
<pre>
HOTLINE : +33 344 746 330  von Dienstag bis einschliesslich
                           Samstags von 12:00 Uhr bis 19:00 Uhr
                           Weiterhin von 21:00 Uhr bis 23:00 Uhr unter gleicher Rufnummer.
</pre>
<p>Mit Sicherheit sind hier auch deutsche H&auml;ndleranfragen
erlaubt und erw&uuml;nscht.
<br>
</p>
<p>CLASS 4
<br>
<br>42, rue Delegorgue
<br>F-62970 COURCELLES-LES-LENS
<br>France
<br>Tel: + (33)-3-2-1-409-400
<br>Fax: + (33)-3-2-1-746-449
<br>
</p>
<ul>
<li> <a href="http://www.centek.fr" target="_top">CENTEK Homepage</a>
<br>&nbsp;
</li>
</ul>
<p>Email: vxp@imaginet.fr
<br>
</p>
<p>
<br>
<br>
</p>
<p>Alle technischen Daten und Beschreibungen mit freundlicher
Unterst&uuml;tzung von CENTEK France f&uuml;r DOITF030
<br>
<br>
<br>
</p>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b05.htm" target="UDOcon"><img src="udo_up.gif" alt="Centurbo2" border=0 width="24" height="24"></a>
<a href="0b05.htm" target="UDOcon"><img src="udo_lf.gif" alt="Centurbo2" border=0 width="24" height="24"></a>
<a href="0b0502.htm" target="UDOcon"><img src="udo_rg.gif" alt="CENTurbo2 B Accelerator" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
