<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: CT60 Beschleuniger
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b07.htm" target="UDOcon"><img src="udo_up.gif" alt="CT60" border=0 width="24" height="24"></a>
<a href="0b0701.htm" target="UDOcon"><img src="udo_lf.gif" alt="CT60 Accelerator" border=0 width="24" height="24"></a>
<a href="0c.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stecker und Schnittstellen am Falcon F030" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="CT60_20Beschleuniger">11.7.2 CT60 Beschleuniger</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> CT060 Beschleuniger </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Von Robert Schaffner
<br>
<br>Nach dem vor 1.5 Wochen endlich mein CT060 angekommen ist, habe
ich heute morgen, 02.11.2003, endlich die Zeit gehabt den
Beschleuniger einzubauen.
<br>
</p>
<p>Da der daf&uuml;r vorgesehene F030 bereits mit einer <a href="0b03.htm" target="UDOcon">FX-Karte</a>
ausgestattet war, musste diese nur enfernt und die Verkabelung
geringf&uuml;gig ver&auml;ndert werden.
<br>
</p>
<p>Der Einbau ansich war f&uuml;r mich in 20 Minuten erledigt.
<br>
<br>
</p>
<p>Der CT060 l&auml;uft -&gt; 132Mips bei 128MB Ram.
<br>
</p>
<p>- Leiterbahnunterbrechungen die nur f&uuml;r die <a href="0b03.htm" target="UDOcon">FX-Karte</a> relevant
waren m&uuml;ssen entfernt werden.
<br>
<br>- Den ClockPatch habe ich, wie von mir seit Jahren publiziert,
belassen Der Rechner l&auml;uft seit mehreren Stunden damit korrekt.
SCSI-Zugriff funktioniert Einwandfrei.
<br>
<br>- Das alte XCONTROL.ACC verursacht einen Absturz direkt nach dem
Booten des Rechners - Entfernen und durch COPS ersetzen.
<br>
<br>- Die Autoordner-Programme sind exakt nach den Anweisungen von
Rodolphe Czuba anzuordnen. Programm die man zum Testen des
Beschleunigers nicht ben&ouml;tigt sollte man Umbenennen oder
enfernen.
<br>
<br>- <a href="1302.htm" target="UDOcon">HDDriver</a> sollte min. in der Version 7.60 installiert sein.
<br>
<br>
<br>Pers&ouml;nlich empfinde ich den Beschleuniger als ein sehr
ausgereiftes St&uuml;ck <a href="0305.htm" target="UDOcon">Hardware</a> das eben seinen Preis hat und diesen
auch Wert ist.
<br>
</p>
<p>An der Stelle kann ich nur jedem Raten, der einen Falcon besitzt,
noch ein wenig an diesem h&auml;ngt, darauf zu hoffen das eine weitere
Charge des Beschleunigers von Rodolphe Czuba aufgelegt wird.
<br>
</p>
<p>Abschliessend noch die Anmerkung das mein papyrus auf dem
CT060-Falcon so fl&uuml;ssig wie unter MagiCMac 6.20 auf einem G3/400
arbeitet.
<br>
</p>
<p>Benchmarks werde ich keine Vorlegen. Die gibt es bereits.
</p>
<p>
<br>
<br><b> Anleitung von Gunther Beninde
&lt;gunther.beninde@fh-duesseldorf.de&gt; </b>
<br>
</p>
<p>
<br>Vorbereitung f&uuml;r den Einbau einer &quot;verdrahteten&quot;
CT060:
<br>
</p>
<p>
<br>Es versteht sich von selber, das bei allen arbeiten am
Falcon030-Computer alle Sicherheitsma&szlig;nahmen eingehalten werden
m&uuml;ssen! Dies betrifft vor allen den Schutz vor Netzspannung und
Antistatik (Siehe hierzu auch die franz&ouml;sisch/englische
originalsprachige Web-Site).
<br>
</p>
<p>Zuerst wird nat&uuml;rlich der Stecker gezogen; dann das
Geh&auml;use ge&ouml;ffnet und das Motherboard insofern vorbereitet,
indem folgende Komponenten ausgebaut werden: (Dies betrifft meinen
Falcon030, welcher mit einer Speed-Resolution-Card, einem Falcon-Speed
(Intel 286er Prozessor), und 14 MB RAM nachger&uuml;stet wurde. Diese
Anweisung bezieht sich haupts&auml;chlich auf die
Speed-Resolution-Card und den &quot;<a href="0e.htm" target="UDOcon">Clockpatch</a>&quot;, tats&auml;chlich
d&uuml;rften inzwischen die meisten Falcons mit dem
&quot;<a href="0e.htm" target="UDOcon">Clockpatch</a>&quot; und der einen oder anderen Beschleunigung
aufwarten.)
<br>
</p>
<p>Die Vorbereitung betrifft (vor allem die Entfernung) folgender
Komponenten:
<br>
</p>
<p>- Tastatur (auf Anschlussorientierung achten!)
<br>
</p>
<p>- <a href="0f01.htm" target="UDOcon">Netzteil</a>, dieses befindet sich links-oben
<br>
</p>
<p>- Erweiterungsplatine links-unten (dieses ist die, welche mittels
Kabel (lila) mit der Erweiterungsplatine mittig-unten verbunden ist.)
Das Kabel ist zu durchtrennen, die erste Erweiterungsplatine ist von
ihren zwei Anschlussleisten zu l&ouml;sen. Die zweite
Erweiterungsplatine ist verschraubt bzw. fest verdrahtet
(Speed-Resolution-Card), ihr Ausbau ist unten beschrieben) Festplatte
mit Halter (auf Anschlussorientierung achten!)
<br>
</p>
<p>- Floppylaufwerk
<br>
</p>
<p>- Erweiterungsplatine mit dem PS/2-Speicherriegel (unten, mehr
rechts), diese von ihren zwei Anschlussleisten l&ouml;sen. Diese
Platine ist an ihrer Pappe-Abdeckung erkennbar (in meinem Fall!)
<br>
</p>
<p>Alle Angaben &uuml;ber die Orientierung beziehen sich auf eine
Lage, als wenn der Computer betriebsfertig vor einen liegen w&uuml;rde
(abgesehen von den o.g. Entfernungen)! Anschlie&szlig;end sollte es in
etwa so aussehen:
<br>
</p>
<p>Foto 1: Originalmotherboard (hier wurde leider VIDEL mit dem
MATRIX-Chip verwechselt; Quelle: <a href="1403.htm" target="UDOcon">ST-Computer</a> 11/92)
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0601.gif" border=0 width="698" height="468"></p><br>
<p>
<br>
<br>
</p>
<p>1.Schritt: Deinstallation des &quot;Clockpatches&quot;
<br>
</p>
<p>Dieses kann zuweilen die gr&ouml;&szlig;te H&uuml;rde f&uuml;r den
Einbau einer verdrahteten <a href="0b07.htm" target="UDOcon">CT60</a> sein, da es hierbei auf die
Qualit&auml;t der Ausf&uuml;hrung des Clockpatches ankommt. Dirk
Strangfeld &auml;u&szlig;ert sich hierzu auf seiner Homepage (siehe:
L&ouml;tpads), bei mir hatte es zur Folge, das ich einen
jungfr&auml;ulichen Falcon030 erstanden habe, um die <a href="0b07.htm" target="UDOcon">CT60</a> dann dort
einzubauen
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0602.gif" border=0 width="277" height="318"></p><br>
<p>
<br>
<br>
</p>
<p>- Die kleine Drahtbr&uuml;cke zwischen R216 und R221 entfernen.
<br>- Kabelverbindung R216 /R221 zum &quot;Huckepack-&quot; 74F08
l&ouml;sen.
<br>- Kabelverbindung zwischen R217 und dem 74F08 an R217 l&ouml;sen.
<br>- abl&ouml;sen des 74F08 von &quot; U63 &quot;
<br>
</p>
<p>(Einbau einer &quot;25 MHz Bustakt&quot;-Erweiterung:
</p>
<p><i> Falls man folgende RAM-Karte folgendes Types besitzt:
<br>
</p>
<p>CENTram 14 (aus Frankreich)
<br>MegaRAM 14 (ebenfalls aus Frankreich)
<br>Action Soft (aus Gro&szlig;britannien)
<br>
</p>
<p>kann folgender neuer &quot;<a href="0e.htm" target="UDOcon">Clockpatch</a>&quot; eingebaut werden, weil
mit diesen Karten ein schnellerer Zugriff auf das sogenannte ST-RAM
m&ouml;glich ist:
<br>
</p>
<p>Der 74F08 wird wie folgt recycelt: Pin 14 wird mit Pin 14 des
&quot;U63&quot; verbunden, ebenso wie Pin 7 mit Pin 7 (Alles am
besten, in dem der 74F08 &quot;huckepack&quot; aufgel&ouml;tet wird.
Desweiteren werden Pin 12 und Pin 13 des 74F08 verbunden und diese
Verbindung mit dem vorderen Anschlu&szlig;punkt von &quot;R216&quot;
verbunden. Der hintere Anschlu&szlig;punkt von &quot;R216&quot; wird
mit dem Pin 11 des 74F08 verbunden. In diesem Fall entf&auml;llt auch
der unten beschriebene Einbau eines 33 Ohm-Widerstandes als
&quot;R216&quot;.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0603.gif" border=0 width="240" height="277"></p><br>
<p>
<br>
<br>
</p>
<p>
<br>Falls man folgende RAM-Karte besitzt:
<br>Atari 14MB Card (das Original/ sehr selten!)
<br>Falcon Wings
<br>Wizztronics Memory Up-Date (aus den USA)
<br>(oder wie ich!) Hard &amp; Soft PS/2-RAM
<br>Paskud (aus Polen)
<br>
</p>
<p>
<br>er&uuml;brigt sich der oben beschriebene neue <a href="0e.htm" target="UDOcon">Clockpatch</a>, diese
Karten sind etwas zu langsam)
</p>
<p>Hinweis: zur Begr&uuml;ndung des neuen (bzw. zur Ablehnung des
alten) <a href="0e.htm" target="UDOcon">Clockpatch</a> schrieb mir Rodolphe (Originalton): One remark about
the old clock patch you deinstall on your page: this clock patch is
very bad! It badly bufferize the clock to 030 SLOT bus and the clock
to SDMA / FPU, BUT not the clock to 030 + GALS! This gives a
non-synchronization that is not important with 030, but is important
with <a href="0b07.htm" target="UDOcon">CT60</a> that need to be sync with GALS of the motherboard. Second
thing, it is stupid in term of electronic, to charge TWO clock traces
with only one gate (74f08) output! A good clock patch uses 1 GATE for
1 clock! The correct clock patch on Falcons was a 74F08 with the 3
gates used: one for R216, one for R221 and one for R222! I don't know
who is the bad guy who published this schema of clock patch but it is
very bad, and I'm sorry to see that some people have it in their
machine! </i>
<br>
</p>
<p>
<br>
<br>Anmmerkung des Autors: Rodolphe hat bez&uuml;glich des <a href="0e.htm" target="UDOcon">Clockpatch</a>
nat&uuml;rlich Recht. Hinzugef&uuml;gt werden mu&szlig; das in DOIF030
seit Jahren der Clockpach mit einem 74F08 angeraten wird. F&uuml;r
jeden Falcon.
<br>
<br>
<br>
</p>
<p>
<br>2.Schritt: Entfernen der Speed-Resolution-Card
<br>
</p>
<p>- Austausch der Widerstande &quot; R216 &quot;,&quot; R221 &quot;
und &quot; R222 &quot; gegen 33 Ohm Widerst&auml;nde. Die
Widerst&auml;nde sollten als SMD-Bausteine ausgef&uuml;hrt sein.
<br>
</p>
<p>- entfernen aller Anschl&uuml;sse der Speed-Resolution-Card
(fortan SRC genannt) (dies kann auch beim wechseln der
SMD-Widerst&auml;nde geschehen); hier konkret: P1 der SRC (gelb) vom
unteren Anschlu&szlig; (mitsamt des angel&ouml;teten Widerstandes
390/39R) des &quot;R222&quot;, dann P2 der SRC (orange) vom unteren
Anschlu&szlig; des &quot;R234&quot;.
<br>
</p>
<p>- Entfernen von P4 der RSC (schwarz) von Pin 9 von &quot; U63
&quot;
<br>- Entfernen von P5 der RSC (gr&uuml;n) von R217
<br>- Entfernen von P6 der RSC (blau) von P16 des &quot; U68 &quot;
(&quot;U68&quot; befindet sich unterhalb von &quot;U63&quot;).
<br>
</p>
<p>- Entfernen von P7 der RSC (grau/dick) vom Motherboard (dort, wo
sich der Aufdruck &quot;U65&quot; befindet)
<br>
</p>
<p>- <b>Sonderbehandlung </b> der Spule L102 : Diese wurde an ihrer
rechten Seite vom Motherboard gel&ouml;st und mit ihrer abgetrennten
Seite mit P9 der RSC (rot) verbunden. Nunmehr ist es n&ouml;tig, genau
diese Anschluss wieder mit dem Motherboard zu verbinden, daf&uuml;r
muss dann die linke Seite von L102 gel&ouml;st werden, da dort der
Clock &quot;32 MHz from MB&quot; f&uuml;r die CT060 abgegriffen wird.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0604.gif" border=0 width="231" height="119"></p><br>
<p>
<br>
<br>
</p>
<p>Foto 2: &ouml;bersicht 1, rot markiert wurde der Bereich des
&quot;Clockpatches&quot;, hellblau der Bereich, wo sich L102 befindet:
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0605.gif" border=0 width="800" height="574"></p><br>
<p>
<br>
<br>
</p>
<p>- Entfernen der Verbindung P10 der SRC von den beiden ACIA-Chips
<b>&quot;U24&quot; </b> und <b> &quot;U52&quot; </b>.
&quot;U24&quot; befindet sich unterhalb des Rechnernetzteiles ziemlich
weit links oben ( wie auf dem Foto gut zu erkennen ist) und ist wie
&quot;U52&quot;, welches sich unter der Floppy befindet, anhand der
<b> zusammen gel&ouml;teten Pins 3 und 4 </b> zu erkennen. Diese
Modifikation bleibt erhalten, hier wird dann die CT060 angeschlossen.
<br>
<br>
</p>
<p>- Entfernung der SRC-Anschl&uuml;sse von den beiden <b>
Widerstandsarrays &quot;P14&quot; </b> und <b>&quot;P16&quot; </b>;
dies betrifft v.a. &quot;P14&quot;, da hier die Leitungen P16
(schwarz), P17 (lila), P18 (grau) und P19 (wei&szlig;) anliegen. Das
Widerstandsarray &quot;P16&quot; wurde am 2. Pin von links mit Masse
verbunden; diese Masse-Verbindung muss wider aufgetrennt werden. Wo
sich diese Widerstandsarrays sich befinden, ist mir noch unklar, sie
sollten aber anhand ihrer Modifikation deutlich zu erkennen sein
(folgen sie einfach den Anschl&uuml;ssen).
<br>
<br>
</p>
<p>- Entfernen von P21 der SRC vom Anschluss Pin 14 des
<b>&quot;U34&quot; </b>. &quot;U34&quot; liegt unterhalb der
Festplatte und wird auch VIDEL genannt. Dieser Chip stellt die gesamte
Grafiklogik des Rechners! VIDEL ist (in meinem Fall) auch daran zu
erkennen, das er mit einem eigenen K&uuml;hler ausgestattet wurde. Der
Anschluss zu &quot;Pin 14&quot; wird frei bleiben, da VIDEL
sp&auml;ter regul&auml;r mit Takt versorgt wird (&quot;Pin 14&quot;
versorgte VIDEL mit externen Takt, wenn dort Takt anliegt, wird der
normale Takt intern abgeschaltet; wenn man seinen Falcon also auch
sp&auml;ter mit dem SM124-Bildschirm von Atari betreiben m&ouml;chte,
wird daf&uuml;r eigens der normale Takt durch Versorgung des &quot;Pin
14&quot; mit 32MHz &uuml;berspielt (siehe originale
franz&ouml;sische/englische Einbauanweisung); Ich habe dieses
allerdings nicht vor). In meinem Fall wurde allerdings Pin 14 mit der
Speed-Resolution-Card verbunden. Diese Verbindung ist nat&uuml;rlich
zu trennen, allerdings kann der Zwischenstecker weiter verwendet
werden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0606.gif" border=0 width="96" height="116"></p><br>
<p>
<br>
<br>
</p>
<p>- ggf. Entfernung der Leitung zu P22 der SRC, wobei ich allerdings
nicht wei&szlig;, ob und wo sie &uuml;berhaupt angeschlossen ist.
<br>
</p>
<p>- Nun kann die SRC abgeschraubt werden (Wer will eine haben?)
<br>
</p>
<p>3.Schritt: Einbau der CT060
<br>
</p>
<p>
<br>- Vorher sind einige Modifikationen durchzuf&uuml;hren, diese
betreffen den Bereich des sogenannten DSP und des sogenannten SDMA.
Zuerst zum SDMA. Dieses hatte anscheinend bei der Entwicklung der
CT060 bis zuletzt Probleme bereitet. Wie man allerdings der Skizze und
dem Foto dieses Bereiches entnehmen kann, scheint die L&ouml;sung
recht einfach, sofern man das n&ouml;tige Feingef&uuml;hl hat: Zuerst
muss &quot;U20&quot; (AJAX-Chip) und <b> &quot;U36&quot; </b>
lokalisiert werden. Sie befinden sich im Bereich unter der Floppy bzw.
unterhalb des RAM. Anschlie&szlig;end muss die (von rechts gesehen )
Leiterbahn welche den in der Skizze dargestellten Verlauf nimmt und zu
&quot;U36&quot; f&uuml;hrt, kurz vor dem Chip oberfl&auml;chig
abisoliert werden (siehe Foto), damit dann diese Mittels eines
Widerstandes (Wert: <b>68 Ohm </b> ) mit Pin 14 des AJAX-Chips
verbunden werden kann.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0607.gif" border=0 width="230" height="206"></p><br>
<p>
<br>
<br>
</p>
<p>( Einbau einer &quot;25 MHz Bustakt&quot;-Erweiterung:
<br>
</p>
<p>Anstelle eines <b> 68 Ohm </b> - Widerstandes muss hier ein <b>
47 Ohm </b> - Widerstand verwendet werden.)
<br>
<br>
</p>
<p>- Ebenfalls in diesem Bereich (etwas links oberhalb des AJAX-Chips
und ebenfalls unter der Floppy) befindet sich der DSP-Chip
(&quot;U38&quot;). &quot;U38&quot; ist mittels einer Leiterbahn mit
einem freien Anschluss des links daneben befindlichen Oszilators
&quot; U37 &quot; verbunden (Der entsprechende Aufdruck auf dem
Motherboard umfasst 6 Anschl&uuml;sse, der Oszilator selber hat aber
nur 4 Beine). Die Leiterbahn selber ist durchzutrennen und f&uuml;r
den Anschluss der CT060 an den DSP (&quot;U38&quot;) etwas
abzuisolieren.
<br>
</p>
<p>
<br><i>(Einbau einer &quot;25 MHz Bustakt&quot;-Erweiterung:
<br>
</p>
<p>Da der DSP gut belastet wird, ist dieser zu seinem eigenen Schutz
mit einen K&uuml;hlk&ouml;rper zu versehen. Dieser kann aufgeklebt
werden (&quot;Sekundenkleber&quot;). Dieses ist zwar dann
unwiderruflich, aber K&uuml;hlung hat noch keinem Chip geschadet. )
</i>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0608.gif" border=0 width="162" height="132"></p><br>
<p>
<br>
<br>
</p>
<p>- Nun k&ouml;nnen die Anschl&uuml;sse gelegt werden. Die sollten
sich nicht &uuml;berkreuzen und relativ kurz sein.
<br>
</p>
<p>- <b> Anschluss 1+2 </b> = Der Masseanschluss (1) wird nicht
angeschlossen (aber m&ouml;glichst lange parallel gef&uuml;hrt!), der
andere (2) kommt an das Motherboard, und zwar da, wo vorher der linke
Anschluss der Spule <b> &quot;L102&quot; </b> war. (&quot;CT060-Clock
to MB&quot;)
<br>
</p>
<p>- <b> Anschluss 3+4 </b> = Der Masseanschluss (3) wird nicht
angeschlossen (aber m&ouml;glichst lange parallel gef&uuml;hrt!), der
andere (4) kommt an das Motherboard, blo&szlig; eben an den freien
Anschluss von &quot; L102 &quot;. (&quot;32MHz-Clock from MB&quot;)
</p>
<p>- <b> Anschluss 5 </b> = an &quot; U52 &quot; (&quot;ACIA
<a href="0c02.htm" target="UDOcon">Keyboard</a>-Clock&quot;)
<br>- <b> Anschluss 6 </b> = an &quot; U24 &quot; (&quot;ACIA
Midi-Clock&quot;) (Siehe auch Foto 2 weiter oben)
<br>
</p>
<p>- <b> Anschluss 7+8 </b> = Der Masseanschluss (8) wird nicht
angeschlossen (aber m&ouml;glichst lange parallel gef&uuml;hrt!), der
andere (7) kommt an das Motherboard, blo&szlig; hier an dem DSP
(&quot;U38&quot; )
<br>
</p>
<p>
<br>Foto 3: SDMA-Termination und Anschluss des DSP
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct0609.gif" border=0 width="612" height="507"></p><br>
<p>
<br>
<br>
</p>
<p>- Anschluss 9= an den <b> Pin 8 </b> des &quot;U63&quot;
<br>
</p>
<p>- <b> Anschluss 10 </b> = wird nicht genutzt
<br>
</p>
<p>NEU: Hinweis bez&uuml;glich des TOS-ROM-Chips: Dieser befindet
sich unterhalb der rechten Erweiterung (RAM-Speicher; das Bauteil mit
dem PS/2-Speicherriegel). Die Aufgabe besteht darin, seine
Reaktionszeit zu bestimmen, Dazu mu&szlig; der Aufkleber an der
rechten Seite angehoben werden. Alle folgenden Schritte h&auml;ngen
von der Antwort ab, die wir vom TOS-Chip erhalten!: Es sind folgende
Aufschriften auffindbar: 10 oder 12 oder 15. Sollte 10 vorgefunden
werden, ist keine Ma&szlig;nahme n&ouml;tig! Anders sieht es aus wenn,
die Aufschrift 12 oder 15 lautet: Dann mu&szlig; &quot;U46&quot;
gesucht werden; dieses stellt eine Jumper-Leiste dar, welche im
Original folgende Einstellung aufweist: 1-0-0-1 (1= ON;0= OFF!),
sollte die Aufschrift des TOS-Chips &quot;12&quot; oder &quot;15&quot;
lauten; sind folgende Ma&szlig;nahme notwendig, je nachdem, was auf
dem Chip steht und was erw&uuml;nscht wird!):
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct06010.gif" border=0 width="404" height="88"></p><br>
<p>
<br>
<br>
</p>
<p>Nun folgen die n&auml;chsten Schritte: zu allererst denken wir
hierbei nat&uuml;rlich an den Arbeitsspeicher. Hier gilt folgendes zu
beachten. Rodolphe scheint einen offensichtlichen Hinweis nicht
beachtet oder erw&auml;hnt zu haben (soweit ich dieses seiner Website
&quot;SDRAM&quot; entnehmen kann): Es ist darauf zu achten, ob der
Speicher-Riegel mit 66MHz klar kommt! (dieses ist nicht!
selbstverst&auml;ndlich), andere Speicher-Riegel sind obsolet!.
</p>
<p>Wenn ein passender Speicher-Riegel vorhanden ist, besteht die
Aufgabe darin, diesen in die CT060 einzust&ouml;pseln, bevor die Karte
selber in den linken Erweiterungsbereich eingedr&uuml;ckt wird (der
rechte Erweiterungsbereich steht weiterhin f&uuml;r die RAM-Card zur
Verf&uuml;gung. Ansonsten werden noch folgende Komponenten
ben&ouml;tigt: 3 Stecker f&uuml;r &quot;Power&quot; , LED und
&quot;Reset&quot; sowie dazugeh&ouml;rend einen Tast-Schalter, eine
LED und einen Taster f&uuml;r &quot;Reset&quot;. Ggf. einen
Wechsel-Schalter als Ersatz f&uuml;r die Jumperbr&uuml;cke, mit der
der Boost-Vorgang (Boost von CT060/ Boost von Falcon030) geregelt
wird. Die n&auml;chste Aufgabe besteht darin, entsprechende
Ausschnitte (f&uuml;r Taster/Schalter) in das Falcon030-Geh&auml;use
zu integrieren und die Komponenten mit ihren Anschl&uuml;ssen und der
CT060 zu verbinden. Sobald die CT060 mit Speicher (SDRAM) ausgestattet
wird und:
<br>
</p>
<p>
<br>
</p>
<p>a) eingest&ouml;pselt ist
<br>
<br>
</p>
<p>b) mit den zus&auml;tzlichen Teilen (Ein/Aus;LED;Reset) verbunden
ist und
<br>
<br>
</p>
<p>c) die Verbindung zum ATX-<a href="0f01.htm" target="UDOcon">Netzteil</a> steht (siehe auch hier das
Original)
<br>
</p>
<p>
<br>d) Einbau eines L&uuml;fters (statt des Riesen-Trums, den Rodolphe
verwendet) Hier scheint ein besonders flacher 40X40mm L&uuml;fter
geeignet, welcher irgendwie zwischen den beiden &auml;u&szlig;eren
K&uuml;hlrippen der CT060 eingepresst/eingeschoben werden muss.
Immerhin ist diese Variante in das Original-Geh&auml;use einbaubar und
k&uuml;hlt den 68060-Prozessor besser, wie Rodolphes Vorschlag, den
L&uuml;fter letztendlich irgendwohin zu verbauen:
<br>
</p>
<p>siehe Foto der eingebauten <a href="0b07.htm" target="UDOcon">CT60</a>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ct06011.gif" border=0 width="1020" height="654"></p><br>
<p>
<br>
<br>
</p>
<p>Nat&uuml;rlich w&auml;re es noch sinnvoll, diesen L&uuml;fter mit
einer Temperatursteuerung auszustatten, da er doch recht laut ist.
<br>
</p>
<p>e) Nat&uuml;rlich braucht auch das Motherboard Strom. Zu diesem
Zweck wird die Stromversorgung der Floppy genommen, an der Floppy
abgel&ouml;st und mit der <a href="0b07.htm" target="UDOcon">CT60</a> verbunden (Polung beachten!). F&uuml;r
die Floppy mu&szlig; man sich dann ein eigenes Kabel bauen, wenn man
eine L&ouml;sung w&uuml;nscht, welche das ATX abtrennbar macht.
<br>
</p>
<p>f) Zuguterletzt m&uuml;sste alles wieder mit dem Abschirmblech
abgedeckt werden. Dabei mu&szlig; allerdings noch ein Einschnitt
f&uuml;r den L&uuml;fter und das SDRAM der <a href="0b07.htm" target="UDOcon">CT60</a> eingef&uuml;gt werden.
Bis dahin kann man den Rechner in diesem Bereich ungeschirmt lassen,
aber nicht in der N&auml;he von Handys oder anderen empfindlichen
Ger&auml;ten.
<br>
</p>
<p><i> (Einbau einer &quot;25 MHz Bustakt&quot;-Erweiterung:
<br>
</p>
<p>Der 40MHz Oszillator auf der CT060 muss gegen ein 50 MHz-Modell
ausgetauscht werden. Der 40 MHz Oszillator ist verl&ouml;tet!, dies
hei&szlig;t: es muss gel&ouml;tet werden! )
<br>
</p>
<p>Da sich nunmehr die Frage stellt, wo sich der Oszillator befindet:
hier ein Schema der CT060 ! </i>
<br>
</p>
<p>gilt es: alles wieder zusammen schrauben und sich freuen!!
</p>
<p>
<br>Hinweis: Bisher sind 31 CT060-Karten ausgeliefert worden.
Entsprechend der bisher aufgelaufenden Fehlermeldungen versucht
Rodolphe nun mehr, die restlichen Karten der ersten Serie (und die
Karten einer potentiellen zweiten Serie) zu optimieren: Dies bedeutet
f&uuml;r die erste Serie z.B.: achten Sie darauf, ob der der 68060-er
wirklich fest in seinem Sockel sitzt! (bei der zweiten Serie wird er
fest verl&ouml;tet). Was ich bisher noch nicht so richtig verstanden
habe, ist die Methode des upflashings der verschiedenen Bauteile. Wenn
ich dieses verstanden habe, werde ich mein Wissen nat&uuml;rlich
sofort ver&ouml;ffentlichen! (bis dahin hoffe ich nat&uuml;rlich, das
meine pers&ouml;nliche CT060 mit dem optimalen ABE- bzw. SDR-Flash
f&uuml;r meine <a href="0305.htm" target="UDOcon">Hardware</a> ausger&uuml;stet sein wird). Leider war dem
nicht so, inzwischen hat der ABE-Flash ein Update erfahren, welche mit
der n&auml;chsten Trance geliefert wird, Bei mir mu&szlig;te ich
stattdessen eine Einstellung des Harddiskdrivers (HDD) &auml;ndern,
&uuml;ber die ich aber per Email informiert wurde, so das es diesbzgl.
keine Probleme gab.
<br>
<br>Ein besonderer Hinweis: Ich danke Dirk Strangfeld f&uuml;r den
Einbau der <a href="0b07.htm" target="UDOcon">CT60</a> in meinem Rechner und kann ihn nur weiterempfehlen und
verweise hierzu auf seine Homepage! (auch wenn diese durch den Einsatz
von Java-Applets nicht mit CAB oder einen anderen Atari-Browser
nutzbar ist)
<br>
</p>
<p>
<br>
</p>
<p>Inzwischen ist Dirk Stranfeld meinerseits mit der Konstruktion des
up-flash-Kabels beauftragt worden, was insofern wichtig ist, da er es
zu einem deutlich g&uuml;nstigeren Preis realisiert, wie Xilinx!
Wichtig f&uuml;r die Verwendung des Kabels ist hierbei, das die <a href="0b07.htm" target="UDOcon">CT60</a>
vom Falcon gel&ouml;st werden mu&szlig;, au&szlig;er man hat folgende
Modifikation vorliegen:
<br>
</p>
<p>- NVDI mu&szlig; installiert sein (zur Vermeidung von Zugriffen
auf den Blitter-Chip)
<br>
</p>
<p>- Auf der <a href="0b07.htm" target="UDOcon">CT60</a> mu&szlig; folgende Datenleitung gekappt sein (
siehe Bild ), was aber nach einer Email von Rodolphe f&uuml;r alle
<a href="0b07.htm" target="UDOcon">CT60</a> zutreffen d&uuml;rfte, welche nach der 31. Karte ausgeliefert
wurde.
<br>
</p>
<p>- Und (Wichtig): Auf der Karte mu&szlig; ein zus&auml;tzlicher
Widerstand (1-10 KOhm) auf einen der drei &quot;74LVC245A-Chips&quot;
eingel&ouml;tet sein. Dieses ist nicht! serienm&auml;&szlig;ig der
Fall, obwohl ich Rodolphe darum gebeten hatte; immerhin hat er als
Reaktion auf meine Nachfrage meine eigene Karte um einen solchen
Widerstand erg&auml;nzt.
<br>
</p>
<p>Liegen alle drei Voraussetzungen vor, kann die <a href="0b07.htm" target="UDOcon">CT60</a> im eingebauten
Zustand geflasht werden, ansonsten mu&szlig; sie (wie Eingangs
erw&auml;hnt) unter Beibehaltung der sonstigen Verbindungen mit dem
Motherboard bzw. dem ATX-<a href="0f01.htm" target="UDOcon">Netzteil</a> vom Erweiterungs-Sockel gel&ouml;st
werden.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b07.htm" target="UDOcon"><img src="udo_up.gif" alt="CT60" border=0 width="24" height="24"></a>
<a href="0b0701.htm" target="UDOcon"><img src="udo_lf.gif" alt="CT60 Accelerator" border=0 width="24" height="24"></a>
<a href="0c.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stecker und Schnittstellen am Falcon F030" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
