<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: SCSI-Schnittstelle
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c.htm" target="UDOcon"><img src="udo_up.gif" alt="Stecker und Schnittstellen am Falcon F030" border=0 width="24" height="24"></a>
<a href="0c0703.htm" target="UDOcon"><img src="udo_lf.gif" alt="Serial RS232 Port" border=0 width="24" height="24"></a>
<a href="0c0801.htm" target="UDOcon"><img src="udo_rg.gif" alt="SCSI TermPwr umr&uuml;sten" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="SCSI-Schnittstelle">12.8 SCSI-Schnittstelle</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Die SCSI-Schnittstelle </tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Der wichtigste Punkt zu Anschlu&szlig; einer externen
SCSI-Festplatte am Falcon ist das richtige Kabel, bzw. der passende
SCSI2 - SCSI1 Adapter und auch das richtige SCSI-Ger&auml;t. Es
k&ouml;nnen am Falcon bis auf wenige Aussnahmen alle SCSI- Ger&auml;te
vom Scanner bis zum Laserdrucker angeschlossen werden. Ausnahmen sind
Festplatten mit Wide/Differential SCSI. Das klappt nicht unbedingt.
Solche Ger&auml;te ben&ouml;tigen idR einen besonderen Controller /
SCSI-Bus. Hierzu finden Sie weitere Tips in DOITDRIVE.
<br>
</p>
<p>U.a besitzen diese Ger&auml;te auch eine leicht abweichende
Schnittstellenbelegung! Solche Platten werden von alten
Festplattentreibern NICHT erkannt.
</p>
<p>Jeder bessere Computerh&auml;ndler sollte passende Kabeladapter im
Sortiment haben. Hierzu kommt noch ein 50 poliges Flachbandkabel und
beim Falcon z.B. auch ein fertiges SCSI2-Anschlu&szlig;kabel das
sp&auml;ter die externe SCSI2-Schnittstelle des Rechners mit der
zumeist 50 poligen SCSI-Buchse des externen Laufwerks verbindet.
<br>
</p>
<p>F&uuml;r den internen Einbau und die folgende Verkabelung sind 50
polige Buchsen in &quot;Schneidklemm-Technik&quot; nur Ratsam. Jede
&quot;fliegende&quot; Verkabelung sollte man meiden wie die Pest. Mit
den passenden Buchsen- und Stiftleisten kann man vern&uuml;nftig 50
Pins in einem Arbeitsgang mit einer oder mehreren Buchsen- oder
Buchsenleisten verbinden. Von L&ouml;tsteckern m&ouml;chte ich hier
ebenfalls dringlichst abraten!
<br>
</p>
<p>SCSI-Flachbandkabel besitzen auf der einen Seite eine einzelne
farbige Ader die uns als Markierung des Pin 1 einer jeden Stiftleiste
dient. Das Kabel selber wird so in die Buchsen gelegt da&szlig;
jeweils die farbige Ader auf Pin 1 zu liegen kommt. Ist das geschehen
kann man damit beginnen das jeweilige Buchsenoberteil auf das
Unterteil zu quetschen. Vorteilhaft geschieht das in einem
Schraubstock bei dem die Spannbacken vorher mit weichem Plasik ect.
abgedeckt wurden. Steht ein Schraubstock nicht zur Verf&uuml;gung tut
es zur Not auch eine Kombizange. Hier ist Vorsicht geboten, da man mit
der Zange sehr leicht die Buchsen/Stecker zerbrechen kann. Sind die
Verrieglungsstifte mal abgebrochen ist der Stecker unbrauchbar da er
von selber nicht mehr zubleibt. Alte Pfuscher benutzen dann Klebstoff
um das Oberteil mit dem Unterteil dauerhaft zu verbinden, leider kann
hier nicht garantiert werden, da&szlig; alle Adern des Kabels auch
wirklich mit den Schneidstiften der Buchsenteile in Verbindung stehen.
Der gleiche Fall tritt ein wenn man glaubt die Adern einzeln an die
Pfostenfeldbuchse anl&ouml;ten zu m&uuml;ssen. &Uuml;bertragungsfehler
und Funktionsst&ouml;rungen ect. pp. sind hier somit schon
vorprogrammiert.
<br>
</p>
<p>Wenn mal was auf Anhieb nicht klappen sollte ist deswegen auch
nicht sofort der Falcon bzw. die SCSI-Schnittstelle defekt.
<br>
</p>
<p>Eine &auml;ltere SCSI-Festplatte die vorher &uuml;ber einen
SCSI-Hostadapter an einem ST betrieben wurd l&auml;sst sich wie
beschriebenen hier so auch weiterverwenden. Wurde auf dieser Platte
AHDI, HuSHI, CHBD oder gar schon der <a href="1302.htm" target="UDOcon">HDDriver</a> verwendet wird man die
Patte nicht mal neu einrichten m&uuml;ssen.
<br>
</p>
<p>Betreiben Sie keine nachtr&auml;glich eingebaute SCSI-Platte am
internen Netzteils des Falcons. Die Leistung des Netzteiles reicht idR
nicht aus. Verwenden Sie ein externes neues <a href="0f01.htm" target="UDOcon">Netzteil</a>. Bei einem
Towerumbau k&ouml;nnen solche Ger&auml;te durch das PC-<a href="0f01.htm" target="UDOcon">Netzteil</a>
problemlos versorgt werden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cdromsup.gif" border=0 width="260" height="100"></p><br>
<div align=center><tt> Abbildung 1 - Stecker der Stromversorgung an Festplatten</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Der linke Pin f&uuml;hrt +12 Volt Versorgungsspannung. Der rechte
Pin f&uuml;hrt +5 Volt, die beiden mittleren sind GND. Das ist an
allen diesen Steckern gleich!
</p>
<p>Ein weiterer sehr wichtige Punkt ist die Art der Terminierung des
Ger&auml;tes. Normalerweise befinden sich in jedem SCSI-Drive ab Werk
Abschlu&szlig;widerst&auml;nde die den SCSI-Bus terminieren.
(Abschlie&szlig;en) Sollte Ihr neues Ger&auml;t einziges oder letztes
Laufwerk am SCSI-Bus sein sind die Widerst&auml;nde, der
Terminierungsjumper, so zu belassen, im anderen Fall, wenn das
Laufwerk also an einem Bus eingef&uuml;gt wird an dem sich schon ein
'letztes' SCSI-Device befindet, sind die Terminatoren in jedem Fall zu
entfernen. Ansonsten kommt es zu einer &Uuml;berlastung des
SCSI-Bausteins, KEIN angeschlossenes Laufwerk arbeitet korrekt. Der
SCSI-Controller im Falcon kann dadurch Schaden erleiden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cdterm.gif" border=0 width="480" height="100"></p><br>
<div align=center><tt>Abbildung 2 - Beispiele f&uuml;r eine korrekte
Bus-Terminierung: </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Deutlich also zu sehen das wirklich immer nur das pysikalisch
letzte Laufwerk an einem SCSI-Bus einen Terminator tragen darf. Der
Computer als Host ist ebenfalls immer Terminiert. Beim Falcon z.B sind
diese Terminatoren fest eingel&ouml;tet. Sie befinden sich direkt
hinter der SCSI2-Anschlu&szlig;buchse im Falcon.
<br>Der Falcon ist imausgeschaltetem Zustand nicht terminiert, das
sollten Sie wissen wenn sie mit dem Falcon und einem anderen Computer
einen gemeinsamen SCSI-Bus betreiben wollen. Das klappt nur nach einem
Umbau der Falcon SCSI-Schnittstelle.
<br>
</p>
<p>Schemata f&uuml;r einen SCSI-Bus mit zwei Computern finden Sie in
DOITDRIVE.
<br>
</p>
<p>Ein dritter wichtiger Punkt ist die SCSI-Adresse auf der die
Treiber-Software das SCSI-Laufwerk sp&auml;ter finden soll, es stehen
insgesamt 3 Jumper zur Verf&uuml;gung, die je nach dem wie die Jumper
gesteckt werden eine SCSI-Adresse zwischen 0 und 6 Erzeugen. Das 'wie'
entnimmt man immer am sichersten dem Datenblatt des jeweiligen
Laufwerks, dem <a href="0602.htm" target="UDOcon">Jumper Einmaleins</a>, oder DOITDRIVE.
<br>
</p>
<p>Die Adresse 0 und 1 ist in den meisten F&auml;llen durch eine oder
zwei bereits extern angeschlossene SCSI-Ger&auml;te belegt. 0+1 z.B
bei zwei Platten. Die SCSI-Tools und der <a href="1302.htm" target="UDOcon">HDDriver</a> besitzen ein
komfortables Programm mit dem man die bereits belegten Adressen sehr
schnell herausfinden kann. Beachten Sie bei den SCSI-Tools und beim
<a href="1302.htm" target="UDOcon">HDDriver</a> stets die &quot;Ger&auml;teeinstellungen&quot;, hier
k&ouml;nnen einzelne Lauferksadressen komplett ausmaskiert werden. Die
entsprechenden Platten werden sp&auml;ter auch nicht mehr gefunden.
<br>
</p>
<p>Adress&uuml;berschneidungen sollte man hier tunlichst vermeiden,
es kommt hier schnell zu Datenschrott oder die Laufwerke arbeiten dann
&uuml;berhaupt nicht.
<br>
</p>
<p>Sind diese Punkte alle in Erw&auml;gung gezogen worden kann man
eigentlich damit beginnen die Treibersoftware installieren.
<br>
</p>
<p>Vorher aber sollte man nochmal einen Blick auf die Jumper werfen.
<br>
<br>
</p>
<p><tt>Beispiel f&uuml;r Jumper eines SCSI-Ger&auml;tes.</tt>
<br>
<br>Eine genauere Beschreibung finden Sie im <a href="0602.htm" target="UDOcon">Jumper Einmaleins</a>
<br>
</p>
<dl>
<dt><b>SCSI-ID Jumper 1-3</b></dt><dd> SCSI-ID...JP1...JP2...JP3
<br>-----
<br>ID0.......o.....o.....o
<br>ID1.......#.....o.....o
<br>ID2.......o.....#.....o
<br>ID3.......#.....#.....o
<br>ID4.......o.....o.....#
<br>ID5.......#.....o.....#
<br>ID6.......o.....#.....#
<br>ID7.......#.....#.....#
<br>
<br>&nbsp;
<br>Jumper-#-close Jumper-o-open
<br>&nbsp;
<dt><b>Parity Jumper 4</b></dt><dd> Jumper OPEN : Das Laufwerk f&uuml;hrt keinen Paritycheck durch.
<br>Jumper CLOSE: Paritycheck eingeschaltet. Spielt beim Falcon keine
Rolle da hier ein richtiger SCSI-Host vorhanden ist.
<br>Das Paritybit wird vom SCSI-Chip im F030 generiert.
<br>(Manche Hostadapter vom ST her tun das nicht!)
<br>
<br>&nbsp;
<dt><b>TERM Jumper 5</b></dt><dd> Jumper CLOSE: Termpower ist eingeschaltet. (Default ab Werk!)
<br>OPEN : Termpower ist deaktiviert.
<br>Die +5 Volt werden &uuml;ber einen Widerstand und eine Schutzdiode
auf die TRMPWR-Leitung des SCSI-Bus gelegt.
<br>
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Das SCSI-Kabel (Flachbandkabel) wird immer so auf die Buchse des
Drives gesteckt das die farbige Ader auf Pin 1 zu liegen kommt. Pin 1
befindet sich im &uuml;brigen bei allen mir bekannten SCSI-Laufwerken
immer in der N&auml;he des Stromsteckers.
<br>
<br>
</p>
<p><tt>Belegung der SCSI2-Buchse am Falcon</tt>
<br>Die Pinbelegung entspricht der &uuml;blichen MiniDIN Belegung
<br>
</p>
<p>
<br>
</p>
<div align=center><table border=1 frame=box>
<caption align=bottom>Tabelle 49: Falcon SCSI Port</caption>
<tr>
  <td align=left valign=top>Pin</td>
  <td align=left valign=top>Signalbeschreibung</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>Pin 50</td>
  <td align=left valign=top>IO - Signal</td>
  <td align=left valign=top>Pin 49</td>
  <td align=left valign=top>REQ - Request</td>
</tr>
<tr>
  <td align=left valign=top>Pin 48</td>
  <td align=left valign=top>Code/Data Signal</td>
  <td align=left valign=top>Pin 47</td>
  <td align=left valign=top>SEL - Select</td>
</tr>
<tr>
  <td align=left valign=top>Pin 46</td>
  <td align=left valign=top>MSG - Message</td>
  <td align=left valign=top>Pin 45</td>
  <td align=left valign=top>RST - Reset</td>
</tr>
<tr>
  <td align=left valign=top>Pin 44</td>
  <td align=left valign=top>SACK - Acknowledge</td>
  <td align=left valign=top>Pin 43</td>
  <td align=left valign=top>BSY - Busy</td>
</tr>
<tr>
  <td align=left valign=top>Pin 42</td>
  <td align=left valign=top>GND</td>
  <td align=left valign=top>Pin 41</td>
  <td align=left valign=top>ATN</td>
</tr>
<tr>
  <td align=left valign=top>Pin 40</td>
  <td align=left valign=top>GND</td>
  <td align=left valign=top>Pin 39</td>
  <td align=left valign=top>Not Connected</td>
</tr>
<tr>
  <td align=left valign=top>Pin 38</td>
  <td align=left valign=top>+5 Volt (1Amp)(TermPwr)</td>
  <td align=left valign=top>Pin 37</td>
  <td align=left valign=top>Not Connected</td>
</tr>
<tr>
  <td align=left valign=top>Pin 36</td>
  <td align=left valign=top>GND</td>
  <td align=left valign=top>Pin 35</td>
  <td align=left valign=top>GND</td>
</tr>
<tr>
  <td align=left valign=top>Pin 34</td>
  <td align=left valign=top>PARITY Signal</td>
  <td align=left valign=top>Pin 33</td>
  <td align=left valign=top>SCSI 7 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 32</td>
  <td align=left valign=top>SCSI 6 - Signal</td>
  <td align=left valign=top>Pin 31</td>
  <td align=left valign=top>SCSI 5 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 30</td>
  <td align=left valign=top>SCSI 4 - Signal</td>
  <td align=left valign=top>Pin 29</td>
  <td align=left valign=top>SCSI 3 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 28</td>
  <td align=left valign=top>SCSI 2 - Signal</td>
  <td align=left valign=top>Pin 27</td>
  <td align=left valign=top>SCSI 1 - Signal</td>
</tr>
<tr>
  <td align=left valign=top>Pin 26</td>
  <td align=left valign=top>SCSI 0 - Signal</td>
  <td align=left valign=top>Pin 25-15</td>
  <td align=left valign=top>GND</td>
</tr>
<tr>
  <td align=left valign=top>Pin 14-12</td>
  <td align=left valign=top>NC - Not used</td>
  <td align=left valign=top>Pin 11</td>
  <td align=left valign=top>Vcc - Resistor R65 with 10KOhm</td>
</tr>
<tr>
  <td align=left valign=top>Pin 10-1</td>
  <td align=left valign=top>GND - Signal Ground</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
</table></div>

<p>
<br>
<br>Terminierung im Falcon:
<br><b>220/330Ohm Widerstandsarrays.</b>
<br>&Uuml;bersicht welche Signalleitung im Falcon abgeschlossen ist.
<br>Es gibt 3 Busterminatoren: (Widerstandsarrays!)
</p>
<dl>
<dt><b>Terminator P1:</b></dt><dd> &nbsp;
<br>
<br>&nbsp;
<br>1 = Vcc
<br>2 = SEL
<br>3 = BSY
<br>4 = SACK
<br>5 = ATN
<br>6 = RST
<br>7 = REQ
<br>8 = GND
<br>
<br>&nbsp;
<dt><b>Terminator P2:</b></dt><dd> &nbsp;
<br>
<br>&nbsp;
<br>1 = Vcc
<br>2 = CD
<br>3 = MSG
<br>4 = SCSI1
<br>5 = SCSI0
<br>6 = IO
<br>7 = SCSI2
<br>8 = GND
<br>
<br>&nbsp;
<dt><b>Terminator P3:</b></dt><dd> &nbsp;
<br>
<br>&nbsp;
<br>1 = Vcc
<br>2 = SCSI7
<br>3 = SCSI6
<br>4 = SCSI5
<br>5 = SCSI4
<br>6 = SCSI3
<br>7 = P
<br>8 = GND
<br>
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Die SCSI-Schaltung im Falcon k&ouml;nnen Sie dem Teilschaltplan,
Abbildung 4, entnehmen.
<br>
</p>
<p>
<br>
<br><b> <a href="0308.htm" target="UDOcon">Fehlersuche</a> und Reparatur </b>
<br>
</p>
<p>Die Terminatoren im Falcon sind gel&ouml;tet und sollten
eigentlich nie Entfernt werden! Gibt es hier Unterbrechungen der
Leiterbahnen oder liegt hier ein defekt vor ist ganz sicher kein
korrekter SCSI-Betrieb m&ouml;glich. Kontrollieren Sie den korrekten
Sitz des SCSI-Chips, sofern dieser in einem PLCC-Sockel sitzt,
da&szlig; ist die PLCC-Fassung welche Sie direkt hinter der
SCSI2-Anschlu&szlig;buchse in ihren Falcon finden. Nehmen Sie diesen
Chip aus dem Sockel und reinigen sie die Kontakte am Chip.
M&ouml;glicherweise hat sich hier ein leicher Korrosionsfilm gebildet
der u.A auch &Uuml;bergangswiderst&auml;nde mit sich bringt.
Abweichungen in den Signalpegeln w&auml;ren eine Folge davon.
</p>
<p>Wenn Sie den Rechner schon so weit zerlegt haben, es schadet
nichts die einzelnen Widerst&auml;nde der drei Terminator-Arrays mal
mit einem Ohmmeter zu untersuchen. Unterschiedliche Widerstandswerte
in den Arrays ergeben eine nette St&ouml;rungsquelle. Das kann bis zum
nicht Erkennen von allen externen Ger&auml;ten f&uuml;hren.
<br>
</p>
<p>Die interne 'Verschaltung' eines 330/220 Ohm Arrays finden Sie
weiter oben. Bedenken sie bei Nachmessen mit einem Ohmmeter das sie
immer zwei Widerst&auml;nde zu messen haben! Beide sollte nur Minimal
vom angegebenen Wert abweichen.
<br>
</p>
<p>Der PLCC Chipsockel besitzt auf dem Rand Enden der Kontaktfedern,
man kann hier so jeden einzeln Pin des Chips auf Kontakt mit dem
Sockel leicht pr&uuml;fen. Auch l&auml;sst sich auf genau diesem Weg
jeder einzelne Pin zu den Widerstandarrays und der
SCSI2-Anschlu&szlig;buchse austesten.
<br>
</p>
<p>Dazu dient ein ganz einfaches Multimeter.
<br>
</p>
<p>Pin 1 des SCSI-Chips, dessen Markierung zeigt in Richtung der
SCSI2-Anschlu&szlig;buchse an der Rechnerr&uuml;ckwand. Die
Pinbelegung und die Signalbeschreibung finden Sie unter Pin oder
weiter oben in diesem Artikel, auch Abbildung 4 sollten sie beachten.
<br>
</p>
<p>Sollten Sie den Chip aus dem Sockel holen wollen sind Sie gut
beraten sich das passende Werkzeug dazu vorher zu beschaffen. Hierzu
gibt es passende PLCC-Zangen. Es geht auch mit zwei
Uhrmacher-Schraubendrehern. Lassen Sie sich hier an dieser Stelle
gesagt sein das der SCSI- und der FPU-Sockel in den Falcon Computern
aus einem derart spr&ouml;den Material bestehen das sie schon bei
scharfen hinsehen br&ouml;ckeln. Eine Zange kostet Geld, das aus und
einl&ouml;ten eines PLCC-Sockels dauert l&auml;nger!!
</p>
<p>Hier kam mal ein Falcon an dessen SCSI PLCC-Sockel mit einem
Kabelbinder rundum zusammengehalten wurde. Der Besitzer
&quot;dachte&quot; das wohl alle Pin so anliegen m&uuml;ssen und
wunderte sich das er keinen SCSI Zugriff hatte. Leute, so geht das
nicht.
<br>
</p>
<p>Ist ein Sockel vorhanden und ist dieser Besch&auml;digt kommt man
um einen Austausch nicht drumherum. Geflickte Sockel halten keinerlei
Ersch&uuml;tterung stand. Der Zustand des SCSI-Betriebs kann sich so
von einer Sekunde zur anderen drastisch &auml;ndern. Datenverluste
garantiert nicht ausgeschlossen.
<br>
</p>
<p>Die L&ouml;tpins des PLCC-Carriers befinden sich alle unter dem
Sockel. Der Sockel mu&szlig; durch seine Mitten&ouml;ffnung
gel&ouml;tet werden. Die L&ouml;tpads auf der Platine m&uuml;ssen dazu
Sauber und glatt sein, befinden sich auf einzelnen Pads H&uuml;gel aus
L&ouml;tzinn ist so ein neuer Sockel nicht korrekt aufl&ouml;tbar.
Neue Sockel sollten genau positioniert werden und mit einem winzigen
Tr&ouml;pfchen Kleber fixiert werden. Verrutscht der Sockel nicht mehr
und die Pin liegen genau auf den Pads sollte der Sockel in einem
Rutsch verl&ouml;tet werden. Beachten Sie dabei die SMD-Bauteile in
unmittelbarer Nachbarschaft!
<br>
</p>
<p>Zum einwandfreien Betrieb des SCSI-Bus im Falcon m&uuml;ssen die
Dioden D5 und D6 in Ordnung sein. Ebenso die Microsicherung F1. Die
Sicherung darf maximal 1Ampere gro&szlig; sein. Das gen&uuml;gt immer
und dient dem Schutz des Bus. Die Sicherung versorgt Pin 38, die
TermPower-Leitung des SCSI Bus, mit +5V. Es macht nichts wenn mehrere
angeschlossende Ger&auml;te die TermPwr Leitung auch mit +5V
versorgen. Es stellt nur sicher das alle Terminatoren am Bus korrekt
versorgt werden. Alle genannten Bauteile befinden sich in
unmittelbarer N&auml;he des eigentlichen SCSI-Chips.
</p>
<p>Die beiden Dioden sind normale 1N4001 Dioden in kleiner Bauform.
<br>
</p>
<p>Sind alle Leitungswege in Ordnung, alle Dioden und Sicherungen
ebenso werden Sie in den meisten F&auml;llen leider einen neuen
SCSI-Chip ben&ouml;tigen. Meinen Erfahrungen nach verabschiedet sich
der SCSI-Chip aus freien St&uuml;cken &auml;usserst selten, hat er
aber das Zeitliche gesegnet, liegt in den meisten F&auml;llen immer
ein defekt an der Terminierung, der SCSI Verkabelung oder einem
Ger&auml;t vor. Ger&auml;tedefekte sind heute eigentlich auch relativ
selten und beschr&auml;nken sich aller Regel nach darauf das dieses
entsprechende Ger&auml;t einfach nicht mehr reagiert. Was also
&uuml;brigbleibt mu&szlig; logischerweise die Fehlerquelle enthalten.
Das ist die Termination, der Ger&auml;teanschlu&szlig; sowie die
interne Termination im Falcon.
<br>
</p>
<p>Man kann an diesem Bus relativ schlecht Messen, es tut sich ja
erst was wenn dieser Bus aktiv ist. Es gibt externe SCSI-Tester als
Zwischenstecker die man Testweise anschliessen kann wenn sich eben
nichts mehr r&uuml;hrt. Dauerhaft sollte so ein Teil allerdings an
keinem aktiven Bus verbleiben. Wenn Sie ihr Multimeter bem&uuml;hen
f&uuml;hren die Datenleitungen ca. -+3V, das schwankt aber und hat
keine definitive Aussage! Sind alle Datenleitungen auf 0V kann man
daraus schliessen das der Chip tot ist.
<br>
</p>
<p>
<br><b> Chipansteuerung vom Rechner aus </b>
<br>
</p>
<p>Der SCSI Chip selber, es mu&szlig; &uuml;brigens f&uuml;r den
Falcon zwingend ein L53C80JC2 sein, liegt mit den Pin 14-16, A0-A2 am
Adressbus des Falcon. Pin 13 READY, wird am Atari Falcon nicht benutzt
und ist offen. Pin 10 EOP, ist mit +5Vcc Verbunden. HDRQ finden Sie an
Pin 9, DACK an Pin 11, an Pin 17, 18 und 19 finden Sie in der
Reihenfolge die Steuersignale CS, Chipselekt, sowie IOW und IOR. HDINT
vom COMBEL ist direkt mit Pin 8 IRQ verbunden. Pin 7 ist direkt mit
der allgemeinen RESET Leitung verbunden so das der 53C80 bei jedem
Reset in einen definierten Ausgangszustand versetzt wird. Pin 20-22
und Pin 24-28 liegen auf dem Datenbus, die Reihenfolge ist so das Pin
20 an der Datenleitung D7 angeschlossen ist. Der 53C80 liest Daten vom
Bus wenn CS aktiv ist und Pin 9 (HDRQ) toggelt. Ob gelesen oder
geschrieben wird ist an den Pin 19 (IOR) und Pin 18 (IOW)
m&ouml;glich.
<br>
</p>
<p>Sollten sie mit einer softwaregesteuerten Aktion an Pin 4, das ist
BUSY, keine Reaktion hervorufen k&ouml;nnen, sollten Sie davon
ausgehen das Sie einen neuen Chip ben&ouml;tigen.
<br>
</p>
<p>Sollte ihr Falcon auch auf dem Diskettenlaufwerk eine Lese- u.
Schreibaktion ausf&uuml;hren liegt ein anderer, schwererer Fehler in
ihrem Falcon vor.
<br>
</p>
<p>Ein Timingdiagram kann hier nicht gegeben werden.
<br>
</p>
<p>Bezugsquelle f&uuml;r <a href="030805.htm" target="UDOcon">Ersatzteile</a> finden Sie unter <a href="1604.htm" target="UDOcon">H&auml;ndler</a>
oder bei der Fa. C-Lab.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/scsiterm.gif" border=0 width="300" height="110"></p><br>
<div align=center><tt>Abbildung 3 - Termination im Falcon (Widerstandsarrays)</tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br><tt> Probleme mit der Terminierung im Falcon </tt>
<br>
</p>
<p>Bei neueren C-LAB MK-Falcons befindet sich an der Stelle der
internen Terminatoren der Anschlu&szlig; f&uuml;r interne
SCSI-Ger&auml;te. Hiebei mu&szlig; die Terminierung dann auf bzw. am
diesem internen SCSI-Drive stattfinden!
</p>
<p>Ist das der Fall, sind Sie gut beraten auf den Anschlu&szlig;
externer Ger&auml;te an der noch vorhandenen SCSI2 Buchse zu
unterlassen. Machen sie das dennoch f&uuml;gen sie ihrem Falcon den
gef&uuml;rchteten &quot;Y&quot; SCSI Bus zu der garantiert irgendwann
in einer &Uuml;berlastung des selben endet.
<br>
</p>
<p>Beachten Sie bitte das dann noch immer am externen SCSI Port die
M&ouml;glichkeit besteht externe SCSI-Ger&auml;te anzuschliessen,
vermeiden sie das soweit es geht, sofern Sie so einen Falcon besitzen.
Nach der SCSI-Norm ist, soweit Sie dort externe Ger&auml;te
hinzuf&uuml;gen, eine normgerechte Verkabelung eines SCSI-Bus nicht
mehr gegeben. Besch&auml;digungen am SCSI-Controller sind zu erwarten.
<br>
</p>
<p>
<br>
<br><b> Spannungsversorgung der Terminatorarrays </b>
<br>
</p>
<p>Vcc der Terminatoren liegt &uuml;ber eine Diode 1N4001 an +5 Volt.
Pin 38 der SCSI2-Buchse liegt &uuml;ber eine Diode 1N4001 und der
Microfuse F1 an +5 Volt. Diese Sicherung h&auml;lt max. 1 Amp aus und
kann leider nur durch ausl&ouml;ten Ersetzt werden. Pin 11 der
SCSI2-Buchse liegt &uuml;ber einen Widerstand von 10KOhm an +5Volt.
Sog. Microfuses kann man in verschiedenen Bauformen im
einschl&auml;gigen Fachhandel beziehen. Im Falcon waren das bisher
axiale Typen, keine stehenden.
<br>
</p>
<p>Siehe auch <a href="0c09.htm" target="UDOcon">Romport</a>, Sicherung F2
<br>
</p>
<p>Wenn Sie immer, trotz korrektem <a href="0e.htm" target="UDOcon">Clockpatch</a>, Probleme mit ihrer
SCSI-Schnittstelle am Atari Falcon haben sollten Sie sich mal die
internen Terminatoren der SCSI-Schnittstelle ansehen, ggf. auch
Ausl&ouml;ten und nachmessen.
</p>
<p>Die einzelnen Widerst&auml;nde der Arrays k&ouml;nnen je nach
Serie stark abweichende Werte auf den einzelnen Anschl&uuml;ssen
haben. So kann der Chip nicht korrekt arbeiten. Ist das der Fall,
sollten Sie diese Arrays in jedem Fall durch neue Terminatorarrays mit
gleichem Widerstandswert ersetzen.
</p>
<p>Die Arrays sollten minimale Toleranzen haben.
<br>
</p>
<p>Sie finden die 3 Widerstandsarrays direkt hinter der
SCSI-Anschlu&szlig;buchse und dem SCSI-Chip, die genaue Signalbelegung
finden Sie weiter oben in diesem Artikel.
<br>
</p>
<p>Beitrag von: Benjamin_Kirchheim@iz.maus.de
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/scsi.gif" border=0 width="470" height="385"></p><br>
<div align=center><tt>Abbildung 4 - SCSI-Wire <a href="0302.htm" target="UDOcon">Falcon F030</a></tt>
</div>
<p>
<br>
<br>
</p>
<p>Viele Pfostenfeldstecker haben an der einen Seite eine Kerbe so,
da&szlig; man den Stecker nur in einer Richtung einstecken kann. Bei
diesem Stecker sollte man vorher, bevor das Flachbandkabel gequetscht
wird, aufpassen wie rum der Stecker dann sp&auml;ter auf das <a href="0701.htm" target="UDOcon">CD-ROM</a>
passt. (Farbige Ader beachten!)
<br>
</p>
<p>Nachdem das Laufwerk nun mit dem SCSI-BUS, und/oder &uuml;ber das
SCSI2-Kabel (extern) mit dem restlichen Bus verbunden ist wird der Bus
nun mit dem Falcon verbunden (SCSI2 extern). Der Falcon ist hierbei
nat&uuml;rlich ausgeschaltet! (Wie eigentlich bei allen
Anschlu&szlig;arbeiten)
<br>
</p>
<p>Das <a href="0f01.htm" target="UDOcon">Netzteil</a> sollte Ordnungsgem&auml;&szlig; angeschlossen worden
sein, (Netzsteckdose, VDE-Verschriften, Schutzleiter ect.pp) man kann
es leider nur immer wieder sagen. Im Tower ist das einfacher da hier
ein gekapseltes PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> zum Einsatz kommen wird, der Selbstbauer
kommt hier erst gar nicht mit der gef&auml;hrlichen Netzspannung in
Ber&uuml;hrung.
<br>
</p>
<p>Die SCSI-Adresse ist korrekt eingestellt, der SCSI-Bus angesteckt,
die Stromversorgung ist angeschlossen? Dann kann man jetzt endlich zu
einem ersten Test schreiten:
<br>
</p>
<p>Nach dem Einschalten sollte der Rechner (z.B Falcon) wie gewohnt
booten. Man kann die Meldungen des HD-Treibers w&auml;rend dem Booten
beobachten. Allerdings geht das auch recht schnell. Neue Laufwerke
sollten sich hierbei schon mit ihrer ID und der Typenbezeichnung
melden. Nach dem Booten k&ouml;nnen Sie unter &quot;Laufwerke
anmelden&quot; im <a href="030505.htm" target="UDOcon">Desktop</a> alle Partitionen die sie vorher eingerichtet
haben auf Ihrem <a href="030505.htm" target="UDOcon">Desktop</a> installieren. Alle Laufwerkicons sollten sich
&ouml;ffen lassen. Jedes neue Drive sollte sich sofort Fehlerfrei
beschreiben lassen.
</p>
<p>Meldet sich ein Laufwerk mit zerst&uuml;ckelter Typenbezeichnung
d&uuml;rfen Sie sicher sein das mit dem SCSI-Bus etwas nicht in
Ordnung ist. Die Erfahrung zeigt das es meistens an einer fehlenden,
falschen Terminierung des Bus liegt.
<br>
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p><tt> Terminierung im Falcon MKII </tt>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p>If it is a MKII, then the termination on the motherboard has been
removed in order to fit the internal SCSI cabling. If you have removed
the drive but not replaced the terminator packs onto the board, then
you will have to do so, or have it done by a service tech. There are
two or three 220 OHM single in line resistor packs, I think 8 pin. The
header connection has to be desoldered and the packs resoldered in.
<br>
</p>
<p>Our tech department has this info if you need it, or you can send
the machine to us for Certified C-Lab Service.
</p>
<p>All the best,
<br>Chris @ Computer Direct
<br>
</p>
<ul>
<li> <a href="http://compdirect.com" target="_top">Computer Direct Homepage</a>
<br>&nbsp;
</li>
</ul>
<p>
<br>
<br><b> Some words about ID-Jumpers </b>
<br>
</p>
<p>As ID-Jumper you found 3 Jumpers on any SCSI Device A simple
combination of these jumpers gave a static SCSI adress beetween 0-7 to
any SCSI device.
<br>
</p>
<pre>
      Jumper No  Counter
      ------------------
      Jumper 0 = 1
      Jumper 1 = 2
      Jumper 2 = 3

</pre>
<p>We can switch Adresses beetween 0 and 7
<br>
</p>
<p>Example : Jumper 1 = ON and Jumper 2 = ON results: 2+3 = SCSI ID5
<br>Example : Jumper 0 = ON results: 1, all other are OFF = SCSI ID1
<br>
</p>
<p>Some external SCSI Devices have DIP switches outside.. so you can
use any adress beetween 0 and 7 simple by use the DIP switch backside
of SCSI case.
<br>
</p>
<p>
<br>
<br><b> SCSI Platten werden nicht erkannt </b>
<br>
</p>
<p>Das Problem kann die Arbitrierung sein.
<br>
</p>
<p>Die Platte (Target) m&Uuml;chte wissen, wer sie anspricht
(Initiator), in diesem Fall der Atari.
<br>
</p>
<p>Ein Link97 Hostadapter macht das von sich aus und
unabh&egrave;ngig vom verwendeten Treiber - er verwendet daf&#166;r
selbst die Initiator-ID (SCSI-ID) 7. Von SCSI-Platten, die auf dieses
Verfahren bestehen, kann nicht gebootet werden. Das ist bei allen
Atari Computern so.
<br>
</p>
<p>Das ungepatchte Atari TOS rechnet nicht mit solchen Platten - so
auch Falcon und TT. Versucht man es trotzdem, kann dazu es dazu
f&#166;hren, das der ganze SCSI-Bus blockiert.
<br>
</p>
<p>TT und Falcon sind Parity-tauglich. Was die Terminierung angeht,
so ist der Falcon ein wenig pingeliger als ein TT, das beschriebene
Verhalten spricht aber gegen ein Terminierungsproblem - das w&#166;rde
sich eher beim Datentransfer durch Transferfehler &egrave;ussern.
<br>
</p>
<p>AHDI unterst&#166;tzt -keine- Bus-Arbitrierung, HDDRIVER hingegen
schon. Hushi zwar auch, k&Uuml;nnte aber je nach Version auch nur 1GB
verwalten - 6.50 ist eine solche Version, 6.10 und weitere vor Version
6.50 haben dieses Problem nicht.
<br>
</p>
<p>Im <a href="040101.htm" target="UDOcon">NVRAM</a>, dem Batteriegepufferten nichtfl&#166;chtigem Ram in der
Uhr sind f&#166;r die Bus-Arbitrierung zwei Informationen abgelegt,
die jedoch nur von Treibern ber&#166;cksichtigt werden, die
Bus-Arbitrierung unterst&#166;tzen. Einige Treiberprogrammierer haben
sich darauf geeinigt.
<br>
</p>
<p>Zum einen gibt es ein Flag, mit dem bestimmt wird, ob mit
Bus-Arbitrierung gearbeitet werden soll (u.a. auch f&#166;r die
meisten Brenner n&Uuml;tig) und daneben nat&#166;rlich die SCSI-ID,
die der Rechner (TT, Falcon) selbst benutzen soll - sie ist nicht auf
ID 7 festgelegt, darf aber mit keinem existierenden SCSI-Ger&egrave;t
kollidieren.
<br>
</p>
<p>Da beim Falcon idR von einer <a href="060402.htm" target="UDOcon">IDE-Platte</a> gebootet wird, kann ein
Treiber wie HUSHI, HDDRIVER oder auch der speziell angepasste AHDI von
Soundpool (6.06t o.&egrave;.) eingesetzt werden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li>12.8.1 <a href="0c0801.htm" target="UDOcon">SCSI TermPwr umr&uuml;sten</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c.htm" target="UDOcon"><img src="udo_up.gif" alt="Stecker und Schnittstellen am Falcon F030" border=0 width="24" height="24"></a>
<a href="0c0703.htm" target="UDOcon"><img src="udo_lf.gif" alt="Serial RS232 Port" border=0 width="24" height="24"></a>
<a href="0c0801.htm" target="UDOcon"><img src="udo_rg.gif" alt="SCSI TermPwr umr&uuml;sten" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
