<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Romportbuffer
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c09.htm" target="UDOcon"><img src="udo_up.gif" alt="Romport" border=0 width="24" height="24"></a>
<a href="0c09.htm" target="UDOcon"><img src="udo_lf.gif" alt="Romport" border=0 width="24" height="24"></a>
<a href="0c0902.htm" target="UDOcon"><img src="udo_rg.gif" alt="Epromkarten am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Romportbuffer">12.9.1 Romportbuffer</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<div align=center><tt> ROMPORT-Expander/Buffer f&uuml;r alle Atari-Computer mit ST
kompatiblem ROMPORT </tt>
<br>
</div>
<p><tt>Der Romportbuffer aus der c't</tt>
</p>
<p>Wer seinen Atari am <a href="0c09.htm" target="UDOcon">Romport</a> erweitern m&ouml;chte, sollte sich im
klaren sein das dieser Port mit abstand der teuerste Port von allen
ist. Eine Bastelei kann unter umst&auml;nden den ganzen Rechner
zerst&ouml;ren, die Hersteller von Computern sparen eben auch manchmal
an der falschen Stelle.
</p>
<p>Hier w&auml;hre es angebracht gewesen s&auml;mtliche Leitungen
dieses Ports &uuml;ber Treiberbausteine der Au&szlig;enwelt zur
verf&uuml;gung zu stellen. So da&szlig; eben der empfindliche CPU-Bus
gesch&uuml;tzt wird, auch eine &uuml;berlastung dieses Ports durch die
Entnahme gr&ouml;sserer Signalleistungen wird mit
Rechnerabst&uuml;rtzen oder auch mit Hardwaredefekten geahndet.
<br>
</p>
<p>Man h&auml;tte ja auch aus Sinclair oder aus C64 Zeiten etwas
lernen k&ouml;nnen.
<br>
</p>
<p>Wer also unbedingt am <a href="0c09.htm" target="UDOcon">Romport</a> 'bauen' will sollte sich den
Romportbuffer aus der c't besorgen.
</p>
<p align=center><img src="image/rombuff1.gif" border=0 width="170" height="129"></p><br>
<div align=center><tt>Abbildung 1 - c't Romportbuffer</tt>
</div>
<p>Wie klein diese Bufferplatine ist l&auml;sst sich erahnen wenn man
sieht das diese Platine nicht breiter als der Anschlu&szlig;stecker
ist.
<br>
</p>
<p align=center><img src="image/rombuff2.gif" border=0 width="170" height="129"></p><br>
<p align=center><img src="image/rombuff3.gif" border=0 width="170" height="129"></p><br>
<div align=center><tt>Abbildung 2 - Romportbuffer, stehend auf dem Stecker</tt>
</div>
<p>Diese wirklich sehr kleine Erweiterung passt sogar fast unsichtbar
in die Geh&auml;useaussparung des Originalgeh&auml;uses. Erreicht
wurde diese Kompaktheit durch Verwendung einer doppelseitigen Platine
und einer vollst&auml;ndigen SMD-Best&uuml;ckung.
<br>
</p>
<p>Sichergestellt wird dadurch das s&auml;mtliche Address- sowie
Datenleitungen gepuffert werden. Nicht aber die +5V Versorgung! Diese
ist lediglich im Falcon &uuml;ber die Sicherung F2 mit 0.5-1 Amp
gesch&uuml;tzt!
</p>
<p><tt>Die Platine gab es bei Issendorf Computer 3 Hannover 1
0551/3504500 oder direkt bei E_Media (c't) </tt>
</p>
<p>Die Lieferzeit war sehr kurz (UPS), ca.2 Tage. Man konnte die
Platine fertig bekommen oder aber als Bausatz. Die Bausatzl&ouml;sung
ist allerdings wirklich nur den Vollprofis zu empfehlen, wer
l&ouml;tet schon gerne SMD-Bausteine mit der Hand ?? Die
Best&uuml;ckung ist noch relativ einfach, da die Platine mit einem
L&ouml;tstoplack behandelt ist, sicherlich wird man bei der
Best&uuml;ckung mit den Kondensatoren anfangen. Das ist eine gut
&Uuml;bung mit ausserdem nur zwei L&ouml;tstellen pro Bauteil. Die
Treiberbausteine (HCT 245) sollte man sich genau betrachten, durch den
Transport k&ouml;nnten sich die winzigen Beinchen etwas verbogen
haben. Nach der Kontrolle mit einer feinen Pinzette kann man
eigentlich mit der L&ouml;terei beginnen. Man sollte einen wirklich
sehr feinen L&ouml;tkolben benutzen, eine Leistung von 5 - 8 Watt und
eine sehr feine Spitze sind aussreichend.
</p>
<p>Die Bausteine kann man zur besseren Arretierung auf der Platine
mit L&ouml;tpaste (Kein S&auml;urehaltiges L&ouml;tfett verwenden !!!)
aufkleben. diese Paste gibt es extra f&uuml;r SMD-Bausteine. Ausserdem
sorgt diese Paste daf&uuml;r das das L&ouml;tzinn nur dahin l&auml;uft
wo es auch gebraucht wird. Vieleicht l&ouml;tet man an dem
entsprechenden Bauteil erst mal nur ein Bein fest um dann noch mal den
Sitz des Bauteiles zu kontrollieren.
</p>
<p>Die L&ouml;tungen m&uuml;ssen absolut schnell und sauber
ausgef&uuml;hrt werden. Sollte das L&ouml;tzinn zwischen die Beinchen
laufen kann man die Platine am besten gleich aussondern. Nicht das
L&ouml;tzinn wegblasen! Mit einer L&ouml;tpumpe kann man versuchen der
L&ouml;tzinn wegzusaugen und mit einen guten Lupe sp&auml;ter
Kontrollieren.
<br>
</p>
<p>Das anl&ouml;ten der Stiftleiste sollte kein Problem darstellen,
hier sind die L&ouml;tstellen die gr&ouml;ssten auf der ganzen
Platine.
<br>
</p>
<p>Mittlerweile gibt es auch Experimentierplatinen die dem
Rasterma&szlig; des <a href="0c09.htm" target="UDOcon">Romport</a>'s entsprechen.
(V&ouml;lkner-/B&uuml;hler-Elektronik) Man k&ouml;nnte sich hier auch
diese Schaltung selber mit 'normalen' Bausteinen aufbauen, sicherlich
ist dann alles etwas gr&ouml;sser und ragt aus der
Geh&auml;useaussparung weit raus. Wer aber sowieso seinen Rechner in
ein PC oder Towergeh&auml;use umgebaut hat dem d&uuml;rfte das Egal
sein.
<br>
</p>
<p>Zu dem Romportbuffer geh&ouml;rt noch ein Expander der gleich zwei
Romports zur Verf&uuml;gung stellt. (Gleiche Lieferfirma) Diese Ports
k&ouml;nnen manuell &uuml;ber einen Taster oder auch mit einem
Software Basic-Einzeiler umgeschaltet werden. Auch ist es so
m&ouml;glich den Expander v&ouml;llig unsichtbar f&uuml;r den Rechner
abzuschalten. Welcher der beiden Ports gerade Aktiv ist wird mit
jeweils einer Leuchtdiode angezeigt. Die Leuchtdioden sollte man schon
sichtbar anbringen.
<br>
</p>
<p align=center><img src="image/romexbuf.gif" border=0 width="170" height="129"></p><br>
<div align=center><tt>Abbildung 3 - Buffer und Romportexpander</tt>
</div>
<p>Wenn der Expander eingebaut wird kann man den Taster mit zwei
Dr&auml;hten verl&auml;ngern, so da&szlig; er von ausserhalb des
Rechnergeh&auml;uses leicht bedient werden kann.
<br>(Siehe Tower)
<br>
</p>
<p>Sollte jemand mehr als zwei Ports ben&ouml;tigen ist eine
Erweiterung mit einem weiteren Expander vorgesehen, es stehen dann
vier Romslots zur freien Verf&uuml;gung. An dem Expander kann jede
g&auml;ngige Romporterweiterung betrieben werden ohne das st&auml;ndig
Umgesteckt werden m&uuml;sste. Mit der Elektronisch gel&ouml;sten
Umschaltung ist immer nur die gerade selektierte Karte f&uuml;r den
Rechner 'vorhanden', die anderen sind Ausgeblendet und somit
Unsichtbar f&uuml;r den Rechner. Sicherlich ist das f&uuml;r die
Verwendung von Epromkarten sehr brauchbar da man eben mal schnell auf
die zweite Karte umschalten kann. Vorher musste man dazu eben den
Rechner abschalten und die entsprechenden Karten oder Dongles wechseln
um dann erneut zu booten. Es soll nicht verschwiegen werden das es
Karten gibt die nur nach einen neuerlichen Bootvorgang am Falcon
erkannt werden!
<br>
</p>
<p align=center><img src="image/romexp1.gif" border=0 width="170" height="129"></p><br>
<div align=center><tt>Abbildung 4 - Port A des Romportexpanders</tt>
</div>
<p>Die Verbindungsleitung (40 Polig) zwischen dem Buffer und dem
Expander kann man sich &uuml;blicherweise mit Falchbandkabel selbst
Herstellen. Ben&ouml;tigt wird 40 poliges Flachbandkabel und die
erforderlichen Stecker zum Aufquetschen (Schneidklemmtechnik) Da die
Platine des Buffers sowie die Platine des Expanders aussreichend
beschriftet wurden kann ja jeder selber darauf achten das die
Verbindungsleitung richtig eingesteckt wird.
<br>
</p>
<p align=center><img src="image/romexp2.gif" border=0 width="170" height="129"></p><br>
<div align=center><tt>Abbildung 5 - Romportbuffer mit Flachbandkabel zum Buffer</tt>
</div>
<p>Normalerweise kann die l&auml;nge der Leitung bis zu 1 Meter
betragen, da aber die meisten sicherlich diese L&ouml;sung innerhalb
eines Geh&auml;useumbau benutzen macht man das Kabel am besten nur so
lange wie es eben gerade reicht. Je l&auml;nger das Kabel desto
gr&ouml;&szlig;er die St&ouml;ranf&auml;lligkeit. Selbst mit Buffer
verl&auml;ngert man hier ja den gesammten Rechnerbus.
<br>
</p>
<p>Wenn der Expander an einem Originalgeh&auml;use Verwendung findet
sollte man sich ein sch&ouml;nes Geh&auml;use f&uuml;r den Expander
besorgen. Es ist einfach sicherer solche Dinge dann in ein
Geh&auml;use einzubauen. Erstens sieht es besser aus, zweitens kann
nichts draufallen und es fingert keiner daran herrum.
<br>
</p>
<p>Zu Beachten w&auml;hre noch das die Platine des Buffers nicht
versehentlich falsch herrum in den Rechner eingesteckt wird, die Seite
mit dem einzigen kleineren Chip ist die Seite die von oben zu sehen
sein sollte. Ausserdem ist die Oberseite eben mit 'OBEN'
beschriftet.... Sollte die Platine dennoch falsch herum eingesteckt
werden liegt an allen auf der Platine befindlichen Chip's die
Versorgungsspannung falsch an, was das bedeutet kann sich ja jeder
selber Ausrechnen. Die Beschreibung eines solchen Desaster erspare ich
mir. Das gleiche gilt f&uuml;r direkt eingesteckte
<a href="0c09.htm" target="UDOcon">Romport</a>-Erweiterungen wie Scanner-Interfaces, Digitizer und
&auml;hnlichem.
<br>
</p>
<p>Der Buffer kann in jedem Fall immer im Rechner stecken bleiben,
eine Unvertr&auml;glichkeit mit Software oder auch Dongels
(Kopierschutzmodule) die ebenfalls auf den Expander gesteckt werden
k&ouml;nnen, ist mir bis heute nicht bekannt.
</p>
<p><tt>Der <a href="0c09.htm" target="UDOcon">Romport</a>-Expander aus der c't macht an manchen Rechnern
probleme.</tt>
</p>
<p>Die Symtome:
<br>
</p>
<p>Lange Programme die in Eproms gebrannt wurden lassen sich nicht
laden oder der Rechner h&auml;ngt sich beim Zugriff auf eine der
eingesteckten Karte auf. Oder aber auch verschiedene
Systemfehlermeldungen auftauchen. Also z.B auch 2-6 Smilies. (Bomben,
Pilze) :-)
<br>
</p>
<p>Es handelt sich dabei um ein <a href="030503.htm" target="UDOcon">Timing</a>-Problem auf dem Systembus,
entweder ist das Kabel zwischen Buffer und dem Expander zu lang oder
die Treiberbausteine auf dem <a href="0c09.htm" target="UDOcon">Romport</a>-Buffer sind anf&auml;llig gegen
St&ouml;rstrahlungen anderer Bauteile oder Ger&auml;te die sich in der
N&auml;he befinden.
<br>
</p>
<p>Beim Falcon l&auml;uft das <a href="030503.htm" target="UDOcon">Timing</a> am <a href="0c09.htm" target="UDOcon">Romport</a> mit 16Mhz!
<br>
</p>
<p>Eine zu schwache Spannungsversorgung des Rechners kann oder ist
die erste Schwachstelle im System, man sollte auf der Expanderkarte
mindestens *genau* +5V DC messen k&ouml;nnen. Das macht man am besten
mit einem Oszilloskop, da man dort auch genau die
Spannungseinbr&uuml;che bei einem Speicherzugriff bewundern kann. Wenn
das Oszi angeschlossen ist, sollte man den Rechner auch ruhig mal was
tun lassen, also einen Zugriff auf die Speicher der Epromkarte oder
sowas in der Richtung. Durch lange und d&uuml;nne Verbindungskabel,
besonders bei der Stromversorgung, k&ouml;nnen Spannungseinbr&uuml;che
entstehen, trotz einem 200 Watt Tower-Schaltnetzteil!
<br>
</p>
<p>Die Hauptursache lag hier in der Hauptsache bei &auml;lteren STs
an zu d&uuml;nnen Leiterbahnen innerhalb des Computers.
<br>
</p>
<p>Der Expander und die darin eingesteckten Karten werden ebenfalls
&uuml;ber das lange Falchbandkabel mit Strom versorgt.
<br>
</p>
<p>So kann es bei einem Lesezugriff auf der Epromkarte eben passieren
das die Spannung kurzzeitig Zusammenbricht und der Rechner nicht
wei&szlig; was er machen soll. Die Folge sind verschiedene Fehler.
<br>
</p>
<p>Eine erste Hilfestellung ist das Anbringen von st&auml;rkeren
Verbindungen f&uuml;r die Stromversorgung. Man kann hier die
Versorgung &uuml;ber den <a href="0c09.htm" target="UDOcon">Romport</a> umgehen in dem man dem Expander
seinen eigenen Anschlu&szlig; an das <a href="0f01.htm" target="UDOcon">Netzteil</a> g&ouml;nnt. Der Buffer
wird weiterhin &uuml;ber den <a href="0c09.htm" target="UDOcon">Romport</a> versorgt. Man kann das mit einer
Diode in der +5V-Leitung regeln. Besser ist es jedoch wenn die +5 Volt
zwischen Expander und Buffer getrennt wird. GND kann erhalten bleiben.
<br>
</p>
<p>Das ist die sicherste Methode.
<br>
</p>
<p>Auf der Expanderplatine befindet sich ein Tantal-Elko 10uF/25Volt,
diesen tauscht man bei Versorgungschwierigkeiten am besten gegen einen
Elko der Gr&ouml;sse 100 oder 220uF/25 Volt aus!
<br>Es ist dabei auf die Baugr&ouml;sse zu achten, bei einem sehr
grossen Exemplar dieser Gattung kann es sein das sich auf der
Pfostenleiste f&uuml;r den 2.ten Expander kein Stecker mehr einstecken
l&auml;sst, hier also Vorsicht. Ein Topf-Elko ist hier passend.
<br>Bei einem Rechner welcher durch ein PC - <a href="0f01.htm" target="UDOcon">Netzteil</a> versorgt wird
ist es einfacher den Expander extra zu versorgen. Man nimmt einen
freien Stecker des Netzteils und sucht sich hier +5V und GND
<br>
</p>
<p>Sicherlich liegt es auch in vielen F&auml;llen an den verwendeten
Eproms. Die schnellsten sind mit Sicherheit auch die die am besten
Funktionieren werden. Die Zugriffszeit der Eproms sollte nicht
&uuml;ber 170nS liegen, mit Eproms die eine Zugriffszeit von 200nS
besitzen kann man zwar Versuche machen, man wird aber auf keinen
gr&uuml;nen Zweig kommen. 120 oder 150nS kosten ca. 6 DM pro
St&uuml;ck, also keine grosse Ausgabe.
<br>
</p>
<p>Sollte das bis hier alles nichts gebracht haben gibt es noch
weitere Tricks. Der n&auml;chste Schritt ist weniger sch&ouml;n,
Funktioniert aber meistens. Alle ICs die sich auf der Platine befinden
werden an ihren Versorgungspins 7+14 mit einen 100nF Kondensator
direkt &uuml;berbr&uuml;ckt. Eventuell auch unter den Eproms auf der
Epromkarte, das sind ja die gr&ouml;&szlig;ten Stromsauger. Diese
winzigen Kondensatoren blocken die Betriebsspannung zus&auml;tzlich
etwas ab und Filtern auch einiges andere aus der Versorgungsspannung.
Meiner Meinung nach ein kleines Vers&auml;umniss der Hersteller.
<br>
</p>
<p>In vielen F&auml;llen werden sich dann alle Programme schnell und
sicher auch von einer Epromkarte laden lassen die nicht direkt am
<a href="0c09.htm" target="UDOcon">Romport</a> angesteckt wurde. Die Eproms und die Umschaltlogik bekommen
dadurch etwas mehr Luft und die Timingprobleme sollten dann der
Vergangenheit angeh&ouml;ren.
<br>
</p>
<p>Man kann vorher selbstverst&auml;ndlich auch noch das
Flachbandkabel zwischen Buffer und Expander auf exakt die
ben&ouml;tigte l&auml;nge abschneiden, das wirkt auch meist schon
Wunder. Je l&auml;nger das Kabel, desto anf&auml;lliger ist die Sache
gegen St&ouml;rungen! Also ganz Entgegen der Behauptung aus der c't,
es w&uuml;rde mit Kabel bis zu 2m l&auml;nge sehr gut Funktionieren.
Das <a href="030503.htm" target="UDOcon">Timing</a> auf dem Bus ist Problematisch! Und das bleibt es auch,
selbst mit dem Romportbuffer.
<br>
</p>
<pre>                     Rombelegung des alten Atari ST
                     ______________________________

                U =Alte Bezeichnung   L= Neue Bezeichnung
             **** U2/H2  ******** U3/H1 ******** U4/H0 ****
                  U5/L2           U6/L1          U7/L0
             ..............................................
                 $FE0000         $FD0000         $FC0000
                   BIS             BIS             BIS
                 $FEFFFF         $FDFFFF         $FCFFFF


        Hierzu die verschiedenen ROM/Eproms in Atari Computern:
        _______________________________________________________

                  TOS 1.0 to 1.4 are 192k (196608 bytes)
                  TOS 1.06 and 1.62 are 256k (262144 bytes)
                  TOS 2.x and 3.x are 512k (524288 bytes)
                  TOS 4.x are 512K

                  0.xx   32k / 2 Roms 28p (Bootrom 520ST)
                  1.00  192k / 6 Roms 28p
                  1.02  192k / 2 Roms 28p
                  1.04  192k / 2 Roms 28p
                  1.06  192k / 2 Roms 28p
                  1.062 192k / 2 Roms 28p
                  2.06  256k / 2 Roms 32p
                  3.0x  512k / 4 Roms 32p      (TT only)
                  4.0x  512k / 1 Rom PLCC 44p  (Falcon only)


 Die Pinbelegung des 40 poligen <a href="0c09.htm" target="UDOcon">Romport</a> aus der Dokumentation der alten STs:
 ___________________________________________________________________________

              Pin Signal     Pin Signal

              1= +5V   o o   2= +5V    &uuml;ber Sicherung F2 0.5-1Amp !!
              3= D14   o o   4= D15
              5= D12   o o   6= D13
              7= D10   o o   8= D11
              9= D8    o o  10= D9
             11= D6    o o  12= D7
             13= D4    o o  14= D5
             15= D2    o o  16= D3
             17= D0    o o  18= D1
             19= A13   o o  20= A15
             21= A8    o o  22= A14
             23= A7    o o  24= A9
             25= A6    o o  26= A10
             27= A5    o o  28= A12
             29= A11   o o  30= A4
             31= ROM 3 o o  32= A3
             33= ROM 4 o o  34= A2
             35= UDS   o o  36= A1
             37= LDS   o o  38= GND
             39= GND   o o  40= GND

</pre>
<p>Der Falcon-<a href="0c09.htm" target="UDOcon">Romport</a> ist voll kompatibel zu dem des alten ST.
Pysikalisch werden die Cardridges, Epromkarten ect. &uuml;ber einen
sog. 40 poligen Cardridge S Connector mit dem Rechner verbunden. Die
Adressen liegen 128Kb breit von 0x00FA0000 bis 0x00FBFFFF
<br>
</p>
<p>Betrachtet man den Falcon auf den <a href="0c09.htm" target="UDOcon">Romport</a> gesehen befindet sich
Pin 1 rechts auf der Platinenoberseite!
<br>
</p>
<p><tt> Niemals Karten falsch herrum in den Rechner einstecken!
<br>Der Rechner ist bei jeder Aktion AUSGESCHALTET !</tt>
</p>
<p>Es ist leicht m&ouml;glich das alte ST-Software wegen des
wesentlich schelleren Timings des Falcons nicht korrekt auf die
angesteckte <a href="0305.htm" target="UDOcon">Hardware</a> zugreifen kann. Hierzu m&uuml;sste in allen
F&auml;llen die Software an den Falcon angepasst werden. Alle
Steuersignale werden im Falcon vom COMBEL-Chip erzeugt.
<br>
</p>
<div align=center>Ursprung in 1990 (c) R.Schaffner
<br>robscha@data.rhein-main.de
</div>
<p align=center><img src="image/line2.gif" border=0 width="638" height="17"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c09.htm" target="UDOcon"><img src="udo_up.gif" alt="Romport" border=0 width="24" height="24"></a>
<a href="0c09.htm" target="UDOcon"><img src="udo_lf.gif" alt="Romport" border=0 width="24" height="24"></a>
<a href="0c0902.htm" target="UDOcon"><img src="udo_rg.gif" alt="Epromkarten am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
