<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Epromkarten am Romport
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c09.htm" target="UDOcon"><img src="udo_up.gif" alt="Romport" border=0 width="24" height="24"></a>
<a href="0c0901.htm" target="UDOcon"><img src="udo_lf.gif" alt="Romportbuffer" border=0 width="24" height="24"></a>
<a href="0c0903.htm" target="UDOcon"><img src="udo_rg.gif" alt="Romport-Digitizer" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Epromkarten_20am_20Romport">12.9.2 Epromkarten am Romport</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Wissenswertes &uuml;ber Epromkarten am Atari-<a href="0c09.htm" target="UDOcon">Romport</a></tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<p>Als Einleitung sollte jedem klar sein das irgendwelche Basteleien
am <a href="0c09.htm" target="UDOcon">Romport</a> der Atari Computer sehr rasch auch schnell recht teuer
werden kann. An diesem Port liegen alle Bussignale des Rechner
ungepuffert an. Durch eine Unachtsamkeit, einen Kurzschlu&szlig;
zwischen den einzelnen Pins der Portbuchse kann so der gesammte
Rechner zerst&ouml;rt werden. Als einzige Sicherheitsma&szlig;nahme
existieren in zwei Atarimodellen Sicherungen die die +5 Volt Versorung
des Romports absichern. Das trifft hier einmal auf den Atari TT zu,
hier wird &uuml;ber die Microsicherung F1 abgesichert, zum anderen
betrifft es den Falcon der &uuml;ber die Microsicherung mit der
Bezeichung F2 (5Amp) gegen Kurzschl&uuml;sse der Versorgungsspannung
von au&szlig;en gesch&uuml;tzt wird. Keinen Schutz haben bei allen
Atari Computern alle anderen Signal- oder Steuerleitungen.
<br>
</p>
<p>Meiner Meinung nach kann die Sicherung eine St&auml;rke von 0.5-1
Amp haben.
<br>Gr&ouml;&szlig;ere Sicherungen k&ouml;nnen unter anderem auch die
Leiterbahnen im inneren des Falcons zerst&ouml;ren. Das Falconnetzteil
kann ca. 3.5 Amp liefern, gr&ouml;&szlig;ere Sicherungen sind daher
eigentlich Unbrauchbar.
<br>Siehe <a href="0f01.htm" target="UDOcon">Netzteil</a>.
<br>
</p>
<p>Sollte z.B ein eingestecktes Scannermodul keine Funktion mehr
haben kann man beim TT und beim Falcon eben diese genannten
Sicherungen &uuml;berpr&uuml;fen. Die Bauteile befinden sich bei
beiden Computern jeweils in der N&auml;he der Romportbuchse. Das
Bauteil selber sieht in den meisten F&auml;llen wie ein Widerstand
aus, und kann meistens auch nur am Platinenaufdruck bzw. der
Bauteilebezeichnung erkannt und gefunden werden. Diese sog.
'Microfuses' (engl.) sind nur durch Ausl&ouml;ten zu ersetzten. In
beiden Computern arbeitet ein axialer Typ den es in verschiedenen
Bauformen in jeden besseren Elektronikladen geben sollte. Beim Ersatz
sollte mit der &uuml;blichen Vorsicht im Rechner gel&ouml;tet werden,
speziell im Falcon, da dieser eine 6fach Multilayerplatine hat und man
es daher hier auf kurze L&ouml;tzeiten anlegen sollte. Eine
Microsicherung mit 0.5 Amp reicht aus, das <a href="0f01.htm" target="UDOcon">Netzteil</a> im Falcon kann nie
mehr als 4Amp liefern, dazu reicht die Leistung leider nicht aus. Bei
einer 5 Amp-Sicherung k&ouml;nnen schnell irgendwelche Leiterbahnen
als Sicherung dienen. Sehr oft schlecht zu Reparieren.
</p>
<p>Im TT eines Freundes, Peter K&uuml;chler@OF2, sah ich einmal die
Anschl&uuml;sse dieser Microsicherung mit Dr&auml;hten auf einen
normalen Feinsicherungshalter verl&auml;ngert, der in der
R&uuml;ckwand des TTs eingebaut war. Vorteil dieser L&ouml;sung ist
bei einem n&auml;chsten Ausfall dieser Sicherung das eben der Rechner
nicht mehr ge&ouml;ffnet werden mu&szlig; und das umst&auml;ndliche
l&ouml;ten so Entf&auml;llt. Logischerweise werden hier dann auch die
billigen Glassicherungen zum Einsatz kommen.
</p>
<p>L&ouml;tzinnreste ect. sollte man Aufsammeln und nicht durch
wegblasen entfernen.
</p>
<p>Bei allen anderen Atarimodellen hilft bei einem Fehlerfall des
Romports meistens leider nur das Atari-<a href="030801.htm" target="UDOcon">Testkit</a> weiter. Testkits stehen
jedem Atari-<a href="1604.htm" target="UDOcon">H&auml;ndler</a> mit Werkstatt zur Verf&uuml;gung. Meistens
betrifft es leider einen relaiv teuren Baustein im Rechner. In einem
ST z.B meistens den GLUE.
</p>
<p>Am sichersten ist es in jedem Fall wenn man alle Erweitungen
f&uuml;r den <a href="0c09.htm" target="UDOcon">Romport</a> &uuml;ber ein Buffermodul betreibt. Die c't hatte
vor einigen Jahren einen '<a href="0c09.htm" target="UDOcon">Romport</a>-Expander' als Projekt in ihrem
Magazin. Die Schaltung des Romportexpander kann der c't 5/88 entnommen
werden. Sicherlich kann man bei e_Media auch eine Kopie des Artikels
bekommen, die Kosten hierf&uuml;r lagen meines Wissens nach bei 5 DM
pro Artikel. Bei fertig gekauften Epromkarten ist das Risiko
wesentlich kleiner, ebenfalls aber nie ganz Auszuschlie&szlig;en. Das
Betrifft selbstgestrickte Epromkarten nat&uuml;rlich noch mehr. Schon
ein falsch eingestecktes Eprom kann bis auf den eigenen defekt des
Bausteils selber auch am Rechner einigen Schaden anrichten. Es ist
hier also Vorsicht geboten.
<br>
</p>
<p>Verschiedene Hersteller bieten also Epromkarten zum einstecken in
den <a href="0c09.htm" target="UDOcon">Romport</a> an. Diese Karten werden meistens ohne Eproms verkauft und
sind in vielen F&auml;llen an mindestens 2 Sorten Eproms anpassbar.
Die entsprechenden Eproms m&uuml;ssen im g&auml;ngingen
Elektronikhandel erstanden werden, zumal die hier meistens billiger
als bei Atarih&auml;ndler zu bekommen sind. Auch hier macht die
St&uuml;ckzahl den Preis, eine Sammelbestellung mit Freunden kann sich
also Auszahlen. Gut geeigent sind diese Epromkarten oder
Epromb&auml;nke um sich z.B das neue MagiC! 3 in Eproms zu brennen und
so einen wesentlich schnelleren Bootvorgang am Rechner zu erhalten.
Aus einem ROM (Eprom) liest es sich schneller als von einer Festplatte
oder einer Diskette. Epromkarten liegen im Adressraum von $FA0000 bis
$FBFFFF. Speziell f&uuml;r MagiC! gibt es in diversen Mausboxen eine
Software die ein vorhandenes MagiC! in eben brennfertige Files
f&uuml;r einen Epromer aufbereitet. Ein sehr guter Tip ist hier der
JuniorPrommer von Maxon mit z.B Pinatubo als Software. Pinatubo ist
ShareWare. Die von Maxon gelieferte Software l&auml;uft zwar auch hat
aber durch ihr Alter bedingt ein paar sehr l&auml;stige Eigenschaften
und sollte zur Sicherheit nur in einem ST-Monchrome-Modus auf z.B dem
Falcon benutzt werden. Ein Update w&auml;hre hier also schon lange mal
&Uuml;berf&auml;llig.
</p>
<p>Hat man sich eine Karte besorgt sollte man sich auch gleich die
passenden Eproms daf&uuml;r besorgen. Von Maxon gab es mal eine
Zeitlang die sog. Easybank, welche einen Epromspeicher von bis zu 576
Kbyte am Rechner zur Verf&uuml;gung stellte. Nat&uuml;rlich gibt es
auch keine Karten mit 128Kbyte freiem Speicherplatz.
<br>Hier passt also schon eine ganze Menge an Software auf eine Karte,
bzw. in Eproms. Es sollte Klargestellt werden das sich hier nur
Software eignet die &uuml;ber keinen Kopierschutz verf&uuml;gt und
auch nicht versucht w&auml;hrend dem Betieb sich selber zu
Modifizieren. Das geht bei einem 'Rom'-Modul logischerweise daneben.
Aus diesen Karten kann also nur gelesen werden um eine Kopie davon im
Ramspeicher anzulegen. (R)ead (O)nly (M)emory
<br>Der Rechner stellt durch 'lesen' des des ersten Langwortes ab
$FA0000 fest ob eine Karte vorhanden ist. Kleinere Epromkarten
arbeiten mit 2 oder 4 Eproms. Gr&ouml;&szlig;ere Karten haben in den
meisten F&auml;llen zwei extra Steuereproms mit drauf. Hier liegen
Daten f&uuml;r den Computer die Ihm einen Zugriff auf eben mehr wie
128Kbyte erm&ouml;glichen. Normalerweise kann ein Rom- oder Eprommodul
am Atari <a href="0c09.htm" target="UDOcon">Romport</a> nur 128Kbyte gro&szlig; sein. Gr&ouml;&szlig;ere
Karten werden mit dem sog. Bankswitching dazu &uuml;berredet korrekt
zu arbeiten. Bei diesem Verfahren verschiebt die Steuersoftware ein
Fenster das genau 128Kbyte gro&szlig; ist &uuml;ber den wesentlich
gr&ouml;sseren Epromspeicher auf der Karte. Der Rechner bekommt bei
dieser Arbeitsweise immer nur 128Kbyte zu sehen und ist Zufrieden.
Also ein relativ guter Trick um gro&szlig;e Karten zu Betreiben.
Zus&auml;tzlich dazu haben die gro&szlig;en Karten meistens daf&uuml;r
auch noch eine Adresslogik on Board die eben auch mit den Daten aus
den beiden Steuereproms bedient wird.
<br>
</p>
<p>Nun lassen sich eben solche Rom- oder Eprommodule nat&uuml;rlich
nicht nur dazu verwenden um irgendwelche Programme darauf zu vebannen.
Die Fa. Atari hat f&uuml;r diesen Zeck z.B eine eigene Testsoftware
f&uuml;r ihre Rechner entwickelt die eben einfach auch auf einem sog.
Testmodul &uuml;ber den <a href="0c09.htm" target="UDOcon">Romport</a> mit eben dem Rechner verbunden wird.
Atari benutzt hier eine Karte mit zwei Eproms vom Typ 27C256. (Alte
ST-Testmodule) Darin enthalten ist eine Testsoftware die direkt vor
dem TOS gestartet wird. Bereits mit 1Kb funktionierendem Ram kann man
hier seinen Rechner auf relativ einfache Art testen.
<br>
</p>
<p align=center><img src="image/epboard.gif" border=0 width="290" height="160"></p><br>
<div align=center><tt>Abbildung 1 - Eine einfache Epromkarte f&uuml;r den
<a href="0c09.htm" target="UDOcon">Romport</a></tt>
</div>
<p>Auch lassen sich nat&uuml;rlich komplette Bootlaufwerke auf solch
einer Karte speichern. Selbst gr&ouml;&szlig;ere Applikationen lassen
sich so bequem auf einer Epromkarte ablegen. Die auf einer solchen
Steckkarte enthaltenen Programme werden beim Anklicken praktisch in
Nullzeit in den Arbeitsspeicher &uuml;bertragen und ausgef&uuml;hrt.
Die Zeitersparniss liegt klar auf der Hand.
</p>
<p>Gut geeignet scheinen hier Kopierprogramme, Diskettenmonitore oder
die sog. Tracer zu sein, alle diese Programm werden nur geladen und
schreiben nicht auf ihr eigenens Laufwerk Daten zur&uuml;ck. Einige
Spezialisten haben hier Software untergebracht die auf Kopfdruck in
der Lage ist laufende Programme zu Unterbrechen, zu Modifizieren oder
auch den gesammten Speicherinhalt auf eine Diskette schreiben zu
k&ouml;nnen. Wozu man das macht und wozu man das Einsetzen kann
m&ouml;ge sich jeder selber an der Nase abfingern. Mir dient das
jedenfalls hier ebenfalls als Einsatzbeispiel. Um vorhandene Software
auf solche Epromkarten zu bringen sind einige durchdachte
Arbeitsschritte notwendig.
</p>
<p>An erster Stelle im ersten Eprom auf einer solchen Karte sollte
die Magicnumber stehen, die wie folgt aussieht:
<br>$ABCDEF42
<br>An dieser Nummer erkennt der Rechner das es sich um ein
ausf&uuml;hrbares Programm, bzw. das es sich um ein Programmodul
handelt. Ein Testmodul tr&auml;gt hier logischerweise eine andere
Magicnumber. Sollte also an dieser Stelle z.B:
<br>$FA522255F
<br>stehen wird der Rechner weder das GEM noch das AES laden bzw.
Initalisieren da er davon ausgeht das ein eben ein Testmodul im
<a href="0c09.htm" target="UDOcon">Romport</a> steckt. Ein eingestecktes Testmodul bewirkt auch keinerlei
Bootvorgang oder &auml;hnliches von den vorhandenen Datentr&auml;gern.
Beim Falcon/TT wird zus&auml;tzlich sofort auch das <a href="040101.htm" target="UDOcon">NVRAM</a>
gel&ouml;scht. Der Rechner arbeitet dann mit den
Default-Werkseinstellungen. Sp&auml;ter kann man diese Einstellungen
mit einem geeigeten Setup-Programm mit eigenen Daten wieder
&Uuml;berschreiben. Das auf einer Karte enthaltene Programm
enth&auml;lt in der Regel ein Monitorprogramm, einen Tracer oder eben
eine Testsoftware f&uuml;r das 680xxer Rechnersystem. Andere Programme
w&auml;hren zu diesem Zeitpunkt auch ziemlich Sinnlos. Wenn auf ein
solches 'Eprom-Programmodul' eines oder auch mehrere (je nach
gr&ouml;&szlig;e) Programme aufgebracht werden, wird noch ein sog.
Header ben&ouml;tigt, der sich Unbedingt ab der Adresse $FA0004 finden
sollte. (Adress-Offset) Ansonsten fliegen diverse B&ouml;mbchen.. :-)
<br>
</p>
<p>Die eigentliche Reihenfolge: Zuerst kommt die magische Nummer
gefolgt von &quot;$00000000&quot; wenn kein weiters Programm in dem
Modul enthalten ist. Die n&auml;chste Langwortadresse sollte den
Initialisierungscode enthalten, denn das System ben&ouml;tigt
Informationen &uuml;ber das Programm. Auch wird hier festgelegt wann
und wo das System in welche Routine springt. Der genaue Zeitpunkt wird
durch das hochwertigste Bit bestimmt:
<br>
</p>
<pre>
 TABELLE:

 0 -  Routine wird vor allem anderen gestartet. (Testmodul)
 1 -  Ausf&uuml;hren vor dem Starten von GEM.
 3 -  Bit 3 erzeugt auch einen Start vor dem GEM, allerdings nur bei
      Computern ohne RomTos.
      (Gab es nur bei den ersten STs)
 5 -  Es handelt sich um ein .ACC
 6 -  Es handelt sich um eine .TOS Anwendung
 7 -  Bit 7 legt fest, das es sich um eine .TTP-Anwendung handelt, welche
      zum Betrieb noch Parameter ben&ouml;tigt.

</pre>
<p><tt>Headerinformationen:</tt>
<br>
</p>
<dl>
<dt><b>$FA0018</b></dt><dd> Der korrekte Programmname.
<br>&nbsp;
<dt><b>$FA0008</b></dt><dd> Das Programminit sowie der Zeiger!
<br>&nbsp;
<dt><b>$FA0014</b></dt><dd> Die komplette Programml&auml;nge.
<br>&nbsp;
<dt><b>$FA0004</b></dt><dd> Der gesammte Programmkopf sowie dessen Zeiger!
<br>&nbsp;
<dt><b>$FA0012</b></dt><dd> Das Erstellungsdatum.
<br>&nbsp;
<dt><b>$FA0000</b></dt><dd> Hier steht das &quot;magische&quot; Langwort des Moduls.
<br>&nbsp;
<dt><b>$FA0010</b></dt><dd> Die Erstellungszeit (Uhrzeit) des Programmmoduls.
<br>&nbsp;
<dt><b>$FA000C</b></dt><dd> Die Anfangsadresse / Programmanfang.
<br>&nbsp;
</dl>
<p>An der Adresse des n&auml;chsten Langwortes steht dann die
Startadresse des eigentlichen Programmcodes. An den beiden danach
folgenden Worten (keine Langw&ouml;rter) k&ouml;nnen dann auch noch
Datum und die Uhrzeit enthalten sein. Das Langwort zum Schlu&szlig;
enth&auml;lt die gesamte Programml&auml;nge in Bytes. Der nachfolgende
String sollte dann noch den kompletten Programmnamen enthalten, den
Stringabschlu&szlig; veranstaltet dann ein &quot;$00&quot;. Das ist
alles dringend Notwendig um zu erkennen um wieviele Programme und um
welche Art von Programmen es sich handelt.
</p>
<p>Um die Sache zu vereinfachen, bieten manche Hersteller von
Epromern in ihrer Software bereits eine vorgefertigte 'Modulsoftware'
an. Beim JuniorPrommer oder z.B bei der Easybank ist diese Software in
beiden F&auml;llen vorhanden. Damit ist es wesentlich einfacher sich
selber Module zu erzeugen und eigene Programmdateien in Epromms zu
brennen.
</p>
<p>Im &uuml;brigen ist man mit einem solchen &quot;Epromer&quot; auch
leicht in der Lage sich Betriebssystempatches in eben das ROM des
Rechners zu &quot;brennen&quot; Das l&auml;stige Ladem im Autoorder
w&uuml;rde dann entfallen.
</p>
<p>Hierzu die verschiedenen ROM/Eproms aus Atari Computern:
</p>
<dl>
<dt><b>TOS 1.0</b></dt><dd> TOS 1.0 bis 1.4 sind 192k Roms (196608 Bytes)
<br>&nbsp;
<dt><b>TOS 1.06</b></dt><dd> TOS 1.06 bis 1.62 sind 256k Roms (262144 Bytes)
<br>&nbsp;
<dt><b>TOS 2.x</b></dt><dd> TOS 2.06 bis 3.x sind 512k Roms (524288 Bytes)
<br>&nbsp;
<dt><b>TOS 4.x</b></dt><dd> TOS 4.0x passt bisher nur in 512K PLCC-OPTRoms / -Eprom (524288
Bytes)
<br>&nbsp;
<dt><b>TOS 0.xx</b></dt><dd> Die beiden Bootroms vom 520/260ST sind 32k lang und 2 Roms 28p
(Bootrom)
<br>&nbsp;
<dt><b>1.00</b></dt><dd> 192k / 6 Roms 28p
<br>&nbsp;
<dt><b>1.02</b></dt><dd> 192k / 2 Roms 28p
<br>&nbsp;
<dt><b>1.04</b></dt><dd> 192k / 2 Roms 28p
<br>&nbsp;
<dt><b>1.06</b></dt><dd> 192k / 2 Roms 28p
<br>&nbsp;
<dt><b>1.062</b></dt><dd> 192k / 2 Roms 28p
<br>&nbsp;
<dt><b>2.06</b></dt><dd> 256k / 2 Roms 32p
<br>&nbsp;
<dt><b>3.0x</b></dt><dd> 512k / 4 Roms 32p (TT only)
<br>&nbsp;
<dt><b>4.0x</b></dt><dd> 512k / 1 Rom PLCC 44p (Falcon only)
<br>&nbsp;
</dl>
<p>Das nur als Randbemerkung und Beispiel.
</p>
<p>Quelle: Profibuch/<a href="15.htm" target="UDOcon">Internet</a>
</p>
<p>Leider ist die Benutzung von mehreren Rom-Modulen an den Atari
Rechner nicht ganz unproblematisch. Die Federleiste welche den
herrausgef&uuml;hrten Stecker bildet verkraftet nicht ohne weiteres
das andauernde Umstecken der verschiedenen Karten. Auch sollte ein
Kartenwechsel dringlichst nur bei ausgeschaltetem Computer
stattfinden! Die Kontaktfedern sind nach ca. 1 Jahr so ausgeleiert das
eine richtige Kontaktgabe nicht mehr immer gew&auml;hrleistet ist. Die
Folge davon sind h&auml;ufige 'Abst&uuml;rze' oder selbstst&auml;ndige
'Resets' des Rechners. Was nur durch einen geziehlten Austausch der
<a href="0c09.htm" target="UDOcon">Romport</a>-Buchse richtig und Dauerhaft behoben werden kann. Kontaktspray
o.&Auml; sind hier eher Sch&auml;dlich.
</p>
<p>Nicht ganz Unwichtig ist die Zugriffszeit der verwendeten Eproms.
Eproms mit einer Zugriffszeit von 200nS sollen wirklich das untere
Maximum darstellen! Besser ist es hier auf 100-150 nS Zugriffszeit
auszuweichen. Langsamer als 200 nS behindern den Datentransfer von
Modul zum Atari, in Abh&auml;ngigkeit des Rechner internen Timings!
Auch nach vielen L&ouml;schvorg&auml;ngen mit dem beliebten UV-Licht
aus der L&ouml;schlampe steigt die Zugriffszeit der Eproms!
</p>
<p>Auch wenn das nicht jeder Wahrhaben m&ouml;chte! Eproms altern.
Schneller noch durch h&auml;ufiges l&ouml;schen. Die Zugriffszeit
steigt dabei an.
</p>
<p>Wird eine Modul- oder Epromkarte nicht mehr Korrekt oder
&uuml;berhaupt nicht mehr Erkannt sollte man zuerst im Falle dieses
Fehlers zuerst die beiden Steuerleitungen ROM 3+4 auf ihre Funktion
hin &uuml;berpr&uuml;fen. Die Leitungen sind LOW aktiv, d.h beim
Ansprechen per Software sollte sich hier etwas tun. Auch k&ouml;nnte
die Verschmutzung einiger Kontaktfedern vorliegen, da sich durch
h&auml;ufiges Umstecken von den Leiterplatinen immer wieder kleine
Partikel der Verzinnten oder vergoldeten Steckfl&auml;chen l&ouml;sen
und eben an den Kontaktfedern haften bleiben. Mit der Zeit bildet sich
so ein regelrechter schwarzer Schmutzfilm, der sich jedoch mit einem
einfachen Schul-Radiergummi leicht abradieren l&auml;sst. Ein wenig
Spiritus eignet sich auch, l&auml;sst aber den Kunststoff schneller
altern. (Die Weichmacher l&ouml;sen sich durch die D&auml;mpfe aus dem
Plastik, das Material wird Spr&ouml;de und bricht dann sehr schnell)
</p>
<p>Sollte es dann noch immer zu Ausetzern kommen ist auch das leichte
nachbiegen der Kontaktfedern erlaubt, sicherer ist allerdings immer
der Austausch der gesammten <a href="0c09.htm" target="UDOcon">Romport</a>-Buchse. Diese <a href="0c09.htm" target="UDOcon">Romport</a>-Buchsen sind
leider schwer Aufzutreiben.
<br>
</p>
<p align=center><img src="image/romport.gif" border=0 width="600" height="170"></p><br>
<div align=center><tt>Abbildung 2 - Die Pinbelegung des 40 poligen <a href="0c09.htm" target="UDOcon">Romport</a> aus der
ST Dokumentation:</tt>
</div>
<p>- <a href="0302.htm" target="UDOcon">Falcon F030</a> von der linken Seite gesehen.
<br>- Midi Buchsen
<br>- <a href="0c09.htm" target="UDOcon">Romport</a>
<br>- Paddle Ports
<br>
</p>
<dl>
<dt><b>Pin 1=</b></dt><dd> +5V Versorgungsspannung
<br>&nbsp;
<dt><b>Pin 2=</b></dt><dd> +5V Versorgungsspannung
<br>&nbsp;
<dt><b>Pin 3=</b></dt><dd> Datenleitung 14 (D14)
<br>&nbsp;
<dt><b>Pin 4=</b></dt><dd> Datenleitung 15 (D15)
<br>&nbsp;
<dt><b>Pin 5=</b></dt><dd> Datenleitung 12 (D12)
<br>&nbsp;
<dt><b>Pin 6=</b></dt><dd> Datenleitung 13 (D13)
<br>&nbsp;
<dt><b>Pin 7=</b></dt><dd> Datenleitung 10 (D10)
<br>&nbsp;
<dt><b>Pin 8=</b></dt><dd> Datenleitung 11 (D11)
<br>&nbsp;
<dt><b>Pin 9=</b></dt><dd> Datenleitung 8 (D 8)
<br>&nbsp;
<dt><b>Pin 10=</b></dt><dd> Datenleitung 9 (D 9)
<br>&nbsp;
<dt><b>Pin 11=</b></dt><dd> Datenleitung 6 (D 6)
<br>&nbsp;
<dt><b>Pin 12=</b></dt><dd> Datenleitung 7 (D 7)
<br>&nbsp;
<dt><b>Pin 13=</b></dt><dd> Datenleitung 4 (D 4)
<br>&nbsp;
<dt><b>Pin 14=</b></dt><dd> Datenleitung 5 (D 5)
<br>&nbsp;
<dt><b>Pin 15=</b></dt><dd> Datenleitung 2 (D 2)
<br>&nbsp;
<dt><b>Pin 16=</b></dt><dd> Datenleitung 3 (D 3)
<br>&nbsp;
<dt><b>Pin 17=</b></dt><dd> Datenleitung 0 (D 0)
<br>&nbsp;
<dt><b>Pin 18=</b></dt><dd> Datenleitung 1 (D 1)
<br>&nbsp;
<dt><b>Pin 19=</b></dt><dd> Adressleitung 13 (A13)
<br>&nbsp;
<dt><b>Pin 20=</b></dt><dd> Adressleitung 15 (A15)
<br>&nbsp;
<dt><b>Pin 21=</b></dt><dd> Adressleitung 8 (A 8)
<br>&nbsp;
<dt><b>Pin 22=</b></dt><dd> Adressleitung 14 (A14)
<br>&nbsp;
<dt><b>Pin 23=</b></dt><dd> Adressleitung 7 (A 7)
<br>&nbsp;
<dt><b>Pin 24=</b></dt><dd> Adressleitung 9 (A 9)
<br>&nbsp;
<dt><b>Pin 25=</b></dt><dd> Adressleitung 6 (A 6)
<br>&nbsp;
<dt><b>Pin 26=</b></dt><dd> Adressleitung 10 (A10)
<br>&nbsp;
<dt><b>Pin 27=</b></dt><dd> Adressleitung 5 (A 5)
<br>&nbsp;
<dt><b>Pin 28=</b></dt><dd> Adressleitung 12 (A12)
<br>&nbsp;
<dt><b>Pin 29=</b></dt><dd> Adressleitung 11 (A11)
<br>&nbsp;
<dt><b>Pin 30=</b></dt><dd> Adressleitung 4 (A 4)
<br>&nbsp;
<dt><b>Pin 31=</b></dt><dd> ROM-Selekt 3
<br>&nbsp;
<dt><b>Pin 32=</b></dt><dd> Adressleitung 3 (A 3)
<br>&nbsp;
<dt><b>Pin 33=</b></dt><dd> ROM-Selekt 4
<br>&nbsp;
<dt><b>Pin 34=</b></dt><dd> Adressleitung 2 (A 2)
<br>&nbsp;
<dt><b>Pin 35=</b></dt><dd> UpperDataStrobe (UDS)
<br>&nbsp;
<dt><b>Pin 36=</b></dt><dd> Adressleitung 1 (A 1)
<br>&nbsp;
<dt><b>Pin 37=</b></dt><dd> LowerDataStrobe (LDS)
<br>&nbsp;
<dt><b>Pin 38-40=</b></dt><dd> GND (Ground)
<br>&nbsp;
</dl>
<p>Diese Pinbelegung, die aus einigen Fachb&uuml;chern stammt, passt
bis heute zu jedem Atari Computer mit eben diesem <a href="0c09.htm" target="UDOcon">Romport</a> Lediglich
beim Falcon werden einige Signale auf eine andere Weise im COMBEL
erzeugt. &Auml;ltere Module, z.B Melody-Maker k&ouml;nnen nicht
funktionieren da das <a href="030503.htm" target="UDOcon">Timing</a> am Falcon-<a href="0c09.htm" target="UDOcon">Romport</a> mit 16Mhz abl&auml;uft.
Zu schnell f&uuml;r alte Modul-Software.
<br>
</p>
<p>Bitte beachten Sie das am <a href="0c09.htm" target="UDOcon">Romport</a> an bisher allen Atari-Computern
keinerlei Schutzeinrichtung gegen falsches Einstecken oder
&Uuml;berlasten der Signale gegeben ist.
<br>Ein versehentlich falsch eingestecktes Modul kann den Falcon sowie
jeden anderen Atari-Computer, das Modul, dauerhaft besch&auml;digen.
Der COMBEL-Chip im Falcon kostet ca. 160.-DM +MwSt und ist noch nicht
Eingebaut! <a href="030805.htm" target="UDOcon">Ersatzteile</a>: C302995-001 / C-LAB: AT4181 208P
</p>
<p>Im einfachsten Fall wird die Sicherung F2 zerst&ouml;rt.
<br>(Kurzschlu&szlig; der 5V Versorgungsspannung)
</p>
<p>Verwenden Sie bei Bastelarbeiten m&ouml;glichst einen
<a href="0c09.htm" target="UDOcon">Romport</a>-Buffer!
<br>
</p>
<dl>
Zum Programmieren der Karten bzw. der Eproms gibt es einige Wege und
M&ouml;glichkeiten. Die Easybank von Maxon kann man z.B in der
folgenden Art best&uuml;cken:
<br>&nbsp;
<dt>&nbsp;</dt><dd> <tt>Steuereproms:</tt> 2 St&uuml;ck 27C256 (64Kb)
<br>&nbsp;
<dt>&nbsp;</dt><dd> <tt>Dateneproms :</tt> 8 St&uuml;ck 27C256 (256Kb)
<br>&nbsp;
<br>Ergibt eine Kapazit&auml;t von 230Kbyte f&uuml;r den Benutzer.
Oder man Best&uuml;ckt wie folgt mit:
<br>&nbsp;
<dt>&nbsp;</dt><dd> <tt>Steuereproms:</tt> 2 St&uuml;ck 27C256 (64Kb)
<br>&nbsp;
<dt>&nbsp;</dt><dd> <tt>Dateneproms :</tt> 8 St&uuml;ck 27C512 (512Kb)
<br>&nbsp;
<br>W&uuml;rde dann eine Kapazit&auml;t von eben 576 Kbyte ergeben.
<br>
<br>&nbsp;
</dl>
<p>Hier passt dann schon eine ganze Menge hinein. Zu Bemerken ist
noch das bei der Easybank in den Steuereproms nicht der gesammte Platz
verbraucht wird. Auf der Epromkarte selber befindet sich eine kleine
Steuerlogik die mit ca. 10Kbyte Anweisung aus beiden Steuereproms
auskommt. Der gesammte Rest in diesen beiden Eproms steht somit
ebenfalls dem Benutzer zur freien Verf&uuml;gung. Kleinere Karten, mit
nur 4 Eproms haben keine Steuerlogik, das wird von der Modulsoftware
des Epromers &uuml;bernommen und am Anfang des Epromspeichers zusammen
mit der Anwendersoftware eingebrannt.
</p>
<p>Bei kleinen Karten werden nur vier St&uuml;ck vom gleichen Typ
ben&ouml;tigt, also hier meistens: 4 St&uuml;ck 27C512, oder 4
St&uuml;ck 27C256 Allenfalls bei sehr kleinen Karten kommen auch noch
27C128 zum tragen.
</p>
<p>Zu Bemerken w&auml;hre das man bei den Eproms immer die CMos
Ausf&uuml;hrungen beschaffen sollte, die sind wesentlich sparsamer im
Energieverbrauch und somit in der Belastung des Rechners freundlicher.
Fast alle CMos-Eproms sind mit einer Programmierspannung von 12.5 V
zufrieden. H&ouml;her eingestelle Spannungen zerst&ouml;ren die
Bausteine. Auf jeder Epromkarte sind die Eproms in gerade und ungerade
Adressen aufgeteilt. Daher erscheinen auf den Platinen meistens
Bezeichungen wie 4U, 3U oder 4L und 3L Wobei 'U' f&uuml;r 'Upper' und
'L' f&uuml;r 'Lower' steht. Im Klartext, 4U bedeutet das Eprom 4 High
und 3L steht f&uuml;r das Eprom 3 unten, also mit LOW-Inhalt. Alle
'kleinen' Eproms sind 8 Bit breit Organisiert. Eine Epromkarte aber
16Bit breit. Wie geht das?
</p>
<p>Die in solche Eproms/Karten zu brennende Software wird also mit
der Prommersoftware in 'High' und 'Low' geteilt.
</p>
<p>Wobei Low 'ungerade Adressen' High hingegen 'gerade Adressen
bedeutet. Auf der Karte hingegen 'sieht' der Computer die vollen
16Bit, die Software wird aus dem High- und Low-Eprom in einem Rutsch
gelesen.
</p>
<p>Leute die ihren Computer auch noch nach Jahren im orignalen
Geh&auml;use betreiben sollten bedenken das z.B gerade bei den alten
STs das Rechnernetzteil durch eine gro&szlig;e Eprombank
zus&auml;tzlich belastet wird. Eine Karte mit 500KB Epromspeicherplatz
zieht am +5 V Anschlu&szlig; des Netzteiles ohne weiteres bis zu 400mA
die eben dieses <a href="0f01.htm" target="UDOcon">Netzteil</a> zus&auml;tzlich noch aufbringen mu&szlig;.
Eine schnelle und sichere Abhilfe ist es die Epromkarte eben &uuml;ber
ein 5V-Steckernetzteil zu betreiben. Hier zu wird an einer geeigneten
Stelle auf der Karte die +5V Versorung vom Rechner her einfach
aufgetrennt. Die Masseverbindung (GND) sollte allerdings hierbei
bestehen bleiben, GND dient hier gleichzeitig als Signalmasse ohne die
nichts l&auml;uft. Viele Karten haben auch genau f&uuml;r diesen Zweck
einen Jumper mit dem man von 'intern' auf eine 'externe'
Stromversorgung umstecken kann. Weitere Jumper auf der Karte sind
zumeist f&uuml;r den Epromtyp der auf der Karte eingesetzt werden
soll, auch kann es z.B einen Jumper geben mit dem man die Karte quasi
Abschalten kann. Sie ist dann f&uuml;r den Rechner unsichtbar obwohl
die Karte im <a href="0c09.htm" target="UDOcon">Romport</a> stecken bleiben kann. Eine gute Art die
Portkontakte zu schonen.
</p>
<p>Wie Eingangs schon Erw&auml;hnt wurde bei manchen Karten, so z.B
auch bei dem JuniorPrommer, eine sog. 'Modulsoftware' mitgeliefert.
Der Benutzer hat eigentlich nichts weiter zu tun als die Programme die
auf einer Karte arbeiten sollen auf einem geeigneten Datentr&auml;ger
bereit zu halten. I.d.R ist das eine Ramdisk die in ihrer
gr&ouml;&szlig;e sehr genau dem Platz in eben 2,4 oder mehreren Eproms
entspricht. Die gesammten zu brennenden Daten werden in die eben
eingerichtete Ramdisk kopiert, danach ist ein Laufwerk anzugeben unter
dem der Computer sp&auml;ter die Daten/Epromkarte finden soll.
Sinnvoll ist es gleich danach auf dem <a href="030505.htm" target="UDOcon">Desktop</a> das passende Icon zu
installieren. Oder auch diese so ge&auml;nderte
DESKTOP.INF/NEWDESK.INF mit auf die Karte zu brennen. Die
'Modulsoftware' wird den Inhalt der Ramdisk zusammenfassen und
entsprechend der Anzahl der verwendeten Eproms bzw. des n&ouml;tig
werdenen Platzes in eben brennfertige Files aufsplitten. Wenn das
gelaufen ist erh&auml;lt man eine oder mehrere Dateien die eben den
Inhalt der Ramdisk darstellt. Die Namen sind i.d.R default auf z.B
'ROM.EP1', 'ROM.EP2' usw. benannt worden. Hierdurch sollte die
M&ouml;glichkeit des Vertauschens klein gehalten werden. Diese Dateien
beinhalten nun jeweils die Daten f&uuml;r ein High und ein Low Eprom.
Diese Datei wird nun in die Steuersoftware des Epromers geladen, und
dort in High und Low gesplittet. Beim JuniorPrommer gibt es die
Einstellungsm&ouml;glichkeiten 'gerade' und 'ungerade' Adressen. Je
nach der Einstellung brennt man dann aus z.B dem File
&quot;ROM.EP1&quot; jeweils ein 'H' und ein 'L' Eprom. Bei mehreren
&quot;ROM.EPx&quot; Files sollten die Eproms dann mit H1, H2 oder L1,
L2 usw. Beschriftet werden. Das ist meistens von der bereits auf der
Karte vergebenen Beschriftung abh&auml;nging. Sollten die Eproms
vertauscht werden, so z.B 'H' mit 'L' oder z.B 'H1' mit 'L1' wird die
Karte unter keinen Umst&auml;nden funktionieren! Hier kann beim
Arbeiten also eine gewisse Umsicht und/oder Reihenfolge sehr von
Nutzen sein. Wer will schon Stundenlang Eproms auf Verdacht umstecken.
</p>
<p>Eindringlich sei hier noch mal Erw&auml;hnt das Eproms mit einer
Zugriffszeit von mehr als 200nS funktionieren k&ouml;nnen, das aber
auf keinen Fall auch immer tun m&uuml;ssen. Bei Zugriffsproblemen wird
der Fehler i.d.R sicher immer zuerst hier zu suchen sein. Und
Logischerweise, wie bei allem, ist auf das korrekte einsetzen der
Eproms und auf das richtige Einstecken der Karten in den <a href="0c09.htm" target="UDOcon">Romport</a> zu
achten. Ebenfalls darf keine 'High' oder 'Low' Position vertauscht
sein. Beachtet man diese kleinen Regeln wird man sicher eine lange
Zeit viel Freude an einem sonst brachliegendem Medium haben. F&uuml;r
einen l&auml;ngeren Gebrauch ist ein passendes Geh&auml;use f&uuml;r
eine solche Karte nicht schlecht, es sammelt sich so kein Staub auf
den Bauteilen, und es kann nichts passieren wenn beim 'hantieren' mal
eine Schraube herrunterf&auml;llt ;-) Geeignete Geh&auml;use wurden
bei 128er Karten teilweise mitgeliefert, f&uuml;r eine
gr&ouml;&szlig;ere Karte sollte man sich im Fachhandel umsehen. Eine
mechanische Bearbeitung eines solchen Kunststoffgeh&auml;uses ist
allerdings leider nicht ganz zu vermeiden.
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c09.htm" target="UDOcon"><img src="udo_up.gif" alt="Romport" border=0 width="24" height="24"></a>
<a href="0c0901.htm" target="UDOcon"><img src="udo_lf.gif" alt="Romportbuffer" border=0 width="24" height="24"></a>
<a href="0c0903.htm" target="UDOcon"><img src="udo_rg.gif" alt="Romport-Digitizer" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
