<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Tower - Umbau Falcon F030
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0d.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon - Umbau" border=0 width="24" height="24"></a>
<a href="0d.htm" target="UDOcon"><img src="udo_lf.gif" alt="Falcon - Umbau" border=0 width="24" height="24"></a>
<a href="0d02.htm" target="UDOcon"><img src="udo_rg.gif" alt="Desktopper" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Tower_20-_20Umbau_20Falcon_20F030">13.1 Tower - Umbau Falcon F030</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>TowerFalconF030 im Eigenbau</tt>
<br>
</p>
<p><tt><a href="0205.htm" target="UDOcon">Information</a> vor dem Begin</tt>
<br>
</p>
<p><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>Diese Anleitung vor dem Zerlegen des Falcons bitte m&ouml;glichst
komplett durchlesen.
<br>Diese Anleitung wurde nach besten Wissen und Gewissen erstellt,
Fehler k&ouml;nnen aber trozdem nie ausgeschlossen werden. Alle
technischen Informationen beruhen auf eigenen Kenntnissen und
teilweise auch auf &ouml;ffentlich erh&auml;ltlichen Informationen
sowie eigenen &auml;lteren ST-Umbauten.
<br>
</p>
<p>Es d&uuml;rfte klar sein das aus dieser Anleitung nicht jeder
Umbau komplett abgeleitet werden kann und das auch der <a href="0201.htm" target="UDOcon">Autor</a> keine
Tips geben kann die zu 100% auf jeden Anwendungsfall zutreffen. Eine
Funktionsgarantie sowie eine Haftung bei selbst verursachten
Hardwaresch&auml;den wird nicht &Uuml;bernommen!
<br>
</p>
<p><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>
<br>
<br><b>- Der Umbau</b>
</p>
<p>Die Tatsache das ein Atari, in diesem Fall der Falcon, mit seinen
externen Zusatzger&auml;ten auf dem Schreibtisch ein mehr oder weniger
gro&szlig;es Kabelchaos verursacht treibt viele Falconbesitzer dazu
dem Falcon ein anst&auml;ndiges Untertischgeh&auml;use zu verpassen.
Auf dem Tisch sollte nur die Tastatur, die Maus und der Bildschirm
verbleiben.
<br>
</p>
<p>
<br><b>- Das Geh&auml;use</b>
</p>
<p>Zu diesem Zweck sollte man sich nach einem PC-Towergeh&auml;use
umsehen. Bei diversen Fachh&auml;ndlern kann man da sehr schnell
f&uuml;ndig werden. Bei verschiedenen Atari-H&auml;ndlern gibt es
genau zu diesem Zweck fertige Geh&auml;use die f&uuml;r den Einbau
eines Falcon oder eines anderen Atari-Computers vorgesehen sind.
Hierzu sollte man die jeweilige dazu passende Einbauanleitung des
bereffenden Herstellers genauestens befolgen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tower7.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 1 - Ein fertiges Towergeh&auml;use </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Diese vorbearbeiteten Towergeh&auml;use haben allerdings ihren
Preis und auch einige Vorteile f&uuml;r Leute die handwerklich nicht
so begabt sind oder eben ganz einfach nicht die M&ouml;glichkeiten
haben um ein Geh&auml;use entsprechend zu bearbeiten. Ein
ausgestanztes Loch sieht eben immer besser aus wie ein selbst aus
gefeiltes! Es f&auml;ngt mit den passenden L&ouml;chern f&uuml;r die
Schnittstellenbuchsen an und h&ouml;rt mit dem richtigen
Anschlu&szlig;stecker f&uuml;r das Falcon Mainboard noch nicht auf.
<br>
</p>
<p>
<br>
<br><b>- Selber gemacht oder fertig</b>
</p>
<p>Im Fall das man sich f&uuml;r einen kompletten Eigenbau
entscheidet sollte man bei der Geh&auml;useauswahl darauf achten das
die Falconplatine auch wirklich in das Geh&auml;use passt. Manche
PC-Geh&auml;use haben einen riesengro&szlig;en Laufwerkshalter in den
zwar Problemlos auch 5 1/4&quot; Laufwerke passen, aber andererseits
den Einbau der Falconplatine behindert. Das Falconmainboard sollte
komplett auf die freie Montagefl&auml;che des Towers passen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tower9.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 2 - Die Platine mu&szlig; komplett passen </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Ganz Interessant fand ich die neuen Geh&auml;use einiger
PC-<a href="1604.htm" target="UDOcon">H&auml;ndler</a>, das kann man seitlich wie einen Schuhschrank mittels
einem T&uuml;rchen &ouml;ffnen! Alle Komponenten sind somit sofort und
&auml;usserst leich zug&auml;nglich. Was nie passt sind nat&uuml;rlich
die Halterungen f&uuml;r die Hauptplatine. Aber auch das l&auml;sst
sich immer Regeln. Sehr wichtig ist das die Platine des Falcon nicht
verspannt oder verbogen befestigt wird. Beachten sie das nicht wird
sich ihr Falcon mit diversen Ausgf&auml;llen f&uuml;rchterlich
R&auml;chen. Und das wird nicht gleich sofort oder morgen sein! Man
kann nur vorher warnen!
<br>
</p>
<p>Je weniger Platinenoberfl&auml;che von dem PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> oder des
Laufwerktr&auml;gers verdeckt wird desto besser ist die sp&auml;tere
Handhabung bzw. desto leichter ist die sp&auml;tere Nachr&uuml;stung
der einen oder der anderen Erweiterung. Das Falconmainboard besitzt
einige Befestigungsl&ouml;cher die man sich am besten aus dem
originalen Plastikgeh&auml;use oder eben der bereits ausgebauten
Falconplatine mittels einer Schablone 1:1 abzeichnet. Auch kann diese
Schablone ruhig schon so in etwa die Positionen der
Schnittstellenbuchsen beinhalten die sich an der Falcon-R&uuml;ckwand
befinden. Es geht auch wenn man das Unterteil des Falcongeh&auml;uses
als Schablone f&uuml;r die Buchsen verwendet. Mit dieser Schablone
sollte es nun relativ einfach sein die Befestigungsstellen der Platine
auf die Trageteile des Towers zu &uuml;bertragen. Wenn eine oder zwei
Bohrungen nicht passen sollten ist das auch kein Beinbruch, solange
man sp&auml;ter nicht wie ein wilder an der Platine hantiert. Als
erster Schritt ist dazu der Falcon zu &ouml;ffen und aus seinem
original Geh&auml;use zu entfernen. Man m&ouml;ge eine eventuell noch
vorhandene Ger&auml;tegaratie bedenken! Es sollte hier beachtet werden
das es Unbedingt zu vermeiden ist die Falconplatine mechanischen
Belastungen auszusetzten, also weder Verkanten noch verbiegen oder als
Ablage benutzen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tower4.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 3 - Das Mainboard ist komplett drin </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Die Falconplatine ist ein sog. Multilayer der nun mal aus vielen
verschiedenen Schichten besteht, Sch&auml;den die durch mechanisches
Belasten an einer der inneren Schichten entsteht sind nacher nicht
mehr zu Beheben! Der Falcon ist somit irreparabel Besch&auml;digt.
Auch sollte bei L&ouml;tarbeiten stets bedacht werden das ein 'Braten'
an einem L&ouml;tpunkt die Platine dauerhaft besch&auml;digen kann.
Die Anschirmbleche sind durch vorsichtiges Aufbiegen der seitlichen
Blechlaschen zu entfernen, sie werden nicht mehr ben&ouml;tigt. Auch
gibt es hier einige Befestigungsschrauben die die Blechhaube mit der
Platine zusammen im Kunststoffunterteil festh&auml;lt.
<br>
</p>
<p>Auch beim sp&auml;teren Befestigen in dem neuen Geh&auml;use
sollte man peinlichst darauf achten das die Platine nicht verspannt
oder gebogen wird! Gerade hier treten dann diverse Verspannungen auf
wenn nur ein einziges Loch nicht genau auf dem Punkt gebohrt wurde.
<br>
</p>
<p>
<br>
<br><b>- Komplett zerlegen</b>
</p>
<p>Zum Ausbau der Falconplatine ist es g&uuml;nstig wenn man das
Diskettenlaufwerk und die interne Festplatte sowie das <a href="0f01.htm" target="UDOcon">Netzteil</a> vorher
ausbaut. Das Diskettenlaufwerk ist mit vier Schrauben auf der
Rechnerunterseite befestigt, eine Schraube h&auml;lt einen
Zentrierstift aus Metall im innern des Rechners. Das interne
IDE-Festplattenlaufwerk ist mir vier Schrauben gegen die Hauptplatine
verschraubt. An beiden Laufwerken ist das Flachbandkabel vorsichtig
abzuziehen und am besten gegen falsches Aufstecken zu markieren. An
der <a href="060402.htm" target="UDOcon">IDE-Platte</a> bleiben rechts 4 Stifte frei, das ist das Jumperfeld.
(Kann bei anderen Festplatten verschieden sein)
<br>
</p>
<p>Beim erneuten Montieren mit dem alten Laufwerkstr&auml;ger aus dem
Falcon unbedingt darauf achten das die Befestigungsschrauben der
Platte nicht angeknallt werden, der Blechtr&auml;ger verzieht sich
dadurch und verwindet die 2.5&quot; Platte. Ein Laufwerksschaden
w&auml;hre so nicht Auszuschliessen. Was sich manchmaldurch seltsame
Ger&auml;usche der Platte ank&uuml;ndigt. Wird das Laufwerk
sp&auml;ter ohne diesen Blechhalter montiert sind unbedingt vorher die
passenen Schrauben zu besorgen. Falsche oder zu lange Schrauben
zerst&ouml;ren die empfindliche Platte! Wenn keine Schrauben in
Zoll-Gewinde aufzutreiben sind kann man hier als letzte Notl&ouml;sung
ein M3 metrisches Gewinde einschneiden. Allerdings gibt das
Aluminiumsp&auml;ne die u.U durch Ausblasen nur noch tiefer in der
Laufwerkselektronik verschwinden!! Die Sp&auml;ne zerst&ouml;ren durch
Kurzschl&uuml;sse die Elektronik!!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tower6.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 4 - Laufwerkstr&auml;ger im Falcontower </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Normalerweise kann man die passenden Schr&auml;ubchen immer da
bekommen wo man auch Festplatten und Laufwerkstr&auml;ger ect. kaufen
kann. Gut sortierte Eisenwarenfachh&auml;ndler sollten da auch helfen
k&ouml;nnen. Das mit dem Gewinde nachschneiden bitte wirklich nur im
&auml;ussersten Notfall anwenden, oder wenn z.B sowieso schon das
Gewinde besch&auml;digt wurde. Leicht Festzustellen wenn die Schrauben
nur schwer wieder in die Gewindel&ouml;cher der Platte passen.
<br>
</p>
<p>
<br>
<br><b>- <a href="0f01.htm" target="UDOcon">Netzteil</a>, die Quelle der Kraft</b>
</p>
<p>Das interne <a href="0f01.htm" target="UDOcon">Netzteil</a> besitzt einen Flachstecker der die
Stomverbindung zur Hauptplatine herstellt. Schwarz ist GND, Rot +5
Volt und Gelb bef&ouml;rdert +12V zur Falconplatine. Wer hier ganz
sicher gehen will sollte vorher, also bevor der Falcon zerlegt wird,
hier mit einem Voltmeter das richtige anliegen der Versorgungsspannung
testen bzw. Nachmessen. Die Anschl&uuml;sse am <a href="0f01.htm" target="UDOcon">Netzteil</a> des
Towergeh&auml;uses sind warscheinlich zu kurz und m&uuml;ssen
sp&auml;ter in der richtigen Reihenfolge und in der richtigen
Polarit&auml;t bis zu dem Platinenanschlu&szlig; verl&auml;ngert
werden. Es ist sehr Sinnvoll das irgendwo dauerhaft zu Notieren!
<br>
</p>
<p>Dazu doch sp&auml;ter mehr. S&auml;mtliche Steckverbinder gibt es
in guten Elektronikl&auml;den. Hier in der Gegend ist da z.B die Firma
Zimmermann-Elektronik oder die Firma Elpro, beide in Darmstadt zu
finden, meist ganz gut Best&uuml;ckt. Nat&uuml;rlich kann es auch
Hilfreich sein wenn man hin und wieder mal ein altes elektronisches
Ger&auml;t vor dem wegwerfen Ausschlachtet. Da trifft man schon so
manchen passenden Stecker :)
<br>
</p>
<p>
<br>
<br><b>Hier zu noch ein Tip von Mark Ansbach</b>
</p>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p>Um das Falcon-<a href="0f01.htm" target="UDOcon">Netzteil</a> sp&auml;ter durch das im Tower vorhandene
PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> leicht ersetzen zu k&ouml;nnen kann man sich hier einen
Adapterstecker bauen. Im Fachhandel gibt es
Verl&auml;ngerungs-Kabels&auml;tze f&uuml;r PC-Netzteile. Man besorgt
sich eine solche Verl&auml;ngerung und &ouml;ffnet die Stecker, die
einzelnen Kontaktfedern werden dann von den Litzen getrennt. Das
gleiche macht man mit dem originalen Atari-Stecker. (vorher Stecker
aufgemalen!) Einfach nur damit es nicht vergessen geht und nichts
Vertauscht wird. Um den Adapter herzustellen werden dann einfach die
Stecker an das jeweils andere Kabelb&uuml;ndel angel&ouml;tet.
<br>
</p>
<p>Vorteil: Das Atari-<a href="0f01.htm" target="UDOcon">Netzteil</a> hat jetzt einen PC-Stecker (nicht
vollst&auml;ndig belegt), das Atari-Mainboard einen Adapter f&uuml;r
PC-Netzteile und das PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> ist noch unver&auml;ndert. Jetzt
lassen sich sowohl Atari- als auch PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> einfach anstecken. So
lie&szlig;e sich &uuml;brigens auch noch eine PowerGood-Leitung
anbringen (an den Adapter), die vom <a href="0f01.htm" target="UDOcon">Netzteil</a> durch abstecken trennbar
ist.
<br>
</p>
<p>Vielleicht hilft das ja jemandem...
<br>Gru&szlig;, Mark
<br>
</p>
<p>Die R&uuml;ckwand des PC-Towergeh&auml;uses entspricht leider
nicht den Anschl&uuml;ssen die der Falcon an seiner R&uuml;ckwand zur
Verf&uuml;gung stellt. Hier gibt es zwei M&ouml;glichkeiten. Zu ersten
kann man die R&uuml;ckwand der Towers komplett herraustrennen. Viel
Metallbearbeitung ist eine Vorraussetzung, zum zweiten k&ouml;nnte man
s&auml;mtliche Falcon-Schnittstellen mittels 1:1 D-Sub Buchsen und
Steckern sowie mit Flachbandkabelsoweit verl&auml;ngern bis eben die
Buchsen in die am PC-Geh&auml;use vorhandenen Aussparungen reichen.
Das bringt nat&uuml;rlich etwas mehr L&ouml;tarbeit mit sich. Es
entstehen so aber jederzeit l&ouml;sbare Verbindungen die auch bei
einem weiteren Ausbau oder einer eventuell mal n&ouml;tig werdenden
Reparatur oder einem Boardtausch recht n&uuml;tzlich beiben. Der
Aufwand ist h&ouml;her, kann sich aber schon an Hand der freien
Auswahl des Montageplatzes f&uuml;r die Schnittstellen auszahlen. Im
ersten Fall w&uuml;rden die Buchsen alle auf einer Seite der
R&uuml;ckwand herrausschauen, eben so wie vorher am Falcon. F&uuml;r
die Schlitze in der PC-R&uuml;ckwand gibt es beim gut sortierten
PC-<a href="1604.htm" target="UDOcon">H&auml;ndler</a> sog. Slotbleche die Befestigungsm&ouml;glichkeiten
f&uuml;r 9, 15 und 25 polige D-Sub-Verbinder haben. Man kann die
Buchsen u. Stecker dann in diese Slotabdeckungen schrauben und diese
dann wiederrum im PC befestigen. Das d&uuml;rfte die sauberste
L&ouml;sung an sich sein. Die Herstellung einer neuen R&uuml;ckwand
ist ja nicht jedermans Handwerk.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tower1.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 5 - Die Anschlu&szlig;m&ouml;glichkeiten auf der
R&uuml;ckwand </tt>
<br>
<br>
<br>
</div>
<p align=center><img src="image/tower2.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 6 - R&uuml;ckwand mit Anschlu&szlig;buchsen </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>In diesem Fall m&uuml;ssten alle Verbindungen zwischen den Buchsen
am Falcon und den Buchsen in der R&uuml;ckwand mittels 1:1
Kabelverbindungen hergestellt werden. Servicefreundlich ist das schon.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/padpomod.gif" border=0 width="236" height="173"></p><br>
<div align=center><tt>Abbildung 7 - Die Paddleports werden verl&auml;ngert </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Man sollte nicht vergessen auch die beiden Paddleports des F030 an
einer geeigneten Stelle nach aussen zu f&uuml;hren. Sieht es auch im
ersten Moment nicht danach aus, nach 2 Monaten m&ouml;chte man
vieleicht doch ein Spiel laden das z.B die Jaguar-Joypads abfragt. Ein
wesentlich h&ouml;herer Spielkomfort.
<br>Die beiden Paddleports k&ouml;nnen mit passenden Steckern und
Buchsen einfach 1:1 verl&auml;ngert werden. Allgemein geht das mit
jeder Schnittstelle, ausser dem <a href="0c09.htm" target="UDOcon">Romport</a>.
<br>
</p>
<p>
<br>
<br><b>- Eingebaut</b>
</p>
<p>Bevor wir nun zum L&ouml;ten kommen sollte man alle mechanischen
Arbeiten soweit wie wie m&ouml;glich Abgschlossen haben. Und alle
Schnipsel sowie Sp&auml;ne bereits komplett beseitigt haben. Die
Falconplatine sollte mit Kunststoff-Abstandsbolzen, Schrauben oder den
normalen Plastiklipsen f&uuml;r Mainboards bereits an ihrem Platz
befinden. Und mit keinem einzigen L&ouml;tpunkt auf der
Platinenunterseite irgendwo am Towergeh&auml;use anliegen.
<br>
</p>
<p>Kunststoffbefestigung deshalb da das metallene PC-Geh&auml;use
verbindung mit dem Schutzleiter der Netzspannung hat welche
sp&auml;ter am PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> angesteckt wird. Zur vermeidung von
St&ouml;rungen aber nicht unbedingt mit der Rechnermasse des Falcons
in Verbindung gebracht werden mu&szlig;. Nachdem das Mainboard nun an
seinem Platz sitzt kann man sich schon um den richtigen Anschlu&szlig;
des PC-Netzteils k&uuml;mmern. Die meisten Towergeh&auml;use haben
f&uuml;r ihren Preis ein 220 Watt Schaltnetzteil eingebaut. Die
Leistung ist f&uuml;r unseren Umbau mehr als ausreichend. Was nicht
passt ist der Mainboardstecker f&uuml;r die Rechner-Stormversorung,
dieser ist f&uuml;r ein PC-Mainboard ausgelegt. Wer sich das vorher
genau Notiert hatte braucht jetzt eigentlich nur die richtigen
Dr&auml;hte mit der richtigen Farbe in die L&ouml;cher des Steckers
stecken. Die meisten Stifte dieser Steckverbindungen lassen sich durch
biegen einer winzigen Lasche aus ihrem alten Stecker ziehen. Biegt man
die Lasche wieder nach aussen kann man den Stift in den neuen Stecker
stecken. Beim Falcon wird das wegen den flachen Stiften eventuell
Probleme geben. Eventuell lassen sich bei manchen PC-Netzteilen die
Mainboardstecker aufhebeln um die Steckh&uuml;lsen zu entnehmen. In
der richtigen Farbe und Reihenfolge kann man die dann in dem neuen
Stecker einstecken. Hilft das alles nicht mu&szlig; gel&ouml;tet
werden. Sollte sich dieser Stecker nirgens auftreiben lassen nimmt man
zu Not, wirklich nur zur Not!, den des ausgebauten Falconnetzteils.
Den Stecker sollte man auch im gut sortierten Computer-Zubeh&ouml;r
bekommen. (Siehe weiter oben)
<br>
</p>
<p>Rot ist am PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> + 5 Volt
<br>Gelb +12 Volt
<br>Schwarz GND
<br>
</p>
<p>Eigentlich also &auml;hnlich wie am <a href="0f01.htm" target="UDOcon">Netzteil</a> des Falcon!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/powersup.gif" border=0 width="340" height="120"></p><br>
<div align=center><tt> Abbildung 8 - So ist der Stecker eines Falcon-Netzteiles
belegt. </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>G7 / H8 sind die Punke f&uuml;r den Anschlu&szlig; eines
zus&auml;tzlichen CPU-K&uuml;hlers! Kein Riesenl&uuml;fter! Max. 50mA
! Bedenken Sie bitte das der 12V-Regler des original <a href="0f01.htm" target="UDOcon">Netzteil</a> (IC3)
lediglich 200mA liefern kann!
<br>Direkt an der Netzteilplatine kommt man leicht an die Kabel ran.
<br>
</p>
<p>Die +12V werden auf den SKYNET-PSUs mittels IC3 erzeugt. Das ist
nur ein 200mA +12V Spannungsregler im Plastikgeh&auml;use!
<br>Bei Netztteilen des Herstellers SKYNET kommt es hin und wieder vor
das bei hohen Innentemperaturen die &Uuml;bertragerspule innen einen
Kurzschlu&szlig; bekommt. Diese Spule ist als Ersatzteil leider kaum
einzeln zu erhalten. Das <a href="0f01.htm" target="UDOcon">Netzteil</a> sollte aus Sicherheitsg&uuml;nden
nicht mit einem &auml;hnlichen &Uuml;bertrager repariert werden!
<br>
</p>
<p>Ausserdem sollte man wirklich genau darauf achten was man hier
macht. Ein falscher Anschlu&szlig; zerst&ouml;rt das <a href="0f01.htm" target="UDOcon">Netzteil</a>, den
Falcon in jedem Fall! Traut man sich das nicht zu sollte das jemand
machen der davon Ahnung hat! Die meisten Fehler passieren hier beim
Einstecken der Leitungen. Durch falsch herrum gehaltene Stecker sind
die Spannungen genau Spiegelverkehrt angelegt, der sichere Tot des
Falcon einschlie&szlig;lich Floppy und der bereits montierten
Festplatte!
<br>
</p>
<p>Man kann die +5V, die +12Volt sowie die Masse auch mit einem
Filzstift auf dem Mainboard und dem Stecker markieren. Der Platine tut
das nicht weh, sofern es nicht als Best&uuml;ckungsaufdruck schon auf
der Falconplatine steht. Schaltnetzteile zumx usprobieren nicht ohne
Grundlast laufen lassen! Zum Ausprobieren eine 6V Gl&uuml;hbirne an
den 5Volt und eine 12Volt Birne an den 12Volt-Zweig des Netzteiles
anschliessen. Nur zur Sicherheit. Manche Netzteile haben ohne
Grundlast eine h&ouml;here 12V Spannung oder erzeugen seltsame
Ger&auml;usche die u.U zur Zerst&ouml;rung des selben f&uuml;hren
k&ouml;nnen. Man kann die Spannungen auch messen wenn die
Gl&uuml;hbirnen dranh&auml;ngen, schliesslich beissen die ja nicht. 2
Watt pro (Auto) Gl&uuml;hbirne reichen v&ouml;llig aus. In vielen
Netzteilen dient der interne 12 Volt L&uuml;fter bereits als Gundlast,
also den dann auch nicht abstecken.
<br>
</p>
<p>
<br>
<br><b>- Unsere Einkaufsliste</b>
</p>
<p>Vor dem gesammten Umbau sollte man sich vieleicht ein Liste der
n&ouml;tigen Kleinteile anfertigen um die Teile dann gesammelt
irgendwo zu kaufen. Hard &amp; Soft-Herberg ist da z.B ganz gut
ausgestattet. &Auml;rgerlich wenn man seinen Rechner nach dem Umbau
nicht testen kann weil ein einziger Stecker fehlt.
<br>Ebenso gibt es bei H&amp;S fertige Verl&auml;ngerungen f&uuml;r
die interne IDE-Festplatte sowie f&uuml;r das 3.5&quot;
Floppylaufwerk. Beide Laufwerke passen ja nicht mehr an den
urspr&uuml;nglichen Platz. Das Diskdrive nicht weil man keine Diskette
einstecken kann, die interne Platte nicht da einige Festplatten in
einer seitlichen Lage nicht betrieben werden d&uuml;rfen.
(Lagersch&auml;den w&auml;hren die Folge) Wer sich die technischen
Daten seiner internen Platte besorgt kann vorher feststellen ob die
Platte in der Seitenlage betrieben werden darf, oder ob die Platte nur
in der normalen Lage laufen sollte.
</p>
<p>Sollte die Platte seitlich betrieben werden d&uuml;rfen schrauben
wir das Ger&auml;t wieder an seinen alten Platz und achten auch darauf
das das Flachkabel korrekt und in der richtigen Richtung aufgesteckt
wird. An der Stiftleiste bleiben rechts PINs frei. Man beachte die
Schrauben! (Siehe weiter oben) Im &uuml;brigen bring ein wahnwitziges
Verl&auml;ngern des IDE-Kabels bis auf diverse Datenverluste nichts.
Besser ist es i.d.R darauf zu achten das ein IDE-Festplattenkabel so
kurz wie nur irgendm&ouml;glich zu halten ist, 20 cm k&ouml;nnen im
Einzelfall schon zu erheblichen St&ouml;rungen beitragen. Man ist hier
schon geneigt zu sagen das man lieber auf die an der SCSI2-Buchse
angeschlossenen <a href="0605.htm" target="UDOcon">SCSI-Festplatten</a> ausweichen sollte und die interne
<a href="060402.htm" target="UDOcon">IDE-Platte</a> am besten da l&auml;st wo sie sich befindet. Ausnahme siehe
Einbaulagen, Lagersch&auml;den ect.
<br>Es bringt auch nicht viel den IDE-Bus &uuml;ber sog.
Bi-Direktionale Treiber zu verst&auml;rken, in wenigen F&auml;llen ja,
jedoch ist das <a href="030503.htm" target="UDOcon">Timing</a> der Falcons so eng und kritisch das man sich
damit eigentlich mehr &Auml;rger als Nutzen einhandelt.
<br>
</p>
<p>
<br>
<br><b>- ohne Tastatur</b>
</p>
<p>Ein weiter wichtiger Punkt ist die Tastatur. Passen tut die so ja
nicht mehr. Einige Lieferranten von fertigen Towern bieten ganz genau
zu diesem Zweck fertige abgesetzte Tastaturl&ouml;sungen in einem
Tastaturgeh&auml;use an oder verkaufen mit dem Towergeh&auml;use
modifizierte PC-Keyboards. Einfaches Verl&auml;ngern der
Keyboardanschl&uuml;sse geht nicht ohne weiteres und ist auch nicht zu
empfehlen, Fehlfunktionen die bis zur Zerst&ouml;rung des
ACIA-Bausteins im Falcon gehen k&ouml;nnten hier die Folgen sein.
Sicherer ist es hier auf eine fertige L&ouml;sung
zur&uuml;ckzugreifen. Auch gibt es hier L&ouml;sungen mit
PC-Tastaturen die aber wiederrum alle ein Interface ben&ouml;tigen.
Wem das zu teuer ist mu&szlig; und kann die eigene Tastatur verwenden.
Erforderlich ist eine Treiberschaltung mit einem einzigen TTL-IC. Die
Tastatur wird dann &uuml;ber diese Schaltung und ein wenig Spiralkabel
mit dem Falcon verbunden. Das Spiralkabel k&ouml;nnte ruhig eine
Abschirmung haben. Entsprechendes Spiralkabel gibt es im
einschl&auml;gigen Fachhandel.
<br>
</p>
<p>Es soll noch gesagt werden das es m&ouml;glich ist ein <a href="0c02.htm" target="UDOcon">Keyboard</a>
eines MegaSTE oder eines TT f&uuml;r den Towerumbau zu benutzen. Diese
Keyboards gibt/gab es als Ersatzteil beim freundlichen
Atari-<a href="1604.htm" target="UDOcon">H&auml;ndler</a>. Wer sich daf&uuml;r n&auml;her Interessiert sollte
mal bei einen der <a href="1604.htm" target="UDOcon">H&auml;ndler</a> nachfragen.
<br>
</p>
<p>Man spart sich so den Umweg &uuml;ber die diversen PC-Keyboards
die allesamt wieder ein Interface ben&ouml;tigen und in den wenigsten
F&auml;llen korrekt Beschriftet sind. Jedenfalls bei den
Funktionstasten ect.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/keybomod.gif" border=0 width="183" height="109"></p><br>
<div align=center><tt>Abbildung 9 - modifizierter Keyboardanschlu&szlig; &uuml;ber
langes Kabel </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Im neuen Atari-<a href="0302.htm" target="UDOcon">Falcon F030</a> gibt es zum anschlie&szlig;en der
Tastatur eine 10 polige Pfostenleiste die mit der im 1040 ST/E
identisch ist. Hier untenstehend also gleich die Pinbelegung der
Pfostenleiste im <a href="0302.htm" target="UDOcon">Falcon F030</a>. Etwas weiter unten die Belegung des
Steckers der Mega oder TT-Tastatur. Man kann so schon sofort sehen
welche Verbindungen herzustellen sind.
<br>
</p>
<p>
<br>
<br><b><a href="0c02.htm" target="UDOcon">Keyboard</a> - Anschlu&szlig;leiste im Atari <a href="0302.htm" target="UDOcon">Falcon F030</a></b>
<br>
</p>
<dl>
<dt><b>Stiftnummer/Anschlu&szlig;:</b></dt><dd>
<br>
<br>&nbsp;
<dt><b>Pin 10</b></dt><dd> (KroK) (<a href="0c02.htm" target="UDOcon">Keyboard</a> Datenempfang OK)
<br>&nbsp;
<dt><b>Pin 9</b></dt><dd> (KtoK) (<a href="0c02.htm" target="UDOcon">Keyboard</a> Datensendung OK)
<br>&nbsp;
<dt><b>Pin 8</b></dt><dd> GND-Signalmasse der Tastatur
<br>&nbsp;
<dt><b>Pin 7</b></dt><dd> Reset-Signal f&uuml;r den Tastaturprozessor
<br>&nbsp;
<dt><b>Pin 6</b></dt><dd> TxD-Sendedaten des Tastaturprozessors
<br>&nbsp;
<dt><b>Pin 5</b></dt><dd> RxD-Empfangsdaten des Tastaturprozessors
<br>&nbsp;
<dt><b>Pin 4</b></dt><dd> +5V Versorgung von der Hauptplatine &uuml;ber MFP!
<br>&nbsp;
<dt><b>Pin 3</b></dt><dd> HD/Floppy (5V) Ansteuerung f&uuml;r die Leuchdiode
<br>&nbsp;
<dt><b>Pin o</b></dt><dd> Leerfeld, damit der Stecker nur in einer Richtung passt
<br>&nbsp;
<dt><b>Pin 1</b></dt><dd> GND oder auch 5V Return / Masse-Signalmasse
<br>&nbsp;
<dt><b>Tastaturstecker/Westernstecker</b></dt><dd>
<br>
<br>&nbsp;
<p align=center><img src="image/keybstec.gif" border=0 width="170" height="120"></p><br>
<div align=center><tt> Abbildung 10 - Anschlu&szlig;stecker </tt>
<br>
</div>
</dl>
<p>Weitere Informationen bez&uuml;glich der Tastatur siehe &quot;Ein
abgesetztes <a href="0c02.htm" target="UDOcon">Keyboard</a> am Falcon&quot;
<br>Unter Schnittstellen finden sie weitere wichtige Tips
bez&uuml;glich der Tastatur.
<br>
</p>
<p>
<br>
<br><b>- Die Laufwerke</b>
</p>
<p>Das Diskettenlaufwerk l&auml;sst sich auf einem alten
Einschubblech montiert hervorragend in einen der Laufwerkstr&auml;ger
des Towers einschieben und Befestigen. Vorzugsweise d&uuml;rfte das
sicher bei allen der oberste Schacht sein sofern dieser nicht f&uuml;r
ein <a href="0701.htm" target="UDOcon">CD-ROM</a> verwendet wird. Das interne Floppy hat einen extra
Stromstecker f&uuml;r den es auch passende Adapter gibt.
(Computerzubeh&ouml;r) z.B auch Conrad-Elektronik Das Flachbandkabel
mu&szlig; bis zur Platine des Falcon verl&auml;ngert werden. Es gibt
fertige Verl&auml;ngerungen die keine zus&auml;tzlichen
L&ouml;tarbeiten mit sich bringen, selbstgebaute Adapterkabel haben
meist die Angewohnheit irgendwo falsch Aufgel&ouml;tet zu sein. Solche
Kabel k&ouml;nnen bei vielen Lieferranten nach Angabe der l&auml;nge
in Meter bezogen werden.
<br>
</p>
<p>Die einzige farbig markierte Ader am Flachbandkabel ist in den
meisten f&auml;llen Pin 1 des/der Stecker, bitte Kontrollieren ob das
auch so ist!
<br>
</p>
<p>Darf die Festplatte in keiner Seitenlage betrieben werden ist mit
der internen 2.5&quot; <a href="060402.htm" target="UDOcon">IDE-Platte</a> genau so zu Verfahren. Die
<a href="060402.htm" target="UDOcon">IDE-Platte</a> bezieht ihre Versorungsspannung &uuml;ber das
Flachbandkabel! Vorsicht beim Aufstecken.
<br>Nicht Verpolen.
<br>Alle Kabel, auch die Flachbandkabel von den Laufwerken werden
sp&auml;ter mit 2-3 Klebeschellen und Kabelbindern im Geh&auml;use
ordentlich und Sauber verlegt. Das sieht nicht nur gut aus sondern
tr&auml;gt auch noch wesentlich zur Betriebssicherheit bei!
<br>
</p>
<p>Mehr zu Diskettenlaufwerken finden sie in <a href="160a.htm" target="UDOcon">DOIT_ST</a>
<br>
</p>
<p>
<br>
<br><b>- Ein erster Test</b>
</p>
<p>Wenn die Laufwerke und die Tastatur angeschlossen sind k&ouml;nnte
man den Tower einem ersten Test unterziehen, hierzu sollte der Monitor
angeschlossen werden. Ist der Monitor &uuml;ber einen externen
<a href="0806.htm" target="UDOcon">ScreenBlaster</a> angeschlossen sollte man sicherstellen das auch das
Steuerkabel des ScreenBlasters in dem richtigen <a href="0c0c.htm" target="UDOcon">Paddleport</a> des Falcon
steckt. Nur so kiegt man dann auch sein gewohnte Aufl&ouml;sung auf
den Bildschirm :-) Am Towernetzteil befindet sich eine weitere
Netzbuchse, hier kann die Netzteilung des Monitors mit einem geeigeten
Stecker angeschlossen werden. Das hat den Vorteil das der Monitor mit
dem Tower gleichzeitig Ein bzw. auch Ausgeschaltet wird.
<br>
</p>
<p>Ist bis hier alles korrekt gelaufen sollte der Rechner nach dem
Einschalten v&ouml;llig normal booten.
<br>
</p>
<p>Tut er das nicht sofort Abschalten und zuerst die
Versorgungsspannung testen!
<br>
</p>
<p>- Monitor angeschlossen?
<br>- Monitor eingeschaltet?
<br>- <a href="0806.htm" target="UDOcon">ScreenBlaster</a> &amp; Steuerkabel angsteckt?
<br>- Kabel falsch auf das Floppy gesteckt?
<br>- Tastatur richtig angschlossen?
<br>- Hat die LED am <a href="0c02.htm" target="UDOcon">Keyboard</a> geleuchtet? (Ist das nicht der Fall
k&ouml;nnte die Tastatur falsch angeschlossen sein)
<br>- f&auml;hrt die Platte hoch?
<br>- Flackert die Zugriffs LED ?
<br>
</p>
<p>Notfalls das alte original Falcon-<a href="0f01.htm" target="UDOcon">Netzteil</a> zum Test am Mainboard
anschiessen.
<br>
</p>
<p>- L&auml;uft der Rechner jetzt korrekt an?
<br>Wenn er es jetzt tut ist leider eine kleine Modifikation zwischen
dem Falconmainboard und dem PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> notwenig.
<br>
</p>
<p>
<br>
<br><b>- <a href="0f01.htm" target="UDOcon">Netzteil</a> modifizieren</b>
</p>
<p>Viele PC-Netzteile haben eine 'PowerGood-Leitung' (Oranges oder
wei&szlig;es Kabel) f&uuml;r das es ja am Falcon-Mainboard kein
Anschlu&szlig; gibt. Es hat damit folgende Bewandniss.
<br>Das PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> h&auml;lt damit das Rechnermainboard solange im
PowerON-Reset fest bis eben die Spannungen des PC-Netzteils stabil
abgegeben werden k&ouml;nnen. Ist das nicht der Fall st&uuml;rzt der
Falcon gnadenlos ab oder bootet nicht korrekt bzw. er l&auml;uft erst
nach mehreren Versuchen richtig.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/towpsu.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt>Abbildung 11 - Towernetzteil mit modifiziertem Stecker </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Hierzu w&auml;re es erforderlich einen Anschlu&szlig; f&uuml;r die
PowerGood-Leitung auf dem Falcon-Mainboard zu schaffen. Der technische
Aufwand betr&auml;gt eine Diode und den richtigen L&ouml;tpunkt auf
der Platine :-) Der Resettaster befindet sich hinten links am
Rechnerboard. Rechts neben dem Resettaster befindet sich eine kleine
Diode, der Diodenanschlu&szlig; welcher zum <a href="0c02.htm" target="UDOcon">Keyboard</a> zeigt (der
Rechner liegt so auf dem Tisch als wenn man damit Arbeiten w&uuml;rde)
ist der richtige Anschlu&szlig; f&uuml;r die PowerGood-Leitung des
Netzteils. Das ist aber normalerweise schon zu viel Arbeit. Die
Leitung k&ouml;nnte ja mal abreissen oder abbrechen, ausserdem macht
man hier wieder eine Verbindung die nur mit dem L&ouml;tkolben zu
l&ouml;sen ist. Wesentlich besser und einfacher erscheint es den
Kondensator C7 (1uF) welcher sich in der N&auml;he des Resettasters
befindet, auf einen Wert von 2.2uF bis auf maximal 4.7uF zu
vergr&ouml;ssern.
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/reset.gif" border=0 width="230" height="155"></p><br>
<div align=center><tt> Abbildung - 12 Anl&ouml;ten eines Resettasters </tt>
</div>
<p>
<br>
<br>
</p>
<p>Der Kondensator sollte 16 Volt Betriebsspannung vertragen
k&ouml;nnen. Der alte Kondensator sollte dazu vorsichtig
ausgel&ouml;tet werden und und durch den neuen gr&ouml;sseren Ersetzt
werden. Auf die Polarit&auml;t beim Einsetzen des neuen Kondensators
achten! Das Funktioniert dann in jedem Fall und ganz sicher auch mit
jedem PC-<a href="0f01.htm" target="UDOcon">Netzteil</a>. Gewarnt wird hier nochmals vor dem rumbraten auf
der Platine. Durch lange L&ouml;tzeiten werden tieferliegende
Leiterbahnen besch&auml;digt!
<br>
</p>
<p>Durch diese Ma&szlig;nahme wird einfach der PowerON-Reset des
Falcons verl&auml;ngert, diese Zeit reicht dann dem PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> aus um
sich korrekt zu Stabilisieren und der Rechner sollte/wird dann korrekt
hochlaufen.
<br>
</p>
<p>Es w&uuml;rde dann jedenfalls das etwas unsichere Anl&ouml;ten der
PowerGood-Leitung an der Diode entfallen. Zumal diese L&ouml;sung ohne
den bekannten L&ouml;tkolben nicht zu wieder zu Entfernen ist. Sollte
der Rechner beim ersten Versuch nicht gelaufen sein sollte er
sp&auml;testens nach dieser &Auml;nderung sicher laufen. Bootet er
korrekt und l&auml;uft kann man mit dem weiteren Umbau fortfahren. Zu
Beachten ist ja hier halt noch das der Kondensator auf jeden Fall
*polrichtig* eingel&ouml;tet wird und auch mindestens 16V
vertr&auml;gt.
<br>
</p>
<p>Sehen sie hier zu auch im Artikel <a href="0f01.htm" target="UDOcon">Netzteil</a> und <a href="0f04.htm" target="UDOcon">PSU PowerOn Reset</a>
nach.
<br>
</p>
<p>
<br>
<br><b>- Sichtfenster</b>
</p>
<p>Wurde das Falconmainboard geschickt eingebaut ist es m&ouml;glich
das ein vorhandener ScreenBlasterII-extern mit in den Tower eingebaut
werden kann. Das sollte dann so aussehen das die Ausgangsbuchse dem
ScreenBlasterII als Monitorbuchse dient und mit der Towerr&uuml;ckwand
verschraubt werden kann. Es w&uuml;rde dann nur noch der passende
<a href="080102.htm" target="UDOcon">Monitoradapter</a> und eben der Monitorstecker auf der R&uuml;ckwand
auftragen. Man kann den Rechner somit weiter an die Wand schieben.
Hierzu ist es n&ouml;tig die genaue Aussparung vor dem Befestigen des
Mainboards in die R&uuml;ckwand zu s&auml;gen. Wer lieber l&ouml;tet
stellt sich einfach eine 1:1 Kabelverbindung zwischen der
Falcon-Monitorbuchse und dem <a href="0806.htm" target="UDOcon">ScreenBlaster</a> mit einem abgeschirmten
Rundkabel her. So bleibt man flexibel und kann den ScreenBlasterII an
geeigneter Stelle in der R&uuml;ckwand als Monitorbuchse einbauen.
Wird diese Verl&auml;ngerung nicht sonderlich lang kann auch hier
Flachkabel ohne Abschirmung verwenden werden. In diesem Fall wird dann
f&uuml;r Buchse und Stecker jeweils ein Exemplar in
Schneidklemmtechnik verwendet. Kommt an der Buchse und am Stecker
immer die gleiche Ader auf Pin1 braucht man sich um die restlichen
Adern kaum zu k&uuml;mmern, denn die liegen dann automatisch am
jeweils richtigen Pin an. Das Steuerkabel von ScreenBlasterII das in
einem der beiden Paddleports steckt ist hierzu ebenfalls zu
Verl&auml;ngern und sauber zu verlegen, sofern die original L&auml;nge
nicht aussreichen sollte. In der gleichen Art und Weise verf&auml;hrt
man mit allen Steckern des Falcons die man gerne auf der Aussenseite
des Towers benutzen m&ouml;chte. Einzige Ausnahme bildet hier der
recht empfindliche <a href="0c09.htm" target="UDOcon">Romport</a>! D.h genauer, man l&ouml;tet sich Kabel die
z.B den Druckeranschlu&szlig; Pin 1 mit Pin 1 der in der R&uuml;ckwand
eingebauten Druckerbuchse verbindet. Pin 2 des Rechners mit Pin 2 der
Buchse usw.. (Schneidklemmtechnik ist einfacher, siehe weiter oben) So
ist auch mit der seriellen Schnittstelle usw. zu verfahren. Diese
Verbindungsst&uuml;cke werden in der Regel nicht l&auml;nger als ca.
15cm, es reicht also diese Verbindungen mit Flachbandkabel
herzustellen. Auf dieser L&auml;nge k&ouml;nnen kaum St&ouml;rungen
auftreten. Es braucht nicht sonderlich Betont zu werden das auch diese
einfachen 1:1 Verl&auml;ngerungen mit einer gewissen Sorgfalt
herzustellen sind. Ein Ohmmeter zum durchmessen sollte schon Vorhanden
sein falls man sich nicht zu 100% sicher sein sollte. Ein Vertauschen
der Anschl&uuml;sse oder dadurch Kurzschl&uuml;sse k&ouml;nnten
sp&auml;ter recht fatale Folgen haben.
<br>
</p>
<p>
<br>
<br><b>- Intern oder Extern</b>
</p>
<p>Vorher vorhandene externe SCSI-Ger&auml;te wie z.B Festplatten
oder CD-ROMs k&ouml;nnen ebenfalls im Tower verschwinden und zwar so
das man nur noch die Frontplatten sieht. Der gesammte Kabelverhau kann
entfallen. Ein riesen Vorteil des eingebauten PC-Netzteils ist die
Tatsache das f&uuml;r alle Festplatten und CD-ROMS kein extra <a href="0f01.htm" target="UDOcon">Netzteil</a>
mehr erforderlich ist. S&auml;mtliche Stromanschl&uuml;sse, direkt an
den Laufwerken, wird nun vom PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> &uuml;bernommen. Die Stecker
vom <a href="0f01.htm" target="UDOcon">Netzteil</a> passen nur in einer Richtung auf die Buchsen an den
Laufwerken und sollten somit keine weitere Beachtung finden. Laufwerke
in den Tower schrauben, Stromstecker aufstecken, fertig. Die Platten,
das <a href="0701.htm" target="UDOcon">CD-ROM</a> wird jetzt &uuml;ber den einen Netzschalter des Towers
aktiviert.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tower8.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 13 - Mainboard im Geh&auml;use </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Aus dem vorhandenen SCSI2 Kabel, welches vorher den Falcon mit der
externen SCSI-Platte verbunden hat, bauen wir uns dann noch den
SCSI-Anschlu&szlig; f&uuml;r die Ger&auml;te die jetzt im Tower
eingebaut wurden. Aus den externen Geh&auml;usen kann man sich in den
meisten F&auml;llen die R&uuml;ckw&auml;rtige 50polige
SCSI-Centronicsbuchse mit samt dem Flachbandkabel ausbauen. Das
dickere SCSI2 Rundkabel wird auf den Falcon aufgesteckt und sauber im
Tower verlegt, hierzu kann man Klebeschellen und Kabelbinder
verwenden. Solche geeigneten Schellen und Binder bekommt man im
Fachhandel.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/scsiad.gif" border=0 width="160" height="200"></p><br>
<div align=center><tt>Abbildung 14 - passende SCSI Adapterkabel</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Am Ende des SCSI2 Kabels steckt man eigentlich genau wie vorher
den Stecker in die 50 polige Buchse, das Flachbandkabel der Buchse
widerrum richtig auf die SCSI-Platte und ist damit auch dann schon
fertig.
<br>
</p>
<p>Nat&uuml;rlich kann auch hier ein fertiger SCSI2 Adapter gekauft
werden. Es soll nicht verschwiegen werden das man einen SCSI2 Stecker
nat&uuml;rlich auch kaufen kann und sich eben den Adapter selber
l&ouml;tet. Zum einen m&ouml;chte ich Bemerken das man diesen Stecker
leider nicht an jeder Ecke kaufen kann, und das Teil auch noch
Sauteuer ist. Ein fertiges Kabel ist fast genauso teuer! Das
L&ouml;ten eines SCSI2 Steckers sollten den Leuten vorbehalten bleiben
die immer alles besser Wissen, und auch eventuell Pinzettenfinger
haben. Pinzettenfinger deshalb, da das Rasterma&szlig; der Steckerpins
mit 1.25mm recht eng gehalten ist. Wer keine ruhige L&ouml;thand hat
sollte es besser lassen.
<br>
</p>
<p>Plattensch&auml;den, Rechnerdefekte sowie Datenverluste nicht
auszuschliessen.
<br>
</p>
<p>Ein k&auml;ufliches SCSI2-Kabel w&auml;hre in diesem Falle dann
ein vielfaches billiger gewesen..
<br>
</p>
<p>Sollten nun mehrere SCSI-Ger&auml;te angschlossen werden
m&uuml;ssen auf dem Flachbandkabel zus&auml;tzliche Buchsen
aufgequetscht werden, und das Kabel ist warscheinlich dann auch zu
kurz. Hier kann man sich mit dem passenden Kabel und den
k&auml;uflichen Buchsen selbst ein l&auml;ngeres SCSI-Buskabel
anfertigen. Beim Aufpressen der Buchsen sollte die farbige Ader an
allen Buchsen auf Pin 1 zu liegen kommen, das erleichertert die Suche
nach dem richtigen Pin mit der Nummer1 und dient als Orientierung beim
anstecken an die Laufwerke. Es soll auch kein Schaden sein wenn man
sich vorher mal ansieht wie rum der Busstecker nachher auf das
Laufwerk passt, man kann sich hier das sp&auml;tere Verdrehen des
Buskabels ersparen. Sieht auch viel besser aus wenn die Leitung gerade
im Kasten h&auml;ngt.
<br>
</p>
<p>Sehr wichtig ist das richtige Terminieren der Laufwerke! Werden
die Laufwerke so &uuml;bernommen wie es vorher war ist eine
&Auml;nderung an der Terminierung nicht zu erwarten. Werden beim Umbau
gleichzeitig neue SCSI-Ger&auml;te mit eingebaut ist die Terminierung
am *letzten* SCSI-Ger&auml;t an diesem Buskabel vorzunehmen. Alle
anderen Laufwerke sollten dann keine Terminatoren mehr tragen!
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cdterm.gif" border=0 width="480" height="100"></p><br>
<p>
<br>
<br>
</p>
<p>Busfehler und Datenverluste sind die Folgen einer doppelten, oder
gar einer fehlenden Busterminierung. Gleiches trifft in etwa auch zu
wenn die Versorgung von der Signalleitung 'Termpwr' auf dem SCSI-Bus
von mehreren SCSI-Ger&auml;ten gleichzeitig &uuml;bernommen wird. Es
sollte nur jeweils ein Ger&auml;t diese Signalleitung mit +5 Volt
versorgen. Bei den meisten Ger&auml;ten existiert hierzu ein Jumper im
jeweiligen Jumperfeld des SCSI-Ger&auml;tes.
<br>Ist das nicht der Fall, kann man sich durch Abtrennen des PIN 26
des jeweilgen Ger&auml;tes behelfen. Auch gibt es hier L&ouml;sungen
mit Dioden. (1N 4001) Die Diode wird dann in jeden Fall an den
entsprechenden Ger&auml;ten so eingel&ouml;tet das der Diodenpfeil in
Richtung des Flachbandkabel zeigt. Also aus dem SCSI-Ger&auml;t
herraus. So kann man Sicherstellen das keine fremd Angelegten +5 V
(von einem anderen Ger&auml;t) &uuml;ber die 'Termpwr'- Leitung in das
SCSI-Ger&auml;t zur&uuml;ckflie&szlig;en k&ouml;nnen. Sch&auml;den
sind somit vermeidbar. Nachteilig an der Sache ist das wenn man ein
solches Ger&auml;t verwendet bei dem sich 'Termpwr' nicht wegjumpern
l&auml;sst entweder hier der PIN getrennt wird, oder eben alle anderen
Ger&auml;te mit Dioden ausgestattet werden m&uuml;ssten.
<br>
</p>
<p>Da aber heute die meisten Ger&auml;te relativ neu sind wird das
Problem in seltenen F&auml;llen nur vereinzelt Auftreten. Bei mir war
das bis heute selber jedenfalls noch nie Erforderlich. Das betrifft
bei mir zwei Laufwerke vom Typ Quantum 105, eine Quantum 210, ein
XM4101 und eine 730er Lightning sowie eine Maveric und eine IBM DPES
31080.
<br>
</p>
<p>Man kann dem SCSI-Bus am Ende eine weitere 50polige Buchse
spendieren und diese dann wiederrum in die Towerr&uuml;ckwand
einbauen, hier k&ouml;nnen dann Scanner sowie weitere externe
Festplatten u. Ger&auml;te angeschlossen werden. Ein SCSI-Bus erlaubt
ja 8 Devices. (Ger&auml;te) Ebenso eignet sich dieser Anschluss dann
sehr gut f&uuml;r ein <a href="060701.htm" target="UDOcon">Zip-Drive</a>, das ist billig, es passen 100Mb auf
jede Diskette. Schneller und g&uuml;nstiger kommt man kaum zu einem
Backup.
<br>
</p>
<p>Hierzu ist ein externer SCSI-Terminator n&ouml;tig, dieser wird in
die Buchse gesteckt und nur entfernt wenn wirklich ein externes
Ger&auml;t benutzt werden soll. In diesem Fall sind dann an allen im
Tower eingebauten SCSI-Ger&auml;ten die Terminatoren zu entfernen. Der
externe Terminator &uuml;bernimmt dann die ganze Arbeit. Das extern
anzusteckende Ger&auml;t mu&szlig; dann die Terminierung f&uuml;r das
gesammte System &uuml;bernehmen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/25ide.gif" border=0 width="300" height="330"></p><br>
<div align=center><tt> Abbildung 15 - Steckerbelegung der internen 2.5&quot;
<a href="060402.htm" target="UDOcon">IDE-Platte</a>.</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Deutlich mehr zum Anschlu&szlig; von Laufwerken aller Art finden
sie hier in DOIT030, im Archiv <a href="160a.htm" target="UDOcon">DOIT_ST</a> und in der Hauptsache in
DOITDRIVE. Unter <a href="06.htm" target="UDOcon">Verschiedene Laufwerke am Falcon F030</a> finden sich
alle Tips bez&uuml;glich dem Anschlu&szlig; am Atari Falcon.
<br>
</p>
<p>
<br>
<br><b>- Zeit und Rat</b>
</p>
<p>Ein sehr wichtiger Punkt bei einem Towerumbau ist die Tatsache das
man nicht alles auf einen Schlag machen sollte. Zuerst kommt der
Computer, dann die Laufwerke und ein anschliessender Funktionstest.
Danach kann man damit beginnen die diversen <a href="0a.htm" target="UDOcon">Speichererweiterungen</a>,
Beschleuniger, Taktanzeigen und sonstige Zusatzhardware in den Tower
einzubauen. Macht man das alles auf einmal und es Funktioniert etwas
nicht auf Anhieb sucht man lange vergeblich rum, bei kleinen
Umbauschritten bleibt die Sache &uuml;bersichtlich und man kann
schneller zum Ziel kommen da man hier eben noch sieht was man gerade
vor 5 Minuten Eingebaut hat. Auf jeden Fall sollte man sich die
vorhandenen Anleitungen in Ruhe und auch bis immer ganz zum Ende
durchlesen.
<br>
</p>
<p>F&uuml;r die Laufwerks LEDs habe ich einen Tip aus einer c't
Ausgegraben: (<a href="060402.htm" target="UDOcon">IDE-Platte</a>) (ACT am Plattenstecker) Kathode der LED an
Pin 39, Anode der LED &uuml;ber 270 Ohm-Widerstand an +5V Die LED
sollte dann bei jedem Zuriff leuchten. Das habe ich selbst noch nicht
ausprobiert, diese Angabe erfolgt daher ohne Gew&auml;hr.
<br>
</p>
<p>
<br>
<br><b>- Rom und Midi</b>
</p>
<p>F&uuml;r viele Leute wird es Interessant sein den <a href="0c09.htm" target="UDOcon">Romport</a>
au&szlig;en am Rechner Zug&auml;nglich zu haben, einerseits als
Scanneranschlu&szlig; oder einfach f&uuml;r Epromkarten oder diverses
Midizubeh&ouml;r. Hier sei Eingangs gleich erw&auml;hnt das hier der
gesammte Systembus ungepuffert anliegt und das es die empfindlichste
Atari-Schnittstelle ist. Einzig und alleine die +5 Volt werden
&uuml;ber eine 5 Amp L&ouml;tsicherung (F2) an dem Port angelegt, was
nicht bedeutet das der Port oder der Rechner deswegen aussreichend
gesichert w&auml;hre! Meines Wissens nach besitzt diese Sicherung
einzigst nur der TT und der Falcon. Diese Sicherung ansich sieht
meistens wie ein Widerstand, oder wie eine Diode ohne Beschriftung
aus. Bei einem Defekt mit folgenden Erstatz mu&szlig; hier jedenfalls
gel&ouml;tet werden.
<br>
</p>
<p>Es ist aussreichend wenn diese Sicherung f&uuml;r eine Belastung
von 500mA ausgelegt wird. Das original <a href="0f01.htm" target="UDOcon">Netzteil</a> kann nie mehr als 4
Amp liefern. Ein PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> hingegen auch &uuml;ber 15 Amp bei +5
Volt! Das hier dann u.U auch die Leiterbahnen als Sicherung dienen
kann sich jeder selber Ausmalen. F&uuml;r die meisten Romportmodule
und Inerfaces gen&uuml;gt daher eine Sicherung von 500mA.
<br>
</p>
<p>In einem Atari TT eines befreundeten Atari-Users, Peter
K&uuml;chler, sah ich diese Sicherung (Atari TT = F1) allerdings auch
schon durch zwei Dr&auml;hte und einem normalen Sicherungshalter
f&uuml;r die &uuml;blichen Feinsicherungen ersetzt. Das war vor
einigen Jahrens schon ein guter Trick. So gesehen also eine kleine
aber ganz feine Verbesserung. Im Tower ist ja reichlich Platz
vorhanden.
<br>
</p>
<p>Der <a href="0c09.htm" target="UDOcon">Romport</a> kann *nicht* einfach mit Flachbandkabel
verl&auml;ngert werden!
<br>U.u klappt es bis zu einer L&auml;nge von ca. 10 cm.
<br>Das bedeutet aber nicht das das an jedem Falcon so klappt!
<br>
</p>
<p>Wer dennoch glaubt es besser zu wissen soll es so machen,
besonders dann wenn noch Beschleuniger oder sonstige Zus&auml;tze im
<a href="0302.htm" target="UDOcon">Falcon F030</a> eingebaut sind.
<br>
</p>
<p>In einem neulich gesehenen Tower der Firma Eickmann war der
<a href="0c09.htm" target="UDOcon">Romport</a> intern mit einem Platinen-Winkelst&uuml;ck versehen und darin
steckte das <a href="0701.htm" target="UDOcon">CD-ROM</a>-ROM, ein Interface welches einen CD-Rom
Anschlu&szlig; an eben dem <a href="0c09.htm" target="UDOcon">Romport</a> erm&ouml;glicht. N&auml;heres
sollte hier sicher bei der Fa. Eickmann zu erfahren sein. Jedenfalls
verschwindet mit dieser L&ouml;sung das CDROM-Interface auch noch im
Tower. Sogesehen auch eine saubere L&ouml;sung. Der Nachteil ist hier
das der Port dann eben schon belegt ist und von aussen her nicht mehr
zu benutzen ist.
<br>
</p>
<p>Sollte der <a href="0c09.htm" target="UDOcon">Romport</a> doch nach au&szlig;en verlagert werden ist es
meiner Meinung nach n&ouml;tig die Signale direkt nach der
Romportbuchse einem Hardwarebuffer zuzuf&uuml;hren der die Signale
stabilisiert und Verst&auml;rkt. Hierzu eignet sich ganz gut ein
&auml;lteres c't Projekt das schon am ST sehr gut gelaufen ist und in
der kleinsten Ausbaustufe bereits zwei per Software umschaltbare
Romports zur Verf&uuml;gung stellt. Diese <a href="0305.htm" target="UDOcon">Hardware</a> l&auml;uft bei mir
seit einigen Jahren und hat bis heute sehr gute Dienste geleistet,
auch als ich einmal versehentlich das Scannerinterface falsch herrum
in den Rechner gesteckt hatte. Das Interface hat &Uuml;berlebt. Der
Buffer ist hier in SMD-Technik ausgef&uuml;hrt und so klein das er an
einem orignalen Geh&auml;use komplett in der <a href="0c09.htm" target="UDOcon">Romport</a>-Ausparung des
Geh&auml;uses verschwindet. Der Anschlu&szlig; weiterer Teile erfolgt
dann &uuml;ber Flachbandkabel das hier dann bis zu 1 Meter l&auml;nge
haben darf. Es ist hier also leicht m&ouml;glich einen der beiden
Ports nach aussen zu f&uuml;hren. Der zweite Port k&ouml;nnte z.B im
Tower verbleiben um eine Epromkarte durch die Portumschaltung im
Zugriff zu haben. MagiC! im Rom scheint sich hier als Option geradezu
anzubieten, sofern es dann mal endlich auf dem Falcon ohne
irgendwelche Patches laufen wird.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/rommidi.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 16 - <a href="0c09.htm" target="UDOcon">Romport</a> und <a href="0c0a.htm" target="UDOcon">Midiport</a> verl&auml;ngern </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Die Ports k&ouml;nnen mit einem einfachen GFA-Programmeinzeiler
umgeschaltet werden. Bedingt durch das Atari-<a href="0304.htm" target="UDOcon">Betriebssystem</a> ist es
m&ouml;glich das das jeweilige andere Ger&auml;t erst nach einem
erneuten booten zur Verf&uuml;gung steht. Auf jedem Fall entf&auml;llt
das l&auml;stige Umstecken der Ger&auml;te bzw. der Epromkarten oder
der Scannerinterfaces und schont auch noch die Portbuchse des Falcons
F030.
<br>
</p>
<p>Irgend jemand im Mausnetz hatte da im letzten Jahr diverse
Platinen anfertigen lassen. Sicher findet sich hier schnell eine
Bezugsquelle. Ansonsten bei der c't Redaktion nachfragen oder bei der
Fa. Issendorff in Hannover.
<br>(Projekt: c't <a href="0c09.htm" target="UDOcon">Romport</a>-Expander)
<br>
</p>
<p>eMedia GmbH
<br>30601 Hannover
<br>Postfach 610106
<br>
</p>
<p>Fax: 0511-5352147
<br>Tel: 0511-537295
<br>E-Mail: <a href="15.htm" target="UDOcon">Internet</a>: emedia@ix.de
<br>
</p>
<p>Die beiden Midi-Buchsen stellen das kleinste Problem dar. Diese
Buchsen k&ouml;nnen einfach mit handels&uuml;blichen Stereo DIN-Kabeln
verl&auml;ngert werden. Kabell&auml;ngen von 10 Metern zwischen dem
Rechner oder zwischen zwei Rechnern und einem anderen Midi-Ger&auml;t
sind keine Seltenheit und bei der B&uuml;hnentechnik an der
Tagesordung. Max. 7 Ger&auml;te finden so eine einfache Verbindung.
Also sollte es kein Problem sein diese beiden Buchsen mit der
entsprechenden Verl&auml;ngerung ca. 10cm weiter nach aussen zu
verlegen. Seit einigen Tagen kann man bei Dieter Cotta @ KR
&uuml;brigens eine <a href="0305.htm" target="UDOcon">Hardware</a> erhalten die es erm&ouml;glicht zusammen
mit der MidiCOM 3.94 Software zwei Ataris per brachliegendem RomPort
zu vernetzen. Die &Uuml;bertragungsgeschwindikeit sollte hier typisch
bei 70Kb/Sec liegen. Bei meinen beiden Falcons sind es laut HowFastII
jedoch 160Kb/Sec.
<br>
</p>
<p>Also einiges schneller als mit der &uuml;blichen Midi-Verbindung
&uuml;ber die normale 5 polige Midibuchse. N&auml;here Informationen
erfragt man am besten bei der genannten Adresse. Die L&ouml;sung
eignet sich sehr gut dazu seinen FalconTower mit z.B einem
&auml;lteren ST zu vernetzen.
<br>
</p>
<p>
<br>
<br><b>- Beschleunigen </b>
</p>
<p>Bis hier haben wir bereits ein sch&ouml;nes St&uuml;ck Arbeit
hinter uns und k&ouml;nnen unseren Tower auch schon mal zumachen. Wer
allerdings noch vorhat eine MightySonic oder einen <a href="0b0107.htm" target="UDOcon">Skunk</a> einzubauen,
der braucht das Werkzeug nicht weit wegzulegen. Hierzu sollte man sich
die Anleitung des jeweiligen Beschleunigers genauestens durchlesen und
alle Bauschritte genauestens Befolgen. Bei vielen &auml;lteren Falcons
gibt es nach dem Einbau die ersten Probleme. Das ein oder andere
Programm will nicht mehr korrekt laufen oder der Rechner h&auml;ngt
sich sporadisch auf. Im schlimmsten Fall will er &uuml;berhaupt nicht
mehr laufen oder die externe SCSI-Platte strotzt nur so vor Lese- und
Schreibfehlern. Diese Probleme k&ouml;nnen alle im Zusammenhang mit
dem doch recht engen Bustiming der Falcon Computer auftreten, hinzu
kommt noch die Signalform des Taktsignals welches vom COMBEL Chip
ausgehend das ganze System mit dem Takt versorgt. Selbst das reine
einstecken eines ScreenEyes auf den internen Systembus kann in manchen
F&auml;llen bereits zu Problemen f&uuml;hren, auch dann wenn das
Ger&auml;t nicht mal per Software aktiviert ist. Ein Einstecken einer
Erweiterungskarte verl&auml;ngert die Leitungen des F030 Systembus!
<br>
</p>
<p>Nach Informationen verschiedener Hardwarehersteller belastet auch
eine nicht aktive Karte allein durch das Verl&auml;ngern der
Busleitungen das gesammte System. Ramkarten mit ung&uuml;nstiger
Leiterbahnf&uuml;hrung k&ouml;nnten genauso zum Problem werden. Aber
hier sicher wesentlich seltener.
<br>
</p>
<p>Einmal verl&auml;ngert sich der Bus um eben das aufgesteckte Teil,
zum anderen &auml;ndert sich die Kapazit&auml;t auf den verschiedenen
Leitungen. Das kann bei hohen Taktraten sehr leicht und schnell zu
Problemen f&uuml;hren. Einer der Gr&uuml;nde warum z.B nicht in jedem
ST die alte TURBO V25 - Beschleunigerkarte gelaufen ist! Gerade bei
Atari treffen dann solche 'Kleinigkeiten' dann auch noch auf hohe
Bauteiletoleranzen und das Chaos ist fast perfekt.
<br>
</p>
<p>Bei solchen Problemen gibt es Abhilfe. Hierzu kann man sich das
Taktsignal an den SMD-Widerst&auml;nden R221, R222 und an R217
ansehen. Die drei Widerst&auml;nde liegen einseitig alle zusammen und
beziehen das Taktsignal gemeinsam &uuml;ber R217 vom COMBEL. Gut
geeignet w&auml;re hier ein Oszilloskop mit einer Speicherfunktion
oder der M&ouml;glichkeit eines 'ScreenShots'. Man w&auml;re so z.B in
der Lage sich das Taktsignal eines funktionierenden F030 zu speichern
und es sp&auml;ter mit dem Taktsignal des nicht laufenden F030 zu
vergleichen. Interessant ist hier die Waveform, nicht unbedingt die
H&ouml;he des Signalpegels ist der ausschlaggebende Punkt.
<br>
</p>
<p>Ein Auszug aus der Schaltung betreffs der Verteilung des
Taktsignals. Ohne Gew&auml;hr, bzw. abh&auml;ngig von der
Revisionsnummer des Mainboards. Das hier entspricht der Platinenrev. B
und somit warscheinlich den meisten Falcons die sich seit letztem Jahr
im Umlauf befinden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cpuclock.gif" border=0 width="580" height="50"></p><br>
<div align=center><tt> Abbildung 17 - Taktverteilung </tt>
<br>
</div>
<p>
<br>
<br>
<br>
<br><b>- Der Taktstock</b>
</p>
<p>Die SMD-Widerst&auml;nde R216, R222 und R221 haben einen Wert von
je 33 Ohm und dienen zur Strombegrenzung falls ein Teilbereich des
Rechners diese Leitung st&auml;rker belasten sollte. In einem F030 sah
ich schon den R221 von Werk aus mit einem dicken L&ouml;tklecks
&uuml;berbr&uuml;ckt. Warscheinlich spielen hier gro&szlig;e
Bauteiletoleranzen bei der DMA-Herstellung eine gr&ouml;ssere Rolle.
Manche <a href="0305.htm" target="UDOcon">Hardware</a> CPU-Speeder greifen neben dem sog. <a href="0e.htm" target="UDOcon">Clockpatch</a> genau an
dieser Stelle in die Falconhardware ein um ihr schnelleres Taktsignal
einzuspeisen. Der DMA-Baustein sollte nicht durch eine
Takterh&ouml;hung beschleunigt werden. Das Soundsubsystem leidet
darunter. Soll die FPU beschleunigt werden ist der DMA-Baustein
weiterhin mit dem orig. Rechnertakt zu versorgen, die FPU hingegen mit
dem schnellen Takt vom Speederboard. Dazu ist es n&ouml;tig die FPU
erst nach dem DMA-Baustein vom original Takt zu trennen. Das
entsprechende L&ouml;tauge habe ich selber leider noch nicht ausfindig
machen k&ouml;nnen. Einige Leute trennen deswegen PIN 11 der FPU von
der Platine oder dem FPU-Sockel ab und l&ouml;ten hier einen
d&uuml;nnen WireWrap-Draht an! Meiner Meinung nach keine sehr gute
L&ouml;sung, da hierbei direkt am FPU-Sockel manipuliert werden
mu&szlig;. Bei ungeschickter Handhabung kann der PLCC-Sockel leicht
besch&auml;digt werden. Sicher ist es per Ohmmeter die n&auml;chste
Durchkontaktierung zu suchen und ggf. seine Leitung hier aufzutrennen.
Im originalen Rechnergeh&auml;use w&auml;hre f&uuml;r diese Arbeit
extra das <a href="0f01.htm" target="UDOcon">Netzteil</a> auszubauen.
<br>Wobei man auf der Platine zum Leiterbahn unterbrechen nur leicht
kratzen sollte, tiefe Kratzer k&ouml;nnen die tiefer liegenden
Schichten rasch Besch&auml;digen! Das Mainboard wird dadurch sehr
schnell unbrauchbar.
<br>
</p>
<p>Die Firma Atari selber hat einen Hardwarepatch herrausgegeben um
eben das Taktsignal soweit zu Stabilisieren das selbst nach dem Einbau
eines ScreenEyes oder eines CPU-Speeders keine Probleme mehr auftreten
sollten. Hierzu habe ich ein ganz eigenes Textfile mit einer
erkl&auml;renden Grafik in 16 Farben angefertigt. (.XIMG und 256
Farben.JPG-Format) Die Grafik habe ich erstellt da mir das der einzig
vern&uuml;nftige Weg erscheint um auch anderen Leuten den Einbau des
Patches korrekt zu erm&ouml;glichen. Eine richtige farbige Grafik
zeigt eben auch mehr als jeder Text. Es existieren so also auch noch
1.2 Mb lange TrueColor-Bilder mit genau diesem Ausschnitt der
F030-Platine. Sollten gen&uuml;gend Anfragen vorliegen kann ich diese
Dateien gerne auch zur Verf&uuml;gung stellen bzw. man kann sich die
von meinem Rechner Downloaden.
<br>
</p>
<p>Der Hardwarepatch kann auch von jedem Atari-<a href="1604.htm" target="UDOcon">H&auml;ndler</a> eingebaut
werden! Bei vielen neueren Ger&auml;ten ist das ab Werk schon
vorhanden.
<br>
</p>
<p>Meiner Meinung nach ist der Patch mit dem 74F04 der Stabilste,
zumal auch genau der von Atari selber angeraten wird und auch so
bereits per H&auml;ndlerrundschreiben ver&ouml;ffentlicht wurde. Und
auch von verschiedenen Herstellern von Erweiterungen so
&uuml;bernommen wurde. Ob dieser <a href="0e.htm" target="UDOcon">Clockpatch</a> n&ouml;tig sein sollte
kann man leicht am eigenen Rechner testen, man erh&ouml;ht die
Bildschirmaufl&ouml;sung, schaltet auf 256 Farben und benutzt das
Soundsubsystem.
<br>Einfaches Abspielen von irgendwelchen Soundfiles gen&uuml;gt. Sind
Nebenger&auml;usche zu h&ouml;ren, Kistert oder Knackt es? Gibt es
Lese und/oder Schreibfehler auf der externen SCSI-Platte? Haben
gr&ouml;&szlig;ere Bilddateien pl&ouml;tzlich Querstreifen nach dem
Laden? Bleibt der Rechner pl&ouml;tzlich mitten im Programm
undefiniert h&auml;ngen?
<br>
</p>
<p>Dann, und nur dann ist der <a href="0e.htm" target="UDOcon">Clockpatch</a> wirklich notwendig. Man kann
hier sicher nicht f&uuml;r jeden Falcon den passenden Tip geben. Ein
wenig Experimentieren ist auf jeden Fall gefragt. Im Fehlerfall immer
zuerst den Hersteller des jeweiligen Beschleunigers konsultieren, die
meisten Hersteller haben noch Ihre eigenen L&ouml;sungen parat. Die in
den meisten F&auml;llen v&ouml;llig ausreichen und auch zum Erfolg
f&uuml;hren. Auch kann durch den Einsatz anderer TTL-ICs ein eventuell
besseres Ergebniss erziehlt werden. Der Patch ist abh&auml;nging vom
vorhandenen Falcon-Mainboard. Revisionsnummer auf jeden Fall beachten.
Verschiedene Beschleuniger benutzen auch diesen Patch mit einer
anderen Anordung der Gatter im 74F04. Meistens werden hier recht gute
Ergebnisse erziehlt.
<br>
</p>
<p>
<br>
<br><b>- <a href="0907.htm" target="UDOcon">Audio</a></b>
</p>
<p>Den Audioausgang des im Tower eingebautem <a href="0701.htm" target="UDOcon">CD-ROM</a> kan man auf
Wunsch sogar direkt mit der 3.5 mm Sound-IN-Klinkenbuchse des Falcon
verbinden. Sogesehen ist man dann in der Lage eine eingelegte <a href="0907.htm" target="UDOcon">Audio</a>-CD
&uuml;ber die hoffentlich vorhandenen Aktivboxen am F030 abzuspielen.
Weiterhin kann auch der Kopfh&ouml;rer direkt am <a href="0701.htm" target="UDOcon">CD-ROM</a> eingesteckt
werden. Die entsprechende Verkabelung gibt es bereits im Textfile
CDROMBAU.TXT, hierzu liegen auch einige Zeichnungen bereit. Recht
sinnvoll w&auml;hre es die Sound-IN-Buchse umschaltbar auszulegen,
eventuell m&ouml;chte man sp&auml;ter ja einen Sound &uuml;ber ein
externes Ger&auml;t einspielen, z.B vom TV-Ger&auml;t. Sollte ein
fertiger Tower verwendet worden sein sind die beiden Soundbuchsen sehr
warscheinlich schon nach aussen gef&uuml;hrt oder es gibt eine
M&ouml;glichkeit das zu machen. (Bestellen) Hier ist es wieder nicht
so sch&ouml;n m&ouml;glich das interne <a href="0701.htm" target="UDOcon">CD-ROM</a> Audiom&auml;ssig mit der
IN-Buchse zu verbinden. G&uuml;nstig ist es da immer wieder sich
vorher genau zu &Uuml;berlegen was man mit der Maschine machen
m&ouml;chte, nachtr&auml;glich ist das zwar auch Einzubauen, bringt
aber immer wieder einige Umst&auml;nde mit sich. So z.B das wohl
keiner ein Loch in ein Geh&auml;use bohren m&ouml;chte wenn schon der
Computer eingebaut ist. Kleine und kleinste Bohrsp&auml;ne versauen
hier auch die sorgf&auml;ltigste Arbeit.
<br>Mehr &uuml;ber das Soundsubsystem finden Sie in dieser
Zusammenstellung.
<br>
</p>
<p>In der gleichen Art u. Weise kann man auch mit vielen
Zusatzger&auml;ten, wie z.B einem Videotextdekoder oder einer
DCF77-Uhr verfahren werden. Bei der DCF-Uhr sollte wenigstens die
Antenne nach aussen verl&auml;ngert werden. Ein <a href="1003.htm" target="UDOcon">Videotextdecoder</a> kann
mit seinem gesammten Geh&auml;use im Tower eingebaut werden und zwar
so das von aussen nur noch die Video-In-Buchse zu sehen ist. Hierzu
eignet sich eine Dekodersoftware die einen der Paddleports abfragt und
per MausNet zu erhalten ist. Das kann gleichzeitig auch bei aktivem
Screenblaster betrieben werden. So bleibt die serielle Schnittstelle
f&uuml;r das externe Modem frei.
<br>
</p>
<p>
<br>
<br><b>- Speed Display</b>
</p>
<p>Ganz zum Ende dieser hoffentlich guten und allgemeinen gehaltenen
Umbauanleitung kann man vieleicht noch, falls nicht schon vorhanden,
das Speed-Display des Towers anschliessen. Die meisten Displays werden
vom Towernetzteil mit +5 Volt und GND versorgt. Ein passender Stecker
baumelt sicher irgendwo hinter der Frontpartie herrum. Man stellt hier
also nur die Verbindung zum <a href="0f01.htm" target="UDOcon">Netzteil</a> her. Ein weiterer Anschlu&szlig;
ist das 'Turbo-Signal' ist diese Leitung nicht angschlossen wird das
Display einen kleineren Wert anzeigen als wenn diese Leitung auf +5
Volt gelegt wird. (Es soll auch welche geben die Umschalten wenn man
diese Leitung mit GND verbindet. Wird nun diese Leitung mit dem Punkt
des Beschleunigers verbunden der bei erh&ouml;hter Taktzahl des
Rechners ein 'High'-Signal f&uuml;hrt ist die Turbo-Anzeige somit
schon realisiert. Die '100Mhz' k&ouml;nnen bei den meisten
Speed-Displays per Jumper voreingestellt werden. Wird der
Beschleuniger &uuml;ber ein 'Port-Bit' eingeschaltet kann man diese
Leitung mit dem gleichen Anschlusspunkt verl&ouml;ten. Bei Low-aktiven
Displays mu&szlig; das Umschaltsignal invertiert werden. Im Normalfall
ist der Beschleuniger nicht aktiv, das Display zeigt '16Mhz' im
zweiten Fall ist der Beschleuniger aktiv und das Display zeigt '32
Mhz' oder mehr an. Genau so kann das auch verschaltet werden wenn der
Speeder nur per Handschalter Ein bzw. Ausgeschaltet wird.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tower10.gif" border=0 width="320" height="200"></p><br>
<div align=center><tt> Abbildung 18 - Anschlu&szlig;leiste des Displays </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Sicherlich wird an der Frontplatte neben dem Einschalter auch noch
die Turbotaste und der Resesttaster auffallen. Der Resettaster kann
einfach mit zwei Leitungen paraell zu dem auf der Falconplatine
vorhandenem Resettaster angel&ouml;tet werden. Das gibt keine
Probleme. Man sollte hier nur keine Klemmen oder so etwas verwenden,
anl&ouml;ten ist wesentlich sicherer. Der nun noch &uuml;brige
'Turbotaster', also entweder l&auml;sst man ihn wie er ist, als
Attrappe, oder man schaltet sich damit den Cache oder den ganzen
Beschleuniger per 'Hand'. Wie das genau Funktioniert kann man aus den
Anleitungen der meisten Beschleuniger entnehmen. Meistens wird hier
auch eine Umschaltung per Schalter oder .CPX-Modul angeboten, genau
hier kann man dann auch den Turboschalter einsetzten.
<br>
</p>
<p>Der Tower interne Lautsprechner wird am Falcon anstelle dem im
Falcon vorher vorhandenen Lautsprechner angeschlossen, die
Polarit&auml;t spielt hier normalerweise keine Rolle, man kann hier
nichts vertauschen. Selbstverst&auml;ndlich kann auch der alte
Falcon-Lautsprecher verwendet werden. Es ist m&ouml;glich das der
Stecker des 'Tower'-Lautsprechers nicht auf die Stiftleiste der
Falconplatine passt. Hier m&uuml;sste ein passendendes Steckerchen
organisiert werden. Der Platinenstecker auf dem Falconmainboard
tr&auml;gt die Bezeichnung J12 und ist zwischen interner <a href="060402.htm" target="UDOcon">IDE-Platte</a>
und dem Diskettenlaufwerk zu finden.
<br>
</p>
<p>Das gefrickel mit den 'Kleinigkeiten' am Ende kann im Einzellfall
genau so lange dauern wie der eigentliche Umbau des Rechners in das
neue Geh&auml;use. Schnell findet sich noch die ein oder andere
Kleinigkeit die ja 'unbedingt' noch Realisiert werden mu&szlig;.
<br>
</p>
<p>Ist der Rechner der hier in den Tower verfrachtet werden soll kein
Falcon, gibt es hier die M&ouml;glichkeit ein kleines
Verst&auml;rkermodul dazwischen zu Schalten um so ebenfalls einen
gewissen 'H&ouml;rerfolg' zu haben. Dazu gibt es fertige Module
(vergossen) die nur mit einem Poti f&uuml;r die Lautst&auml;rkereglung
und den Ein- bzw. Ausg&auml;ngen beschaltet werden m&uuml;ssen.
<br>
</p>
<p>So kann man z.B bei einem vorhandenen Schl&uuml;sselschalter die
Tastatur verriegeln, der Falcon-Tower ist somit vor unbefugter
Benutzung schon relativ gut gesch&uuml;tzt. Man f&uuml;gt den Schalter
dann einfach in die TxD-Leitung der Tastatur ein. Bei ge&ouml;ffnetem
Schl&uuml;sselschalter kann so nichts mehr zum Rechner gesendet
werden. Ist der Schl&uuml;sselschalter geschlossen geht das nach wie
vor. Es sollte dabei nicht die Masseleitung oder die +5Volt
Versorgungsleitung der Tastatur unterbrochen werden, der Rechner
f&auml;ngt sonst an zu spinnen. Er wird sich so verhalten als wenn
keine Tastatur angesteckt ist. (Siehe weiter oben im Text)
<br>
</p>
<p>
<br>
<br><b>- Alles Cool man</b>
</p>
<p>Sind alle Umbauma&szlig;nahmen erfolgreich abgeschlossen kann man
den Rechner beruhigt in Betrieb nehmen. Der im PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> vorhandene
Ventilator zieht die Luft aus dem Tower durch das <a href="0f01.htm" target="UDOcon">Netzteil</a> und
bl&auml;st nach aussen ab. In den meisten F&auml;llen gen&uuml;gt das
als Bel&uuml;ftung auf jeden Fall. Den originalen Falconl&uuml;fter
kann man ausbauen und zur Seite legen. Auch bei dem L&uuml;fter des
PC-Netzteils kann man eine L&uuml;ftersteuerung einsetzen, was die
Ger&auml;uschkulisse stark abd&auml;mpft. Hierzu mu&szlig; allerdings
gekapselte PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> ausgebaut und ge&ouml;ffnet werden. Diese
Arbeit sollte einem Elektrofachman vorbehalten bleiben da man hier
direkt mit der 230V Netzspannung in Ber&uuml;hrung kommen kann.
Selbstredend ist bei allen Arbeiten am Ger&auml;t der Netzstecker zu
ziehen.
<br>
</p>
<p>Der 'entfallene' original Falcon-L&uuml;fter kann so z.B auch
zus&auml;tzlich als direkter, zus&auml;tzlicher
&quot;CPU-K&uuml;hler&quot; eingesetzt werden. Z.b w&auml;rmt auch der
Videochip nicht schlecht wenn man mit erh&ouml;hten
Bildschirmaufl&ouml;sungen arbeitet. (Der L&uuml;fter passt nicht
direkt &uuml;ber die F030 CPU !, daf&uuml;r aber im Deckel links
&uuml;ber dem <a href="0f01.htm" target="UDOcon">Netzteil</a>)
<br>
</p>
<p>
<br>
<br>
</p>
<div align=center>! Einige K&uuml;hlk&ouml;rper im inneren des PC-Netzteiles
f&uuml;hren 230V-Netzspannung !
<br>! Die Kondensatoren ben&ouml;tigen einige Zeit zum Entladen !
<br>
</div>
<p>
<br>
<br>
</p>
<p>Die L&uuml;ftersteuerung wird hier dann im PC-<a href="0f01.htm" target="UDOcon">Netzteil</a> eingebaut.
Es erlischt hierbei die Garantie des PC-Netzteils. Die meisten
Ger&auml;te haben ein Siegel &uuml;ber zwei Geh&auml;useteile geklebt.
L&uuml;ftersteuerungen gibt es in verschiedenen Ausf&uuml;hrungen
fertig im einschl&auml;gigen Fachhandel, manche braucht man nur
zwischen Ventilator und dessen Anschlu&szlig; auf der Netzteilplatine
zu stecken. Das hat den uneingeschr&auml;nkten Vorteil das bei einem
eventuellen defekt des Reglers der L&uuml;fter sofort wieder an seinem
original Anschlu&szlig; betrieben werden kann. Zum 'L&uuml;fter' gibt
es ein eigenes Textfile mit dem <a href="030806.htm" target="UDOcon">Schaltplan</a> einer L&uuml;ftersteuerung.
Ein Eigenbau sollte so auf jeden Fall sicher m&ouml;glich sein.
<br>
</p>
<p>Nicht unerw&auml;hnt soll die Tatsache bleiben das manche
<a href="1604.htm" target="UDOcon">H&auml;ndler</a> sich weigern einen derart ver&auml;nderten Atari bei
einem defekt der <a href="0305.htm" target="UDOcon">Hardware</a> zu Reparieren, Ausnahmen werden wohl die
sein die selber einen Tower in ihrem Angebot haben.
<br>
</p>
<p>Viel Erfolg beim Umbau.
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0d.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon - Umbau" border=0 width="24" height="24"></a>
<a href="0d.htm" target="UDOcon"><img src="udo_lf.gif" alt="Falcon - Umbau" border=0 width="24" height="24"></a>
<a href="0d02.htm" target="UDOcon"><img src="udo_rg.gif" alt="Desktopper" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
