<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Desktopper
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0d.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon - Umbau" border=0 width="24" height="24"></a>
<a href="0d01.htm" target="UDOcon"><img src="udo_lf.gif" alt="Tower - Umbau Falcon F030" border=0 width="24" height="24"></a>
<a href="0d03.htm" target="UDOcon"><img src="udo_rg.gif" alt="Rack Case" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Desktopper">13.2 Desktopper</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Umbau des Falcons in einen Desktopper</tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Die Firma DDD bietet einen &quot;Desktopper&quot; zum Aufsetzen
auf den Atari <a href="0302.htm" target="UDOcon">Falcon F030</a> an. Das gleiche Geh&auml;use eignet sich
auch f&uuml;r den 1040 bzw. den 1040STE, sofern man diese Ger&auml;te
noch auftreiben kann. Ob sich die Geldanlage lohnt, mu&szlig; halt
jeder selbst entscheiden. Atari ist halt nicht mehr...
<br>
</p>
<p>Der Desktopper selbst wird z.Z. f&uuml;r 199.- DM inklusive einer
einfachen PC-Tastatur und zus&auml;tzlichem Keyboardinterface
angeboten. Der Umbau kann eigentlich von jedem vorgenommen werden, der
einen Schraubendreher anfassen kann. Das Falcon-<a href="0f01.htm" target="UDOcon">Netzteil</a> sowie alle
r&uuml;ckw&auml;rtigen Steckanschl&uuml;ssen behalten bei dieser
Modifikation ihren alten Platz. Hierzu wird einfach das alte
Geh&auml;useoberteil des Falcon entfernt, am besten auch gleich die
eventuell noch vorhandenen Abschirmbleche, um dann gegen das neue
Plastikoberteil des Desktoppers ersetzt zu werden. Hierdurch erreicht
man einen wesentlich besseren Luftdurchsatz, was sich gerade bei
Rechnern mit 40-50Mhz Takt positiv bemerkbar machen wird.
W&auml;rmestaus k&ouml;nnen t&ouml;dlich sein.
<br>
</p>
<p>Ebenso beh&auml;lt die interne IDE-Festplatte und das
Diskettenlaufwerk jeweils seinen alten Platz. Es fallen keine
L&ouml;tarbeiten an. Auch werden keinerlei Kabeladapter etc.
ben&ouml;tigt. Was vorher extern war, z.B. ein <a href="0806.htm" target="UDOcon">ScreenBlaster</a>,
verbleibt genau da, wo er vorher auch war.
<br>Dieses Geh&auml;use hat ein gutes Design und tr&auml;gt auch einen
Monitor, den man oben drauf abstellt. Im Geh&auml;use selbst finden
auch gr&ouml;ssere Erweiterungen wie z.B. eine <a href="0b03.htm" target="UDOcon">FX-Karte</a> oder ein
<a href="0b04.htm" target="UDOcon">Afterburner</a> sehr gut Platz. Selbst eine <a href="0b03.htm" target="UDOcon">FX-Karte</a> mit <a href="0804.htm" target="UDOcon">ScreenEye</a>
obendrauf passt so noch hinein.
<br>
</p>
<p>Diese <a href="030505.htm" target="UDOcon">Desktop</a>-L&ouml;sung ist in der Hauptsache f&uuml;r Leute
gedacht, die nicht gerne bei einem Diskettenwechsel unter dem Tisch
kriechen wollen. Und ebenso keinen Platz f&uuml;r einen Tower haben,
trozdem aber nicht auf die ein oder andere Erweiterung verzichten
wollen. Sehr gut finde ich die L&ouml;sung mit der Tastaturbuchse an
der Vorderseite des Geh&auml;uses. Auch der Netzschalter und der
Resettaster sollten so besser zug&auml;nglich sein.
<br>
</p>
<p>Bei Beachtung aller Sicherheitsma&szlig;nahmen kann bei diesem
Umbau eigentlich nichts passieren. Mehr Tricks zum Rechnerumbau
befinden sich in der Anleitung zum Towerumbau.
<br>
</p>
<p>Man k&ouml;nnte vielleicht noch eine zus&auml;tzliche Platte
einbauen. Hierzu sollte man sich aber genau &uuml;berlegen, wie man
das anstellt. Platz kann man hier nicht verschwenden. Der Desktopper
ist so bemessen, da&szlig; er nur unwesentlich h&ouml;her als das
Geh&auml;use eines MegaSTs ist.
<br>
</p>
<p>Nach dem Umbau ist man auf jeden Fall das Image eines
Konsolencomputers los. Der Monitor steht drauf und man hat in sehr
vielen F&auml;llen auch mehr Platz auf dem Tisch.
<br>
<br>
<br>
</p>
<p><b> Lighthouse Desktopper </b>
<br>
<br>
</p>
<p>Ebenso bietet die Fa. Lighthouse Umbaugeh&auml;use f&uuml;r den
F030 den 1040 und die ST-Serie an. In den meisten F&auml;llen wird
hier ein Aufsatzgeh&auml;use auf das Plastikunterteil des F030
geschraubt. Das ist mehr oder weniger vorteilhaft. Besser sind
Towergeh&auml;use. Einzig ist mir hier bisher als Vorteil aufgefallen,
da&szlig; bei einer dieser L&ouml;sungen das Original-Floppykabel vom
Mainboard auch nach dem Umbau ohne Verl&auml;ngerung bis zum
Diskettenlaufwerk reicht.
<br>
</p>
<p>Die Blechaufsatzgeh&auml;use haben sehr scharfe Kanten! Das ist
schlecht f&uuml;r die H&auml;nde und die diversen Kabel.
<br>
</p>
<p>Als sehr negativ ist anzusehen, da&szlig; bei diversen
Geh&auml;usen die am <a href="0f01.htm" target="UDOcon">Netzteil</a> befindlichen Netzschalter auf die
Vorderseite der Geh&auml;useoberteile verlagert werden. In einigen
F&auml;llen sah ich, da&szlig; mit L&uuml;sterklemmen und offenen
Anschlu&szlig;klemmen an eben den Netzschaltern gearbeitet wird.
<br>Ebenso scheint es Mode zu sein, in genau solchen Umbauten keine
gekapselten Schaltnetzteile zu verwenden. Findet man doch auch in
einigen Umbauanleitungen den Vorschlag, die Metallk&auml;fige wegen
Platzmangel zu entfernen.
</p>
<p>Es kann hier nur nachhaltig vor kr&auml;ftigen Stromschl&auml;gen
gewarnt werden!
<br>Unf&auml;lle mit Netzspannung sind an solchen ge&ouml;ffneten
Geh&auml;usen keine Seltenheit; es sollte daher nur mit gezogenem
Netzstecker gearbeitet werden.
<br>
</p>
<p>Es spricht die eigene Erfahrung!
<br>
</p>
<p>An manchen Stellen, so z.B. den Netzschaltern, kann
Schrumpfschlauch f&uuml;r 0.10 DM wirklich wahre Wunder bewirken und
Schlimmeres verhindern.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0d.htm" target="UDOcon"><img src="udo_up.gif" alt="Falcon - Umbau" border=0 width="24" height="24"></a>
<a href="0d01.htm" target="UDOcon"><img src="udo_lf.gif" alt="Tower - Umbau Falcon F030" border=0 width="24" height="24"></a>
<a href="0d03.htm" target="UDOcon"><img src="udo_rg.gif" alt="Rack Case" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
