<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Clockpatch mit dem 74F04
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0e.htm" target="UDOcon"><img src="udo_up.gif" alt="Clockpatch" border=0 width="24" height="24"></a>
<a href="0e01.htm" target="UDOcon"><img src="udo_lf.gif" alt="Clockpatch with 74F04" border=0 width="24" height="24"></a>
<a href="0e03.htm" target="UDOcon"><img src="udo_rg.gif" alt="Wizztronics Clockpatch" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Clockpatch_20mit_20dem_2074F04">14.2 Clockpatch mit dem 74F04</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Falcon Clock-Patch - Modifikation des Taktsignals</tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<p>Beim nachtr&auml;glichem Einbau von Erweiterungskarten, der
<a href="0804.htm" target="UDOcon">ScreenEye</a>-<a href="0305.htm" target="UDOcon">Hardware</a> oder irgendwelchen CPU-Beschleunigerkarten *kann*
es in verschiedenen F030- Computern zu St&ouml;rungen des Soundteils,
des Datentransfers zur externen SCSI- Platte oder auch einfach nur zu
Systemh&auml;ngern kommen. Einfaches einstecken von jeglichen
Erweiterungskarten verl&auml;ngern in jedem Fall die empfindlichen
Busleitungen und k&ouml;nnen somit das gesamte System negativ
beeinflussen.
<br>
</p>
<p>Abhilfe soll laut Atari ein sogenannter CPU-<a href="0e.htm" target="UDOcon">Clockpatch</a> bringen der
von Atari Corp. selber empfohlen wurde. Die keine Zusatzschaltung
besteht aus einem 74F04 TTL-IC das man in jedem guten Elektronikladen
kaufen kann. Mein Falcon-<a href="1604.htm" target="UDOcon">H&auml;ndler</a> hatte mir diesen Patch per Fax
&uuml;berlassen da durch den Einbau eines ScreenEyes beim laden von
gr&ouml;&szlig;eren Farbgrafiken diverse Fehler auftraten. Der Patch
selber stammt im Original &uuml;brigens direkt von Atari Corp. und
wurde so an <a href="1604.htm" target="UDOcon">H&auml;ndler</a> gegeben. Selbst bei einem angeschlossenen
<a href="0806.htm" target="UDOcon">ScreenBlaster</a> III extern gab es bei Grafikaufl&ouml;sungen von
960x620x16 bzw. 840x600x265 noch keine Probleme. Die Probleme zeigten
sich erst als durch den Einbau der <a href="0804.htm" target="UDOcon">ScreenEye</a>-<a href="0305.htm" target="UDOcon">Hardware</a> der interne
Erweiterungsbus verl&auml;ngert wurde.
<br>
</p>
<p>Jede Eingriff dieser Art bring auch eine Belastung diverser
Busignale mit sich, l&auml;ngere Busleitungen verursachen auch immer
l&auml;ngere Signallaufzeiten. Speziell beim Atari Falcon ist es das
16Mhz-Taktsignal das von COMBEL Chip erzeugt wird um FPU, CPU und DMA
(SCSI) zu versorgen. Dieses Taktsignal &quot;verw&auml;scht&quot; sehr
leicht (wird unsauber) und verursacht so SCSI sowie Soundprobleme im
Falcon.
<br>
</p>
<p>Dumm dabei ist das sich kein Falcon genau wie ein anderer
verh&auml;lt. Grosse Bauteiletoleranzen und unterschiedliche
Busbelastung sowie ein sehr enges <a href="030503.htm" target="UDOcon">Timing</a>, besonders was den DMA-Teil
betrifft, erschweren die korrekte Behebung von Sound- oder
SCSI-Problemen.
<br>
<br>
<br>
</p>
<p><b> Der eigentlichen Einbau: </b>
<br>
</p>
<p>Die SMD-Widerst&auml;nde R216, R222 und R221 haben einen Wert von
33 Ohm und dienen zur Strombegrenzung auf der 16Mhz-Taktleitung, falls
ein Teilbereich des Rechners diese Leitung st&auml;rker belasten
w&uuml;rde, k&ouml;nnten die beiden anderen Zweige damit nicht auch
zusammenbrechen.
<br>
</p>
<p>Ob dieser <a href="0e.htm" target="UDOcon">Clockpatch</a> n&ouml;tig sein sollte kann man leicht am
eigenen Rechner testen, man erh&ouml;ht die Bildschirmaufl&ouml;sung
mit dem <a href="0806.htm" target="UDOcon">ScreenBlaster</a> im 256 Farben-Modus und und benutzt dann das
Soundsubsystem. Einfaches Abspielen von Soundfiles mit 49Khz
CD-Qualit&auml;t gen&uuml;gt. Sind dabei Nebenger&auml;usche zu
h&ouml;ren, kistert oder Knackt es? Gibt es Lese und/oder
Schreibfehler auf der externen SCSI-Platte? Haben gr&ouml;&szlig;ere
Bilddateien pl&ouml;tzlich Bildfehler, L&auml;ngsstriche oder fehlen
einzelne Pixel nach dem Laden? Bleibt der Rechner pl&ouml;tzlich
mitten im Programm undefiniert h&auml;ngen? Meldet der
Festplattentreiber undefiniert [Time Out] bei den externen
SCSI-Platten?
<br>
</p>
<p>Dann, und wirlich nur dann ist der ClockPatch wirklich unbedingt
notwendig. Man kann hier nicht f&uuml;r jeden Falcon den exakt
passenden Tip geben. Ein wenig Experimentieren ist auf jeden Fall
angesagt.
<br>
</p>
<p>Andererseits ist mir, bis zum Jahr 2000, noch kein Falcon bekannt
den man nicht mit diesem ClockPatch bez&uuml;glich SCSI/DMA zum
korrekten Arbeiten bringen konnte. Auch ohne teueres Equipment.
<br>
</p>
<p>In einigen Falcons habe ich gesehen das der SMD-Widerstand R222 ab
Werk mit einem L&ouml;tklecks &uuml;berbr&uuml;ckt wurde. Anscheinend
gab es schon hier Probleme bei den Werksseitigen Abschlu&szlig;tests.
Diese Werkseitige Modifikation ist bei diesem Umbau nat&uuml;rlich
vorher ebenfalls zu entfernen und nur in F&auml;llen bei denen kein
anderer Ausweg gefunden werden kann wieder vorzunehmen. Atari selber
hat wohl so versucht dem DMA-Problem Herr zu werden.
<br>
<br>
<br>
</p>
<p>Die Widerst&auml;nde dienen ganz einfach der Strombegrenzung,
immerhin mu&szlig; der 16Mhz-Taktausgang des COMBEL, im
Originalzustand, ohne ClockPatch, drei weitere TTL-Eing&auml;nge
bedienen. Man kann auch mit diesem Widerst&auml;nden versuche
anstellen, jedoch sollten diese nie kleiner als 20 Ohm werden.
<br>Das 16Mhz-Signal bricht dann zusammen.
<br>Der Rechner hat keinen Takt und wird nicht arbeiten.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cpuclock.gif" border=0 width="580" height="50"></p><br>
<div align=center><tt>Abbildung 1 - Signalweg aus dem F030-<a href="030806.htm" target="UDOcon">Schaltplan</a> </tt>
</div>
<p>
<br>
<br>
</p>
<p>Zur besseren Unterscheidung wurde das Clocksignal im <a href="030806.htm" target="UDOcon">Schaltplan</a> in
A, B und C unterteilt, es ist so eindeutig zu sehen welche Leitung wo
den Takt hinf&uuml;hrt. Hier kann man auch deutlich die Verteilung
erkennen und das die drei 33Ohm Widerst&auml;nge eigentlich auch nur
ein schlechte Notl&ouml;sung sind. W&auml;hre hier ab Werk ein
korrekter Takttreiber eingesetzt worden w&uuml;rde eine menge
L&ouml;tarbeiten eingespart.
<br>
</p>
<p>Der 74F04 TTL-Chip sollte vor dem Einbau ein wenig vorbereitet
werden. Alle Anschlu&szlig;beinchen bis auf Pin 14 und Pin 7 werden
gek&uuml;rzt, aber nur soweit das noch ein sicherer
L&ouml;tanschlu&szlig; bestehen bleibt und der Chip dadurch keinen
Schaden nehmen kann. Lange L&ouml;tzeiten an den gek&uuml;rzten
Anschlu&szlig;beinchen sind zu vermeiden. Der Chip wird sp&auml;ter im
Falcon auf den Chip U63 zwecks einfacher Stromversorgung und zur
mechanischen stabilisierung Huckepack aufgel&ouml;tet. Er k&ouml;nnte
auch auf einem anderen Chip im TTL-Geh&auml;use sitzen, hier sind
jedoch die taktf&uuml;hrenden Leitungen am k&uuml;rzesten und Erzeugen
somit die wenigsten Probleme.
<br>
<br>
<br>
</p>
<p>Beachten Sie bitte das nicht alle Beinchen des 74F04 Pingleich mit
dem darunterliegenden PAL U63 verl&ouml;tet werden!
<br>Lediglich die Stromversorgung des 74F04 wird an U63
angel&ouml;tet!!
<br>Der 74F04/ F08 befindet sich nur zwecks Stromversorgung und kurzer
Verbindungen auf U63!
</p>
<p>Am 74F04 k&ouml;nnen die Anschl&uuml;sse 2 und 9, sowie die Pins
11 und 13 schon vorher mit Drahtverbindungen gebr&uuml;ckt werden, das
geschieht am besten auf der Oberseite des Chips. Es St&ouml;rt hier am
wenigsten. Die Drahtbr&uuml;cke kann hier ruhig aus blankem
Schaltdraht, am sichersten Silberdraht bestehen. Nach dem &ouml;ffen
des Falcongeh&auml;uses, des Entfernen der sicherlich noch vorhanden
Abschirmbleche, solle man sich am COMBEL und an der CPU orientieren.
Der Rechner liegt so vor uns als w&uuml;rden wir wie gewohnt auf die
Tastatur blicken. Links oben befindet sich das Netzeil, gleich rechts
daneben die interne IDE-Festplatte und ganz rechts das 3,5&quot;
Diskettenlaufwerk. Der L&uuml;fter befindet sich recchts vorne unter
der abgenommenen Tastatur. Nur so liegt die Platine f&uuml;r weitere
Erkl&auml;rungen richtig herum.
<br>
<br>
<br>
</p>
<p align=center><img src="image/clockpat.gif" border=0 width="434" height="388"></p><br>
<div align=center><tt>Abbildung 2 - orientieren Sie sich an der Farbgrafik.</tt>
</div>
<p>
<br>
<br>Irgendwo zwischen COMBEL, CPU und einem hohen rechteckigem Chip,
das ist &uuml;brigens der Uhrenchip mit <a href="040101.htm" target="UDOcon">NVRAM</a> und der internen
Batterie, befinden sich die SMD-Widerst&auml;nde R216, R221 und R222.
Ein klein wenig oberhalb des PAL/GAL-Chips U63. Diese drei
SMD-Widerst&auml;nde werden ausgel&ouml;tet, in der Regel 33
Ohm-Widerst&auml;nde die das Taktsignal an das Soundsubsystem, den
SCSI-Port und an den Co-Prozessor verteilen. Das Taktsignal kommt
&uuml;ber R217, meist eine Null-Ohm- Br&uuml;cke, direkt vom COMBEL
der sich knapp &uuml;ber den genannten SMD-Widerst&auml;nden befindet.
R217 ist *kein*! SMD-Widerstand, warscheinlich aber eine 0
Ohm-Br&uuml;cke in Form eines Widerstandes.
<br>
</p>
<p>Beim Entl&ouml;ten sollte man eine gewisse Vorsicht walten lassen,
es handelt sich hier um SMD-Bauteile auf immerhin einer
6fach-Multilayerplatine. Die L&ouml;taugen sind rasch abgerissen und
die Falconplatine somit unbrauchbar. Eine Reparatur ist in den meisten
F&auml;llen aussichtslos wenn die tieferliegende Leiterbahnen durch
kratzen ect. zerst&ouml;rt wurden. SMD-Bauteile bekommt man in jedem
guten Elektronikgesch&auml;ft. Die entl&ouml;teten
SMD-Widerst&auml;nde haben einen Wert von 33 Ohm.
<br>
</p>
<p>Bew&auml;hrt hat sich die Methode diese SMD-Widerst&auml;nde auf
beiden Seiten zu erhitzen. Meistens bleiben diese winzigen Teile mit
samt dem L&ouml;tzinn direkt an der L&ouml;tspitze kleben und
k&ouml;nnen so rasch Entfernt werden.
<br>
</p>
<p>Der 74F04 TTL-Chip kann nun Huckepack auf das IC U63 gel&ouml;tet
werden. U63 geh&ouml;rt neben 3 weiteren Bausteinen zur <a href="030502.htm" target="UDOcon">Busemulation</a>
des Falcons. PIN 14 des 74F04 sollte dabei passend mit PIN 20 (+5Volt)
des IC U63 verl&ouml;tet werden.
<br>Pin 7 des TTLs wird mit etwas steifem Draht nach PIN 10 (GND) des
ICs verl&auml;ngert und dort ebenfalls verl&ouml;tet. Das IC U63 ist
meistens gesockelt, genau wie die drei anderen ICs die sich direkt
daneben befinden.
<br>Der Draht stabilisiert und fixiert den TTL Chip einigermassen auf
U63. Pin 20 des ICs U63 f&uuml;hrt +5V (Vcc) Pin 10 von U63 hingegen
ist mit Masse verbunden. (GND)
<br>U63 wird verwendet da das die n&auml;chste Stelle zu dem
SMD-Widerst&auml;nden darstellt und hier die fliegende Verdrahtung am
k&uuml;rzesten bleibt.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/clockpa1.gif" border=0 width="315" height="275"></p><br>
<div align=center><tt>Abbildung 3 - Hierzu einige vaarianten des <a href="0e.htm" target="UDOcon">Clockpatch</a>, z.B
f&uuml;r die <a href="0b03.htm" target="UDOcon">FX-Karte</a></tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Nachdem diese beiden Verbindungen hergestellt sind k&ouml;nnte man
noch auf ein wenig Luft zwischen den beiden Chips achten, ein wenig
Bel&uuml;ftung schadet keinem Bauteil, auch nicht einem PAL oder GAL.
<br>
</p>
<p>Lesen Sie die Anleitung zum ClockPatch komplett durch *bevor* Sie
l&ouml;ten!
<br>
<br>Pin 1 des 74F04 wird nun mit R217 verbunden, und zwar mit dem
unteren Ende dieses Widerstandes. Das ist das Ende was von dem COMBEL
weg in Richtung von U63 bzw. der Tastatur zeigt! Das untere
L&ouml;tauge von R222, auch in Richtung des ICs U63, wird mit Pin 8
des 74F04 verl&ouml;tet.
<br>
<br>
</p>
<p>Bei allen L&ouml;tungen ist darauf zu achten das keine Verbindung
zu dem darunterliegendem IC entsteht! Auch sollte vermieden werden U63
in seinem eigenen Sockel festzul&ouml;ten! Das erleichtert einen
eventuellen sp&auml;teren Bauteiletausch ungemein.
<br>
</p>
<p>Pin 10 des TTLs wird mit dem oberen L&ouml;tauge von R221
verl&ouml;tet, das zeigt in Richtung der internen Festplatte. Pin 12
des TTLs wird mit dem oberen L&ouml;tauge von R216 verbunden, zeigt
ebenfalls in Richtung der internen Festplatte. Die
SMD-Widerst&auml;nde R221, R222, R216 wurden bereits vorher entfernt.
<br>
</p>
<p>Wobei hier noch zu Beachten ist das das jeweilige obere und untere
L&ouml;tpad des SMD-L&ouml;tpunktes keine Verbindung untereinander
nach dem Ausl&ouml;ten haben sollten! Die Schaltung w&uuml;rde nachher
ganz sicher nicht korrekt Arbeiten!
<br>
</p>
<p>Zum Herstellen der n&ouml;tigen Drahtverbindungen sollte
m&ouml;glichst ein guter F&auml;deldraht verwendet werden. Da diese
Leitungen den Systemtakt f&uuml;hren sollen sie auch so kurz wie
m&ouml;glich und auch sehr dicht an der Platine verlegt werden. Die
Leitungen ansich werden sicher nicht lange, die SMD-Widerst&auml;nde
befinden sich in der unmittelbaren N&auml;he von U63. Ich habe
jedenfalls mit dieser Art der Verdrahtung die besten Erfahrungen
gesammelt, zumal dieses Verfahren schon bei dem
&quot;SpeedUp16-Projekt der c't vor Jahren schon zu einem sehr
stabilen Verhalten des Rechners gef&uuml;hrt hat. Es soll kein Schaden
sein wenn man WireWrap-Draht in verschiedenen Farben benutzt. Es
erh&auml;lt die &ouml;bersichtlichkeit. Damals halt eben ein ST, kein
Falcon, wer einen ST umger&uuml;stet hat wird wissen wovon ich hier
gerade gesprochen habe.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/clockpa2.gif" border=0 width="515" height="340"></p><br>
<div align=center><tt>Abbildung 4 - Verschaltung des Standard-ClockPatch</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Jedem Atari sein eigenes und ganz privates <a href="030503.htm" target="UDOcon">Timing</a>! :-)
<br>
</p>
<p>Nach Beendigung der L&ouml;tarbeiten sollte alles genau
Kontrolliert und eventuelle L&ouml;tzinnreste ect. sauber entfernt
werden. L&ouml;tperlen krallen sich gew&ouml;hnlich zwischen den
Anschlu&szlig;beinchen der ICs fest. L&ouml;tzinnreste sollten
keinesfalls durch Wegblasen entfernt werden. Nach dem Umbau sollte der
Rechner eigentlich wie gewohnt booten.
<br>
</p>
<p>Nicht vergessen die Tastatur vorher wieder anzustecken!
<br>Der Stecker passt auch nur in einer Richtung!
<br>
</p>
<p>Sollte der Rechner keine Reaktion zeigen ist in 98% aller
F&auml;lle die Verdrahtung falsch und mu&szlig; korrigiert werden.
Nicht auszuschlie&szlig;en das an den L&ouml;taugen der entfernten
SMD-Widerst&auml;nde nicht sauber gearbeitet wurde und hier eventuell
ein Kurzschlu&szlig; vorliegt oder die abgehenden Leitungen auf der
falschen Seite der SMD-Pads angel&ouml;tet wurden.
<br>
</p>
<p>Zerst&ouml;ren kann man den Falcon an dieser Stelle eigentlich
weniger, Aussnahmen best&auml;tigen jedoch auch hier die Regel!
<br>
</p>
<p>Wenn der Rechner nicht booten sollte:
<br>Keine Panik und sofort Abschalten sowie folgende Schritte
ausf&uuml;hren!
<br>
</p>
<p>
<br>
<br><b> M&ouml;gliche Ursachen </b>
<br>
</p>
<p>Hier werden einige Dinge beschrieben die sie vieleicht, sollte ihr
Falcon wieder erwaren nicht korrekt arbeiten, gut gebrauchen
k&ouml;nnen.
<br>
</p>
<dl>
<dt><b>Kein Bild</b></dt><dd> Stromversorgung und Monitor kontrollieren! Netzstecker
eingesteckt, Ger&auml;te eingeschaltet?
<br>&nbsp;
<dt><b>Kein Bootlogo</b></dt><dd> Jumper auf J20 noch vorhanden? Kurzschlu&szlig; des Taktsignals?
Takt f&uuml;r Videologik fehlt.
<br>&nbsp;
<dt><b>Klickern aus dem Lautsprecher</b></dt><dd> <a href="0c02.htm" target="UDOcon">Keyboard</a> korrekt angesteckt?
<br>&nbsp;
<dt><b>LED an der Tastatur leuchtet nicht</b></dt><dd> Schaltung nach Kurzschlu&szlig; untersuchen! <a href="0c02.htm" target="UDOcon">Keyboard</a> richig
angesteckt?
<br>&nbsp;
<dt><b>Der Falcon bootet nicht</b></dt><dd> Warscheinlicher Verdrahtungsfehler!
<br>Alle Verbindungen kontrollieren und auf Fehler untersuchen.
<br>IC korrekt Aufgel&ouml;tet, die richtigen Pins verbunden?
<br>Besteht eine Verbinung zu U63?
<br>Die Dr&auml;hte an der richtigen Seite der SMD-L&ouml;tpads
angeschlossen?
<br>Wurden die L&ouml;dpads beim Entl&ouml;ten kurzgeschlossen?
<br>Neuen 74F04 versuchen!
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p>Die Anleitung passte bis heute auf jeden <a href="0302.htm" target="UDOcon">Falcon F030</a> der mir unter
die Finger gekommen ist. Bedingt trifft diese Anleitung auch auf
Umbauten zu die einen 74F08 anstelle eines 74F04 verwenden. In jedem
Fall sollte vorher festgestellt werden welche Platinenrevision
vorliegt. Bei neueren Platinen k&ouml;nnten z.T die Angaben &uuml;ber
die SMD-Widerst&auml;nde und die Verdrahtung nicht mehr zu 100%
&uuml;bereinstimmen! Die Schaltung ansich ist aber auf jeden Falcon
anzuwenden. Hier ist eine vorherige Kontrolle n&ouml;tig, eventuell
arbeitet der Patch dann hier aber auch in einer leicht modifizierten
Form, insbesondere wenn noch ein Beschleunigermodul zum Einsatz kommt.
In seltenen F&auml;llen k&ouml;nnte es vorkommen das die Probleme
nicht ganz durch den Patch zu Beseitungen sind. Hier ist es wirklich
nur in wenigen Ausnahmef&auml;llen m&ouml;glich durch 2-3 kleine
Kunstgriffe trozdem zum vollen Erfolg zu kommen. Das dies nur
vereinzelt passiert wird das wegen der besseren &ouml;berschaubarkeit
auch hier nicht beschrieben. Alles weitere, sollte es noch das ein
oder andere Problem geben, per Email.
<br>
</p>
<p>Die beigelegten Grafiken sind nach bestem Wissen und Gewissen
entstanden, dennoch kann keine Garantie f&uuml;r die Richtigkeit der
hier wiedergegeben <a href="0205.htm" target="UDOcon">Information</a> &uuml;bernommen werden. Auch kann keine
Haftung f&uuml;r zerschossene Rechner oder sonstige Fehlfunktionen
&uuml;bernommen werden. F&uuml;r diese Anleitung sind Grundkenntnisse
&uuml;ber Elektronik und ein gewisses ma&szlig; an L&ouml;terfahrung
erforderlich! Im Zweifelsfall w&auml;hre es nicht schlecht im Umgang
mit einem Oszilloskop bescheid zu wissen. (Oder jemanden zu kennen der
das kann) Eine L&ouml;tausr&uuml;stung f&uuml;r SMD-Teile ist teuer,
kann aber angeraten werden! Meistens gibt es f&uuml;r vorhandene
L&ouml;tstationen passende SMD-L&ouml;tspitzen. (Feine
L&ouml;tspitzen, kurze L&ouml;tphasen, max. 15Watt L&ouml;tkolben) Die
L&ouml;tarbeiten an SMD-Platinen erfordern ein sehr sauberes Arbeiten
und einen gewissen Zeitaufwand.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<div align=center>Das einzelne weitergeben der Bilder ist Untersagt!
<br>Eine gewerbliche Nutzung ist Untersagt!
</div>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>
<br>
<br>
</p>
<p>Ein Fax als IMG-Datei, direkt von Atari und Bilder die nicht von
mir pers&ouml;nlich Stammen habe ich ebenfalls zu besseren
Orientierung diesem Archiv beigelegt.
<br>
</p>
<p>
<br>
<br><b> Modifikationen: </b>
<br>
</p>
<p>Eine abgewandelte Schaltung, die auch beim Einbau von
Beschleunigern verwendet wird. Z.B beim PowerUp32 Beschleuniger oder
beim SKUNK.
<br>
</p>
<p>Bei der urspr&uuml;nglichen Schaltung kann es n&uuml;tzlich sein
wenn in der Leitung zum Pin 1, also die Leitung welchen den Takt zum
74F04 leitet eine Ferritperle &uuml;bergeschoben wird. Alle Leitungen
sollten grunds&auml;tzlich so Nahe wie m&ouml;glich an der
Falconplatine verlegt werden. Die besten Erfahrungen habe ich mit
d&uuml;nnem WireWarp-Draht gemacht! &ouml;ber den SMD-Widerstand R222
wird die <a href="030502.htm" target="UDOcon">Busemulation</a>, welche aus den GALs U62 usw, besteht, mit dem
Rechnertakt versorgt. Es kann n&uuml;tzlich sein hier wieder einen
Widerstand bis zu einem maximalen Wert von 33 Ohm einzuf&uuml;gen. Da
mu&szlig; leider ein wenig Experimentiert werden. Gleiches trifft auf
die Leitung zu welche am unteren Ende von R216 angel&ouml;tet wurde.
Diese Leitung versorgt den SCSI-Trakt im Rechner. Auch hier ist
Experimentieren angesagt.
<br>
</p>
<p>Bush&auml;nger, Abst&uuml;rze oder das Einfrieren des F030 treten
in den meisten F&auml;llen in h&ouml;heren Aufl&ouml;sungsmodis auf.
Stark betroffen sind hier Aufl&ouml;sungen in 256 Farben und
TrueColor. In diesen Bildschirmmodis m&uuml;ssen in dem selben
Zeitzyklus wesentlich mehr Bildschirmdaten als z.B bei 16 oder nur 2
Farben &uuml;ber den engen Falconbus transportiert werden. In vielen
F&auml;llen kommt es dabei noch gleichzeitig zu einem Zugriff auf eine
externe SCSI-Platte. Hier treten dann die 'kleinen Pausen' bis hin zum
Einfrieren des gesammten Systems auf. Abhilfe kann in einigen
F&auml;llen das Modifizieren des ClockPatches bringen, aber auch der
Einbau eines Beschleunigers welcher den langsamen Bustakt mit
erh&ouml;ht. So wird es m&ouml;glich das bei einem schnelleren Takt in
der selben Zeit wesentlich mehr Bits &uuml;ber den Bus transferiert
werden k&ouml;nnen. Eine M&ouml;glichkeit solche 'H&auml;nger' zu
Beseitigen. Auch besteht hier die M&ouml;glichkeit das gerade beim
Einstaz von Beschleunigern die Rambausteine leider zu langsam sein
k&ouml;nnten. Hier kann man nur schnellere Rams versuchen oder aber
die Grafikaufl&ouml;sungen so weit herrunternehmen das ein sicherer
Betrieb des Rechners m&ouml;glich ist.
<br>
</p>
<p>Es soll hier nicht verschwiegen werden das es Falcons gibt bei
denen keiner der genannten Tips richtig zum Erfolg f&uuml;hrt. Hier
sind die Bauteiletoleranzen so gro&szlig; das man froh sein mu&szlig;
das der Rechner &uuml;berhaupt korrekt l&auml;uft. Hier hilft es nur
die Bildschirmaufl&ouml;sungen, meistens mittels <a href="0806.htm" target="UDOcon">ScreenBlaster</a> oder
BlowUp hochgepuscht, schrittweise zu verringern und eine Einstellung
zu suchen bei der das gesammte System stabil arbeitet. Ein Punkt bei
dem diese 'H&auml;nger' dann wirklich sehr sicher beseitigt sein
sollten. Im &uuml;brigen ist es auff&auml;llig das offensichlich
neuere Falcons von diesem Problem st&auml;rker als &auml;ltere
Ger&auml;te betroffen sind.
<br>
</p>
<p>
<br>
<br><b> Tip </b>
<br>
</p>
<p>Eine weitere, auf den ersten Blick recht seltsame L&ouml;sung,
findet man in diesem Archiv in dem FX-Ordner. Hier gibt es diverse
Hinweise zum ClockPatch von Georg Archer von der Fa. BlowUp. Das passt
nat&uuml;rlich auch wenn man keinen Beschleuniger eingebaut hat ;-)
<br>
</p>
<p>Ich habe bisher nur die Schaltung mit dem 74F04 angewendet und
bisher in jedem Falcon damit das besste Ergebniss erziehlt. Weitere
Schaltungsvarianten sind eigentlich unn&ouml;tig und verwirrend.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Warum ausgerechnet ein 74F04 </b>
<br>
</p>
<p>Da hier an der Taktleitung des Falcon gearbeitet wird sind die
F-Typen von der Gschwindigkeit und des Verhaltens im sog. TTL-Pegel
bestens geeignet. Von der Geschwindigkeit her gesehen sollte es
allerdings eigentlich auch ein HCT-Typ machen, u.U ist dieser auch
leichter Aufzutreiben.
<br>(Selber noch nicht versucht!)
<br>
</p>
<p>Zitat aus einem Halbleiterfachbuch:
<br>
</p>
<p>Chips der 74er-Reihe gibt es in zwei verschiedenen
Ausf&uuml;hrungen. Entweder in TTL- oder als CMOS-Chips. Letztere
erkennt man immer an dem Buchstaben &quot;C&quot; in der
Bauteilebezeichnung. Ein HC, C oder HCT ist also immer ein
CMos-Bauteil. CMos bedeutet auch immer eine Stromaufnahme im
uA-Bereich, also kaum deutlich Messbar.
<br>
</p>
<p>Von der Funktion her ist ein 7404, ein 74F04 oder ein 74HCT04
genau der gleiche Baustein mit genau der gleichen Funktion. Der 74F04
ist ein Inverter. Ein 7408 ist ein AND-Gatter. Der innere Aufbau eines
7404 und einem 74F04 unterscheidet sich nur durch technische Tricks
bei der Herstellung, die eben einen F-Typ letztendlich in der
Schaltleistung wesentlich schneller machen. Ger&uuml;chte
bez&uuml;glich erheblicher Unterschiede in der Gatterlaufzeit
k&ouml;nnen Sie vergessen, es sind Ger&uuml;chte und es bleiben
Ger&uuml;chte.
<br>
</p>
<p>Beachten sollte man aber das CMos-Bausteine einen leicht anderen
Signal-Pegel ausgeben als &quot;normale&quot; TTL-Bausteine. Genau
f&uuml;r diesen Fall gibt es darum die HCT-Typen, welche im Pegel den
normalen TTL-Chips &auml;hnlicher sind. In der Schaltgeschwindigkeit
ist halt ein 74F04 oder ein 74F08 aber immer schneller als z.B ein
74HCT04. AS-Typen sind idR nicht angegeben. Sollten aber bei 1nS
liegen.
<br>
<br>
<br>
</p>
<pre>
TTL-Gatterlaufzeiten im direkten Vergeich
-----------------------------------------------------------
        7404       74HC04      74HCT04        74F04
-----------------------------------------------------------
7404:  8   12        6-9         7-14        3.2  3.7
7408: 12  17.5    7-13  7-10    10-14         4   4.2
-----------------------------------------------------------

</pre>
<p>
<br>
<br>
</p>
<p>Zeitangabe erfolgt generell immer in nS. (Nano-Sekunden)
<br>
</p>
<p>Deutlich also auch zu sehen das ein Patch mit einem 74F08 das
Taktsignal mehr oder weniger &uuml;ber UND-Gatter nur verteilt,
verz&ouml;gert, sich dabei die Ausgangsleistung des TTL-Bausteins zu
nutze macht, w&auml;rend bei einem 74F04 hingegen das Signal durch
zwei Inverter l&auml;uft um halt &quot;eckig&quot; zu werden. Das ist
genau die Signalform die von den Falcon-Peripheriebausteinen, z.B dem
DMA-Chip, am besten verstanden wird. Flankensteilheit ist gefragt. Die
beste L&ouml;sung ist jedoch das Taktsignal f&uuml;r jeden der drei
Takanschl&uuml;sse &uuml;ber ein eigenes Gate zu f&uuml;hren. So
treibt auch jweils ein TTL-Ausgang einen der drei Signalwege.
<br>
</p>
<p>Eine andere Erl&auml;uterung ist mir hierzu noch nicht
Eingefallen.
</p>
<p>Zwei Inverter damit das Taktsignal in der gleichen Art am Ausgang
wieder verwendet werden kann wie es eingespeist wurde. Ein Inverter
negiert das Signal. Ein nachfolgender Inverter &quot;dreht&quot;
(negiert) das Signal nochmal, somit wird es wieder wie das Signal das
am Eingang des ersten Inverters angelegt wurde. Der Unterschied zum
angelegten Signal besteht in scharfen Signalflanken und einem
unverwaschenen TTL-Pegel. Man erinnere sich das ein TTL-Ausgang
maximal einen TTL-Eingang bedienen sollte. Im Falcon sind es gleich
drei Eing&auml;nge die einen TTL-Ausgang belasten.
<br>
</p>
<p>Beachten Sie hierzu bitte noch die vaariante mit dem 500 Ohm-Poti
(PotPatch) welcher sich bei der <a href="0b03.htm" target="UDOcon">FX-Karte</a> befindet und dort ein
stabiles Verhalten erzeugt.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0e.htm" target="UDOcon"><img src="udo_up.gif" alt="Clockpatch" border=0 width="24" height="24"></a>
<a href="0e01.htm" target="UDOcon"><img src="udo_lf.gif" alt="Clockpatch with 74F04" border=0 width="24" height="24"></a>
<a href="0e03.htm" target="UDOcon"><img src="udo_rg.gif" alt="Wizztronics Clockpatch" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
