<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Netzteil
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f.htm" target="UDOcon"><img src="udo_up.gif" alt="PowerSupply" border=0 width="24" height="24"></a>
<a href="0f.htm" target="UDOcon"><img src="udo_lf.gif" alt="PowerSupply" border=0 width="24" height="24"></a>
<a href="0f02.htm" target="UDOcon"><img src="udo_rg.gif" alt="How to repair the PSU" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Netzteil">15.1 Netzteil</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt><a href="0f.htm" target="UDOcon">PowerSupply</a>, die Stromversorgung</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Use only the save Way!
<br>Use a Voltchecker and check out this Plug *before* you start!
<br>
</p>
<p><tt>Look at Falcon's PCON8 (J14 on PCB)</tt>
</p>
<p>
<br>
</p>
<p align=center><img src="image/powersup.gif" border=0 width="340" height="120"></p><br>
<div align=center><tt>Abbildung 1 - Der Netzteilstecker des <a href="0302.htm" target="UDOcon">Falcon F030</a></tt>
<br>
</div>
<p>
<br>
</p>
<p>G7 / H8 sind die Punke f&uuml;r den Anschlu&szlig; eines
zus&auml;tzlichen CPU-K&uuml;hlers! Kein Riesenl&uuml;fter! Max. 50mA
! Direkt an der Netzteilplatine kommt man leicht an die Kabel ran.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/psucon.gif" border=0 width="170" height="118"></p><br>
<div align=center><tt>Abbildung 2 - F030 PSU und Anschlu&szlig;stecker</tt>
</div>
<p>
<br>
</p>
<p>Die +12V werden auf den SKYNET-PSU's mittels IC3 erzeugt. Das ist
nur ein 200mA +12V Spannungsregler im Plastikgeh&auml;use!
<br>Bei Netzteilen des Herstellers SKYNET kommt es hin und wieder vor
das bei hohen Innentemperaturen die &Uuml;bertragerspule innen einen
Kurzschlu&szlig; bekommt. Diese Spule ist als Ersatzteil leider kaum
einzeln zu erhalten. Das Netzteil sollte aus Sicherheitsg&uuml;nden
nicht mit einem &auml;hnlichen &Uuml;bertrager repariert werden!
<br>
</p>
<p>Sollte in Ihrem Falcon das Netzteil aus welchen Gr&uuml;nden auch
immer irreparabel Besch&auml;digt worden sein kann man bei der Firma
DDD in
<br>
</p>
<p>301163 Hannover, Nordring 9
<br>Telefon: 0511/6370-54 -55
<br>
</p>
<p>F&uuml;r 148.- DM eine neues internes Falcon-Netzteil beziehen.
<br>Der Austausch erfolgt durch abziehen des Verbindungssteckers und
<br>das l&ouml;sen der Befestigungsschrauben.
<br>
</p>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<div align=center>Es mu&szlig; darauf hingewiesen werden das Arbeiten an der
Netzspannung lebensgef&auml;hrlich ist und nur durch geschulte
Fachkr&auml;fte vorgenommen werden darf.
<br>
</div>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<div align=center>
<br>
</div>
<p align=center><img src="image/psu.gif" border=0 width="170" height="129"></p><br>
<div align=center><tt>Abbildung 3 - Falcon original SKYNET-Netzteil</tt>
</div>
<p>
<br>
</p>
<pre>
 Falcon internes Netzteil - Spannung / Output-Current
 _______________________________________________________________________

  Spannung     +5 Volt                    +12 Volt
  Min. Amp    1.5 Amp                     0.0 Amp
  Max. Amp    7.0 Amp                     0.2 Amp
  Line Reg      5 %                        10 %
  Welligkeit  100 mVpp                    100 mVpp
  Max. Last    10 Amp f&uuml;r 10 Sekunden

  Das Netzteil hat bei 5.05V +- 0.1 V eine Leistung von ca. 4 Amp.

  Schaltfrequenz 20Khz minimum

  PowerOn-Verz&ouml;gerung 150mS

  Kurzschlu&szlig;schutz: Abschaltung erfolgt nach 20mS

  AC-Input: 198-264 Volt Wechselspannung / 44-55 Hz (Europa)
  AC-Current 0.45 Amp
 _______________________________________________________________________

</pre>
<p><b>Falcon an einem PC-Schaltnetzteil</b>
</p>
<p>Das interne Netzteil besitzt einen Flachstecker der die
Stomverbindung zur Hauptplatine herstellt. Schwarz ist GND, Rot +5
Volt und Blau bef&ouml;rdert +12V zur Falconplatine. Wer hier ganz
sicher gehen will sollte vorher, also bevor der Falcon zerlegt wird,
hier mit einem Voltmeter das richtige anliegen der Versorgungsspannung
testen bzw. Nachmessen. Die Anschl&uuml;sse am Netzteil des
Towergeh&auml;uses sind warscheinlich zu kurz und m&uuml;ssen
sp&auml;ter in der richtigen Reihenfolge und in der richtigen
Polarit&auml;t bis zu dem Platinenanschlu&szlig; verl&auml;ngert
werden. Es ist sehr Sinnvoll das irgendwo dauerhaft zu Notieren!
<br>
</p>
<p>Die 5 V und GND Leitungen sind mehrfach vorhanden um Zusammen die
gew&uuml;nschte Leistung &uuml;bertragen zu k&ouml;nnen.
<br>Beachten Sie dazu die folgende Abbildung verschiedener
Anschlu&szlig;stecker von PC-Schaltnetzteilen nach DIN
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/psucon1.gif" border=0 width="500" height="343"></p><br>
<div align=center><tt> Abbildung 4 - Anschlu&szlig;stecker der PC-Schaltnetzteile
</tt>
<br>
</div>
<p>
<br>
</p>
<p>Der Blechk&auml;fig eines PC-Netzteils hat &uuml;ber seine
Befestigungsschrauben eine Verbindung zum PC-Geh&auml;use, somit liegt
also am gesammten Geh&auml;use der Schutzleiter von der Netzspannung
an.
<br>Zur vermeidung von St&ouml;rungen mu&szlig; diese Verbindung nicht
unbedingt mit der Rechnermasse des Falcons in Verbindung gebracht
werden.
<br>
</p>
<p>Die meisten Schaltnetzteile haben eine Leistung von 220 Watt.
Diese Leistung ist f&uuml;r einen Falcon-Umbau mehr als ausreichend.
Was auf jeden Fall nicht passt ist der Mainboardstecker.
<br>
</p>
<p>Wer sich die Pinbelegung vorher genau Notiert hatte braucht jetzt
eigentlich nur die richtigen Dr&auml;hte mit der richtigen Farbe in
die richtigen L&ouml;cher des Steckers stecken. Die meisten Stifte
dieser Steckverbindungen lassen sich durch biegen einer winzigen
Lasche aus ihrem alten Stecker ziehen. Biegt man die Lasche wieder
nach aussen kann man den Stift in den neuen Stecker stecken. Beim
Falcon wird das wegen den flachen Stiften eventuell Probleme geben.
Eventuell lassen sich bei manchen PC-Netzteilen die Mainboardstecker
aufhebeln um die Steckh&uuml;lsen zu entnehmen. In der richtigen Farbe
und Reihenfolge kann man die dann in dem neuen Stecker einstecken.
Hilft das alles nicht mu&szlig; gel&ouml;tet werden. Sollte sich
dieser Stecker nirgens auftreiben lassen nimmt man zu Not, wirklich
nur zur Not!, den des ausgebauten Falconnetzteils. Den Stecker sollte
man auch im gut sortierten Computer-Zubeh&ouml;r bekommen. (Siehe
weiter oben)
<br>
</p>
<p>Rot ist am PC-Netzteil + 5 Volt
<br>Gelb +12 Volt
<br>Schwarz GND
<br>
</p>
<p>Eigentlich also &auml;hnlich wie am Netzteil des Falcon!
<br>Beim Falcon ist die +12 V Leitung BLAU!
<br>
</p>
<p>Man kann die +5V, die +12 Volt sowie die Masse auch mit einem
Filzstift auf dem Mainboard und dem Stecker markieren. Der Platine tut
das nicht weh, sofern es nicht als Best&uuml;ckungsaufdruck schon auf
der Falconplatine steht.
<br>
</p>
<p><tt>Schaltnetzteile zum ausprobieren nicht ohne Grundlast laufen
lassen!</tt>
</p>
<p>Zum Ausprobieren eine 6V Gl&uuml;hbirne an den 5 Volt und eine 12
Volt Birne an den 12 Volt-Zweig des Netzteiles anschliessen. Nur zur
Sicherheit. Manche Netzteile haben ohne Grundlast eine h&ouml;here 12
V Spannung oder erzeugen seltsame Ger&auml;usche die u.U zur
Zerst&ouml;rung des selben f&uuml;hren k&ouml;nnen. Man kann die
Spannungen auch messen wenn die Gl&uuml;hbirnen dranh&auml;ngen,
schliesslich beissen die ja nicht. 2 Watt pro (Auto) Gl&uuml;hbirne
reichen v&ouml;llig aus. In vielen Netzteilen dient der interne 12
Volt L&uuml;fter bereits als Gundlast, also den dann auch bitte nicht
entfernen.
<br>
</p>
<p><tt>- Netzteil modifizieren</tt>
</p>
<p>Viele PC-Netzteile haben eine 'PowerGood-Leitung' (Oranges oder
wei&szlig;es Kabel) f&uuml;r das es ja am Falcon-Mainboard kein
Anschlu&szlig; gibt. Es hat damit folgende Bewandniss.
<br>Das PC-Netzteil h&auml;lt damit das Rechnermainboard solange im
PowerON-Reset fest bis eben die Spannungen des PC-Netzteils stabil
abgegeben werden k&ouml;nnen. Ist das nicht der Fall st&uuml;rzt der
Falcon gnadenlos ab oder bootet nicht korrekt bzw. er l&auml;uft erst
nach mehreren Resetversuchen richtig.
<br>
</p>
<p>Hierzu w&auml;re es erforderlich einen Anschlu&szlig; f&uuml;r die
PowerGood-Leitung auf dem Falcon-Mainboard zu schaffen. Der technische
Aufwand betr&auml;gt eine Diode und den richtigen L&ouml;tpunkt auf
der Platine :-) Der Resettaster befindet sich hinten links am
Rechnerboard. Rechts neben dem Resettaster befindet sich eine kleine
Diode, der Diodenanschlu&szlig; welcher zum <a href="0c02.htm" target="UDOcon">Keyboard</a> zeigt (der
Rechner liegt so auf dem Tisch als wenn man damit Arbeiten w&uuml;rde)
ist der richtige Anschlu&szlig; f&uuml;r die PowerGood-Leitung des
Netzteils. Das ist aber normalerweise schon zu viel Arbeit. Die
Leitung k&ouml;nnte ja mal abreissen oder abbrechen, ausserdem macht
man hier wieder eine Verbindung die nur mit dem L&ouml;tkolben zu
l&ouml;sen ist. Wesentlich besser und einfacher erscheint es den
Kondensator C7 (1uF) welcher sich in der N&auml;he des Resettasters
befindet, auf einen Wert von 2.2uF bis auf maximal 4.7uF zu
vergr&ouml;ssern. Der Kondensator sollte 16 Volt Betriebsspannung
vertragen k&ouml;nnen. Der alte Kondensator sollte dazu vorsichtig
ausgel&ouml;tet werden und und durch den neuen gr&ouml;sseren Ersetzt
werden. Auf die Polarit&auml;t beim Einsetzen des neuen Kondensators
achten! Das Funktioniert dann in jedem Fall und ganz sicher auch mit
jedem PC-Netzteil. Gewarnt wird hier nochmals vor dem rumbraten auf
der Platine. Durch lange L&ouml;tzeiten werden tieferliegende
Leiterbahnen besch&auml;digt!
<br>
</p>
<p>Durch diese Ma&szlig;nahme wird einfach der PowerON-Reset des F030
verl&auml;ngert, diese Zeit reicht dann dem PC-Netzteil aus um sich
korrekt zu Stabilisieren und der Rechner sollte/wird dann korrekt
hochlaufen.
<br>
</p>
<p>Es w&uuml;rde dann jedenfalls das etwas unsichere Anl&ouml;ten der
PowerGood-Leitung an der Diode entfallen. Zumal diese L&ouml;sung ohne
den bekannten L&ouml;tkolben nicht zu wieder zu Entfernen ist. Sollte
der Rechner beim ersten Versuch nicht gelaufen sein sollte er
sp&auml;testens nach dieser &Auml;nderung sicher laufen.
<br>
</p>
<p>Gibt das neue Schaltnetzteil klickende Ger&auml;usche von sich
besteht u.U die M&ouml;glichkeit das der +12V Anschlu&szlig; nicht
gen&uuml;gend Belastet ist.
<br>Oder Sie haben aber das Netzteil ohne Grundlast ausprobiert und es
jetzt ganz einfach defekt. Versuchen Sie zuerst die +12V st&auml;rker
zu belasten.
<br>
</p>
<p>Schematic drawn for comp.sys.atari.tech
<br>Technical Data: FalconFieldService Manual
<br>
</p>
<p><tt> Modifikation f&uuml;r PC-Schaltnetzteile </tt>
</p>
<div align=center>Ein Beitrag von Werner Frey@KR.maus.de
<br>
</div>
<p>
<br>
<br>Nachdem mein Falcon in ein PC-Towergeh&auml;use umzog stellte sich
bei mir das Problem ein, da&szlig; nach dem Einschalten die
Reset-Taste gedr&uuml;ckt werden mu&szlig; damit der Rechner
&quot;hochf&auml;hrt&quot;.
<br>
</p>
<p>Dieses Problem l&auml;&szlig;t sich beseitigen, indem ein
Kondensator (470&#181;F/16V) in Reihe mit einem Widerstand (10 Ohm)
parallel zum RESET-Taster geschaltet wird.
<br>
</p>
<pre>
Das Ganze sieht so aus:

     ----------*--------*
               |        |
              +++       *
      10 Ohm  | |         /  RESET-Taster
              | |        /
              +++       /
               |        |
              ---       |
      470&#181;F   +-+       |
              +++       |
               |        |
               +---+----+
                   |
                   *  Masse

Auf die richtige Polarit&auml;t des Kondensators achten!

</pre>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f.htm" target="UDOcon"><img src="udo_up.gif" alt="PowerSupply" border=0 width="24" height="24"></a>
<a href="0f.htm" target="UDOcon"><img src="udo_lf.gif" alt="PowerSupply" border=0 width="24" height="24"></a>
<a href="0f02.htm" target="UDOcon"><img src="udo_rg.gif" alt="How to repair the PSU" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
