<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Eine L&uuml;fterregelung
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_lf.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1002.htm" target="UDOcon"><img src="udo_rg.gif" alt="Taktanzeige" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Eine_20L_26uuml_3Bfterregelung">16.1 Eine L&uuml;fterregelung</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Eine L&uuml;fterregelung im Atari <a href="0302.htm" target="UDOcon">Falcon F030</a> zur
Ger&auml;uschreduzierung.</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Wen st&ouml;rt er nicht, der laute ungeregelte Ventilator in
Ataris neustem Abk&ouml;mmling, dem FALCON F030.
<br>Es gibt Dinge &uuml;ber die man ziemlich ausf&uuml;hrlich
diskutieren kann, und es gibt welche, bei denen man erst
&uuml;berhaupt nicht anzufangen braucht, hierzu z&auml;hlt eigentlich
eben auch dieser Ventilator.
<br>
</p>
<p>Weder der Typ des eingebauten L&uuml;fters, noch das Kaufdatum des
F030 spielen hierbei eine besondere Rolle - das Ger&auml;t ist einfach
mal nur laut.
<br>
</p>
<p>Da ich noch die letzten warmen Monate des letzten Jahres
abgewartet habe, und ich auch nicht jeden Tag meine Zeit damit
verbringe solche Anleitungen zu schreiben, kommt es eben halt erst
jetzt genau richtig zur warmen Jahreszeit.
<br>
</p>
<p>Es spricht also alles daf&uuml;r ca. 15,- DM f&uuml;r eine
L&uuml;fterregelung dranzuh&auml;ngen, und diese eben in den F030
einzubauen. Viele Leute werden sicher bedenken wegen der
Atari-Garantie haben, die ja bei einem Eingriff in den F030
nat&uuml;rlich dann nicht mehr vorhanden ist.
<br>Ich habe das also mit meinem <a href="1604.htm" target="UDOcon">H&auml;ndler</a> abgesprochen, und zwar
wegen einem 68882 Co-Prozessor und dem Einbau eben einer solchen
L&uuml;fterregelung. Vorausgesetzt ist nat&uuml;rlich ein gesundes
Ma&szlig; an Verst&auml;ndniss f&uuml;r die <a href="0305.htm" target="UDOcon">Hardware</a>. Kann man das bei
seinem <a href="1604.htm" target="UDOcon">H&auml;ndler</a> nicht anbringen, wird er sich auch weigern im Fall
des Selbsteinbaues die Garantie zu erhalten. Ansonsten bleibt nur
abzuwarten bis die Garantie um ist, oder man beauftragt seinen
<a href="1604.htm" target="UDOcon">H&auml;ndler</a> mit der ganzen Sache, die ungef&auml;hr eine halbe Stunde
dauert, wenn man es anst&auml;ndig macht.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/fan2.gif" border=0 width="580" height="400"></p><br>
<div align=center><tt> Abbildung 1 - so setzen Sie den Regler korrekt ein </tt>
<br>
</div>
<p>
<br>
</p>
<p>Ich benutze also wie schon erw&auml;hnt eine L&uuml;ftersteuerung
eines Elektronikversenders, in diesem Fall ein Bausatz f&uuml;r 15,-
DM aus dem ELV-Magazin, es eignet sich nat&uuml;rlich auch jede andere
L&uuml;ftersteuerung. Conrad-Elektronik bietet zu diesem Zweck
ebenfalls solche Steuerungen auch fertig an.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/fan1.gif" border=0 width="306" height="218"></p><br>
<div align=center><tt> Abbildung 2 - Eine einfache L&uuml;fterregelung</tt>
<br>
</div>
<p>
<br>
</p>
<p>Die Schaltung kann auf einer 4*4 cm Lochrasterplatine aufgebaut
werden.
<br>Es gibt kein Platinenlayout dazu.
<br>
</p>
<p>Nat&uuml;rlich steht einen Selbstbau nichts im Weg, hier halbiert
sich der Preis da die elektronischen Einzelteile im Prinzip jeweils
nur Pfennigartikel sind. Unterschiedlich von Schaltung zu Schaltung
ist einzig der Bauteileaufwand. Noch wesentlich einfacher h&auml;lt
sich die Sache bei Verwendung eines der neueren Papstl&uuml;fter, hier
befindet sich die Temperaturregelung gleich im Motorgeh&auml;use des
L&uuml;fters. Man spart sich so auf jeden Fall die gesammte Arbeit mit
der Reglerplatine, obgleich diese L&uuml;fter um einiges teurer sind.
<br>
</p>
<p>Ich wollte damals also auch nicht den L&uuml;fter komplett aus dem
Falcon entfernen, manche Leuten machen das ja so, einige warme Tage
mit erh&ouml;hten Temperaturen sprachen dagegen. Auch erschien mir der
Einsatz eines Festspannungsreglers, z.B einem 7808, nicht besonders
geeignet da dieser Regler eben zus&auml;tzlich auch noch reichlich
warm wird. Selbstverst&auml;ndlich Funktioniert auch das, in der
gezeigten Art u. Weise wie es in Abbilung 1 zu sehen ist. Nicht zu
Empfehlen ist es ganz ohne L&uuml;fter zu arbeiten wenn sich im Falcon
noch Hardwarebeschleuniger oder gar eine SpeedResolution-Karte oder
&auml;hnliches befindet. L&ouml;sungen mit Widerst&auml;nden in der
L&uuml;fterzuleitung sind nicht zu Bevorzugen, da es hier bei einer
falschen Berechnung des Widerstandes ausf&auml;lle geben kann. Gerne
werden solche 'billige' L&ouml;sungen an verschiedenen Stellen
propagiert. An hei&szlig;en Tagen kann der Luftdurchsatz eben dann
nicht mehr ausreichend sein. Ein W&auml;rmestau und Temperaturbedingte
Aussetzerdes Rechners w&auml;ren sicher die Folge einer falschen
Sparsamkeit.
<br>Zumal mit dem zunehmenden Alter und der Verschmutzung des
L&uuml;fters kein sicherer Anlauf gew&auml;hrleistet werden kann. Eine
Reglung 'dreht' beim Einschalten eben solange die Spannung hoch bis
der Motor sicher l&auml;uft, sofern kein defekt des Motors vorliegt.
Erst danach beginnen die meisten fertigen Reglerschaltungen die
Drehzahl des L&uuml;fters auf die Temperatur einzustellen.
<br>
</p>
<p>Auch gibt es bereits Schaltungen die den L&uuml;ftermotor
zus&auml;tzlich &uuml;berwachen..
<br>
</p>
<p>Nach dem man im Falcon die oberen Abschirmbleche entfernt hat kann
man bereits den L&uuml;fter sehen, zum besseren Handling ist es aber
sicherer wenn man die Bleche komplett entfernt. Dazu mu&szlig; leider
auch das Diskettenlaufwerk gel&ouml;st werden. Hier ist das
Flachbandkabel recht vorsichtig zu bewegen!
<br>Auch ist es gut, wenn man bei diesem Umbau den Lautsprecher
vorsichtig absteckt, er hat recht kurze Anschlusskabel und ist jetzt
nur hinderlich.
<br>
</p>
<p>Da ich so wenig wie m&ouml;glich an der original <a href="0305.htm" target="UDOcon">Hardware</a>
&auml;ndern wollte habe ich mir eine Stiftleiste und einen Stecker
besorgt, den ich an dem Anschlu&szlig;punkt des L&uuml;fters
eingel&ouml;tet habe. (Elektronikl&auml;den oder die eigene
Bastelkiste erweisen sich immer wieder als wahre Fundgruben). Auf die
neue Stiftleiste passt so also genau der Anschlu&szlig;stecker meiner
Falcon-L&uuml;fterplatine, was auch den Vorteil besitzt das man den
L&uuml;fter sp&auml;ter auch mal zum Reinigen einfach abstecken kann.
Wo geht das sonst wenn das Teil mit zwei Dr&auml;hten fest
angel&ouml;tet ist. So braucht man nicht das Kabel durchzuschneiden
oder was sonst auch immer. Da ich meine Platine in der N&auml;he des
Netzteiles plaziert habe w&auml;ren die original Dr&auml;hte des
L&uuml;fters eh ein wenig zu kurz gewesen. Beim einl&ouml;ten der
Stiftleiste in die Hauptplatine sollte man bedenken das es sich
hierbei um eine 6fach Multilayerplatine handelt und man diese auch
entsprechend behandeln sollte. Ein L&ouml;tkolben mit 15 Watt ist mehr
als aussreichend!
<br>
</p>
<p>Auch k&ouml;nnte man die Dr&auml;hte eingel&ouml;tet lassen und
eben so abschneiden das man eine geeignete Steckverbindung in das
vorhandene Kabel einf&uuml;gen kann. Die Stiftleiste bildet nun bei
mir den neuen Anschluss f&uuml;r diesen L&uuml;fter bzw. der gesammten
Steuerung einschliesslich dem L&uuml;fter. Beachten Sie dazu bitte die
Abbildung 1 hier im Text.
<br>
</p>
<p>An den neuen Stecker kommen nun einfach die Verbindungsdr&auml;hte
von dem Atari-Mainboard. Dort also wo der Ventilator vorher
eingesteckt oder eben angel&ouml;tet war. Das andere Ende wird unter
Beachtung der Polarit&auml;t an der L&uuml;fterplatine angel&ouml;tet,
womit dann der Ventilator (ebenfalls unter Beachtung der
Polarit&auml;t) auf die Stiftleiste der Regelung gesteckt werden kann.
<br>
</p>
<p>Wer sich nicht ganz sicher ist, hat hier doch noch die
M&ouml;glichkeit vorher nachzumessen, der Falcon arbeitet
logischerweise auch ohne L&uuml;fter ! Sollte das alles in Ordnung
sein kann man den L&uuml;fter an seinen alten Platz schrauben und sich
einen geeigneten Platz f&uuml;r die sehr kleine Regelplatine suchen
nachdem der Umbau kurz ausprobiert wurde. Nat&uuml;rlich k&ouml;nnte
der L&uuml;fter bei dieser Gelegenheit auch einen neuen Platz
bekommen, direkt links &uuml;ber dem <a href="0f01.htm" target="UDOcon">Netzteil</a> montiert bleibt der
Rechner wesentlich k&auml;lter!
<br>
</p>
<p>Die Reglerplatine sollte auf keinen Fall irgendwelche Bauteile
ber&uuml;hren oder gar irgendwo auf die Falcon-Chips ect. aufgeklebt
werden. Teilweise werden die Falconchips doch ganz sch&ouml;n warm,
das aufkleben einer Platinenhalterung ect. w&uuml;rde also nur den
W&auml;rmeabtransport behindern. Ferner sollte man bei Einb8 gleich
daran denken, da&szlig; in den Falcon nachtr&auml;glich noch recht
gro&szlig;e Erweiterungskarten eingesteckt werden k&ouml;nnen. Also
nicht jetzt schon wertvollen Platz verbauen!!!
<br>
</p>
<p>Bei meinem Rechner ist das Teil mit einem Abstandshalter und einer
Befestigungsschraube der Netzteilplatine verschraubt, und zwar
zwischen der Festplatte, dem <a href="0f01.htm" target="UDOcon">Netzteil</a> und dem hinterem Abschirmblech.
( Ja ich wei&szlig;, wer hat schon Abschirmbleche im Rechner :-)
<br>
</p>
<p>Der Temperatursensor wurde von mir vorher von der Reglerplatine
entfernt und mit zwei Dr&auml;hten passend verl&auml;ngert; so
da&szlig; er n&auml;her am <a href="0f01.htm" target="UDOcon">Netzteil</a> zum liegen kommen kann. Das
d&uuml;rfte sicher die w&auml;rmste Stelle im ganzen Geh&auml;use
sein. Der Sensor ist bei meiner L&ouml;sung mit einem winzigen Tropfen
Hei&szlig;kleber an der Netzteilplatine fixiert, man will ja keine
Spazierg&auml;nger im Rechner haben, und ist von der Platine weg nach
oben leicht nach oben gebogen.
<br>
</p>
<p>Wenn man das alles erledigt hat kann man seinen Rechner nun
langsam wieder zuschrauben. Der L&uuml;fter wird nun in den ersten
paar Betriebsstunden eines F030 keine Ger&auml;usche machen - weil er
einfach noch nicht l&auml;uft - oder weil er Temperaturbedingt einfach
noch nicht gefordert ist.
<br>Erst nach l&auml;ngerem Betrieb kann ich ahnen das mein
L&uuml;fter l&auml;uft, obwohl der Rechner jetzt nach dem Umbau auf
keinen Fall w&auml;rmer als vorher wird.
<br>
</p>
<p>F&uuml;r die Ohren auf jeden Fall ein ganz brauchbares Ergebniss
:-)
<br>
</p>
<p>Weiterhin hat man die M&ouml;glichkeit auf komplett
Temperaturgesteuerte Papst-L&uuml;fter zur&uuml;ckzugreifen. Diese
Kosten idR ca. 50 DM und k&ouml;nnen bei der Fa. Conrad Electronik in
Hirschau bezogen werden. Diese L&uuml;fter gibt es in verschiedenen
Baugr&ouml;ssen und eignen sich auch sehr gut um laute
Billigl&uuml;fter in Schaltnetzteilen rasch zu ersetzen.
<br>Mit diesen L&uuml;ftern hat man weniger Arbeit da hier die
komplette Steuerelektronik im Ventilator integriert ist. Diese
Papst-Variofans haben neben allen anderen L&uuml;ftern 3
Anschlu&szlig;leitungen.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/fan.gif" border=0 width="410" height="92"></p><br>
<div align=center><tt>Abbildung 3 - Die Verschaltung eines elektronisch geregelten
Papst-Variofan.</tt>
<br>
</div>
<p>
<br>
</p>
<p>Zu jeden VarioFan wird ein passender NTC-Widerstand geliefert der
nach obigen Schema verdrahtet wird. Das ist bei den meisten VarioFans
v&ouml;llig identisch.
<br>Es ist kein Problem das bei dem Papst-L&uuml;fter auch der Sensor
fest mit dem L&uuml;fter verbunden ist, es gen&uuml;gt auch f&uuml;r
den Falle, sollte der Sensor direkt im Abluftstrom sitzen, zu einer
vollst&auml;ndigen Reglung!
<br>Es bleiben die beiden &uuml;blichen Anschlu&szlig;leitungen
f&uuml;r die Versorgungsspannung &uuml;brig die an den ensptechenden
Stellen im Computer angeschlossen werden. Es kann hier also auch der
Falconl&uuml;fter gegen einen VarioFan ausgetauscht werden. Der
Temperatursensor kann auch im Abluftstrom des L&uuml;fters montiert
werden. Bei Computern ist es ratsam die Luft aus dem Geh&auml;use zu
saugen, nicht hineinblasen lassen.
<br>
</p>
<p>
<br>
<br><b> Aufgeklebte L&uuml;fter oder K&uuml;hlk&ouml;rper entfernen
</b>
<br>
</p>
<p>L&ouml;ten sie immer zuerst die Anschlu&szlig;leitungen ab.
Markieren sich sich die L&ouml;tstellen f&uuml;r + und - auf der
Platine.
<br>
</p>
<p>(Disclaimer: Nat&uuml;rlich keine Gew&auml;hr f&uuml;r
irgendwas!):
<br>
</p>
<p>- durch Anbohren des K&uuml;hlk&ouml;rpers oder Auf-/Einklemmen
einen ca.10 cm langen stabilen Stahldraht (3-4mm) am
K&uuml;hlk&ouml;rper befestigen (die Verwendung einer Zange war mir
immer zu unsicher, da man bei dem erforderlichen, z&uuml;gigen
Arbeiten leicht abrutschen k&ouml;nnte)
<br>
</p>
<p>- der &quot;Hebel&quot; mu&szlig; dabei so angebracht sein,
da&szlig; er sp&auml;ter das Drehen des K&uuml;hlk&ouml;rpers auf der
Klebe-Fl&auml;che erm&ouml;glicht, ohne sich die Finger zu
&quot;verbrennen&quot;!
<br>
</p>
<p>- den K&uuml;hlk&ouml;rper mit einem Hei&szlig;luftgebl&auml;se
auf hoher Einstellung (ca. 150 Grad C) solange erhitzen, bis die
Klebefl&auml;che weich wird und sich der K&uuml;hlk&ouml;rper auf der
Klebefl&auml;che &quot;rotierend&quot; abdrehen l&auml;&szlig;t
<br>
</p>
<p>- schnelles Arbeiten verhindert zuverl&auml;ssig eine zu
gro&szlig;e Erhitzung des Chipinneren, der Kleber wurde
*sp&auml;testens* bei etwa 100 Grad C so weich, das der
K&uuml;hlk&ouml;rper sich sicher abdrehen lie&szlig;...
<br>
</p>
<p>- Die Klebestelle ist hinterher komplett zu Reinigen. Dazu gibt es
L&ouml;semittel f&uuml;r Klebstoffe. Ein neuer L&uuml;fter &amp;
K&uuml;hlk&ouml;rper k&uuml;hlt nur korrekt wenn er sauber und plan
auf der Chipoberfl&auml;che befestigt wird. Dabei sollten auch kein
Luftspalt zwischen Chip u. K&uuml;hlk&ouml;rper entstehen.
<br>
</p>
<p>- Zum erneuten befestigen verwendet man ausschliesslich
W&auml;rmeleitkleber aus dem einschl&auml;gigen Fachhandel.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_lf.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1002.htm" target="UDOcon"><img src="udo_rg.gif" alt="Taktanzeige" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
