<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Taktanzeige
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1001.htm" target="UDOcon"><img src="udo_lf.gif" alt="Eine L&uuml;fterregelung" border=0 width="24" height="24"></a>
<a href="1003.htm" target="UDOcon"><img src="udo_rg.gif" alt="Videotextdecoder" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Taktanzeige">16.2 Taktanzeige</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Eine Taktanzeige wie am PC</tt>
</p>
<p>Viele Leute haben sicher den Wunsch nach einer optischen Anzeige
mit welcher Geschwindigkeit ihr Falcon gerade l&auml;uft.
<br>Gut geeignet ist hierzu das Speed-Display eines
Towergeh&auml;uses. Die meisten Displays werden vom Towernetzteil mit
+5 Volt und GND versorgt. Ein passender Stecker baumelt sicher
irgendwo hinter der Frontpartie herrum. Man stellt hier also nur die
Verbindung zum <a href="0f01.htm" target="UDOcon">Netzteil</a> her. Ein weiterer Anschlu&szlig; ist das
'Turbo-Signal' ist diese Leitung nicht angschlossen wird das Display
einen kleineren Wert anzeigen als wenn diese Leitung auf +5 Volt
gelegt wird.
<br>Es soll auch welche geben die Umschalten wenn man diese Leitung
mit GND verbindet. Das mu&szlig; man probieren, wei&szlig; man nicht
wie es am PC-Mainbord gemacht wird.
<br>
</p>
<p>Wird nun diese Leitung mit dem Punkt des Beschleunigers verbunden
der bei erh&ouml;hter Taktzahl des Rechners ein 'High'-Signal
f&uuml;hrt ist die Turbo-Anzeige somit schon realisiert. Die '100Mhz'
k&ouml;nnen bei den meisten Speed-Displays per Jumper voreingestellt
werden. Wird der Beschleuniger &uuml;ber ein 'Port-Bit' eingeschaltet
kann man diese Leitung mit dem gleichen Anschlusspunkt verl&ouml;ten.
Bei Low-aktiven Displays mu&szlig; das Umschaltsignal invertiert
werden. Im Normalfall ist der Beschleuniger nicht aktiv, das Display
zeigt '16Mhz' im zweiten Fall ist der Beschleuniger aktiv und das
Display zeigt '32 Mhz' oder mehr an. Genau so kann das auch
verschaltet werden wenn der Speeder nur per Handschalter Ein bzw.
Ausgeschaltet wird. Was das Display anzeigen soll mu&szlig; mit den
Jumpern darauf eingestellt werden!
<br>
</p>
<p>Im einfachsten Fall gen&uuml;gt nat&uuml;rlich eine LED zum
Anzeigen einer h&ouml;heren Geschwindigkeit.
</p>
<p>Sicherlich wird an der Frontplatte neben dem Einschalter auch noch
die Turbotaste und der Resesttaster auffallen sofern der Rechner in
ein anderes Geh&auml;use gesetzt wurde. Der Resettaster kann einfach
mit zwei Leitungen paraell zu dem Resttaster auf der Falconplatine
verl&auml;ngert werden. Das macht keine Probleme. Man sollte hier nur
keine Klemmen oder so etwas verwenden, anl&ouml;ten ist wesentlich
sicherer. Der nun noch &uuml;brige 'Turbotaster', also entweder
l&auml;sst man ihn wie er ist, als Attrappe, oder man schaltet sich
damit den Cache oder den ganzen Beschleuniger per 'Hand'. Wie das
genau Funktioniert kann man aus den Anleitungen der meisten
Beschleuniger entnehmen. Meistens wird hier auch eine Umschaltung per
Schalter oder .CPX-Modul angeboten, genau hier kann man dann auch den
Turboschalter einsetzten.
</p>
<p>So kann man z.B bei einem vorhandenen Schl&uuml;sselschalter die
Tastatur verriegeln, der Falcon-Tower ist somit vor unbefugter
Benutzung schon relativ gut gesch&uuml;tzt. Man f&uuml;gt den Schalter
dann einfach in die TxD-Leitung der Tastatur ein. Bei ge&ouml;ffnetem
Schl&uuml;sselschalter kann so nichts mehr zum Rechner gesendet
werden. Ist der Schl&uuml;sselschalter geschlossen geht das nach wie
vor. Es sollte dabei nicht die Masseleitung oder die +5Volt
Versorgungsleitung der Tastatur unterbrochen werden, der Rechner
f&auml;ngt sonst an zu spinnen. Er wird sich so verhalten als wenn
keine Tastatur angesteckt ist. Es ist m&ouml;glich das hierbei das
&quot;Klickern&quot; entsteht. Siehe dazu <a href="0c02.htm" target="UDOcon">Keyboard</a>.
</p>
<div align=center>robscha@data.rhein-main.de
<br>
</div>
<p align=center><img src="image/line2.gif" border=0 width="638" height="17"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1001.htm" target="UDOcon"><img src="udo_lf.gif" alt="Eine L&uuml;fterregelung" border=0 width="24" height="24"></a>
<a href="1003.htm" target="UDOcon"><img src="udo_rg.gif" alt="Videotextdecoder" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
