<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: DCF77 Decoder
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1003.htm" target="UDOcon"><img src="udo_lf.gif" alt="Videotextdecoder" border=0 width="24" height="24"></a>
<a href="1005.htm" target="UDOcon"><img src="udo_rg.gif" alt="Device LED" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="DCF77_20Decoder">16.4 DCF77 Decoder</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> DCF77 Uhrzeitdecoder am Falcon</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Um auch -wie bereits beim ST- immer die aktuelle Uhrzeit per DCF77
im Rechner zu haben gen&uuml;gt es, wenn man sich bei Conrad
Electronic den DCF-Empf&auml;nger mit der Bestellnummer: 641138-77
besorgt.
<br>
</p>
<p>Ein wenig Kabel, ein St&uuml;ckchen Software und ein
Joystickstecker erm&ouml;glichen die atomgenaue Zeit auch im Falcon
F030.
<br>
</p>
<p>Ralf Zimmermann hat hier mit DCF-Time den passenden
Softwaredecoder, der auch als .CPX auf dem Falcon l&auml;uft. Ein
kleines Treiberprogramm geh&ouml;rt hier in den Autoordner, um nach
dem Bootvorgang die genaue Zeit zu haben. DCF77 stellt nach Abblauf
der Zeitsynconisation die rechnerinterne Uhr auf die aktuelle Uhrzeit
ein. Der Installationsaufwand beschr&auml;nkt sich auf ein Minimum.
<br>
</p>
<p>Die passende Steckerbelegung f&uuml;r dieses Uhrenmodul:
<br>
</p>
<pre>
DCF Modul            Joystickport

1 Masse   ------     Pin 8
2 +       ------     Pin 7
3 Ausg.   ------     Pin 3
4 Ausg. invers       NC

</pre>
<p>Dem Modul spendiert man ein kleines Geh&auml;use und stellt es in
Richtung des n&auml;chsten Fensters auf. M&ouml;glichst nicht auf den
Monitor. Als Anschlu&szlig;kabel dient mir das Kabel eines alten,
billigen Joysticks.
<br>
</p>
<p>Wer ein Uhrenmodul mit LC-Display hat, kann nat&uuml;rlich auch
das verwenden. Zu beachten w&auml;re noch, da&szlig; manche
Bildschirmschoner nicht aktiv werden, da hier st&auml;ndig &uuml;ber
den Joystickport Impulse vom Uhrenmodul angelegt werden. In Twilight
kann man den Joystickport daher aus der Abfrage des Schoners
rausnehmen.
<br>
</p>
<p><a href="030806.htm" target="UDOcon">Schaltplan</a> f&uuml;r ein Interface, um Conrad DCF-77-Module
anzupassen:
<br>
<br>
<br>
</p>
<p align=center><img src="image/dcf771.gif" border=0 width="544" height="188"></p><br>
<p>
<br>
<br>
</p>
<p>I/P ist der Zeittaktausgang des Funkuhrmoduls. ON ist ein
Schalteingang, der die Empfangseinheit aktiviert, wenn an ON Low Pegel
anliegt. Die Empfangseinheit wird vom Anzeigemodul normalerweise nur 2
mal in der Nacht aktiviert, um die Anzeige mit der Atomuhr zu
syncronisieren. Durch den Transistor T2 wird die Empfangseinheit immer
nur dann aktiviert, wenn eine Vorsorgungsspannung an der Schaltung
anliegt.
<br>
</p>
<p>Die Versorgungsspannung von 5 Volt kann der Einfachheit halber
direkt aus dem Joystickport entnommen werden. Hierbei ist folgende
Pinbelegung zu beachten:
<br>Pin 7 = +5 Volt; Pin 8 = GND
<br>
</p>
<p>Das Ausgangssignal wird mit Pin 1 des Joystickports verbunden. Die
Schaltung arbeitet nur korrekt mit der aktuellen Version 1.2 des
DCF_TIME Programms zusammen. Daf&uuml;r aber auch an der Modem 1
Schnittstelle. Beim Mega ST gen&uuml;gen 5 Volt als
Versorgungsspannung f&uuml;r den Modem 1 Anschlu&szlig;. (Ausgang auf
Pin 22 (RI) Ring Indicator). F&uuml;r den TT-Anschlu&szlig; an Modem 1
(Ausgang auf Pin 9, Masse Pin 5) kann die Schaltung unver&auml;ndert
mit 12 statt mit 5 Volt versorgt werden. Es geht auch mit einer 9 Volt
Blockbatterie.
<br>
</p>
<p>Achtung:
<br>
</p>
<p>Die Uhr nicht zu dicht neben einem Monitor oder anderen,
Hochfrequenz abstrahlenden Ger&auml;ten aufstellen; es
beeintr&auml;chtigt den Empfang des HF-Zeitzeichens.
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/dcf77mod.gif" border=0 width="544" height="188"></p><br>
<p>
<br>
<br>
</p>
<p>IP, ON und GND sind Punkte auf der Uhrenplatine. Das
Ausgangssignal hat als Ruhepegel LOW und folgt den Sekundenbits auf
HIGH. Bei Verwendung eines CMOS 7414 (74HC14, 74HCT14 etc.) unbedingt
alle nicht benutzten Eing&auml;nge auf einen definierten Pegel legen,
z.B. Masse. Sonst neigen CMOS Schaltungen zu wilden Schwingungen und
es funktioniert unter Umst&auml;nden nicht.
<br>
</p>
<p>Um das Funkuhrmodul in unmittelbarer N&auml;he des Rechners
betreiben zu k&ouml;nnen, sollte man die Antenne inkl. der
Empfangseinheit vom Anzeigemodul trennen und in ca. 1m Entfernung vom
Computer betreiben. Bei mir steht die Uhr ca. 30cm &uuml;ber einem
Monitor in einem Regal; auch das geht problemlos.
<br>
</p>
<p>Von einem Einbau der Empfangseinheit in den Rechner ist daher
abzuraten. Die Empfangsprobleme steigen, je n&auml;her die Uhr sich am
Computer befindet und je weiter man sich vom Zeitzeichensender
entfernt befindet. Der DCF77- Sender befindet sich in Mainflingen in
der N&auml;he von Frankfurt am Main. Die eigentliche Atomuhr befindet
sich in Braunschweig.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1003.htm" target="UDOcon"><img src="udo_lf.gif" alt="Videotextdecoder" border=0 width="24" height="24"></a>
<a href="1005.htm" target="UDOcon"><img src="udo_rg.gif" alt="Device LED" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
