<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Device LED
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1004.htm" target="UDOcon"><img src="udo_lf.gif" alt="DCF77 Decoder" border=0 width="24" height="24"></a>
<a href="1006.htm" target="UDOcon"><img src="udo_rg.gif" alt="METEX DMM Multimeter" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Device_20LED">16.5 Device LED</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Eine zus&auml;tzliche Laufwerk-LED </tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Falcon-Benutzer, die ihren Falcon in Tower- oder
Desktopgeh&auml;use umgebaut haben, werden sicherlich die LEDs der
dabei verwendeten Festplatten nicht immer im Blickfeld haben.
Gleicherma&szlig;en eignet sich diese Anleitung nat&uuml;rlich auch
f&uuml;r alle Falcons, die sich noch im normalen Geh&auml;use
befinden.
<br>Einige Festplattentypen besitzen keinen Anschlu&szlig; f&uuml;r
eine eigene LED, welche den Zugriff auf das Laufwerk anzeigt. Andere
besitzen nur spezielle Stecker, um eine LED anzuschliessen. Zugriffe
auf SCSI-Devices werden beim FalconF030 &uuml;berhaupt nicht
angezeigt. Lediglich die interne IDE und das Floppylaufwerk besitzen
eine gemeinsame LED auf dem <a href="0c02.htm" target="UDOcon">Keyboard</a>.
<br>
<br>
</p>
<p align=center><img src="image/driveled.gif" border=0 width="253" height="200"></p><br>
<div align=center><tt> Abbildung 1 - eine zus&auml;tzliche Laufwerk-LED </tt>
</div>
<p>
<br>
</p>
<p>Mit der Schaltung aus Abbildung 1 ist es m&ouml;glich, eine LED am
Rechner zu installieren, die prinzipiell alle Zugriffe auf jedes
vorhandene Laufwerk anzeigt. Also auch Zugriffe auf externe
SCSI-Devices.
<br>
</p>
<p>Es kommen hier lediglich zwei billige TTL-Chips zur Anwendung. Die
Chips k&ouml;nnen Sie auf einer kleinen Platine verdrahten, die sich
dann irgendwo im Rechner leicht befestigen l&auml;sst. Die Verkabelung
ist kein Problem, da alle L&ouml;tstellen sehr leicht erreichbar sind.
Sie sollten daf&uuml;r keine Gatter an etwa einen vorhandenen
<a href="0e.htm" target="UDOcon">Clockpatch</a> oder anderen Chips benutzen, die zuf&auml;llig noch ein
Gatter frei haben. Es w&uuml;rde nat&uuml;rlich einen Chip sparen. Es
ist allerdings fraglich, ob der Preis f&uuml;r einen 7404 es wert ist,
sich eventuell Interferrenzen mit z.B. dem Taktsignal im <a href="0e.htm" target="UDOcon">Clockpatch</a>
74F04 einzufangen.
<br>
</p>
<p>An Pin 3 von J18 -das ist der Anschlu&szlig;stecker f&uuml;r die
Tastatur- greifen Sie das Signal der internen IDE-Festplatte und des
Floppylaufwerks ab. Pin 17 an U7 f&uuml;hrt das Chip Select (CS)
Signal des SCSI-Bausteins. Beide Signale werden in dem 7404 durch zwei
Gatter gef&uuml;hrt, um das urspr&uuml;ngliche Signal nicht zu
belasten. Der 7402 ist lediglich ein NOR-Gatter, das die neue LED eben
bei IDE, Floppy oder SCSI-Zugriffen leuchten l&auml;sst. Negiert und
gebuffert kann die LED dann direkt am Ausgang 6 des 7404 &uuml;ber
einen Vorwiderstand betrieben werden. Die Versorgungsspannung der
beiden Chips entnehmen Sie einfach irgendwo im Rechner; wo eben +5 V
und GND vorhanden sind.
<br>
</p>
<p>Mit einer weiteren &Auml;nderung dieser Schaltung -einer
&Auml;nderung im Layout des Falcon- k&ouml;nnte auch die originale
Tastatur-LED zur Anzeige verwendet werden.
<br>
</p>
<p>Alle Angaben ohne Gew&auml;hr
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>If you like to get a device LED how was shows IDE, Floppy AND SCSI
access, use the following description and the simple diagram upper.
<br>Pin 3 of J18 contains the LED signal for internal floppy or IDE
access. Pin 17 of U7 (SCSI Chip select) shows any access of the
SCSI-Port. If you like to got a LED how was show the access of any
device, also external SCSI, on your Falcon, use the ciruit of
Abbildung 1. That schematic is a simple signal driver for SCSI chip
select and the original IDE, Floppy access wire. A simple 7404 builds
the signal buffer, a 7402 is the NOR-Gate to form both access signals
into one LED. It's simple to create a smal boaard for both chips
<br>Take +5V for both chips on any place how you found +5V
<br>
</p>
<p>Note:
<br>DO NOT shorten the SCSI CS-Signal, you lost your hole SCSI
access!!
<br>
</p>
<p>Use that ciruit to your own risk
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1004.htm" target="UDOcon"><img src="udo_lf.gif" alt="DCF77 Decoder" border=0 width="24" height="24"></a>
<a href="1006.htm" target="UDOcon"><img src="udo_rg.gif" alt="METEX DMM Multimeter" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
