<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Junior Prommer
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1007.htm" target="UDOcon"><img src="udo_lf.gif" alt="Ring On" border=0 width="24" height="24"></a>
<a href="1009.htm" target="UDOcon"><img src="udo_rg.gif" alt="DELA Prommer" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Junior_20Prommer">16.8 Junior Prommer</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Eine Anleitung zum Aufbau des JuniorPrommers </tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<p>Aufbautips zum Junior-Prommer V2.33
<br>
<br>
</p>
<p>Oder das was in der orig. Anleitung fehlt.
<br>
</p>
<p>Dieser Text ist Quasi gleichzeitig mit dem Zusammenbau meines
JuniorPrommers entstanden :)
<br>
</p>
<p>Nach dem man die gute Platine begutachtet hat und sich &uuml;ber
den fast unleserlichen <a href="030806.htm" target="UDOcon">Schaltplan</a> ge&auml;rgert hat kommt mancher
nicht drum herum einen Elektronikladen aufzusuchen, um die diversen
Bauteile zu besorgen. Die kompletten Kosten f&uuml;r die Bauteile
belaufen sich auf ca.30-50 DM je nachdem wo man die Teile einkauft.
<br>
</p>
<p>Um die St&uuml;ckliste nicht m&uuml;hsam abschreiben zu
m&uuml;ssen, kann man sie auch Ausdrucken. Die Liste befindet sich
nochmal in dem Read_me File auf der mitgelieferten Diskette, was die
Sache ungemein erleichtert.
<br>
</p>
<p>Die Bauteile sind allgemein g&auml;ngige und gut erh&auml;ltliche
Teile, ein gut sortierter Elektronikladen sollte sie auf alle
F&auml;lle da haben. Ein Tip ist da hier in der Gegend evntuell die
Fa. Zimmerman in Darmstadt. Eine Ausnahme macht der 28polige
Textool-Nullkraftsockel, nur wer es ganz Eilig hat sollte diesen
ebenfalls im Elektronikladen kaufen. Da betr&auml;gt der Kaufpreis die
h&auml;lfte ! der &uuml;berhaupt insgesamt anfallenden Bauteile
kosten. Bei Conrad oder Simons ist er wesentlich g&uuml;nstiger. Man
k&ouml;nnte z.B auch gleich ein 40poligen nehmen, man denke nur daran
das die Eproms im laufe der Zeit sicher nicht kleiner werden.
<br>
</p>
<p>Der Rest ist eigentlich Pipifax und besteht zum in der Hauptsache
aus Pfennigartikeln. Einige Beachtung verdienen die
Metallschichtwiderst&auml;nde, unbedingt darauf achten das auch nur
solche mit 1% Toleranz gekauft werden. Daf&uuml;r kann man auch ruhig
mal auf -+ 10 Ohm verzichten, das bei&szlig;t keinen Faden ab, da die
Schaltung sp&auml;ter abgeglichen werden mu&szlig;.
<br>
</p>
<p>Die Toleranz dieser Widerst&auml;nde ist daf&uuml;r verantwortlich
wie oft man den Junior-Prommer sp&auml;ter
&quot;Abstimmen/Einstellen&quot; mu&szlig; ! D.h je genauer die
Widerst&auml;nde desto kleiner die Probleme. Sie dienen meist als
Spannugsteiler die in der Elektronik zur Einstellung der verschiedenen
Programmierspannungen dienen. Die einzelnen Programmierspannungen
werden wiederum sp&auml;ter per Software am Bildschirm eingestellt.
<br>
</p>
<p>Der Aufbau gestaltet sich im Prinzip sehr einfach, nur die
ungenaue Beschreibung l&auml;st manchmal ein Zweifel aufkommen. Als
erstes sollte man alle Widerst&auml;nde best&uuml;cken, das ist am
einfachsten. Die &uuml;berstehenden Drahtenden auf der L&ouml;tseite
der Platine verl&ouml;ten und so kurz wie m&ouml;glich &uuml;ber der
L&ouml;tstelle abkneifen.
<br>
</p>
<p>Die L&ouml;tungen sollten so sauber wie m&ouml;glich gemacht
werden, da an manchen stellen die Leiterbahnen ziemlich eng
beieinander liegen. Dieser Arbeitsgang l&auml;st dann auch etwas
&ouml;bung aufkommen, so da&szlig; man sich an die anderen Bauteile
wagen kann. Man kann dann damit beginnen die Kondensatoren
einzul&ouml;ten, die Technik ist genau wie bei den Widerst&auml;nden
gleich. Bei den kleinen keramischen Kondensatoren ist auf keinerlei
Einbaurichtung zu achten, anders bei den &quot;dickeren&quot;
Elektrolytkondensatoren! Bei denen mu&szlig; Unbedingt auf die
Polarit&auml;t geachtet werden. Eine falsche Polung f&uuml;hrt zu
einer Fehlfunktion der Schaltung sowie zur Zerst&ouml;rung des
Kondensators. (Was manchmal auch etwas &quot;laut&quot; ist und auch
Streng riecht!) :-))
<br>
</p>
<p>Als n&auml;chstes k&ouml;nnte man z.B die IC Sockel einl&ouml;ten,
ja richtig, Sockel man kann ruhig ein paar Pfennige f&uuml;r IC-Sockel
ausgeben. Man kann so sp&auml;ter einen defekten Baustein ohne
L&ouml;ten austauschen, ausserdem sieht die Sache sauber und Perfekt
aus.
<br>
</p>
<p>Bei der Best&uuml;ckung der Transistoren ist besondere Vorsicht
geboten, der Best&uuml;ckungsplan gibt keinerlei Auskunft &uuml;ber
die Bauteilelage der Transistoren, was sehr schnell zu
gr&ouml;&szlig;eren Problemen f&uuml;hren kann. Der Transistor T1 wird
so Eingel&ouml;tet das er mit seiner flachen Seite in Richtung der
beiden Dioden D1 + D2 zeigt. Die Rundung seines Geh&auml;uses kommt
fast mit dem Poti P1 in Ber&uuml;hrung. Der Transistor T3 zeigt mit
seiner flachen Seite zur Au&szlig;enseite der Platine (genau in die
Ecke). Die flache Seite von T2 zeigt genau in Richtung auf R26, die
Transistoren T4,T5 und T6 zeigen mit ihrer flachen Seite in Richtung
auf die Widerst&auml;nde R17, R23, R24. Auch die L&ouml;tlage der
Dioden geht nicht aus dem Best&uuml;ckungsplan eindeutig hervor, hier
sollte die Herstellerfirma mal noch Nacharbeiten!! (Einer der
Gr&uuml;nde warum soviele mit dem Nachbau probleme haben!!!) (Man
Erinnert sich ? Es gibt den JuniorPrommer als Fertigger&auml;t, und
f&uuml;r die h&auml;lfte des Preises als Bausatz) Die beiden
Universaldioden 1N4148 werden mit der Ringkennzeichnung in Richtung
der Widerst&auml;nde R17, R18 eingel&ouml;tet. Die Diode D3 (ebenfalls
1N4148) wird mit der Ringmarkierung in Richtung des IC 7 (TL497)
eingel&ouml;tet.
<br>
</p>
<p>Wenn die Platine sp&auml;ter fertig best&uuml;ckt ist, sollte man
seine Arbeit noch einmal sehr genau Kontrollieren. Einiges Augenmerk
sollte auch auf das Verbindungskabel von der Prommer- platine zum
Rechner gerichtet werden, auch hier sind schnell die Stecker
verwechselt bzw. die Nummerierung oder die Aufquetschrichtung. Zur
Verwendung kommt ein Flachbandkabel auf das an der Rechnerseite ein
25poliger Sub-D Stecker in Schneidklemmtechnik aufgepresst wird. Die
Aufpressung auf das Flachbandkabel geht ganz gut in einem
Schraubstock, es wird eine v&ouml;llig gleichm&auml;ssige Pressung
erreicht. Man sollte ein Kabel verwenden das mindestens eine Ader in
einer anderen Farbe mitf&uuml;hrt, wird diese Ader dann als Pin 1
verwendet, ist eine Verwechselung fast schon ausgeschlossen. Die
andere Seite des Kabels wird mit einem sog. 25 poligen
Pfostenverbinder best&uuml;ckt, die Ausf&uuml;hrung sollte ebenfalls
in Schneidklemmtechnik erfolgen. Der Pfostenverbinder hat an einer
Seite eine Markierung oder einen Pfeil der den Pin 1 anzeigt. Wird das
Kabel nun so auf den Pfosteverbinder gequetscht da&szlig;, die
andersfarbige Ader auf der Markierung zu liegen kommt, sind
Automatisch alle Pin's von der Rechnerschnittstelle mit der
Schnittstelle des Prommers 1:1 in der richtigen Reihenfolge verbunden.
<br>
</p>
<p>Auf der Prommerplatine wird an der Stelle ST1 eine 25 polige
Stiftleiste eingel&ouml;tet, die das Gegenst&uuml;ck zum
Pfostenverbinder bildet. Eine Anl&ouml;tung der Einzeladeren direkt an
die Platine ist nicht zu empfehlen, da die Adern bei der geringsten
Belastung des Kabels abbrechen w&uuml;rden.
<br>
</p>
<p>Der Pin 1 der Stiftleiste befindet sich an der Aufschrift A2 bei
den Widerst&auml;nden R2, R3. Wird der Pfostenverbinder mit seiner
Markierung auch auf Pin 1 der Stiftleiste gesteckt, so ist die
Prommer-Platine richtig mit dem Rechner verbunden. Leider l&auml;sst
diese Verbindung eine Verwechlung zu, d.h der Pfostenverbinder passt
leider in zwei Richtungen auf die Stiftleiste, es ist also auch hier
Vorsicht geboten.
<br>
</p>
<p>Interessant ist noch der Anschlu&szlig; f&uuml;r die
Stromversorgung, wenn man nicht die Steckverbindung ST2 benutzen
m&ouml;chte. Die Platine wird so ausgerichtet das man die
Beschriftungen auf den IC's lesen kann. Ganz oben etwas rechts
&uuml;ber IC8 befindet sich ein gr&ouml;sseres L&ouml;tauge, das ist
der Anschluss f&uuml;r +5V. Rechts unten an IC8 befindet sich
ebenfalls ein etwas gr&ouml;&szlig;eres L&ouml;tauge, das ist der
Masse-Anschlu&szlig; der Stromversorgung. Man kann hier auch
Steckstifte oder einfache L&ouml;tstifte einl&ouml;ten, was
sp&auml;ter wenn die Platine in einem Geh&auml;use eingebaut ist,
einen einfacheren Zugriff erlaubt.
<br>
</p>
<p>Die L&ouml;tl&ouml;cher mit der Bezeichnung J1, J2, J3 werden mit
2 bzw.4 poligen Stiftleisten best&uuml;ckt, so das sp&auml;ter mit
kleinen Steckbr&uuml;cken zwischen jeweils 2 Stiften eine Verbindung
hergestellt werden kann. Wird die Platine so hingelegt das man die
Beschriftung von IC7 lesen kann so werden f&uuml;r die Betriebsart
&quot;ST&quot; auf die Stifte mit der Bezeichnung J3 und J1 jeweils
auf die unteren beiden horizontalen Pins die Steckbr&uuml;cken
aufgebracht. Die beiden oberen sind f&uuml;r die Betriebsart
&quot;Amiga&quot;, was uns aber nicht im geringsten kratzt. Der
Prommer kann logischerweise mit der richtigen Software auch am PC
betrieben werden. Hierzu gibt es im PC-Bereich eine relativ einfache,
aber gute, Shareware dazu.
<br>
</p>
<p>Die Verbindung J2 ist f&uuml;r den Fall gedacht das die
Prommerplatine &uuml;ber die Rechnerschnittstelle mit +5 Volt Versorgt
werden soll. (Was aber beim ST nur durch eine kleine interne
Modifikation m&ouml;glich w&auml;hre) Ohne diese Modifikation sollte
diese Steckbr&uuml;cke NICHT gesteckt werden, da ansonsten der Rechner
einen Schaden nehmen k&ouml;nnte.
<br>
</p>
<p>Ansonsten ist noch zu beachten das der Textoolsockel und die LED
(D4) von der !L&ouml;tseite! aus eingel&ouml;tet wird, was ganz zum
Schlu&szlig; gemacht werden sollte. Ausserdem wird er nur genau auf
die vorgesehene Stelle passen, wenn vorher der Widerstand R27 sowie
die Kondensatoren C5, C6 und der Transistor T3 wirklich sauber
eingel&ouml;tet wurden. Ansonsten wird er sehr schief auf der Platine
sitzen, was sp&auml;ter wenn der Sockel aus dem Geh&auml;use
rausschaut recht besch.... aussieht.
<br>
</p>
<p>Will man jetzt die Schaltung einem ersten Test unterziehen, sollte
man die IC's sofern schon eingesteckt, aus den Sockeln entfernen. Die
Versorgungsspannung in der richtigen Polung anlegen und dann an den
Pin's 7+14 sowie den Pin's 8+16 die Sache nachmessen. An den 14er und
den 16er Pin's sollten sich jetzt gegen Masse +5 Volt Messen lassen.
Jede andere Anzeige r&uuml;hrt warscheinlich von einem falschen
Anschlu&szlig; der Versorgungsspannung oder einem
Best&uuml;ckungsfehler her.
<br>
</p>
<p>Wenn dieses in Ordnung sein sollte, Spannung entfernen und die
IC's einsetzen. Man kann jetzt die Software laden und das Teil nach
einer nochmaligen Sichtkontrolle mit dem Rechner verbinden.
(Ger&auml;te vorher Ausschalten)!! Haupts&auml;chlich sollte auf das
richtige einsetzen der IC's geachtet werden.
<br>
</p>
<p>An dieser Stelle ein kleines Lob auf die Test-Software, man kann
es zwar noch besser machen, aber die Sache ist schon gut so !! Die in
der Beschreibung aufgef&uuml;hrten Messungen k&ouml;nnen mit einem
beliebigem Voltmeter ausgef&uuml;hrt werden. Man sollte diese
Messungen aber auf jeden Fall machen, da dann einigermassen
Sichergestellt werden kann das kein Eprom zerst&ouml;rt wird.
<br>
</p>
<p>Keine Kontrolle gibt es &uuml;ber das falsche einsetzen der Eproms
in den Textoolsockel ! Genausowenig sollte man den Sockel &ouml;ffnen,
wenn die LED leuchtet und sich ein Eprom im Sockel befindet. Und vor
dem Ausschalten den Baustein aus dem Sockel nehmen!!!!
<br>
</p>
<p>Ein Nichtbeachten kostet jedesmal ein Eprom, und eventuell Teile
innerhalb des Juniorprommers!!
<br>
</p>
<p>Die Testsoftware gestaltet sich so einfach das z.B bei Fehlen
einer Programmierspannung gleich auf dem Bildschirm angezeigt wird an
welchen Bauteilen es liegen k&ouml;nnte. Mit dem Poti P1 werden
(sollten) die vier verschiedenen Spannungen an Pin 28 des Sockel's auf
-+ 5% genau eingestellt werden. Ich habe nur die 21 Volt einmalig
eingestellt, die drei anderen Spannungen haben sich dann von selbst
ergeben. Man sollte die Sache in etwa bei Zimmertemperatur einstellen,
so da&szlig; man auch bei l&auml;ngerem Betrieb des Epromers mit der
Programmierspannung innerhalb der 5% Toleranzspanne bleibt.
<br>
</p>
<p>Die intern erzeugten Spannungen sind nicht besonders
Belastungsf&auml;hig und reichen genau dazu aus einen Baustein zu
&quot;brennen&quot;, sie werden von dem IC7 (TL497) und dessen
Au&szlig;enbeschaltung erzeugt. Die ganze Schaltung neigt etwas dazu
im h&ouml;rbaren Bereich zu schwingen, je nach erzeugter Spannung
etwas h&ouml;her oder niedriger. Eine Abhilfe schafft ein
tr&ouml;pfchen Klebstoff an den Spulen L1, L2 (100uH) die Spulen
werden daurch etwas &quot;bed&auml;mpft&quot;. Das IC7 wird im Betrieb
etwas w&auml;rmer als die anderen Bausteine, was aber keinen Grund zur
Aufregung ist.
<br>
</p>
<p>Eine kleine Besonderheit ist die im Layout der Platine vergessene
Zenerdiode D5 (27Volt), sie muss UNBEDINGT in die Schaltung und darf
nicht vergessen werden. Das Ding wird an Pin 1+6 des IC's 7
verl&ouml;tet, man kann das auch auf der Unterseite (L&ouml;tseite)
der Platine machen, es sieht dann nicht so SCHLAMPIG aus. Diese
Zenerdiode dient zur Begrenzung der Programmierspannung nach oben hin.
Es ist als Schutz gedacht, falls die Elektronik meint eine etwas
h&ouml;here Programmierspannung erzeugen zu m&uuml;ssen. D.h falls die
Spannung &uuml;ber 27 Volt steigen sollte, wird sie &uuml;ber die
Zenerdiode und R13 nach Masse hin verbraten.
<br>
</p>
<p>Auf die Programmierspannung des Prommer's sollte man gesteigerten
Wert legen, sie entscheidet &uuml;ber das Ja und Amen des
eingesteckten Eproms. Sollte ein 12V Eprom mit 25Volt
&quot;geschossen&quot; werden, kann man es getrost der Ablage 'P'
zuf&uuml;hren.
</p>
<p>Ich konnte zwar w&auml;hrend des Aufbaues keine
gr&ouml;&szlig;eren Schwierigkeiten feststellen, es gibt aber auch
Leute die das Gegenteil behaupten. (Metallschichtwiderst&auml;nde,
Transistoren falsch eingel&ouml;tet) Sind die Tests abgeschlossen
gen&uuml;gt es einmal ein &quot;Testeprom&quot; zu brennen, und durch
anschlie&szlig;endes Auslesen bzw. Vergleichen festzustellen ob der
Prommer einwandfrei arbeitet.
<br>
</p>
<p>Man kann die Platine jetzt in ein Geh&auml;use einbauen, was zwar
nicht zwingend Erforderlich ist, aber der Betriebssicherheit zu gute
kommt. Im Handel gibt es fertige Kunststoffgeh&auml;use in der
richtigen Gr&ouml;&szlig;e, allerdings mu&szlig; das Loch f&uuml;r den
Sockel selber ausgefeilt werden. Bei einem Preis von DM 40 f&uuml;r
das fertige vom Hersteller angebotene Geh&auml;use ist das bestimmt
die billigere Alternative.
<br>
</p>
<p>Im Fall das der Epromer nicht &uuml;ber die Joystickbuchse des
Rechners mit +5 Volt versorgt werden sollte, kann ein jegliches
<a href="0f01.htm" target="UDOcon">Netzteil</a> verwendet werden das Ausgangsseitig 5 Volt sowie einen Strom
von ca.700mA liefern kann. Die L&ouml;sung der Versorgung &uuml;ber
die Joystickbuchse ist nicht besonders Elegant, zumal dann bei vielen
noch ein paar Kabel mehr auf dem Tisch rumliegen. Ein Steckernetzteil
hingegen, verschwindet unter dem Tisch und wirkt dann nicht so
St&ouml;rend. Steckernetzteile k&ouml;nnen von mir auf Wunsch und
gegen einen kleinen Betrag auf +5 Volt Stab. umgebaut werden.
<br>
</p>
<p>Auf dann zum frohen Brennen !
<br>
</p>
<p>&ouml;brigens bietet die Fa. Maxon in Eschborn gerade wieder den
&quot;Teilesatz&quot; des JuniorPrommers f&uuml;r 59.- an.
<br>
</p>
<p>Quelle: <a href="1403.htm" target="UDOcon">ST-Computer</a> 5/95
<br>Originaltext: R.Schaffner 1/90
<br>
</p>
<p>
<br>
<br>
</p>
<p>Hallo Juniorprommer - Besitzer,
<br>
</p>
<p>zu meiner Umbaubeschreibung der Schaltung aus dem Sonderheft der
STC von 1/90 wollte ich noch etwas nachtragen. Anl&auml;&szlig;lich
erneuter Defekte von CMOS-Eproms habe ich nochmals einen ganz kleinen
Umbau gemacht, den ich beschreiben m&ouml;chte.
<br>
</p>
<p>Die Z-Diode 27V zwischen Pin 1 und 6 des TL497 *mu&szlig;* drin
sein, aus folgendem Grund: Die Ausg&auml;nge des 7406 k&ouml;nnen
zuf&auml;llig alle auf Low sein, dann bringt der TL497 54V am Ausgang,
was die Schaltung sch&auml;digen kann.
<br>
</p>
<p>Zus&auml;tzlich habe ich dann eine Z-Diode 2.1V von Pin 1 des
TL497 nach Masse gel&ouml;tet. Die Erkl&auml;rung: Pin 1 des TL497
*mu&szlig;* *immer* auf ca. 1.2V gegen Masse liegen. Fall ZD27 zenert,
rei&szlig;t sie aber manchmal Pin 1 &uuml;ber 5V hoch und bleibt in
diesem Zustand h&auml;ngen, der Ausgang bleibt dann immer auf einer
sehr hohen Spannung h&auml;ngen und der Eingang zieht viel Strom. Das
verhindert die ZD2.1, es kann kein Latch Up im Einschaltmoment mehr
passieren. Falls alle Ausg&auml;nge des 7406 auf Low liegen, wird die
Ausgangsspannung bei mir nun auf ca. 30V begrenzt, ohne da&szlig;
etwas hei&szlig; l&auml;uft, da die Regelung stabil bleibt.
<br>
</p>
<p>Ich hoffe ja, da&szlig; die beiden fehlenden Z-Dioden die Ursache
der Defekte waren, danach konnte ich fehlerfrei mit Pinatubo 1.81
brennen. Es sind nat&uuml;rlich noch andere Fehlerquellen denkbar,
z.B. ist mir aufgefallen, da&szlig; nach dem Start von Pinatubo an Pin
1 des Epromsockels ca 4.5V anliegen. Meiner Meinung nach darf aber
beim Reinstecken eines Eproms *&uuml;berhaupt* keine Spannung am
Sockel anliegen, was eigentlich auch softwarem&auml;&szlig;ig zu
erreichen sein m&uuml;&szlig;te.
<br>
</p>
<p>Nur die Versorgungsspannung wird sich wohl
Softwarem&auml;&szlig;ig nicht ausschalten lassen ohne
Schaltungs&auml;nderung, ein gravierender Mangel des Junior-Prommers.
<br>
</p>
<p>Gru&szlig;, Winfried
<br>
<br>
<br><b> Junior Prommer Mega Adapter </b>
<br>
</p>
<p>F&uuml;r den Juniorprommer gab es den MegaAdapter. Mit dieser
Erweitung ist man in der Lage auch Megabit-Chips zu programmieren.
<br>
</p>
<p>
<br>
</p>
<p align=center><img src="image/megaadap.gif" border=0 width="354" height="409"></p><br>
<div align=center><tt> Abbildung 1 - Megabit Adapter Pinbelegung </tt>
</div>
<p>
<br>
<br>
</p>
<p align=center><img src="image/megaada1.gif" border=0 width="283" height="309"></p><br>
<div align=center><tt> Abbildung 2 - Megabit Adapter Platinenlayout </tt>
</div>
<p>
<br>
<br>Weiterhin gab es von Harum Scheutzow eine aufsteckbare Erweiterung
mit der man in der Lage war PLCC-Chips, z.B das Falcon Rom, zu
brennen. Diese Erweiterungen, also der Megabit-Adapter (Maxon) und der
PLCC-Adapter, sind k&auml;uflich heute nicht mehr zu erwerben.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/prommer.gif" border=0 width="600" height="512"></p><br>
<div align=center><tt> Abbildung 3 - Junior Prommer Schaltung</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Der <a href="030806.htm" target="UDOcon">Schaltplan</a> befindet sich in lesbarer gr&ouml;sse im Ordner
&quot;Programme&quot; innerhalb des DOIT-Ordners.
</p>
<p>
<br>
<br><b> Bauteileliste </b>
<br>
</p>
<pre>
Widerst&auml;nde:                     Kondensatoren:

alle 1/4 Watt Kohleschicht       C1 : 220uF / 16V Elko, stehend
R1,R13 : 1K8                     C3 : 100p keramisch
R2 : 47Ohm                       C4 : 100uF / 35V Elko, stehend
R3,R5,R27 : 1K                   C5,C6 : 100n vielschicht
R4,R6,R19,R20,R25 : 22K
R7 : 910Ohm 1% Metallschicht          Halbleiter:
R8 : 10K  1% Metallschicht
R9 : 390Ohm  1% Metallschicht    D1-D3 : 1N4148
R10 : 16K  1% Metallschicht      T1,T3 : BC547B
R11 : 330Ohm  1% Metallschicht   T2 : BC328-25
R12 : 3K9  1% Metallschicht      T4-T6 : BC557B
R14 : 5K1                        IC1 : 4021
R15,R16 : 1Ohm5                  IC2,IC4,IC5 : 4094
R17,R21,R23 : 10K                IC3 : 28 pol. Nullkraftsockel
R18,R22 : 6K8                    IC6 : 4040
R26 : 180Ohm                     IC7 : TL497
                                 IC8 : 7406
                                 D4 : LED 3mm rot
                                 D5 : Zenerdiode 33V / 400mW

Sonstiges:

ST1 : Doppelpfostenleiste, 26 polig
ST2 : Stromversorgungsbuchse (Printmontage)
TR1 : Trimmer klein, stehend 1K
A1 : Single-Inline-Array 8*22K
A2 : Single-Inline-Array 8*1K8
J1-J3 : je nach Rechnertyp
L1,L2 : Miniaturdrossel 100uH (Conrad) oder Netzentst&ouml;rdrossel mit 50uH
evtl. IC-Fassungen : 4*DIL 14, 5*DIL 16
25 poliger Sub-D Quetschstecker
26 poliger, doppelreihiger Pfostenverbinder, Quetschausf&uuml;hrung
ca. 50cm 26 adriges Flachbandkabel
Geh&auml;use : 123L * 79B * 27T
doppelseitige durchkontaktierte Platine

</pre>
<p>
<br>
<br>
</p>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="1007.htm" target="UDOcon"><img src="udo_lf.gif" alt="Ring On" border=0 width="24" height="24"></a>
<a href="1009.htm" target="UDOcon"><img src="udo_rg.gif" alt="DELA Prommer" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
