<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: F030 ISDN
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="100b.htm" target="UDOcon"><img src="udo_lf.gif" alt="RS232 Wandler" border=0 width="24" height="24"></a>
<a href="100d.htm" target="UDOcon"><img src="udo_rg.gif" alt="Amiga Mouse" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="F030_20ISDN">16.12 F030 ISDN</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Atari <a href="0302.htm" target="UDOcon">Falcon F030</a> und ISDN </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Fragen und Antworten zu ISDN, vorzugsweise mit dem SpeedDragon am
Atari Falcon
<br>
<br>
</p>
<p><b> Hagenuk Speed Dragon FAQ </b>
<br>
<br>
</p>
<p>Frage:
<br>Ist die serielle Schnittstelle des Falcon &uuml;berhaupt schnell
genug, um den ISDN-Adapter mit optimaler Geschwindigkeit zu bedienen?
<br>
</p>
<p>Antwort:
<br>Ja.
<br>
<br>
</p>
<p>Frage:
<br>Ist es m&ouml;glich das Speed Dragon der Firma Hagenuk
gleichzeitig als externen ISDN Adapter f&uuml;r den Atari und f&uuml;r
die 3 analogen Telefonger&auml;te zu benutzen oder ist dann die
analoge Benutzung ausgeschlossen, zumindest zur selben Zeit?
<br>
</p>
<p>Antwort:
<br>Ich habe dieselbe Kombination und es klappt hier ausgezeichnet. Du
kannst ohne weiteres auf dem einen Kanal telefonieren und
w&auml;hrenddessen mit dem Rechner im Netz sein.
<br>
<br>
</p>
<p><b> Speed Dragon allgemein </b>
<br>
</p>
<p>Habe hier die Speed Dragon auch an einem Falcon am Laufen. Bisher
(fast) keine Probleme damit gehabt; es gibt wohl einen kleinen Fehler
in der Firmware oder in der <a href="0305.htm" target="UDOcon">Hardware</a>, der dazu f&uuml;hrt - wie es ein
Telekommunikationselektroniker (puh!) mir erkl&auml;rte -, da&szlig;
bei Spannungsspitzen sich manchmal der Port zur integrierten aktiven
ISDN-Karte (Du brauchst also kein ISDN-&quot;Modem&quot; mehr)
aufh&auml;ngt. Hat sich bei mir dahingehend ge&auml;u&szlig;ert,
da&szlig; mir bspw. in CoNnect gesagt wurde, &quot;Es besteht bereits
eine Verbindung&quot;. Nach einmaligem Rausziehen des Steckers aus der
Steckdose und wieder reinstecken war die Sache dann aber erledigt. Das
Problem ist bisher aber auch nicht wieder aufgetaucht. Das gute an der
SpeedDragon ist nat&uuml;rlich auch, da&szlig; es da f&uuml;r den
ATARI eine sehr komfortable Konfig-Software gibt (von Manfred Ssykor @
AC3).
<br>
<br>
</p>
<p>Wenn Du die Anmeldung des Anschlusses von TKR machen
l&auml;&szlig;t (solltest Du die SpeedDragon nehmen), kriegst Du den
Drachen billiger. War jedenfalls mal so.
<br>
<br>Von Finn Bastiansen@F
<br>
<br>
<br>
</p>
<p>L&auml;uft hier am Falcon einwandfrei. Aber f&uuml;r Fax-Versenden
brauchst Du doch noch ein Analog-Modem, da der Speed Dragon nur durch
die spezielle Windows-Software als Faxger&auml;t zu benutzen ist!
<br>
</p>
<p><b> Speed Dragon Konfigurationssoftware f&uuml;r TOS/MagiC </b>
<br>
</p>
<p>Mit den HS-Modem-Treibern gehen bis zu 230.000 Bd. Du darfst
allerdings das Falcon-Video-System nicht noch gleichzeitig mit 256
Farben-Aufl&ouml;sungen belasten, dann wird der Datenempfang instabil!
<br>
</p>
<p>Die Konfigurationssoftware gibt es in der Maus AC3. Ob sie
irgendwo im <a href="15.htm" target="UDOcon">Internet</a> verf&uuml;gbar ist, wei&szlig; ich nicht. Der
<a href="0201.htm" target="UDOcon">Autor</a> hat auch eine Homepage:
<br>
</p>
<ul>
<li> <a href="http://www.ssycor.com" target="_top">Manfred Ssycor Homepage</a>
<br>&nbsp;
</li>
</ul>
<p>
<br>Man kann aber alles wichtige wie MSNs (also die verschiedenen
Telefonnummern) und auch noch jede Menge mehr einstellen. Treiber
f&uuml;r Ataris sind da nirgends bei, es geht deshalb nur der Betrieb
im AT-Modus (also wie ein Modem), und den mu&szlig; ein ISDN-Adapter
halt anbieten, damit er am Atari nutzbar ist. Eben so wie der Speed
Dragon!
<br>
</p>
<p><b> Speed Dragon und Mausnetz </b>
<br>
</p>
<p>Im Maus-Tausch klappt es bei mir auch bis 115200 auf dem Falcon.
Teiweilse mu&szlig; ich aber auf 57600 runterschalten, ansonsten gibt
es anscheinend so viele Fehler, da&szlig; nichts mehr funktioniert.
Ansonsten ist ja HSModem immer zu empfehlen.
<br>
<br>
<br>
</p>
<p><b> AcerISDN T30 </b>
<br>
<br>
</p>
<p>Wei&szlig; ich nicht, ob das Teil am Atari anzusprechen ist.
</p>
<p><b> <a href="1504.htm" target="UDOcon">Telefonprovider</a> </b>
<br>
<br>Es gibt inzwischen 5 Anbieter, bei denen man sich nicht anmelden
mu&szlig;.
<br>TelDaFax (01030)
<br>MobilCom (01019)
<br>Arcor (01070)
<br>o-tel-o (01011)
<br>Viatel (01079)
<br>
</p>
<p>
<br>
<br>Beitr&auml;ge zum SpeedDragon von Thomas Steuer@OF2
<br>
<br>Weitere Informationen zum Thema Atari, Mac und Speed Dragon ISDN
finden Sie in dem Archiv
</p>
<ul>
<li> <a href="http://www.rhein-main.de/people/robert/down1.htm" target="_top">DOITSPEED</a>
<br>&nbsp;
</li>
</ul>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="100b.htm" target="UDOcon"><img src="udo_lf.gif" alt="RS232 Wandler" border=0 width="24" height="24"></a>
<a href="100d.htm" target="UDOcon"><img src="udo_rg.gif" alt="Amiga Mouse" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
