<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Druckerbuffer
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="100e.htm" target="UDOcon"><img src="udo_lf.gif" alt="SCSI-Anschlu&szlig; beim DDD-TOWER" border=0 width="24" height="24"></a>
<a href="11.htm" target="UDOcon"><img src="udo_rg.gif" alt="Network" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Druckerbuffer">16.15 Druckerbuffer</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Ein Druckerbuffer </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Mit einem einfachen Druckerbuffer, um die Steuerleitungen
erweitert, erh&auml;lt man einen einfachen und sicheren
Hardwarezusatz. Zum einen k&ouml;nnen die verwendeten Drucker, die
sonst in unmittelbarer N&auml;he des Computers stehen dann auch etwas
weiter entfernt aufgestellt werden und die so empfindliche
<a href="0c05.htm" target="UDOcon">Druckerschnittstelle</a> (PSG) des Falcon wird gegen &Uuml;berlastung und
Zerst&ouml;rung durch &auml;ltere Drucker -Drucker mit zu kleinen
Pullup-Widerst&auml;nden- gesch&uuml;tzt.
<br>
</p>
<p>Bei &auml;lteren Druckermodellen sind manchmal leider zu kleine
Abschlu&szlig;widerst&auml;nde eingebaut (Pullup). Nach einiger Zeit
kann dabei der Schnittstellenbaustein im Falcon &uuml;berlastet
werden. Ein korrektes Ausdrucken ist dann nicht mehr m&ouml;glich.
<br>
</p>
<p>Abhilfe bietet hier eine Schaltung, die aus zwei einfachen
Open-Collector-Treibern besteht, die zusammen ca. 2 und 4 DM kosten
d&uuml;rften. Leider funktioniert diese Schaltung nur in eine
Richtung, d.h. es k&ouml;nnen &uuml;ber den Centronics Port bei
angesteckter Schaltung keine Daten mehr eingelesen werden.
<br>
</p>
<p>Der Vorteil dieser Schaltung liegt klar auf der Hand: sollte
tats&auml;chlich am Drucker oder an der Verbindungsleitung zwischen
Computer und Drucker irgend ein Defekt auftreten, so ist der Computer
durch diese Schaltung ausreichend gesch&uuml;tzt. Zuerst werden diese
Treiber zerst&ouml;rt.
<br>
</p>
<p>Auch ist es nun m&ouml;glich den Drucker etwas 'weiter' d.h. bis
zu 5-10 Meter vom Computer entfernt aufzustellen.
<br>
</p>
<p>Der Einfachheit halber habe ich meinen damaligen Nachbau in
F&auml;deltechnik auf einer kleinen Lochrasterplatte aufgebaut und
diese in ein altes Portgeh&auml;use (Modulgeh&auml;use) vom C64
verfrachtet; das Geh&auml;use besitzt beiderseitig einen DB25 Stecker
und steckt so einfach als Adapter zwischen Rechner und Drucker.
Einfacher geht es kaum noch. Die Versorgungsspannung liefert ja der
Drucker.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/pdriver.gif" border=0 width="439" height="352"></p><br>
<div align=center><tt> Abbildung 1 - Einfacher Buffer f&uuml;r Centronics
(ST-Magazin) </tt>
</div>
<p>
<br>
<br>
</p>
<p>Wer denn nun lustig ist -beachten Sie bitte, da&szlig; bei der
gezeigten Schaltung in Abbildung 1 bisher NUR die Datenleitungen
gebuffert werden- erweitert diese Schaltung nach Abbildung 2 auch noch
auf die BUSY-, SELECT- und die ACKNOWLEDGE-Leitung; dazu gen&uuml;gt
noch ein dritter Chip. Das ist eigentlich ganz einfach.
<br>
</p>
<p>Achten Sie aber bitte zwingend auf die Laufrichtung der Signale!
<br>
</p>
<p>Spinnt man den Gedanken weiter -mit einem anderen Baustein
-anstelle von IC1 und IC2, erh&auml;lt man die ganze Schaltung in der
Tat auch noch Bi-direktional, obwohl mir momentan dazu keine Anwendung
einfallen w&uuml;rde. Beachten Sie bitte, da&szlig; z.B. der
JuniorPrommer nach den Schaltungen aus <b> Abbilung 1 und 2 </b>
nicht arbeitet!
<br>
</p>
<p>Diverse Drucker haben eine +5V Leitung aus dem Drucker heraus. Sie
k&ouml;nnen diese Spannung als Versorungsspannung f&uuml;r den Buffer
verwenden, ansonsten m&uuml;ssen Sie die +5V einem Joystickport oder
einem <a href="0c0c.htm" target="UDOcon">Paddleport</a> entnehmen oder aber auch den
Schnittstellenanschlu&szlig; am Falcon umbauen, so da&szlig; man hier
an einem nicht benutzten Pin +5V entnehmen kann. Die Schaltung ansich
ben&ouml;tigt nur wenige mA, um korrekt arbeiten zu k&ouml;nnen.
<br>
</p>
<p>Veranstalten Sie keinen Kurzschlu&szlig;, insbesondere, wenn Sie
die L&ouml;sung mit den +5V aus dem Drucker oder dem Falcon
w&auml;hlen. Benutzen Sie ein extra +5V Steckernetzteil, wenn Sie der
Sache nicht trauen oder nicht genau wissen, was sie da gerade machen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/pdriver1.gif" border=0 width="439" height="500"></p><br>
<div align=center><tt> Abbildung 2 - Einfacher Buffer f&uuml;r Centronics, alle
Leitungen </tt>
</div>
<p>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="10.htm" target="UDOcon"><img src="udo_up.gif" alt="Diverses rund um den Falcon" border=0 width="24" height="24"></a>
<a href="100e.htm" target="UDOcon"><img src="udo_lf.gif" alt="SCSI-Anschlu&szlig; beim DDD-TOWER" border=0 width="24" height="24"></a>
<a href="11.htm" target="UDOcon"><img src="udo_rg.gif" alt="Network" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
