<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: MidiCom - Romportl&ouml;sung
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="11.htm" target="UDOcon"><img src="udo_up.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="1101.htm" target="UDOcon"><img src="udo_lf.gif" alt="Atari NetWork" border=0 width="24" height="24"></a>
<a href="1103.htm" target="UDOcon"><img src="udo_rg.gif" alt="STinG to LAN" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="MidiCom_20-_20Romportl_26ouml_3Bsung">17.2 MidiCom - Romportl&ouml;sung</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Die MidiCom-Romportl&ouml;sung auch am Falcon</tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Seit einigen Tagen, genauer seit der ProTos '95, gibt es im
Atari-Sektor eine neue <a href="0305.htm" target="UDOcon">Hardware</a>. Diese <a href="0305.htm" target="UDOcon">Hardware</a> l&ouml;st die beiden
Stereokabel ab mit denen man bisher zwei Atari-Computer auf einem sehr
billigen und relativ langsamen Weg verbinden konnte. Die
<a href="0c09.htm" target="UDOcon">Romport</a>-L&ouml;sung schafft i.d.R bei mir 160 Kb/Sec. was hier einen
gewaltigen Zuwachs gegen&uuml;ber den &uuml;blichen MidiKabeln mit
sich bringt. Einem Datenbackup auf dem zweiten Rechner steht somit
kaum noch etwas im Wege.
<br>
</p>
<p>Dieter Cotta @ KR verhalf mir hier zu dieser netten Erweiterung.
Die n&ouml;tige Software, MidiCom ab Version 3.94 von Harald Blees,
wurde hier durch spezielle Treiber f&uuml;r genau diese <a href="0c09.htm" target="UDOcon">Romport</a>-Module
erweitert. Die <a href="0204.htm" target="UDOcon">Installation</a> besteht lediglich darin eben die Module
bei abgeschaltetem Computer in den <a href="0c09.htm" target="UDOcon">Romport</a> zu stecken, die Deckel der
Module dabei jeweils nach oben, (Hallo Dieter :-) und die alten
MidiCom-Treiber im Autoordner gegen die neuen Fast-Treiber f&uuml;r
die <a href="0c09.htm" target="UDOcon">Romport</a>-Module zu ersetzen. Hierzu sollte man sich ein
MidiCom-Update auf die Version 3.94 besorgen. Momentan ist das zwar
eine &szlig;-Version Funktioniert aber ohne Probleme. Die Version 3.94
erh&auml;lt man bei Harald Blees.
<br>
</p>
<p align=center><img src="image/Midirom.gif" border=0 width="153" height="128"></p><br>
<div align=center><tt>Abbildung 1 - Das MidiCom Romportmodul</tt>
<br>
</div>
<p>Die alten Laufwerksnamen u. Icons auf dem <a href="030505.htm" target="UDOcon">Desktop</a> werden auch nach
der <a href="0204.htm" target="UDOcon">Installation</a> beibehalten. Diese <a href="0c09.htm" target="UDOcon">Romport</a>-L&ouml;sung arbeitet
bisher nur mit zwei Atari-Computern zusammen. Bisher fehlt auch noch
die <a href="0c09.htm" target="UDOcon">Romport</a>-Version mit dem durchgef&uuml;hrten Anschlu&szlig; so
da&szlig; man in der Lage w&auml;re auch noch eine weitere Erweiterung
an den <a href="0c09.htm" target="UDOcon">Romport</a> zu stecken.
<br>
</p>
<p>Nach den booten beider Rechner kann man auf die Laufwerke des
jeweils anderen Rechner in gewohnter weise Zugreifen, einzig die
Geschwindigkeit liegt um ein vielfaches h&ouml;her. Typisch liegt hier
die Geschwindigkeit bei 70Kb/Sec. Zwischen meinen beiden Falcon
erreiche ich jedoch nach HowFastII eine Geschwindigkeit von 160Kb/Sec.
Beide Falcons sind im CPU/Systemtakt beschleunigt.
<br>
</p>
<p>Mit den Stereokabeln war es hier m&ouml;glich bis zu 7 Atari-
Rechner miteinander zu Verbinden. In der n&auml;chsten Zeit sollte es
noch Module geben die einen durchgef&uuml;hrten <a href="0c09.htm" target="UDOcon">Romport</a> besitzen. Die
<a href="0c09.htm" target="UDOcon">Romport</a>-Module f&uuml;r MidiCom bestehen aus einer sehr kleinen
Platine die mit drei Chips best&uuml;ckt ist und in einem sehr kleinen
Kunststoffgeh&auml;use in den <a href="0c09.htm" target="UDOcon">Romport</a> eines Ataris gesteckt wird. Die
Platine und das Geh&auml;use sind sehr sauber und passend Verarbeitet,
beide Module werden &uuml;ber ein 14poliges Flachbandkabel verbunden
welches mittels Sockelstecker in Schneidklemmtechnik direkt in einen
freien IC-Sockel im inneren eines jeden Moduls gesteckt wird. Hierzu
ist an beiden Modulen einmalig der Deckel zu &ouml;ffnen um eben das
Kabel einzustecken.
<br>
</p>
<p>Die Kabel sind in der L&auml;nge bis 10m relativ frei
Konfigurierbar und k&ouml;nnen bei der Bestellung in verschiedenen
l&auml;ngen gleich mit geordert werden. Eine l&auml;nge von drei
Metern ist Standard. Laut Aussagen des Entwicklers sind jedoch
Kabell&auml;ngen bis 30-35 Meter m&ouml;glich, sollten hierbei jedoch
nicht zusammen mit Netzleitungen auf l&auml;ngeren Strecken zusammen
verlegt werden.
<br>
</p>
<p>Ich selber benutze ein 3 Meter-Kabel welches neben allen anderen
Kabeln also auch den Netzleitungen der Computer in einem
Tischkabelkanal verlegt ist, es treten hierbei keinerlei
Verbindungsst&ouml;rungen auf.
<br>
</p>
<p>Wenn man mit der Romportl&ouml;sung arbeitet kann man sich sehr
schnell an die neue Geschwindigkeit gew&ouml;hnen. Man erreicht locker
den Datendurchsatz einer &auml;lteren Festplatte womit das kopieren
auch von l&auml;ngeren Dateien zwischen zwei Rechner schneller geht
als das kopieren &uuml;ber Disketten ect.pp.
<br>
</p>
<p>Bei der Treiberinstallation braucht man nur darauf zu achten das
nicht Zuf&auml;llig auf beiden Computern die Treiber mit dem gleichen
Namen installiert werden. Die Treibernamen unterscheiden sich durch
die Nummer 0 bzw.1, auch durch die Zahl 16 und 30. Letztere geben
lediglich an wieviel Kb ein zu &uuml;bertragender Block beinhaltet.
Auch hier sollen nur Treiber mit der gleichen Blockl&auml;nge benutzt
werden.
<br>
</p>
<p>Beachtet man die wenigen kleinen Bedingungen wird man mit dieser
neuen Hardwarel&ouml;sung sehr viel Freude haben. Wirklich wichtig ist
die Sache mit dem An- bzw. Abstecken der Module vom Rechner.
Normalerweise sollte das nur passieren wenn die Computer ausgeschaltet
sind da hier sonst die Gefahr der Zerst&ouml;rung von Modul und/oder
Computer besteht. MidiCom-RomPort kostet mit drei Meter-Kabel 189,-
und kann z.B von Dieter Cotta@KR bezogen werden. Ob das noch so ist
sollten Sie selbst erfragen. Alles in allem macht diese
Hardwarel&ouml;sung einen sehr vern&uuml;nftigen und durchdachten
Eindruck. Die Erweiterung kann auch mit nur wenigen Handgriffen von
jedem installiert werden.
<br>
</p>
<p>Bisher l&auml;uft diese Erweiterung bei mir sehr Stabil und ist
auch f&uuml;r den Einsatz unter MagiC 5.2 gerade zu geeignet.
Jedenfalls ein brauchbares 'Lowcost' Netzwerk das seinem Preis mehr
als gerecht ist.
<br>
</p>
<p>Es sind hierbei keinerlei Bastelarbeiten n&ouml;tig!
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="11.htm" target="UDOcon"><img src="udo_up.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="1101.htm" target="UDOcon"><img src="udo_lf.gif" alt="Atari NetWork" border=0 width="24" height="24"></a>
<a href="1103.htm" target="UDOcon"><img src="udo_rg.gif" alt="STinG to LAN" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
