<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Whiteline Transmission
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="12.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari Software CD-ROM" border=0 width="24" height="24"></a>
<a href="1207.htm" target="UDOcon"><img src="udo_lf.gif" alt="Gemini" border=0 width="24" height="24"></a>
<a href="1209.htm" target="UDOcon"><img src="udo_rg.gif" alt="Whiteline Alpha" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Whiteline_20Transmission">18.8 Whiteline Transmission</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Whiteline Transmission</tt>
<br>
<br>
</p>
<p align=center><img src="images/transmis.gif" border=0 width="102" height="102"></p><br>
<p>Informationen zu dieser <a href="0701.htm" target="UDOcon">CD-ROM</a>
<br>
</p>
<p>Sehr geehrter TRANSMISSION-K&auml;ufer,
<br>
</p>
<p>sie halten das sicherlich vollst&auml;ndigste Daten- und
Programmarchiv f&uuml;r den ATARI FALCON 030 in H&auml;nden, das auf
dem Markt erh&auml;ltlich ist. Folgende Ordner finden Sie im
Hauptverzeichnis: ANIMATIO, DEMOS, DISKMAGS, FR_BITS2, FR_BITS3,
GAMES, GRAFIX, MUSIX, PACKED, PICTURES, UTILITY, VOLLVERS. Besonders
hinweisen m&ouml;chten wir auf die Verzeichnisse FR_BITS 2 und
FR_BITS3: Hier sind die Demos, 96K Demos, Grafiken und Sounds der
Coder-Wettbewerbe der beiden Coder-Parties &quot;FRIED BITS&quot;
enthalten. Diese sind in den jeweiligen Unterverzeichnissen nach den
entsprechenden Coder-Gruppen sortiert. Weitere Hinweise finden Sie
partiell in den jeweiligen Archiven. Sollte das eine oder andere DEMO
dieser Veranstaltungen nicht vorhanden sein, bedauern wir es, die
Genehmigung der jeweiligen Autoren zur Hinzunahme auf diese CD nicht
erhalten zu haben. Wir haben uns bem&uuml;ht die FALCON-Szene so
authentisch und vollst&auml;ndig wie irgend m&ouml;glich zu
dokumentieren. Durch die &uuml;berragende Zahl sonstiger Demos sahen
wir uns veranla&szlig;t, die Programme des Ordners DEMOS in
alphabetischer Folge zu sortieren. Die entsprechenden
Unterverzeichnisse tragen deshalb die dazugeh&ouml;rigen
Buchstabenbereiche (z.B. A-D). Dies erleichtert Ihnen das Suchen und
Finden ganz bestimmter Demo-Titel. Ansonsten sei der Hinweis
gestattet, das eine Verteilung auf VGA- und RGB-Titel nicht sinnvoll
gewesen w&auml;re, da 90% und mehr der Demo-Programme nur auf einem
RGB-Monitor oder TV-Ger&auml;t lauff&auml;hig sind. Die Autoren
verweisen darauf, da&szlig; auf diesen Monitortyp kreativer und
vielseitiger programmiert werden kann, als auf VGA-Ger&auml;ten. Bei
einigen Demo-Programmen finden sich explizite Hinweise auf eine
VGA-Lauff&auml;higkeit in den jeweiligen Readme/Liesmich-Texten.
Ansonsten verweisen wir auf die beiden Listen-Files (F030DEMO.FAQ und
F_DEM_R2-TXT), die wir Ihnen im Hauptverzeichnis DEMOS anbieten und
die f&uuml;r eine Vielzahl der vorhandenen Demos Angabe zur
n&ouml;tigen Konfiguration machen. Soweit m&ouml;glich enth&auml;lt
diese CD direkt ablauff&auml;hige Programme und Demos. Zus&auml;tzlich
sind gepackte Dateien im Verzeichnis PACKED vorhanden, die Sie ggf.
auf Festplatte kopieren k&ouml;nnen, diese sind auch f&uuml;r den
Mailboxeinsatz tauglich. Mit dem Erwerb dieser <a href="0701.htm" target="UDOcon">CD-ROM</a> erhalten Sie
u.a. auch Programme, an denen Sie keine fortw&auml;hrenden
Nutzungsrechte haben, da es sich um Shareware-Programme handelt, bei
denen mit dauerhafter Nutzung eine Registrierungsgeb&uuml;hr beim
<a href="0201.htm" target="UDOcon">Autor</a> f&auml;llig wird. Davon ausdr&uuml;cklich ausgenommen sind die
registrierten Vollversionen der Programme TURBOBLANKER und GOLDEN
ISLAND. Bei diesen Programmen handelt es sich um lizensierte
Vollversionen, bei denen keine zus&auml;tzliche Geb&uuml;hr
f&auml;llig wird. Das dauerhafte Nutzungsrecht dieser aktuellen
Programmversionen wurde von Ihnen durch den Kauf dieser CD erworben.
Dieses Recht ist allerdings auf den jeweiligen einzelnen K&auml;ufer
beschr&auml;nkt. Eine Weitergabe ist untersagt und wird als Raubkopie
betrachtet, sprich straf- und zivilrechtlich verfolgt. Die
Lauff&auml;higkeit einzelner Programme auf anderen ATARI-Systemen als
dem FALCON ist ein gelungener Zufall und keineswegs geplant. Insoweit
handelt es sich bei dieser CD explizit um ein Produkt f&uuml;r ATARI
FALCON 030-Rechner. F&uuml;r einwandfreies Funktionieren und f&uuml;r
jedwede Sch&auml;den Ihres Systems wird keine Haftung &uuml;bernommen,
so da&szlig; die Benutzung auch hier auf eigene Gefahr erfolgt. Die
CD-Zusammenstellung in der hier vorliegenden Form unterliegt dem
copyright der Firma delta labs media. Die Weiterverwendung in den hier
vorliegenden Archiven und Verzeichnissen in der jeweiligen
Zusammenstellung auf anderen CD-Datentr&auml;gern ist
ausdr&uuml;cklich untersagt, insoweit hat diese FALCON-Dokumentation
exclusiven Charakter. delta labs media beh&auml;lt sich f&uuml;r den
Fall der Zuwiderhandlung weitergehende Schadenersatzanspr&uuml;che
vor.
</p>
<p>
<br>
<br>- TRANSMISSION-CD by delta labs media
<br>
</p>
<p>- Whiteline-CD und Soft Series by delta labs media
<br>
</p>
<p>- DL-Serie by delta labs media
<br>
</p>
<p>CD-Compilation by Tom Kohl, Bernhard Artz und Frank Kurpiela
<br>
</p>
<p>Alle eingetragenen Warenzeichen sind als solche zu betrachten.
<br>All rights reserved.
<br>
</p>
<p>Contact:
<br>
</p>
<p>whiteline conception: delta labs media
<br>Breite Str. 2, D-42781 Haan, Germany
<br>Tel: +49 (0)2104-806607
<br>Fax: +49 (0)2104-806608 Email: deltalabs@usa.net
<br>Web: www.deltalabs.com
<br>
</p>
<p>
<br>
</p>
<div align=center><tt>Aus dem Inhalt der Whiteline Transmission </tt>
</div>
<pre>
        - die Vollversion von dem Spiel Golden Island
        - die Vollversion des Bildschirmschoners TurboBlanker
        - die Demos der FriedBits 3 Coder-Party Wettbewerbe
        - Demos der FriedBits 1 und 2
        - spezielle Falcon-Games
        - nahezu s&auml;mtliche sonst erschienenen Falcon-Demos
        - Musik und Grafikprogramme
        - Tools, Documents, Sounds, Bilder
        - Animationen u.v.m

</pre>
<p><tt>Systemvoraussetzung</tt>
</p>
<p>Atari Computer: ST, TT, Falcon mit <a href="0701.htm" target="UDOcon">CD-ROM</a> Drive, 1Mb Ram
<br>Treiber : nach ISO 9660 erforderlich
<br>CD-Tools, Egon, ExtenDos
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="images/img.gif" border=0 width="77" height="25"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="12.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari Software CD-ROM" border=0 width="24" height="24"></a>
<a href="1207.htm" target="UDOcon"><img src="udo_lf.gif" alt="Gemini" border=0 width="24" height="24"></a>
<a href="1209.htm" target="UDOcon"><img src="udo_rg.gif" alt="Whiteline Alpha" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
