<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Whiteline delta
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="12.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari Software CD-ROM" border=0 width="24" height="24"></a>
<a href="120a.htm" target="UDOcon"><img src="udo_lf.gif" alt="Whiteline Gamma" border=0 width="24" height="24"></a>
<a href="120c.htm" target="UDOcon"><img src="udo_rg.gif" alt="Whiteline PSI" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Whiteline_20delta">18.11 Whiteline delta</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Whiteline delta <a href="0701.htm" target="UDOcon">CD-ROM</a> </tt>
<br>
<br>
</p>
<p align=center><img src="images/delta.gif" border=0 width="196" height="185"></p><br>
<p>Informationen zu dieser <a href="0701.htm" target="UDOcon">CD-ROM</a>
<br>
</p>
<p>Soweit m&ouml;glich befinden sich auf der <a href="0701.htm" target="UDOcon">CD-ROM</a> direkt
ablauff&auml;hige Programme, die durch das Men&uuml;system CD-Menu
direkt gestartet werden k&ouml;nnen. Zus&auml;tzlich sind gepackte
Dateien in verschiedenen Unterverzeichnissen vorhanden, die ebenso
&uuml;ber CD-Menu entpackt oder auf Festplatte kopiert werden
k&ouml;nnen. Die entsprechenden Entpacker sind im Subdirectory PACKER
im Verzeichnis CD MENU vorhanden.
<br>
</p>
<p><b> Folgende Verzeichnisse befinden sich im Wurzelverzeichnis der
<a href="0701.htm" target="UDOcon">CD-ROM</a>: </b>
<br>
</p>
<p>DL_SERIE * VISION * FONTS * SOUNDS * DOCUMENTS * SYSTEMS * DTP *
ENGLISH * TEX * VOLLVERS * GAMES * TOOLS * CLASSICS * PROGTOOL *
WHITELIN * CDMENU
<br>
</p>
<p>Im Wurzelverzeichnis finden Sie zus&auml;tzlich die Datei
LIESMICH.TXT die evtl. Neuerungen enth&auml;lt, die bei Drucklegung
dieses Heftes noch nicht verf&uuml;gbar waren. Mit dem Erwerb dieser
<a href="0701.htm" target="UDOcon">CD-ROM</a> erhalten Sie u.a. auch Programme, an denen Sie keine
fortw&auml;hrenden Nutzungsrechte haben, da es sich um
Shareware-Programme handelt, bei denen mit dauerhafter Nutzung eine
Registrierungsgeb&uuml;hr beim <a href="0201.htm" target="UDOcon">Autor</a> f&auml;llig wird. Dies betrifft
eine Reihe von Shareware-Programmen in den jeweiligen Archiven der
diversen Verzeichnisse. Die registrierten Vollversionen aus der
Whiteline Soft Series, die nicht als lizensierte Vollversionen auf
dieser <a href="0701.htm" target="UDOcon">CD-ROM</a> vorhanden sind, k&ouml;nnen Sie via Freischaltung aus
den codierten Archiven nutzbar machen.
<br>
</p>
<p>Wir verweisen auf den entsprechenden Text (FREISCHA.TXT) im
Verzeichnis WHITELIN. Davon ausgenommen sind die lizensierten
Vollversionen der Programme CYPRESS, KANDINSKY, BELLINI, PROCURATOR 2,
MUSIC CHANNEL, PRINTING PRESS GOLD EDITION, MADRESS, CHAOS UNLIMITED
GEM, C.A.G. und GRAPHBASE. Bei diesen Programmen handelt es sich um
lizensierte Vollversionen, bei denen keine zus&auml;tzliche
Geb&uuml;hr f&auml;llig wird. Das Nutzungsrecht an diesen Programmen
wurde von Ihnen durch den Kauf dieser <a href="0701.htm" target="UDOcon">CD-ROM</a> erworben. Dieses Recht
ist allerdings auf den jeweiligen einzelnen K&auml;ufer
beschr&auml;nkt. Eine Weitergabe als einzelnes Archiv ist untersagt
und gilt als Raubkopie! Sollten Sie an zuk&uuml;nftigen Updates von
einem dieser Programme interessiert sein, bitten wir Sie den
Registrierungscoupon dieser CD an uns einzusenden. Sie erhalten dann
regelm&auml;&szlig;ige Informationen zu Updates oder Upgrades aller
Programme der Whiteline Soft Series.
<br>
</p>
<p>Bei CYPRESS erhalten Sie eine Upgrade-M&ouml;glichkeit auf die
Version mit Rechtschreibkorrektur und nicht limitierte
Grafikeinbindung. Beachten Sie das entsprechende Textfile im
gleichnamigen Programm-Archiv. Bei Procurator 2 haben Sie die
M&ouml;glichkeit weitere Datenbankmodule anzufordern. Wenden Sie sich
dazu bitte ausschlie&szlig;lich an uns.
<br>
</p>
<p>F&uuml;r die Lauff&auml;higkeit der Software dieser <a href="0701.htm" target="UDOcon">CD-ROM</a> auf
Ihrem individuellen Atari-System kann keine Gew&auml;hr gegeben
werden! Bitte beachten Sie bei allen Programmen, Daten, Sounds und
Bildern und sonstigen Dateien Hinweise und eventuelle
Nutzungseinschr&auml;nkungen. Respektieren Sie bitte das jeweilige
<a href="0206.htm" target="UDOcon">Copyright</a>. Die Verwendung der Software und Daten dieser <a href="0701.htm" target="UDOcon">CD-ROM</a> erfolgt
auf eigene Gefahr. Es wird keine Haftung f&uuml;r jedwede Sch&auml;den
&uuml;bernommen, die aus der Benutzung dieser <a href="0701.htm" target="UDOcon">CD-ROM</a> entstehen
k&ouml;nnten. Alle Programme und Daten dieser <a href="0701.htm" target="UDOcon">CD-ROM</a> wurden mittels
eines aktuellen Virenscanners gepr&uuml;ft. Trotzdem l&auml;&szlig;t
sich ein Virenbefall niemals v&ouml;llig ausschlie&szlig;en, so
da&szlig; die Benutzung auch hier auf eigene Gefahr erfolgt.
<br>
</p>
<p>Das <a href="0206.htm" target="UDOcon">Copyright</a> der PD- und Sharewareserie DL liegt
ausschlie&szlig;lich bei delta labs media.
<br>
</p>
<p>Die exclusive Zusammenstellung der Font-, Bilder-, Sound- und
Visionarchive, wie auch aller &uuml;brigen ausdr&uuml;cklich als DL
deklarierten Verzeichnisse, liegt ebenso ausschlie&szlig;lich bei
delta labs media. Die Weiterverwendung in der hier vorliegenden
Zusammenstellung und Bezeichnung in anderen PD und Sharewarereihen ist
ausdr&uuml;cklich untersagt und wird ggf. straf- und zivilrechtlich
verfolgt. Weiterhin ist es ausdr&uuml;cklich untersagt, diese Archive
und Verzeichnisse in der jeweiligen Zusammenstellung f&uuml;r andere
CDROM Ver&ouml;ffentlichungen zu verwenden. delta labs media
beh&auml;lt sich f&uuml;r den Fall der Zuwiderhandlung weitergehende
Schadenersatzanspr&uuml;che vor.
</p>
<p>copyright der delta CD by delta labs media
<br>
</p>
<p>copyright der Whiteline CD und Soft Series by delta labs media
<br>
</p>
<p>copyright der DL-Serie by delta labs media
<br>
</p>
<p>Alle eingetragenen Warenzeichen sind als solche zu betrachten. All
rights reserved.
<br>
</p>
<p>Contact:
<br>
</p>
<p>whiteline conception: delta labs media
<br>Breite Str. 2, D-42781 Haan, Germany
<br>Tel: +49 (0)2104-806607
<br>Fax: +49 (0)2104-806608 Email: deltalabs@usa.net
<br>Web: www.deltalabs.com
<br>
</p>
<p>
<br>
</p>
<div align=center><tt>Aus dem Inhalt der Whiteline delta </tt>
</div>
<pre>
          10 lizenzierte Vollversion:

        - CyPress, neue Version
        - Kandinsky, ein Vektorzeichenprogramm
        - Bellini, das Pixelmalprogramm f&uuml;r gro&szlig;e Bilder
        - Procurator 2, moderne Dateanbank
        - Music Channel, Musik CD-Player inkl. Datenbank
        - Printing Press Gold Edition, Die Hausdruckerei
        - MAdress, eine schnelle Adressenverwaltung
        - C.A.G, ein multifunktionales Zeichenprogramm
        - Graphbase, eine Bilddatenbank

        Weitere Highlights:

        . 800 Calamus Fonts
        . 800 neue True Type Fonts f&uuml;r NVDI / SpeedoGDOS
        . Linux68/k - ALD Standardversion
        . neue Spiele, Demos, Hypertexte, Anwendungsprogramme
        . Animationen, Soundfiles, Cliparts, Musik. und Grafikanwendungen

</pre>
<p><tt>Systemvoraussetzung</tt>
</p>
<p>Atari Computer: ST, TT, Falcon mit <a href="0701.htm" target="UDOcon">CD-ROM</a> Drive, 1Mb Ram
<br>Treiber : nach ISO 9660 erforderlich
<br>CD-Tools, ExtenDos, SPIN!034
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="images/img.gif" border=0 width="77" height="25"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="12.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari Software CD-ROM" border=0 width="24" height="24"></a>
<a href="120a.htm" target="UDOcon"><img src="udo_lf.gif" alt="Whiteline Gamma" border=0 width="24" height="24"></a>
<a href="120c.htm" target="UDOcon"><img src="udo_rg.gif" alt="Whiteline PSI" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
