<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: HDDriver
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="13.htm" target="UDOcon"><img src="udo_up.gif" alt="Systemsoftware" border=0 width="24" height="24"></a>
<a href="1301.htm" target="UDOcon"><img src="udo_lf.gif" alt="SPIN! CD Driver" border=0 width="24" height="24"></a>
<a href="1303.htm" target="UDOcon"><img src="udo_rg.gif" alt="EXTenDOS" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="HDDriver">19.2 HDDriver</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> HDDRiver 7 - ein pr&auml;chtiger Devicetreiber </tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
<br>
</p>
<p>Neuerungen und wichtige Features in der aktuellen Release 7 des
HDDRIVER
<br>
</p>
<p>Der HDDRIVER unterst&uuml;tzt das Einrichten von SCSI- und
<a href="0604.htm" target="UDOcon">IDE-Festplatten</a> am jedem Atari-Computer in leichten Schritten, das
Programm HDDRUTIL ist in vielen Punkten selbsterk&auml;rend und man
kann so in wenigen Minuten ein neues Ger&auml;t an seinem Atari
korrekt installieren. Viele Features des HDDrivers d&uuml;rften dem
Leser seit der letzten Ausgabe des <a href="1401.htm" target="UDOcon">Revolution</a> Magazins bekannt sein.
In diesem Artikel werde ich die M&ouml;glichkeit nutzen einige neue
Funktionen und Men&uuml;punkte des HDDriver zu erl&auml;utern.
<br>
</p>
<p>Mit dem HDDriver sind Sie in der Lage jedes SCSI-Ger&auml;t an
ihrem Atari zu betreiben.
<br>
</p>
<p align=center><img src="image/hddrive4.gif" border=0 width="388" height="373"></p><br>
<div align=center><tt> Abbildung 1 - Der ID-Check von HDDRiver7 </tt>
</div>
<p>
<br>
</p>
<p><b> Einstellungen per CPX-Kontrollfeld </b>
</p>
<p>Mit dem HDDriver wird ein neueres CPX-Modul mitgeliefert bei dem
sich der Benutzer in die Lage versetzt sieht jederzeit und unter jedem
GEM-Programm herraus Informationen &uuml;ber den Status seiner
Speichermedien zu erhalten.
<br>
</p>
<p>Nach dem &ouml;ffnen des Kontrollfeldes erf&auml;hrt man welche
Release des HDDriver installiert wurde. Die verschiedenen
Informationen erh&auml;lt man &uuml;ber f&uuml;nf verschiedene
Dialoge:
<br>
</p>
<p><b> - Allgemein </b>
</p>
<p>Ein- bzw. Auschalten des SCSI-Verify und des Hintergrund-DMA
f&uuml;r MagiC Die HDDriver-Versionsnummer, XHDI-Version und die
Versionsnummer von SCSIDRV
<br>
</p>
<p><b> - Schreibschutz </b>
</p>
<p>Man erh&auml;lt hier die M&ouml;glichkeit einen Schreibschutz auf
jedes korrekt angemeldete Laufwerk zu legen. Weiterhin ist es
m&ouml;glich mit dem Schaltern 'Rootsektoren' und 'Bootsektoren' diese
Bereiche einer Partition gezielt zu sch&uuml;tzen.
<br>
</p>
<p><b> - Parken / Auswerfen </b>
</p>
<p>Besitzer von Wechselmedien werden &uuml;ber diesen Men&uuml;punkt
erfreut sein. Egal unter welchem Laufwerksbuchstaben Sie ein
wechselbares Medium installeriert haben, hier ist es m&ouml;glich das
Laufwerk zu Parken oder aber auch das Medium auszuwerfen.
<br>
</p>
<p><b> - Fehlerbehandlung </b>
</p>
<p>Sollten bei Ihnen Fehler auftreten k&ouml;nnen Sie diese nun
jederzeit unter diesem Dialog sehen. Es wird hier jeweils der zuletzt
aufgetretene Fehler angezeigt. Das passiert getrennt nach Lese- oder
Schreibfehlern. Sie erhalten auch hier die M&ouml;glichkeit die Anzahl
der Korrekturversuche einzustellen.
<br>
</p>
<p><b> - ZIP- / JAZ-Medien </b>
</p>
<p>Der Dialog ist nur f&uuml;r Besitzer gleichnahmiger
<a href="0607.htm" target="UDOcon">Wechselplattenlaufwerke</a> interessant. Wenn Sie hier die ID ihres
Laufwerks eintragen erhalten Sie die M&ouml;glichkeit eingelegte
Medien mit einem Lese- und/oder Schreibschutz zu versehen. Damit das
ganze nicht zu einfach wird unterst&uuml;tzt dieser Dialog auch die
Vergabe und das Abfragen von Passw&ouml;rtern. Sofern Sie ein Medium
gesch&uuml;tzt haben, in Besitz des richtigen Passworts sind,
k&ouml;nnen Sie jederzeit auch ein bereits vergebenes Passwort
&auml;ndern. Auch ist es m&ouml;glich die Art des Schutzes mit dem
'Modus'-Schalter zu ver&auml;ndern. Merken Sie sich Ihr Passwort sehr
genau! So gesch&uuml;tze Medien ohne passendes Passwort k&ouml;nnen
nur durch eine neue Formatierung wieder zug&auml;nglich gemacht
werden!
<br>
</p>
<p>Das HDDriver CPX arbeitet bei mir unter dem alten Atari
Kontrollfeld XCONTOL sowie auch unter der neuesten COPS-Version
jeweils einwandfrei. Es erm&ouml;glicht das Handling bestimmter
Funktionen auf einfachem und schnellem Weg.
<br>
</p>
<p><b> HDDriver 7 besitzt einige wichtige interne &Auml;nderungen
</b>
</p>
<p>Sie werden z.B den Dialog 'XHDI Partitions Typen' unter dem
Men&uuml;punkt 'Boot Parameter' finden. Weiterhin gibt es den Punkt
'Generic SCSI Driver' (SCSIDRV), der die SCSIDRV-Interface Routinen
aktiviert. Dieser Punkt ist komplett neu. Der SCSIDRV erm&ouml;glicht
es Anwendern ihre eigenen Ger&auml;tetreiber zu implemetieren ohne
jeweils das Rad neu zu Erfinden. SCSIDRV, der generische SCSI-Treiber
erlaubt es SCSI-Kommandos an jedes angeschlossene SCSI-Ger&auml;t zu
senden. So k&ouml;nnen auf diesem Weg auch CD-ROMs und
Streamerlaufwerke erreicht werden. Ebenso k&ouml;nnen die sog.
'Phasenwechsel-Laufwerke' korrekt angesprochen werden auch wenn beim
booten eine CD eingelegt war. Hierzu gibt es einen speziellen Button.
U.a ist es so auch m&ouml;glich mit 'SPIN!' von Julian Reschke direkt
ein <a href="0701.htm" target="UDOcon">CD-ROM</a> zu betreiben. Unter MagiC gen&uuml;gt es dann das
SPINMAGC.XFS in den Extensions-Ordner zu kopieren.
<br>
</p>
<p><b> XHDI-Partitonstypen </b>
</p>
<p>Das (eXtendet HardDisk Interface) V1.26 erleichtert die
Kommunikation mit blockorientierten Massenspeichern. Das
XHDI-Interface bringt einige zus&auml;tzliche Eigenschaften mit die
viele Treiber bereits haben. &Uuml;ber eine dokumentierte
Schnittstelle kann nun hier der Zugriff erweitert werden.
<br>
<br>
</p>
<p>- erlaubt bis zu 32 Ger&auml;te (GEMDos)
<br>
<br>- Die <a href="0204.htm" target="UDOcon">Installation</a> mehrerer AHDI-Kompatibler Treiber.
<br>
<br>- LUN 0,1 eines ACSI- oder SCSI-Targets wird benutzbar.
<br>
<br>Zweck der XHDI-Funktion in HDDRiver ist es einen flexiblen Zugang
zu den Informationen der einzelnen Ger&auml;te zu erhalten und eine
Unterst&uuml;tzung erweiterter Treiberfunktionen wie Stop/Start oder
Verriegeln/Entriegeln zu Erreichen. Weitere Informationen entnehmen
Sie bitte der umfangreichen XHDI-Spezifikation. Per FTP-Server
k&ouml;nnen Sie weitere Informationen zu XHDI unter:
<br>
</p>
<p>'ftp.uni-muenster.de/pub/atari/docs' vorfinden.
<br>
</p>
<p><b> TOS 1.4- &amp; DOS - Kompatibilit&auml;t </b>
</p>
<p>Unter dem Men&uuml;punkt 'Partitionieren' finden Sie eine
M&ouml;glichkeit ihre gro&szlig;en Partitionen kompatibel zu alten
TOS-Versionen zu halten. Bekannterma&szlig;en k&ouml;nnen &auml;ltere
TOS-Versionen lediglich 32768 Sektoren korrekt Verwalten, ab TOS 1.4
sind es 65535 Sektoren. Diese Funktion erzeugt einen defekten Sektor
auf ihrer Partition. Bei alten TOS-Varianten ist man so in der Lage
auch gr&ouml;&szlig;ere Partitionen Fehlerfrei zu benutzen. HDDriver
markiert hierzu den Sektor 16383 als defekt. Durch diesen Trick ist es
gefahrlos m&ouml;glich gr&ouml;&szlig;ere Partitionen ab TOS 1.4 zu
benutzen.
<br>
</p>
<p>HDDRiver vergibt bei der Anwahl der 'DOS-Kompatiblit&auml;t'
einige wichtige pysikalische Parameter an das entsprechende Device.
Das geschieht genau in der Art wie solche Parameter auch von den
PC-Kontrollern sp&auml;ter 'gelesen' werden. Es wird hier eine 100%
Kompatibilit&auml;t erreicht. Entnehmen Sie die dazu passenden
Kontrollerdaten aus der Beschreibung des entsprechenden PC-Kontrollers
um diese im HDDriver angeben zu k&ouml;nnen. Bedenken Sie bitte das
DOS-Kompatible Medien am Atari nur unter MagiC oder BigDOS komplett
bearbeitet werden k&ouml;nnen. Das betrifft nat&uuml;rlich auch
Wechselmedien!
<br>
</p>
<p>Daraus ergeben sich folgende Partitonsgr&ouml;ssen:
<br>
</p>
<p>
<br>
</p>
<div align=center><table border=1 frame=box>
<caption align=bottom>Tabelle 56: Atari Partition Sizes</caption>
<tr>
  <td align=left valign=top>TOS-Release</td>
  <td align=left valign=top>Size / Gr&ouml;sse</td>
  <td align=left valign=top>Comment / Kommentar</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>TOS 1.00 - 1.02</td>
  <td align=left valign=top>256 MByte</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>TOS 1.04 - 3.xx</td>
  <td align=left valign=top>512 Mbyte</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>TOS 4.0x</td>
  <td align=left valign=top>1024 MByte</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>MagiC</td>
  <td align=left valign=top>1024 MByte</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>BigDOS</td>
  <td align=left valign=top>1024 MByte</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>MagiC / BigDOS</td>
  <td align=left valign=top>2048 MByte</td>
  <td align=left valign=top>(DOS-Kompatibel)</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>MagiC 6.1 -&gt;</td>
  <td align=left valign=top>FAT32 -&gt;</td>
  <td align=left valign=top>Terrabyte (nicht MagiC 6.01)</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>FreeMiNT 1.15</td>
  <td align=left valign=top>FAT 16</td>
  <td align=left valign=top>2048 MByte (DOS/TOS komp. Partitionierung)</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>FreeMiNT</td>
  <td align=left valign=top>FAT 32           !&gt; Terrabyte</td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
</table></div>

<p>
<br>
</p>
<p>Die physkalische Gr&ouml;sse der Platte spielt fast keine Rolle.
Es h&auml;ngt eher an den einrichtbaren Partitionsgr&ouml;ssen. (TOS)
<br>
</p>
<p>Mit dem richtigen Festplattentreiber hat man am Falcon so gut wie
keine Einschr&auml;nkung. Zu unterscheiden ist generell der Begriff
&quot;Plattengr&ouml;sse&quot; und &quot;Partitionsgr&ouml;sse&quot;.
Die Grenze dessen ist abh&auml;ngig von der eingesetzten TOS-Version
und dem dabei vorhandenen Dateisystem.
<br>
</p>
<p>Unter <a href="1307.htm" target="UDOcon">MiNT</a> und MagiC bestehen daher fast keine
Beschr&auml;nkungen. Maximal 128GB Festplatte sollten eigentlich jedem
reichen. Aller Regel nach kannst man eine beliebige Platte benutzen.
Eine 50 polige 8Bit Schnittstelle, bei SCSI, sollte sie schon haben.
Man kann auch UltraWide Festplatten verwenden. Hier zu braucht man
dann aber immer einen Kabeladapter von 8 auf 16 Bit. (Woran manche
Herren gern verzweifeln)
<br>
</p>
<p>
<br>
<br><b> HDDriver7 allgemein </b>
</p>
<p>Wenn Sie den Men&uuml;punkt 'Autokonfigurierung' w&auml;hlen,
sucht das Programm nach allen angeschlossenen Fest- und Wechselplatten
und tr&auml;gt diese in der Reihe des Auffindes die Ger&auml;teliste
des HDDriver ein. In allen meinen Anwendungen konnte ich diese
'Voreinstellung' ungesehen &uuml;bernehmen. Beachten Sie bitte das der
HDDriver dazu in der Lage sein sollte alle IDs am SCSI- und
IDE-Anschlu&szlig; abfragen zu k&ouml;nnen. Man kann im HDDriver
bestimmte IDs ausschalten, diese werden dann auch nicht mehr
abgefragt.
<br>
</p>
<p>Diese Funktion erleichtert das Konfigurieren des Plattentreiber
erheblich. Beachten Sie bitte das Sie hierzu den HDDriver in einer
Version ab V 6.x be&ouml;tigen! Bei Datenverlusten k&ouml;nnen Sie mit
der Funktion 'Partitionsdaten retten' den Rootsektor des betroffenen
Devices wieder herstellen. Die betroffen Platte sollte zuvor
allerdings zwingend mit HDDRUTIL eingerichtet worden sein.
<br>
</p>
<p>Seit einiger Zeit ist nun auch der bekannte ID-Check in HDDriver
integriert. ID-Check ist nicht nur wesentlich schneller geworden, es
wird hier nun auch direkt das entsprechende Laufwerk inkl. des dort
gefundenen SCSI-Device Typ ausgegeben. Eine sehr vorbildliche
Funktion.
<br>
</p>
<p>Beachten Sie bitte unbedingt das sie beim Update von HDDriver 6.x
auf die neueste Version 7 den HDDriver unbedingt rekonfigurieren
m&uuml;ssen um von allen neuen Features profitieren zu k&ouml;nnen.
<br>
</p>
<p>
<br>
<br><b> Neuerungen in HDDRiver 7.5 </b>
<br>
</p>
<p>In der neuesten Ausgabe des Festplattenteibers HDDriver gibt es
einige wichtige &Auml;nderungen die sie sich unbedingt ansehen
sollten. Laut <a href="0201.htm" target="UDOcon">Autor</a> unterst&uuml;tzt so HDDriver ab dieser Version
beide IDE-Ports des neuen Atari Milan. &Uuml;ber ein
SCSI-Unterst&uuml;tzung war noch nichts aussagef&auml;higes zu
erfahren. M&ouml;glich ist aber das dieses in der gleichen Art
passieren wird wie es z.B beim HADES realisiert wurde.
<br>
</p>
<p>Wechselmedien wie sie als JAZ- oder ZIP bekannt sind lassen sich
ab dieser Version auch dann formatieren, wenn sie per Passwort
gesch&uuml;tzt sind. Dies ist wichtig, falls man das Passwort
vergessen haben sollte.
<br>
</p>
<p>Der generischer SCSI-Treiber aktiviert das im HDDRIVER integrierte
SCSI-Treiber-Interface, wie es von Steffen Engel (CHBD) entwickelt
wurde.
<br>
</p>
<p>Alle SCSI-Ger&auml;te wie Streamer, <a href="0701.htm" target="UDOcon">CD-ROM</a>-Laufwerke oder Scanner
die auf diesem Interface aufbauen, k&ouml;nnen nun ohne SCSIDRV.PRG
oder SCSI.RAM betrieben werden, sofern HDDRIVER 7.50 installiert ist.
Das funktioniert aber schon seit der Version 7.0 des HDDriver. Neu ist
hier alleredings, da&szlig; das SCSI-Treiber-Interface 1.01
unterstuetzt wird. HDDRIVER ist &uuml;berhaupt der erste Treiber, der
das tut. SCSI-IDs dieser Ger&auml;te sollten in HDDRUTIL unter
&quot;Ger&auml;tekonfiguration&quot; eingetragen werden.
<br>
</p>
<p>&Uuml;berarbeitet wurden die Einstellungen f&uuml;r die
verschiedenen Kompatibilit&auml;ts- Einstellungen bez&uuml;glich des
Partitionieren von Fest- und Wechselplatten. Die Einstellungen sind
idR vor der verwendeten TOS-Version abh&auml;nging. Wenn Sie noch
&auml;ltere TOS-Ausgaben benutzen sollten Sie die entsprechenden
Kompatibilit&auml;ts-Optionen unbedingt benutzen. Alle anderen
Benutzer d&uuml;rften diese Optionen kaum ben&ouml;tigen da sowieso
ein neues TOS oder MagiC verwendet wird.
<br>
</p>
<p>Optimale Parameter f&uuml;r DOS-kompatible Partitionen wird mit
der Men&uuml;option (SDMS kompatibel) sicher erzeugt. Das Ergebniss
ist ein minimaler Verschnitt bei der Partitionierung einer solchen
Platte.
<br>
</p>
<p>Sehr aktuell finde ich die Einstellung &quot;TOS &amp; DOS
kombiniert&quot;
<br>Hier lassen sich Platten und Wechselmedien einrichten die ohne
einen weiteren Zusatz an Software, einem weiteren Treiber, unter TOS,
DOS&amp;WIN normal benutzt werden k&ouml;nnen. Solche Medien
d&uuml;rfen bis zu 1Gig gro&szlig; werden und auch aus einer einzigen
Partition bestehen. Die maximale Partitiongr&ouml;sse h&auml;ngt von
der TOS-Version ab, wie auch bei normalen TOS-kompatiblen Partitionen.
Es gelten die gleichen Limits.
<br>
</p>
<p>Anmerkung:
<br>
<br>
</p>
<p>Leichter kann ein Datentransfer zwischen verschiedenen Platformen
eigentlich kaum noch gestaltet werden.
<br>
</p>
<p>Beachten Sie hierzu bitte das andere Plattentreiber ein so
eingerichtetes Medium hier nur als ein DOS-Medium erkennen
k&ouml;nnen. &Auml;ltere Treiber sehen kein Medium! KOBOLD kann auf
diese Partition mit voller Geschwindigkeit (kein GEMDOS-Modus)
zugreifen.
<br>
</p>
<p>Ein neuer Men&uuml;punkt ist die Option &quot;Standardwerte
setzen&quot; Hier werden alle Einstellungen im HDDriver auf die
Defaultwerte zur&uuml;ckgesetzt. Das ist gut Notwending wenn man sein
System &quot;Totkonfiguriert&quot; haben sollte.
<br>
</p>
<p>Ab Version 7.50 unterst&uuml;tzen HDDRUTIL und HDDRCONF (nicht
aber HDDRIVER!) die ASH-Emulatoren MagiCMac und MagiCPC, sofern schon
CBHD oder SCSIDRV auf diesen installiert wurden.
<br>
</p>
<p>Sollten Sie nun HDDRUTIL und HDDRCONF (nicht aber HDDRIVER!) auch
unter MagiCMac und MagiCPC verwenden wollen m&uuml;ssten Sie SCSIDRV
und/oder CBHD f&uuml;r MagiCMac bzw. MagiCPC installieren. SCSIDRV und
CBHD f&uuml;r MagiCMac sind Bestandteil des Archivs zu CBHD f&uuml;r
den Atari und in Mailboxen (Maus SZ, 05341-852024) sowie im <a href="15.htm" target="UDOcon">Internet</a>
zu finden. Diese Software stellt HDDRUTIL und HDDRCONF alle
erforderlichen Funktionen zum Plattenzugriff zur Verf&uuml;gung. Es
lassen sich also nur solche Platten ansprechen, die von CBHD bzw.
SCSIDRV angeboten werden. Bitte richten Sie Fragen zu dieser Software
ausschlie&szlig;lich an den <a href="0201.htm" target="UDOcon">Autor</a> Steffen Engel.
<br>
<br>
</p>
<p>E-Mail: Steffen_Engel@sz2.maus.de
<br>
</p>
<ul>
<li> <a href="http://members.aol.com/steffene/" target="_top">Steffen Engel Homepage</a>
<br>&nbsp;
</li>
</ul>
<p>Noch einige Stichpunkte:
<br>
<br>
</p>
<dl>
<dt><b>*1</b></dt><dd> Das SCSI-Treiber-Interface unterst&uuml;tzt nun auch
ATAPI-Ger&auml;te (getestet mit ATAPI <a href="0701.htm" target="UDOcon">CD-ROM</a>-Laufwerken und SPIN!) und
emuliert f&uuml;r IDE-Platten die wichtigsten SCSI-Kommandos. Mehr
dazu s. u. (7.50)
<br>&nbsp;
<dt><b>*2</b></dt><dd> <a href="0604.htm" target="UDOcon">IDE-Festplatten</a> lassen sich formatieren. Dazu unbedingt Warnungen
bez&uuml;glich des formatierens von IDE-Devices beachten!!
<br>&nbsp;
<dt><b>*3</b></dt><dd> IDE-Platten verify.
<br>&nbsp;
<dt><b>*4</b></dt><dd> Auswahldialoge f&uuml;r Ger&auml;te und Partitionen kompelett.
<br>&nbsp;
<dt><b>*5</b></dt><dd> DOS/Windows Partitionierung nun auch f&uuml;r Medien mit
gro&szlig;en physikalischen Sektoren (z. B. MODs mit 2048 Bytes pro
Sektor)
<br>&nbsp;
<dt><b>*6</b></dt><dd> Vorhandene Partitionen lassen sich auch f&uuml;r DOS-kompatible
Medien &auml;ndern. Die Anzeige des Partitiontyps erfolgt hexadezimal.
<br>&nbsp;
<dt><b>*7</b></dt><dd> EJECT.PRG wirft die Medien aller bekannten Ger&auml;te aus, die
vom SCSI-Treiber verwaltet werden.
<br>&nbsp;
</dl>
<p>
<br>
<br><b> Eine eingebaute Emulation </b>
<br>
<br>
</p>
<p>Der in HDDRIVER integrierte SCSI-Treiber emuliert f&uuml;r
IDE-Platten die wichtigsten SCSI-Kommandos. Bei aktuellen IDE
<a href="0701.htm" target="UDOcon">CD-ROM</a>-Laufwerken handelt es sich um Ger&auml;te, die den
ATAPI-Standard unterst&uuml;tzen. Solche Ger&auml;te
&quot;verstehen&quot; im gro&szlig;en und ganzen dieselben Kommandos
wie SCSI-Ger&auml;te, werden aber &uuml;ber die IDE-Schnittstelle
angesteuert. HDDRIVER unterst&uuml;tzt ATAPI-Ger&auml;te und somit
sind f&uuml;r auf dem integrierten SCSI-Treiber basierende Programme
nicht nur SCSI- sondern auch ATAPI-Ger&auml;te verf&uuml;gbar.
Erfolgreich getestet wurden u. a. SPIN! und MUCKE mit einem SONY ATAPI
<a href="0701.htm" target="UDOcon">CD-ROM</a>-Laufwerk. Beachten Sie, da&szlig; hier ausschlie&szlig;lich von
Software die Rede ist, die das in HDDRIVER integrierte SCSI-Interface
benutzt, und nicht von beliebigen Programmen. Vergessen Sie nicht, in
HDDRUTIL unter &quot;Ger&auml;tekonfiguration&quot; die IDs Ihrer
ATAPI-Ger&auml;te zu aktivieren, wenn diese vom SCSI-Treiber
unterst&uuml;tzt werden sollen.
<br>
</p>
<p>
<br>
<br><b> Vertrieb &amp; Support </b>
<br>
</p>
<p>F&uuml;r die Benutzer von DISKUS gibt es das Upgrade auf HDDRiver
7 ausschliesslich bei Uwe Seimet, diese Upgrade kann nicht mehr
&uuml;ber die Firma CCD in Eltville bezogen werden.
<br>
</p>
<p>Eine aktuelle Demoversion von HDDriver erhalten Sie unter:
<br>
</p>
<p>ftp.acp5.chemie.uni-kl.de/pub/atari/hddriver??_demo.zip
<br>
</p>
<p>Maus KA, 0721-358887 (HDDRIV**.ZIP)
<br>
</p>
<p>Informationen &uuml;ber Neuerungen gibt es im WordWideWeb unter:
<br>
</p>
<ul>
<li> <a href="http://acp5.chemie.uni-kl.de/seimet/hddrivernews_german.html" target="_top">HDDRiver german</a>
<br>&nbsp;
</li>
</ul>
<ul>
<li> <a href="http://acp5.chemie.uni-kl.de/seimet/hddrivernews_english.html" target="_top">HDDRiver english</a>
<br>&nbsp;
</li>
</ul>
<p>Der <a href="0201.htm" target="UDOcon">Autor</a> von HDDriver ist:
<br>
</p>
<p>Dr.Uwe Seimet
<br>L&uuml;dersstra&szlig;e 4
<br>D-76275 Ettlingen
<br>
</p>
<p>Ein &auml;hnlicher Artikel in der <a href="1401.htm" target="UDOcon">Revolution</a> Ausgabe 4 erschienen
<br>
</p>
<p>
<br>
<br><b> Neues in HDDriver 8 </b>
<br>
</p>
<p>Umfangreiche Optimierungen und Aufr&auml;umarbeiten in HDDRIVER 8.
Das Programm ist nun mehrere KByte kleiner als HDDRIVER 7.9, bei
gr&ouml;&szlig;erem Funktionsumfang. Gleiches gilt f&uuml;r HDDRUTIL.
<br>
</p>
<blockquote>
<p>* HDDRIVER und s&auml;mtliche Tools laufen nun auf jeder
Plattform, f&uuml;r die es einen SCSI-Treiber gibt. Also neben Atari
und Milan auch MagiCMac und MagiCPC. Achtung: Unter MagiCMac und
MagiCPC nur den SCSI-Treiber installieren, nicht aber CBHD.
</p>
<p>* Auf dem Milan l&auml;uft die Kommunikation zwischen HDDRIVER und
SCSI-Treiber f&uuml;r PCI SCSI nicht mehr &uuml;ber eine
propriet&auml;re Schnittstelle sondern direkt &uuml;ber den
SCSI-Treiber.
</p>
<p>* Erweiterter ID-Check. Dieser ber&uuml;cksichtigt nun alle Busse,
f&uuml;r die ein SCSI-Treiber existiert, und nicht mehr nur die Busse
0 bis 2. Au&szlig;erdem werden die vollst&auml;ndigen Busnamen
angezeigt.
</p>
<p>* Beim Initialisieren von Partitionen werden nun auch
FAT32-Partitionen unterst&uuml;tzt.
</p>
<p>* Beschleunigtes Verify f&uuml;r SCSI- und ATAPI-Platten, die kein
ByteCheck-Verify unterst&uuml;tzen.
</p>
<p>* Unterst&uuml;tzung zus&auml;tzlicher SCSI-Messages f&uuml;r
TT/Falcon SCSI, u. a. SAVE DATA POINTER, MODIFY DATA POINTER, RESTORE
POINTERS, BUS DEVICE RESET.
</p>
<p>* Fehler im Bus-Rescan auf dem Milan behoben, der sich
insbesondere durch einen Aufh&auml;nger beim Start des CD-Recorders
von SoundPool bemerkbar machte.
</p>
</blockquote>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="13.htm" target="UDOcon"><img src="udo_up.gif" alt="Systemsoftware" border=0 width="24" height="24"></a>
<a href="1301.htm" target="UDOcon"><img src="udo_lf.gif" alt="SPIN! CD Driver" border=0 width="24" height="24"></a>
<a href="1303.htm" target="UDOcon"><img src="udo_rg.gif" alt="EXTenDOS" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
