<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.12.2003 -->
<html>
<head>
<title>
DOITF030 - Tips u. Tricks zum Atari Falcon F030: Elektronik Arbeiten
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="support@doitarchive.de">
<link rev=made href="mailto:support@doitarchive.de" title="E-Mail">
<link rel=home href="doitf030.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="16.htm" target="UDOcon"><img src="udo_up.gif" alt="Anhang" border=0 width="24" height="24"></a>
<a href="1606.htm" target="UDOcon"><img src="udo_lf.gif" alt="Scancode" border=0 width="24" height="24"></a>
<a href="1608.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stichwortverzeichniss" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Elektronik_20Arbeiten">22.7 Elektronik Arbeiten</a></h1>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt> Vom Arbeiten mit der Computer Elektronik </tt>
<br>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Eine der wichtigsten Grundlagen beim Arbeiten am Computer ist ein
fundiertes Grundwissen und die Einhaltung der einfachsten Regeln
ebenso wie das vorhandensein des richtigen Werzeuges und die
M&ouml;glichkeit mit den eigenen H&auml;nden eine saubere Arbeit
hinterlassen zu k&ouml;nnen.
<br>
</p>
<p>Ein sauberer Arbeitsplatz, ohne Katze, Kaffe und Kabelschnippel
ist ein mu&szlig;.
<br>
<br>
</p>
<p><tt> L&ouml;ten am Computer </tt>
<br>
<br>
</p>
<p>Zum L&ouml;ten verwenden Sie bitte nur L&ouml;tzinn mit der
Bezeichnung Pnb60, welches genau die richtig Mischung zum l&ouml;ten
an empfindlichen Ger&auml;ten ist. Dieses L&ouml;tzinn gibt es im
einschl&auml;gigen Fachhandel in verschiedenen Drahtst&auml;rken und
L&auml;ngen. Vergessen Sie schnellstens solche Dinge wie L&ouml;tfett,
L&ouml;ts&auml;ure oder einen Schwefelstein. Moderne
L&ouml;tger&auml;te besitzen eine vernickelte Dauerl&ouml;tspitze die
auch Temperaturen jenseits 400C dauerhaft verkraftet. Zum reinigen
dieser Spitzen reicht der feuchte Abstreifschwam der sich an jedem
besseren L&ouml;tger&auml;t befinden sollte. Ein L&ouml;tkolben mit
einer Leistung von 8-15 Watt recht bei jedem Computer aus um alle
normalen L&ouml;tstellen bearbeiten zu k&ouml;nnen, ausgenommen SMD.
Hier reicht ein kleiner SMD-L&ouml;tkolben mit 5 Watt Leistung und
einer Nadell&ouml;tspitze. Das aber auch nur um nicht Hilflos so sein.
Arbeiten mit SMD-Bauteilen verlangt nach eigenem Werkzeug!
<br>
<br>
</p>
<p><tt> Entl&ouml;ten </tt>
<br>
<br>
</p>
<p>Das Entl&ouml;ten elektronischer Bauteile kann auf den
unterschiedlichsten Wegen erfolgen.
<br>Der sicherste Weg f&uuml;r Standard-DIL Bauteile ist eine
Entl&ouml;tstation bei der das erhitzte L&ouml;tzinn mittels Vaccuum
aus den L&ouml;taugen gesaugt wird. Ein Drahthaken f&uuml;r die Beine
von z.B Widerst&auml;nden und liegenden Kondensatoren ist auch nicht
schlecht.
<br>
</p>
<p>Auch kann eine sog. Entl&ouml;tlitze kann eine entscheidende Hilfe
sein, allerdings nicht bei jeder L&ouml;tstelle. Dazu ist das
Einsatzgebiet zu Umfangreich.
<br>
</p>
<p>
<br>
</p>
<p><tt> SMD l&ouml;ten </tt>
<br>
<br>
</p>
<p>SMD-Bauteile sollten immer nur mit den daf&uuml;r geeigneten
L&ouml;twerkzeugen bearbeitet werden. Zu schnell richtet man mit dem
falschen L&ouml;tkolben, der falschen L&ouml;tspitze, einen
verheerenden Schaden an den winzigen Bauteilen und Leiterbahnen an.
<br>Das trifft ganz speziell f&uuml;r SMD-Chips zu die mehrere 100
Anschlu&szlig;beinchen haben. Hier ist man mit sog.
Hei&szlig;luft-L&ouml;tger&auml;ten bestens bedient. Solche
Ger&auml;te sind als Profiausr&uuml;stung sehr teuer und Zuhause wohl
kaum zu finden.
<br>Diese eignen sich hier zum Ein- wie auch zum Ausl&ouml;ten
hervorragend, besitzen allerdings aber auch einen sehr hohen
Anschaffungswiderstand. F&uuml;r einzelne Beinchen eignet sich auch
ein 6 Watt L&ouml;tkolben mit einer Nadelspitze. Beachten Sie das
einige Niederspannungsl&ouml;tger&auml;te eine Spannung an der
L&ouml;tspitze anliegen haben! Enfernen Sie vor dem L&ouml;ten auf
jeden Fall den Netzanschlu&szlig; des jeweiligen Computerboards!
Betreiben Sie Niederspannungsl&ouml;tkolben generell nur &uuml;ber
einen entsprechenden Schutztransformator oder verwenden Sie gleich
eine richtige professionelle L&ouml;tstation.
<br>
</p>
<p>Als L&ouml;tstation ist z.B die WTCP-S vom englischen Hersteller
WELLER sehr zu empfehlen, kostet aber auch gute 200,-. Die Station
h&auml;lt die Temperatur genauer als jeder L&ouml;tkolben.
</p>
<p>RS-Elektronik z.B bietet eine L&ouml;tstation an die auch
Hitzeschilder f&uuml;r Flatpacks enth&auml;lt. Dieses Ger&auml;t liegt
preislich jenseits von gut und b&ouml;se. Allerdings, und das ist der
Punkt, mit dieser Heissluftsation lassen sich auch gro&szlig;e
Bauteile direkt und gezielt l&ouml;ten oder entl&ouml;ten da hier um
das Bauteil herum ein Hitzeschild mit integriertem Feder-
Vaccumabheber auf die Platine aufgebracht wird. Benachbarte Bauteile
werden so nicht erhitzt und das entsprechende Bauteil wird wirklich
erst von den L&ouml;tpads gehoben wenn -alle- Beinchen gleichzeitig
lose sind. Besch&auml;digte Pads sind so eigentlich ausgeschlossen.
<br>
</p>
<p>K&auml;ltespray ist bei diesen Arbeiten eher sch&auml;dlich,
diverse Bauteile halten einen Hitzezyklus beim einl&ouml;ten immer
Stand, erhalten aber durch K&auml;ltespray einen oft t&ouml;tlichen
Temperaturschock.
</p>
<p>Z.b entl&ouml;tet man SMD-Widerst&auml;nde am besten indem man an
einer Seite die L&ouml;tspitze (370&#176;C) dran h&auml;lt, bis ca.
f&uuml;nf z&auml;hlt und dann das Teil mit einer Pinzette in der Mitte
packt und vorsichtig abhebt. Macht man das w&auml;rend das Teil nicht
hei&szlig; genug ist, hat man zumeist die L&ouml;tpads gleich mit
abgerissen, die Platine ist dann hin&uuml;ber.
<br>
</p>
<p>Zum Einl&ouml;ten den Widerstand auf die d&uuml;nn verzinnten Pads
legen. Erste eine, dann die jeweils andere Seite anl&ouml;ten (Heiss
machen reicht idR meist schon), anschliessend die zuerst
angel&ouml;tete Seite nochmal warmmachen. Spezielle SMD-L&ouml;tpaste
braucht man eigentlich nicht, normales SnPbCu 60/38/2 1mm dick mit
Flussmittel ist aussreichend.
<br>
</p>
<p>SMD-Teile nicht recyclen. Viele dieser Teil sind genau f&uuml;r
einen Temperaturzyklus spezifiziert. In der Praxis lassen sich die
Dinger ohne weiteres wiederverwenden, aber es kann halt schon mal was
ausfallen. Insbesondere trifft das SMD-Kondensatoren.
<br>
</p>
<p>Grosse SMD-Widerst&auml;nde werden &quot;1206&quot; genannt, die
kleinen &quot;0804&quot;. Die Zahlen bedeuten Zoll/100, also
0.12&quot;x0.06&quot; macht 3mm x 1.5mm. Drauf stehen drei Zahlen:
erste Ziffer, zweite Ziffer, Exponent. Also 103=10E3=10kOhm.
<br>
</p>
<p>Pusten Sie niemals &uuml;bersch&uuml;ssiges L&ouml;tzinn &uuml;ber
die Platine weg!
<br>Vermeiden Sie das abschnicken von L&ouml;tzinn an der
L&ouml;tspitze des L&ouml;tger&auml;tes
<br>
</p>
<p>Entfernen Sie alle L&ouml;treste vor dem Testen mit einem Pinsel,
sehen Sie auch zwischen den Beinchen der gr&ouml;sseren SMD-Bauteile
nach!
<br>
</p>
<p>Bei nachweislich defekten Bauteilen geht das entl&ouml;ten oft
einfacher wenn man die Anschlu&szlig;beinchen einfach abzwickt um dann
so leichter die Reste aus den L&ouml;taugen entfernen zu k&ouml;nnen.
<br>
</p>
<p>
<br>
</p>
<p><tt> Elektronische Bauteile </tt>
<br>
<br>Elektronische Bauteile gibt es in den unterschiedlichsten Formen.
(!n l) Aktive Bauteile sind Halbleiter, ICs sowie Transistoren. Als
passive Bauteile werden Widerst&auml;nde und Kondensatoren ect.
bezeichnet. Beim Ersetzen eines bestimmten Bauteiles sollte man stets
auf die genaue Typenbezeichnung bzw. die Bauteilebeschriftung achten.
Leider sind in Computern die wichtigsten Bauteile speziell f&uuml;r
diese eine Maschine entwickelt worden und u.U im Fachhandel leider so
nicht erh&auml;ltlich. Hier ist man auf teuere Einzelst&uuml;cke aus
dem Spezialhandel angewiesen. Normale Widerst&auml;nde sowie
Kondensatoren, Transistoren und TTL-ICs erh&auml;lt man in jeder
ge&uuml;nschten Form im einschl&auml;gigen Fachhandel. Das trifft auch
auf SMD-Bauteile zu. Beachten Sie hierzu bitte das bei diesen
Bauteilegr&ouml;ssen keine Beschriftung im Klartext vorhanden ist. Zu
allen SMD-Bauteilen gibt es Codelisten mit denen mein ein Bauteil klar
bestimmen kann.
<br>
</p>
<p>Anschlu&szlig;dr&auml;hte von gew&ouml;hnlichen Bauteilen biegt
man im Winkel von 90 Grad am Bauteil ab. Das Ma&szlig; dazu entnimmt
man den L&ouml;taugen auf der Platine. Biegen Sie niemals irgendwelche
Anschlu&szlig;beinchen direkt am Bauteilgeh&auml;use. Diese Beine
werden schnell abbrechen!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ework.gif" border=0 width="640" height="300"></p><br>
<div align=center><tt> Abbildung 1 - Verschiedene elektronische Bauteile </tt>
</div>
<p>
<br>
<br>
</p>
<p><tt> PLCC Chips </tt>
<br>
<br>Als weitere Besonderheit gelten wohl die sog. PLCC-Chips.
<br>Benutzen Sie nur die dazu geh&ouml;renden Zangen um solche
Bauteile aus ihrem Sockel zu entfernen. Hebeln Sie niemals mit einem
Schraubendreher gegen die recht emfindlichen Sockel. Das gilt
besonders f&uuml;r den Falcon
<br>Defekte PLCC-Sockel m&uuml;ssen immer ausgetauscht werden da so
nicht gew&auml;hrleistet werden kann das der Chip komplett
angeschlossen ist.
<br>Ber&uuml;hren Sie niemals die Kontaktfl&auml;chen der PLCC-Chips
<br>
<br>
<br>
</p>
<p align=center><img src="image/plcc.gif" border=0 width="172" height="126"></p><br>
<div align=center><tt> Abbildung 2 - 27C04001 PLCC Prom </tt>
</div>
<p>
<br>
<br>
</p>
<p><tt> Stecker und Kabelverbindungen </tt>
<br>
<br>
</p>
<p>Beim Herstellen von Kabelverbindungen sollten Sie darauf achten
das immer sauber an den L&ouml;tkelchen der Stecker angel&ouml;tet
wird. Kalte L&ouml;tstellen brechen hier besonders schnell wieder ab.
Schieben Sie &uuml;ber jeden einzelnen Draht ein kurzes St&uuml;ck
Schrumpfschlauch. Nach dem anl&ouml;ten schieben Sie den Schlauch
einfach schnell &uuml;ber die gerade gemachte L&ouml;tstelle. Der
Schlauch schrumft so durch die noch vorhande W&auml;rme und isoliert
die L&ouml;tstelle vollst&auml;ndig gegen die direkt daneben liegenden
L&ouml;tstifte.
<br>
</p>
<p>Flachbandkabel wird sehr selten gel&ouml;tet. Alle
Kabelverbindungen an IDE- und SCSI- Systemen sind idR 1:1 verschaltet.
Alle Stecker und Buchsen werden normalerweise durch aufquetschen mit
dem Kabel verbunden. Die sog. Schneid-Klemmtechnik.
<br>Wenn Sie darauf achten das Pin 1 aller am Kabel vorhandenen
Steckverbindungen auf der farbig markierten Ader des Flachbandkabels
liegt, kann nie etwas falsch Angeschlossen sein, sofern sie Pin 1, die
farbige Ader, an jedem Laufwerk Rechner oder Controller auf Pin 1
stecken.
<br>
</p>
<p>Pin 1 liegt bei allen IDE- oder SCSI-Ger&auml;ten immer direkt
neben dem Stromanschlu&szlig;!
<br>Passende Schnittstellenbelegungen finden Sie im ganzen Archiv.
<br>
<br>
</p>
<p><tt> Kabel an Stecker l&ouml;ten </tt>
<br>
</p>
<p>Die Drahtenden so abisolieren das das blanke Teil komplett in den
L&ouml;tkelch des Steckerpin hineinpasst. Die Drahtisolierung kann
ruhig ein wenig l&auml;nger fehlen. 1mm ist OK. Das blanke Drahtende
zwirbeln so das es sch&ouml;n glatt wird, gerade aussieht und keine
einzelnen Haare abstehen.
<br>
</p>
<p>Zwirbeln ist nicht bei allen Kabeltypen angesagt! Manchmal passt
das so verdrehte Kabelende dann nicht in den entsprechenden Pin.
<br>
</p>
<p>D&uuml;nn verzinnen, wenn das L&ouml;tzinn und das Drahtende
hei&szlig; genug sind l&auml;uft das Zinn in das blanke Ende der Litze
hinein. Fertig.
<br>
</p>
<p>In den Pin damit, beides erhitzen, ein wenig Zinn hinzu, fertig.
Den Stecker mit dem Draht beim l&ouml;ten am besten so halten das das
fl&uuml;ssige L&ouml;tzinn in den Steckerpin hineinlaufen kann. Kommt
es zwischen dem blanken Draht und dem Steckerpin zu einer
gl&auml;nzenden Verbindung, sickert kein Lot mehr in den Pin oder den
Draht, ist die L&ouml;tung beendet.
<br>
</p>
<p>Man kann auch die Litze so in den Pin stecken und dann erst alles
zusammen l&ouml;ten, einer macht es so, andere wiederum anders.
<br>
</p>
<p>Schiebt man vorher noch ein kurzes St&uuml;ckchen passenden
Schrumpfschlauch auf den Draht, kann man diesen bevor die
L&ouml;tstelle kalt wird &uuml;ber den Pin schieben. Dessen
Restw&auml;rme schrumpft den Schlauch und der Pin sieht sauber aus.
Ausserdem gibt es selten einen Kurzschlu&szlig; mit dem Nachbarpin.
<br>
</p>
<p>Mit dem Schlauch dr&uuml;berschieben ist allerdings eine Frage des
Timings. Zu fr&uuml;h, geht der noch zu hei&szlig;e Draht wieder aus
dem Pin raus, wartet man zu lange, schrumpft er nicht mehr ;)
<br>
</p>
<p>Wenn man Steckerpins hat die kein Loch f&uuml;r den Draht haben,
seitlich anl&ouml;ten oder stumpf auf den Pin l&ouml;ten, letzteres
bricht allerdings sehr gerne und auch sehr leicht ab. Geht aber
manchmal aus Platzgr&uuml;nden nicht anders.
<br>
</p>
<p>Die L&ouml;tstelle ist OK wenn Zinn, Leitung und Pin hei&szlig;
waren und sich das Zinn, wenig davon, kein Kilo, auf allen zu
verl&ouml;tenden Teilen gleichm&auml;ssig und d&uuml;nn verteilt hat.
Es mu&szlig; nach dem erkalten silbrig aussen und eine m&ouml;glichst
glatte Oberfl&auml;che haben.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/loeten.gif" border=0 width="270" height="300"></p><br>
<div align=center><tt> Abbildung 3 - Eine L&ouml;tstelle.. </tt>
</div>
<p>
<br>
<br>
</p>
<p>Rauhe, stumpf aussehene L&ouml;tstellen (kalte L&ouml;tstellen)
taugen nichts, brechen ab und haben oft auch keine richtige
elektrische Verbindung. Man nennt das auch &quot;geklebt&quot; oder
&quot;gepappt&quot;. Beispiele f&uuml;r L&ouml;tstellen an Bauteilen
oder einem Steckerpin finden sie in Abbildung 3.
<br>
</p>
<p>Kleine L&ouml;tspitze, blank, frisch verzinnt, hei&szlig; und
sauber. Schnell L&ouml;ten, wenn das Zinn l&auml;uft und sich auf alle
zu verl&ouml;tende Teile verteilt hat ist die L&ouml;tung bereits
beendet. Spitze weg, nicht mehr am Draht wackeln. Kalt pusten, geht
schneller.
<br>
</p>
<p>
<br><b> Beine aus der Platine entfernen </b>
<br>
</p>
<p>Der schnellste Weg bei DIL-Bausteinen ist ein sehr feiner
Seitenschneider und eine ruhige Hand. Merken Sie sich unbedingt die
richtige Einbaurichtung anhand der Kerbe.
</p>
<p>Pitschen Sie vorsichtig die einzelnen Beine des Chips durch und
entfernen Sie die Pinreste anschlie&szlig;end einzeln mit
L&ouml;tkolben, Pinzette und ev. einer Saugpumpe. (Entl&ouml;tpumpe)
</p>
<p>Dem neuen Chip sollten Sie auf jeden Fall einen guten Sockel
spendieren!
<br>
</p>
<p>
<br>
<br><tt> Allgemeines </tt>
<br>
<br>
</p>
<p>Erhitzen Sie niemals ein Bauteil sinnlos. Lange
L&ouml;tvorg&auml;nge zerst&ouml;ren die Bauteile und auch die
Leiterbahnen bzw. die Platine um die L&ouml;tstelle herum.
<br>
</p>
<p>Achten Sie stets auf ausreichende Erdung. Verwenden Sie
Antistatik-Armb&auml;nder wenn Sie an Platinen mit emfpindlichen C-MOS
Bauteilen arbeiten. Sie sollten das Prinzipiell machen wenn Sie am
offenen Computer arbeiten.
<br>
</p>
<p>Beachten Sie die VDE-Vorschriften im Umgang mit der 230V
Netzspannung!
<br>Arbeiten an Netzteilen d&uuml;rfen nur von geschulten
Fachkr&auml;ften vergenommen werden. Versehen ungeschirmte Netzteile
generell mit einer Abdeckung wenn Sie ihren offenen Computer testen.
<br>
</p>
<p>Ziehen sie keinen Computerstecker an einer laufenden Maschine ab
<br>Alle Anschlu&szlig;arbeiten am Computer erfolgen immer dann wenn
der Computer aus ist
<br>
<br>Ihre <a href="0305.htm" target="UDOcon">Hardware</a> dankt Ihnen f&uuml;r die Beachtung dieser kleinen
Sicherheitsregeln!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:support@doitarchive.de">support@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Dezember 2003</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="16.htm" target="UDOcon"><img src="udo_up.gif" alt="Anhang" border=0 width="24" height="24"></a>
<a href="1606.htm" target="UDOcon"><img src="udo_lf.gif" alt="Scancode" border=0 width="24" height="24"></a>
<a href="1608.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stichwortverzeichniss" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
