<html>
<head><title>Documentation de Blaise</title></head>

<body BACKGROUND="../IMAGES/MARBLED.GIF" bgcolor="#FFFFFF" text="#004400" LINK="#884400" VLINK="#004488">
<center><b><FONT SIZE=+1>G&eacute;n&eacute;ralit&eacute;s</FONT><b></center><P>
<TABLE BORDER=0 CELLPADDING=5 CELLSPACING=0>
<TR><TD><IMG SRC="../IMAGES/BLANC.GIF" ALT="" WIDTH=90 HEIGHT=1 BORDER=0></TD><TD VALIGN=TOP>
Blaise est un &eacutediteur de texte (3 fen&ecirc;tres pour le script,
l'include et la liste de commandes), un shell graphique qui se marie bien
avec POV, et un viewer made in M&amp;E. Le shell permet d'acc&eacute;der &agrave;
d'autres programmes type GEM ou TTP avec envoit de param&egrave;tres
directement sous Blaise.
<br>
Vous avez droit en plus &agrave; un appel de viewer apr&egrave;s le calcul
de POV et des macros de texte.
<P>
Je vous fait gr&acirc;ce des descriptions des fonctions. Avec des
ic&ocirc;nes, on comprend tout.<br>
Les ic&ocirc;nes sauver, imprimer, effacer servent pour le texte entier, ou
le bloc s'il existe.
<P>
A noter que vous pouver faire &agrave; la souris votre ligne POV&nbsp;: un vrai
fichier texte avec LF/CR … chaque ligne, extension DEF, mes POV.TTP (des
disquettes de ST Mag) fonctionnent tous avec sans rechigner. C'est
l'ic&ocirc;ne feuille+stylo dans la fen&ecirc;tre concern&eacute;e. Les
commandes produites sont du POV2 (… cause du +u ou +v) par d&eacute;faut (si on ne touche
&agrave; rien) et POV3 si on active certaines options.<br>
<p>
Remarques particuli&egrave;res:
<ul>
<li>Identation automatique pour Enter et les accolades (avec
d&eacute;calage). Cette fonction est d&eacute;sactivable dans les divers
(F3).
<p>
<li>D&eacute;sactivation auto de la souris en monotache uniquement.
<p>
<li>Si le fichier n'est pas trop gros:
Blaise charge le texte en m&eacute;moire. Mais il
se peut que des textes fassent plus que le nombre de lignes indiqu&eacute; dans les
param&egrave;tres et puissent
&ecirc;tre charg&eacute;s. Si c'est la cas, il y aura une alerte. C'est
&agrave; vous de faire attention (pour la sauvegarde) car Blaise
ne sauvera que ce qu'il peut afficher (exit ce qu'il y a au del&agrave;).
Une alerte vous pr&eacute;vient donc au d&eacute;passement du texte lors
d'un load, merge et copie de bloc interne.
<p>
<li>Lorsque vous fermez une fen&ecirc;tre d'&eacute;dition, la position du
curseur ne change pas, mais il est remis en haut &agrave; chaque ouverture.
D'o&ugrave; quelques confusions si vous n'y pr&ecirc;tez pas attention.
<p>
<li>Chercher: c'est toujours &agrave; partir de la position du curseur et
vers le bas.<br>
Remplacer: on commence &agrave; partir du haut
<p>
<li>Plusieurs chemins include, mais Blaise ne pointe que sur le premier.
(les autres servant pour la liste de commandes)
<p>
<li>Sauvegarde BAK: seulement si le fichier poss&egrave;de une extension.
<p>
<li>Syst&egrave;me de marquage&nbsp;: ins&eacute;rez dans votre script ou
include: '@1' dans les commentaires POV (comme //@1 ou /* Green Angel Tower
@1 */) et s&eacute;lectionnez 1 dans le pop-up de la toolbar. &Ccedil;a va
de @1 … @9.
<p>
<li>Insertion d'un SCRAP.POV dans le script ou include et SCRAP.DEF dans
le define (avec ^I).<br>
INTERDICTION FORMELLE d'importer une ligne de commande type POVRAY.DEF!
SCRAP.POV et SCRAP.DEF doivent &ecirc;tre des fichiers textes&nbsp;: chaines
ASCII termin&eacute;s par LF/CR, sinon &ccedil;a plante.
<p>
<li>Au niveau des accessoires en monoTOS&nbsp;: beaucoup ne supportent pas le
changement d'application entre Blaise et les autres. Il sont … fermer
&agrave; la main avant tout lancement.
<p>
<li>Pour le shell&nbsp;: rien de bien particulier, sinon les champs
&eacute;ditables: en fin de ligne, votre curseur passera &agrave; la
suivante automatiquement (et inversement). Lors d'un lancement, Blaise
accolle toutes les lignes (le texte sans ___) pour en former une seule. Il
n'y a pas de TRIM$ ni aucune autre manipulation. Veillez donc &agrave; ce
que vous &eacute;crivez, en particulier les espaces.
</ul>
</TD></TR></TABLE>
</TABLE>
</body>
</html>

