<html>
<head><title>Documentation de Blaise</title></head>

<body BACKGROUND="../IMAGES/MARBLED.GIF" bgcolor="#FFFFFF" text="#004400" LINK="#884400" VLINK="#004488">
<center><b><FONT SIZE=+1>Historique des anciennes versions</FONT><b></center><P>
<TABLE BORDER=0 CELLPADDING=5 CELLSPACING=0>
<TR><TD><IMG SRC="../IMAGES/BLANC.GIF" ALT="" WIDTH=90 HEIGHT=1 BORDER=0></TD><TD VALIGN=TOP>
<b>1.0</b><br>
Premi&egrave;re mouture, remplie de bugs, pas pratique.
<p>
<b>1.1</b><br>
Correction de la plupart des bugs, remplacement de la fen&ecirc;tre
statistiques par un miniappel de programmes externes (qui ne marche que sur
le meme lecteur o&ugrave; se trouve Blaise)
<p>
<b>1.2</b><br>
Am&eacute;lioration du Shell fa&ccedil;on panneau de contr&ocirc;le.
&Ccedil;a marche vers n'importe quel lecteur, quelque soit la longueur du
nom … envoyer comme param&egrave;tre, interface pr&eacute;vue pour
fonctionner en 640*200.
<p>
<b>1.3</b><br>
Des raccourcis claviers et des macros de texte. une gestion de
la ligne de commande indiqu&eacute;e &agrave; Blaise.
<p>
<b>1.4</b><br>
Corrections de certains bugs (dont les titres fen&ecirc;tres),
mini-pop-ups, mini-analyse de la liste de commandes avant rendering.
<p>
<b>1.5</b><br>
Relief et fen&ecirc;tres non activables. fonctionne sous MagiC ou multiTOS
(mais c'est pas le top).
<p>
<b>1.6</b><br>
&Ccedil;a marche beaucoup mieux (et m&ecirc;me tr&egrave;s bien) sous
MagiC4 vu que j'ai diminu&eacute; la consommation m&eacute;moire (buffer
&eacute;cran AES et clipboard sur disque: on passe de 830 &agrave; 550Ko
sur Falcon). BITBLT remplac&eacute; par vro_cpyfm. Slide_show! qui se marie
bien avec les viewers en TTP (surtout ceux d'Apex, on les trouve sur le CD
Whiteline Transmision).
<p>
<b>1.7</b><br>
Choix du mode multi ou monotache. am&eacute;lioration de l'ergonomie.
syst&egrave;me de marques. correction d'un bug pour les fen&ecirc;tres avec
champs &eacute;ditables (swaping entre elles, mais cette correction est
incompl&egrave;te, Argh! lorsqu'on en ferme une, &ccedil;a peut planter).
<p>
<b>1.8</b><br>
D&eacute;buggages intensifs, ~OBJC_EDIT est (presque) enfin
ma&icirc;tris&eacute;.
<p>
<b>1.9</b><br>
Dernier bug ~OBJC_EDIT ma&icirc;tris&eacute;. deux ou trois remaniements
internes.
<p>
<b>2.0</b><br>
Gestion revue du clavier, gestion des accolades, 0% de line-A...
<P>
<b>2.1</b><BR>
VA-START &agrave; gogo, lancement viewer apr&egrave;s le calcul en multitache, gestion
du memory manager de MagiC.
<P>
<B>2.20</B><BR>
Comportement parfait sous MagiC. Viewer interne M&amp;E. Interfa&ccedil;age avec EB&nbsp;Model.
Taille du texte param&eacute;trable. Sonnerie en fin de calcul. Drag&nbsp;n'&nbsp;Drop
</TD></TR></TABLE>
</body>
</html>

