<html>
<head>
<title> <b>NEWSie</b> - Ayuda general </title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#0000ff">
<h1><b>NEWSie</b> - Noticias/Correo/FTP/Navegador</h1>
<p><b>NEWSie</b> utiliza el protocolo de Internet <u>NNTP</u> para leer los 
art&iacute;culos de las noticias de <i>UseNet</i> (<i>UseNet News</i>). 
Est&aacute; provisto de un completo y est&aacute;ndar interfaz <b>GEM</b> 
con men&uacute;, ventanas y selecci&oacute;n por rat&oacute;n. 
<b>NEWSie</b> dispone de la funci&oacute;n de leer, salvar e imprimir los 
art&iacute;culos de las noticias, y una completa capacidad de gestionar el 
anuncio y el seguimiento de las mismas. Los art&iacute;culos pueden ser 
bajados y le&iacute;dos una vez desconectado del servidor (<i>Offline</i>). 
Dispone de opciones para el anuncio y el seguimiento de noticias en 
<i>Offline</i>.<p>

<p>Para la conexi&oacute;n v&iacute;a <u>SLIP/PPP</u> utiliza como gestor 
de acceso a Internet los programas <b>STiK</b>, <b>STinG</b> y 
<b>GlueSTiK</b> (<u>MintNet</u>).</p>

<p><b>NEWSie</b> soporta una amplia variedad de servicios de correo 
electr&oacute;nico (e-mail), incluyendo el <u>Env&iacute;o</u>, 
<u>Respuesta</u> y <u>Reenv&iacute;o</u> de mensajes. Puede soportar 
m&uacute;ltiples buzones de correo, con transferencia de mensajes entre 
ellos. Los buzones se pueden ordenar por <u>tema</u>, <u>autor</u> y 
<u>fecha</u>. Dispone de una opci&oacute;n para usar y editar apodos 
(<i>nicknames</i>).</p>

<p><b>NEWSie</b> tambi&eacute;n dispone del <u>Protocolo de Transferencia 
de Ficheros</u> (<i>File Transfer Protocol</i> o <i>FTP</i>) para el 
usuario de ordenadores Atari. Se puede seleccionar los servidores con 
configuraci&oacute;n individual de acceso al servidor y directorio destino. 
La lista de directorios se guarda en la cach&eacute; para aumentar la 
velocidad de acceso, y los directorios son recuperados 
autom&aacute;ticamente cuando se produce un cambio.</p>

<p>Recientemente se ha integrado en el <b>NEWSie</b> un navegador de texto 
Internet que dispone de las funciones b&aacute;sicas de enlace por 
hipertexto. Puede disponer de una p&aacute;gina de origen local y de una 
lista de las p&aacute;ginas m&aacute;s visitadas (<i>Hot List</i>).</p>

<p><b>NEWSie</b> est&aacute; disponible para ser bajado sin coste alguno 
desde cualquier sitio FTP.</p>

<p>Para m&aacute;s informaci&oacute;n, dirijirse a:<br>
John Rojewski<br>
e-mail:	<a href="rojewski@primenet.com">rojewski@primenet.com</a><br>
WWW: <a href="http://www.primenet.com/~rojewski/NEWSie.html">
http://www.primenet.com/~rojewski/NEWSie.html</a><br>
</p><br>

<h3>GENERAL</h3>
<p>Este es un intento de documentar las facilidades del <b>NEWSie</b>, un 
lector de noticias <i>UseNet</i> cliente para la serie de ordenadores 
Atari. <b>NEWSie</b> es un programa <b>GEM</b> con un aspecto 
gr&aacute;fico est&aacute;ndar incluyendo men&uacute;s, ventanas, cajas de 
di&aacute;logo y entrada desde el rat&oacute;n y teclado. Adem&aacute;s de 
lector <i>UseNet</i>, <b>NEWSie</b> soporta los protocolos de env&iacute;o 
y recepci&oacute;n de correo electr&oacute;nico <u>SMTP</u> y <u>POP3</u> 
respectivamente.</p>

<p>En este documento se han inclu&iacute;do los siguientes temas de 
inter&eacute;s:
<ol type="1">
<li><a href="#menus">MENUS</a></li>
<li><a href="#cajas de dialogo">CAJAS DE DIALOGO</a></li>
<li><a href="#ficheros">FICHEROS</a></li>
<li><a href="#opciones de inicio">OPCIONES DE INICIO</a></li>
</ol><br>

<ol type="1">
<li><a name="menus"><b><u>MENUS</u></b>

<p><b>Fichero</b><br>
<blockquote>
En este men&uacute; encontrar&aacute; las opciones de los grupos de 
noticias <i>Nueva ventana de grupos</i>, <i>Imprimir art&iacute;culo</i> y 
<i>Salir</i> del programa. La opci&oacute;n <i>Cerrar</i> ofrece la 
posibilidad de cerrar cualquier ventana que estuviera abierta en &eacute;se 
momento. La opci&oacute;n <i>Salvar como</i> ofrece la posibilidad de 
salvar la lista de los grupos de noticias, los nuevos art&iacute;culos o 
los mensajes del correo con un nombre diferente.
</blockquote></p>

<p><b>Editar</b><br>
<blockquote>
Este men&uacute; contiene todas las operaciones est&aacute;ndar de 
<i>Cortar</i>, <i>Copiar</i> y <i>Pegar</i>, que desde la versi&oacute;n 
0.82 est&aacute; implementada para algunas ventanas. Tambi&eacute;n tiene 
las opciones de <i>Limpiar</i>, <i>Buscar</i>, <i>Buscar siguiente</i> y 
<i>Ver detalles</i>.
</blockquote></p>

<p><b>News</b><br>
<blockquote>
Este men&uacute; contiene las opciones <i>Siguiente art&iacute;culo</i>, 
<i>Sig. referencia</i> y <i>Siguiente grupo</i>. Opciones adicionales dan 
la posibilidad da anunciar un mensaje y continuar los mensajes 
le&iacute;dos. La opci&oacute;n <i>Leer para Offline</i> da la posibilidad 
de leer todos los art&iacute;culos de todos los grupos a los que se ha 
suscrito (vea m&aacute;s abajo <u>Lectura de noticias en Offline</u>).
</blockquote></p>

<p><b>Correo</b><br>
<blockquote>
El soporte al correo esta disponible a trav&eacute;s de las opciones de 
este men&uacute;. <i>Enviar mensaje</i>, <i>Responder mensaje</i> y 
<i>Reenviar mensaje</i> est&aacute;n disponibles. La posibilidad de 
comprobar la existencia de correo, a trav&eacute;s de la opci&oacute;n 
<i>Comprobar el correo</i>, y la opci&oacute;n <i>Recoger el correo</i> que 
trae sus mensajes a su ordenador.<br>
<br>
La opci&oacute;n <i>Abrir buz&oacute;n entrada</i> presentar&aacute; una 
lista con los mensajes recibidos.<br>
<br>
La opci&oacute;n <i>Abrir buz&oacute;n de correo</i> permite la posibilidad 
de ver otros buzones, incluyendo el de salida (<u>OUTBOX</u>), que contiene 
una copia de todos los mensajes enviados a trav&eacute;s del <b>NEWSie</b>
</blockquote></p>

<p><b>FTP</b><br>
<blockquote>
Este men&uacute; contiene las opciones de subir y bajar ficheros de 
servidores FTP, y se divide en dos secciones. La primera est&aacute; 
dedicada a los servidores: <u>selecci&oacute;n</u>, <u>edici&oacute;n</u>, 
<u>inserci&oacute;n</u> y <u>borrado</u>. La segunda es para moverse a 
trav&eacute;s del sistema de directorios del servidor y recuperar, 
almacenar o borrar ficheros.
</blockquote></p>

<p><b>Especial</b><br>
<blockquote>
Este men&uacute; contiene algunas opciones adicionales, incluyendo la de 
recuperar la lista completa de grupos de noticias, y cualquier nuevo grupo. 
Est&aacute;n disponbles las opciones de conexi&oacute;n y 
desconexi&oacute;n manual al servidor de noticias. La &uacute;ltima 
opci&oacute;n (<i>Abrir URL</i>) permite la recuperaci&oacute;n de 
cualquier referencia Web (p&aacute;gina web-http, gr&aacute;ficos, etc) 
desde el propio <b>NEWSie</b>. Tambi&eacute;n dispone de la opci&oacute;n 
de extraer art&iacute;culos con ficheros vinculados en formato UUEncode. El 
fichero de registro se puede visualizar a trav&eacute;s de la opci&oacute;n 
<i>Ver fichero registro</i>.
</blockquote></p>

<p><b>Opciones</b><br>
<blockquote>
Este men&uacute; proporciona una amplia variedad de opciones que el usuario 
necesita para configurar el <b>NEWSie</b> y poder trabajar con su proveedor 
de servicios de Internet, y tambi&eacute;n permite al usuario definir 
algunas operaciones por defecto. La mayor&iacute;a de las opciones 
presentan una caja de di&aacute;logo.
</blockquote></p>

<p><b>Lectura de noticias desconectado del servidor</b><br>
<blockquote>
El <b>NEWSie</b> soporta esta opci&oacute;n desde la versi&oacute;n 0.60. 
La opci&oacute;n del men&uacute; <u>News</u> <i>Leer para Offline</i> 
permite leer todos los art&iacute;culos en todos los grupos de noticias 
indicado en la ventana de grupos de noticias suscrito. 
<b>Atenci&oacute;n</b>: hasta que est&eacute; familiarizado con el 
funcionamiento de este programa, el autor recomienda que limite el 
n&uacute;mero de grupos de noticias a diez y a un total de 100 
art&iacute;culos. El m&aacute;ximo n&uacute;mero de art&iacute;culos que 
puede gestionar es de 400 (&iexcl;si dispone de suficiente espacio en 
disco!).<br>
<br>
La opci&oacute;n <i>Leer para Offline</i> se usa mientras est&aacute; 
conectado al servidor y crear&aacute; un conjunto de ficheros y directorios 
en un directorio denominado <i>Directorio de Offline</i> (vea la 
opci&oacute;n <i>Directorios</i> del men&uacute; de <u>Opciones</u>). La 
tecla de <u>ESC</u>ape est&aacute; disponible, y la puede emplear para 
abortar esta operaci&oacute;n en cualquier momento.<br>
<br>
Despu&eacute;s de la lectura de los art&iacute;culos, salga del 
<b>NEWSie</b>, descon&eacute;ctese del servidor, y vuelva a entrar en el 
<b>NEWSie</b>. En este momento, usted podr&aacute; ver los art&iacute;culos 
guardados en el disco de la misma manera que si usted estuviera conectado 
al servidor. Con la tecla <b>[Delete]</b> podr&aacute; marcar para borrar 
los art&iacute;culos que desee, y se borrar&aacute;n en el momento en que 
cierre la ventana en la que aparecen todos los art&iacute;culos.<br>
<br>
El anunciar en modo <i>Offline</i> nuevos art&iacute;culos y el continuar 
los art&iacute;culos que est&aacute; leyendo es ahora posible. Estos 
art&iacute;culos son creados como el resultado del 
<u>Anuncio</u>/<u>Continuaci&oacute;n</u> seguido por un 
<u>Env&iacute;o</u> cuando no est&aacute; conectado al servidor de 
noticias. A la siguiente ocasi&oacute;n que se conecte al servidor, estos 
art&iacute;culos ser&aacute;n enviados y borrados del ordenador.<br>
<br>
Para ver los art&iacute;culos que est&aacute;n esperando a ser anunciados, 
use la opci&oacute;n <i>Abrir buz&oacute;n Offline</i> del men&uacute; 
<u>News</u>. Se abrir&aacute; el buz&oacute;n (si existe) y 
permitir&aacute; ver y editar los art&iacute;culos, y/o borrarlos antes de 
que sean enviados usando la tecla <b>[Delete]</b>.<br>
<br>
Actualmente no hay ning&uacute;n control de opciones para esta 
funci&oacute;n.
</blockquote></p><br>
</li>

<li><a name="cajas de dialogo"><b><u>CAJAS DE DIALOGO</u></b></a>

<p><b>Info personal...</b><br>
<blockquote>
Esta caja de di&aacute;logo permite la posibilidad de introducir 
informaci&oacute;n acerca del usuario. Los campos disponibles son:
<ul>
<li>Nombre completo.</li>
<li>Organizaci&oacute;n.</li>
<li>Direcci&oacute;n de correo.</li>
<li>Nombre cuenta - contiene su nombre de cuenta de correo 
electr&oacute;nico.</li>
</ul>
</blockquote></p>

<p><b>Direcc. servidor...</b><br>
<blockquote>
Esta caja de di&aacute;logo permite la posibilidad de que el usuario 
especifique informaci&oacute;n acerca del servidor de Internet que 
ser&aacute; usada para acceder al correo y las noticias. Los campos 
disponibles son:
<ul>
<li>Servidor News (noticias).</li>
<li>Servidor Mail (env&iacute;o de correo).</li>
<li>Servidor POP3 (recepci&oacute;n  de correo).</li>
<li>Conectar al empezar - conectarse al servidor de noticias nada 
m&aacute;s entrar.</li>
<li>Abrir grupos News al empezar.</li>
<li>M&aacute;ximo fuera de tiempo.</li>
<li>Desde el &uacute;ltimo car&aacute;cter.</li>
</ul>
</blockquote></p>

<p><b>Generales...</b><br>
<blockquote>
Esta caja de di&aacute;logo permite configurar otras opciones referentes a 
las ventanas, preferencias del lenguaje, etc. Entre otra opciones esta caja 
incorpora:
<ul>
<li>Ventanas con activaci&oacute;n autom&aacute;tica - si esta 
opci&oacute;n est&aacute; activada, cuando el puntero del rat&oacute;n pase 
por encima de una ventana que esta debajo de otra/s, &eacute;sta se 
activar&aacute; (se pondr&aacute; en primer plano), sin necesidad de pulsar 
el boton del rat&oacute;n. Esta funci&oacute;n no surte efecto con la 
ventana de estado si esta en primer plano, siendo en esta caso ignorada la 
activaci&oacute;n autom&aacute;tica. Esta activaci&oacute;n tarda 0.5 
segundos en surtir efecto. Si no se activa es opci&oacute;n, la 
activaci&oacute;n de las distintas ventanas se realiza con el 
rat&oacute;n.</li>
<li>Dada la amplia cantidad de opciones disponibles en esta caja de 
di&aacute;logo, dirigirse a ella para poder conocerlas.</li>
</ul>
</blockquote></p>

<p><b>Lectura noticias...</b><br>
<blockquote>
Esta caja de di&aacute;logo esta provista de una serie de opciones a 
trav&eacute;s de las cuales el programa <b>NEWSie</b> gestiona la 
presentaci&oacute;n de los art&iacute;culos de las <u>News</u> en la 
pantalla. Estas opciones son:
<ul>
<li>Ver las l&iacute;neas de la cabecera del art&iacute;culo.</li>
<li>M&aacute;ximo n&uacute;mero de art&iacute;culos a recoger.</li>
<li>Utilizar un visualizador externo.</li>
<li>Crear referencias.</li>
<li>Cortar referencias.</li>
<li>Ver los n art&iacute;culos m&aacute;s recientes.</li>
<li>Recoger los ar&iacute;culos para su lectura desconectado del 
servidor(Offline).</li>
<li>Borrar los art&iacute;culos despu&eacute;s de leerlos.</li>
</ul>
</blockquote></p>

<p><b>Lectura correo...</b><br>
<blockquote>
Esta caja de di&aacute;logo dispone de varias opciones para el 
almacenamiento y manipulaci&oacute;n del correo electr&oacute;nico. Estas 
opciones son:
<ul>
<li>Borrar el correo del servidor una vez recogido.</li>
<li>Ver las cabeceras de los mensajes.</li>
<li>Usar la palabra clave (<i>password</i>) para acceder al correo.</li>
<li>El campo del <i>password</i> (salvado en el fichero de 
preferencias).</li>
<li>Borrar el correo guardado al enviarlo.</li>
<li>Enviar el correo guardado al comprobar el buz&oacute;n.</li>
<li>Crear directorios de correo.</li>
</ul>
</blockquote></p>

<p><b>Mensajes...</b><br>
<blockquote>
Esta caja de di&aacute;logo proporciona al usuario a trav&eacute;s de una 
serie de opciones la forma para responder a los art&iacute;culos. Estas 
opciones son:
<ul>
<li>Responder v&iacute;a <i>Posting</i> (anuncio).</li>
<li>Responder al autor del art&iacute;culo v&iacute;a E-mail.</li>
<li>Enviar una copia a s&iacute; mismo.</li>
<li>A&ntilde;adir la firma al mensaje.</li>
<li>Indicar el caracter de cita.</li>
</ul>
</blockquote></p> 

<p><b>FTP...</b><br>
<blockquote>
Esta caja de di&aacute;logo se usa para seleccionar varias opciones 
referentes al <u>Protocolo de Transferencia de Ficheros</u> (<i>FTP</i>). 
Estas opciones son:
<ul>
<li>Enviar la orden <u>HELP</u> al conectar - una lista de &oacute;rdenes 
v&aacute;lidas son almacenadas en el fichero de registro si en la caja de 
di&aacute;logo de <i>Fichero registro...</i> se ha activado la 
opci&oacute;n de crear este fichero.</li>
<li>Dar la orden <i>Allocate</i> (reservar) antes de almacenar - envia el 
commando para reservar espacio para almacenar en el servidor. Algunos 
servidores ignoran este comando, y otros lo necesitan.</li>
<li>Tomar nota del &uacute;ltimo directorio - guarda el nombre del 
&uacute;ltimo directorio referenciado en el servidor (si esta opci&oacute;n 
est&aacute; seleccionada). Esta opci&oacute;n estaba activada por defecto 
en versiones anteriores del <b>NEWSie</b>. Salva el nombre del 
&uacute;ltimo directorio al que se accedi&oacute; para que en la 
pr&oacute;xima conexi&oacute;n autom&aacute;ticamente se vuelva a 
&eacute;l.</li>
</ul>
</blockquote></p>

<p><b>Directorios...</b><br>
<blockquote>
En esta caja de di&aacute;logo el usuario puede indicar los caminos de 
acceso en los cuales quiere tener guardados los ficheros, art&iacute;culos, 
etc, dentro del disco. Estas opciones son:
<ul>
<li>Directorio de trabajo.</li>
<li>Directorio del correo (E-mail).</li>
<li>Directorio de <i>Offline</i> (para lectura de las noticias).</li>
<li>Editor externo.</li>
<li>Visualizador externo.</li>
<li>Directorio de descarga de FTP.</li>
</ul>
<b><u>NOTA:</u></b> los t&iacute;tulos de los campos son seleccionables, 
para as&iacute; permitir tener la misma como si se seleccionas los 
directorios de los objetos que representa.
</blockquote></p>

<p><b>Fichero registro...</b><br>
<blockquote>
Esta caja de di&aacute;logo permite al usuario especificar cu&aacute;nta 
informaci&oacute;n quiere que el programa grabe durante su actividad en la 
recuperaci&oacute;n y la respuestas de los art&iacute;culos. En general, 
esta informaci&oacute;n en el fichero de registro puede ser interesante 
para algunos usuarios, y muchos usuarios quiz&aacute;s no tengan la 
necesidad de cambiar estas opciones. La selecci&oacute;n de <i>Datos del 
Registro</i> no es utilizable. <i>Ocultar palabras clave (passwords)</i> 
cambiar&aacute; todos los caracteres de la palabra clave por el 
car&aacute;cter asterisco '*' antes de acceder al servidor para prevenir 
exposiciones accidentales de sus palabras clave de acceso.
</blockquote></p>

<p><b>Firma...</b><br>
<blockquote>
Esta caja de di&aacute;logo permite al usuario a&ntilde;adir un sufijo a 
cualquier respuesta, mensaje o anuncio en forma de firma escogida por 
&eacute;l. El camino que se ve en la caja indica cu&aacute;l es el fichero 
con la firma actual, y a la vez aparecen las primeras l&iacute;neas del 
texto. Al pulsar en el nombre del fichero el usuario puede escoger una 
nueva firma. Al igual que en la caja de di&aacute;logo de 
<i>Directorios...</i> mencionado anteriormente, el t&iacute;tulo del campo 
con el nombre del fichero tambi&eacute;n es seleccionable, y tiene la misma 
funcionalidad.
</blockquote></p>

<p><b>Tipos de letra...</b><br>
<blockquote>
Esta caja de di&aacute;logo permite al usuario escoger la fuente de letra 
para el grupo de noticias, listado de los art&iacute;culos y cuerpo del 
art&iacute;culo. Para aquellos usuarios que dispongan de alguna 
versi&oacute;n del GDOS (inclu&iacute;do el NVDI), pueden escoger cualquier 
fuente y tama&ntilde;o de letra. A pulsar en la caja con la flecha a la 
derecha del nombre de la fuente aparecer&aacute; un men&uacute; desplegable 
con una lista de fuentes a escoger. Los botones con las flechas en esta 
lista permiten realizar un desplazamiento de la misma. Pulsando sobre 
cualquier nombre de fuente la seleccionar&aacute; para su uso.<br>
<br>
En el caso de que la fuente escogida no existiera e una 
configuraci&oacute;n en particular, se usar&aacute; la fuente del sistema 
que est&aacute; por defecto.
</blockquote></p>

<p><b>Estado de la transferencia</b><br>
<blockquote>
Esta caja de di&aacute;logo es una presentaci&oacute;n del estado del 
programa que da al usuario informaci&oacute;n sobre las transferencias que 
se realizan. Esta caja de estado esta disponible siempre que se est&aacute; 
recibiendo o enviando informaci&oacute;n a los servidores. Se puede 
inhabilitar deseleccionando la opci&oacute;n <i>Ver estado</i> en la caja 
de di&aacute;logo de <i>Lectura noticias...</i>. Esta caja de d&aacute;logo 
tambi&eacute;n se trata como una ventana, de este modo no deja bloqueado al 
sistema.
</blockquote></p>

<p><b>Aviso de todos los Grupos de Noticias</b><br>
<blockquote>
Esta caja de di&aacute;logo advierte al usuario que la transferencia puede 
tomar bastante tiempo y uso de espacio en disco.
</blockquote></p>

<p><b>Recarga de todos los Grupos de Noticias</b><br>
<blockquote>
Esta caja de di&aacute;logo permite al usuario la posibilidad de usar una 
lista completa de grupos de noticias existente o de tomar una nueva. El uso 
de una lista ya existente es m&aacute;s r&aacute;pido.
</blockquote></p>

<p><b>Nueva selecci&oacute;n de Grupos de Noticias</b><br>
<blockquote>
Esta caja de di&aacute;logo permite al usuario ver cualquier <b>Grupo de 
Noticias</b> que se haya creado a partir de una fecha indicada. Esto, en 
combinaci&oacute;n con la lista completa de los Grupos de Noticias, permite 
al usuario acceder a los nuevos grupos as&iacute; como a los que ya 
est&aacute;n disponibles.
</blockquote></p>

<p><b>Suscribirse a un Grupo de Noticias</b><br>
<blockquote>
Esta caja de di&aacute;logo aparece la siguiente serie de situaciones:
<ul>
<li>Una doble pulsaci&oacute;n del bot&oacute;n del rat&oacute;n en la 
ventana con la lista completa de Grupos de Noticias.</li>
<li>Una doble pulsaci&oacute;n del bot&oacute;n del rat&oacute;n en la 
ventana de nuevos Grupos de Noticias.</li>
<li>El opci&oacute;n <i>Suscribirse</i> del men&uacute; 
<i>Especial</i>.</li>
<li>La pulsaci&oacute;n de la tecla <b>[Insert]</b> en la ventana de Grupos 
de Nociticias Suscrito.</li>
</ul>
En los 2 primeros casos, el nombre del grupo ser&aacute; visible. Pulsando 
en el bot&oacute;n <i>OK</i> a&ntilde;adir&aacute; este grupo en el actual 
fichero de Grupos de Noticias a los que est&aacute; suscrito (por ejemplo 
<u>DEFAULT.GRP</u>, u otro). El 3r caso se puede usar en lugar de la doble 
pulsaci&oacute;n, pero tambi&eacute;n se puede usar en cualquier momento lo 
que permite al usuario introducir el nombre del Grupo de Noticias. Tenga en 
cuenta que si este nombre es inv&aacute;lido o no soportado por su servidor 
de noticias, el/la actual fichero/ventana de Grupos de Noticias a los que 
est&aacute; suscrito no ser&aacute; actualizado.
</blockquote></p>

<p><b>Desuscribirse de un Grupo de Noticias</b><br>
<blockquote>
Esta caja de di&aacute;logo aparece la siguiente serie de situaciones:
<ul>
<li>La opci&oacute;n <i>Anular suscripci&oacute;n</i> del men&uacute; 
<i>Especial</i>.</li>
<li>La pulsaci&oacute;n de la tecla <b>[Delete]</b> cuando est&eacute; 
abierta la ventana de Grupos de Noticias Suscrito.</li>
</ul>
En ambos casos, aparece la caja de di&aacute;logo <i>Retirar 
suscripci&oacute;n a este grupo</i> con el nombre del Grupo de Noticias que 
ha seleccionado. Pulsando el bot&oacute;n <i>OK</i> borrar este grupo de la 
ventana y del fichero de Grupos de Noticias a los que est&aacute; suscrito.
</blockquote></p>

<p><b>Editar apodos...</b><br>
<blockquote>
Esta caja de di&aacute;logo esta disponible para permitir el env&iacute;o 
de mensajes a personas con la que se tiene correspondencia frecuentemente, 
o para implementar una lista de correo de personas a quienes se desea 
enviar el mismo mensaje. Con una pulsaci&oacute;n en un campo vac&iacute;o 
(columna izquierda) puede a&ntilde;adir un apodo. <b><u>NO PONGA ESPACIOS 
EN BLANCO</u></b>, dado que todo lo que se encuentre detr&aacute;s del 
primer espacio ser&aacute; ignorado. Hay un campo para a&ntilde;adir una 
descripci&oacute;n del apodo. Para a&ntilde;adir una direcci&oacute;n de 
correo electr&oacute;nica al apodo, selecci&oacute;nelo con el 
rat&oacute;n y a continuaci&oacute;n un campo de <i>Direci&oacute;n</i> que 
est&eacute; vac&iacute;o (columna derecha), y rellene el campo con la 
direcci&oacute;n. Una vez completado, pulse el bot&oacute;n <i>OK</i> para 
guardar la inserci&oacute;n/modificaci&oacute;n, o <i>Salir</i> para 
abandonar esta caja de di&aacute;logo sin guardar ning&uacute;n cambio. Hay 
un l&iacute;mite para 100 entradas, que incluye apodos, descripciones y 
direcciones. En esta caja de di&aacute;logo solo se ven 
simult&aacute;neamente 30 apodos, o 30 direcciones por apodo.
</blockquote></p>

<p><b>Editar servidor</b><br>
<blockquote>
Esta caja de di&aacute;logo permite al usuario introducir un nuevo nombre 
de servidor FTP y la informaci&oacute;n necesaria para entrar en &eacute;l, 
o editar la informaci&oacute;n de un servidor ya introducido. Un ejemplo de 
lista de servidores se encuentra en el fichero <u>DEFAULT.SVR</u>. Se puede 
especificar un identificador de entrada o para aquellos servidores que 
permitan sesiones an&oacute;nimas la palabra <i>anonymous</i>. La palabra 
clave de acceso que se acepta en una conexi&oacute;n an&oacute;nima de FTP 
es la direcci&oacute;n electr&oacute;nica del usuario. El directorio de 
entrada se salva despu&eacute;s de cada sesi&oacute;n si as&iacute; se ha 
especificado en la caja de di&aacute;logo de <i>Opciones de FTP</i>, y si 
se desea se puede cambiar antes de abrir una conexi&oacute;n. Si el campo 
de identificaci&oacute;n de entrada est&aacute; vacio, se emplea 
<i>anonymous</i>. Si el campo de la palabra clave es el que est&aacute; 
vac&iacute;o, para una sesi&oacute;n an&oacute;nima se emplea la 
direcci&oacute;n electr&oacute;nica, o es el usuario el que introduce dicha 
palabra clave a trav&eacute;s de la correspondiente caja de di&aacute;logo 
si el identificador de entrada es cualquier otro. EL programa admite como 
m&aacute;ximo 30 entradas de servidores de FTP.
</blockquote></p>

<p><b>Teclas de funci&oacute;n...</b><br>
<blockquote>
Como parte de una petici&oacute;n de mejorar el soporte de atajos del 
teclado se incluy&oacute; esta caracter&iacute;stica que permite al usuario 
la selecci&oacute;n de cualquier funci&oacute;n del men&uacute; a 
trav&eacute;s de una de las 20 teclas de funci&oacute;n programables que 
hay en la parte superior del teclado. La opci&oacute;n <i>Teclas de 
funci&oacute;n...</i> en el men&uacute; <i>Opciones</i> presenta una caja 
de di&aacute;logo conteniendo texto editable.<br>
<br>
Esta caja de di&aacute;logo consiste en 2 columnas de 10 campos editables 
para que el usuario pueda introducir el texto de la funci&oacute;n del 
men&uacute; que desea que se ejecute cuando pulse la correspondiente tecla 
de funci&oacute;n. La comparaci&oacute;n entre el texto introducido y la 
entrada del men&uacute; es sensible a las 
may&uacute;sculas/min&uacute;sculas, salvo <i>salir</i> que funciona igual 
que <i>Salir</i>. Dicha comparaci&oacute;n se realiza para la longitud del 
texto introducido, es decir, si se introduce <i>s</i> se ejecutar&aacute; 
la opci&oacute;n del men&uacute; <i>Salir</i>.<br>
<br>
Esta provisto de los botones <i>OK</i> y <i>Cancela</i>, este &uacute;ltimo 
es el bot&oacute;n por defecto, y el primero salva los cambios realizados 
en un fichero de texto.
</blockquote></p>

<p><b>STiK no presente</b><br>
<blockquote>
Esta caja de di&aacute;logo aparece al arrancar el programa cuando el 
accesorio del <b>STiK</b> (o del <b>STinG</b>) no est&aacute; 
<i>activado</i>. Debe activar el STiK (o el STinG) y conectarse a su 
Proveedor de Servicios de Internet antes de que el <b>NEWSie</b> acceda a 
los nuevos art&iacute;culos.
</blockquote></p>
</li>

<li><a name="ficheros"><b><u>FICHEROS</u></b></a>

<p><b>Recursos</b><br>
<blockquote>
Para funcionar es necesario el fichero <b>NEWSIE.RSC</b>. Deber&aacute; de 
estar en el mismo directorio que el fichero <b>NEWSIE.PRG</b>. Este fichero 
contiene todas las definiciones de men&uacute;s y cajas de di&aacute;logo. 
en principio no existir&aacute; ninguna raz&oacute;n para que el usuario 
modifique este fichero de cualquier manera, salvo para su 
traducci&oacute;n. De esta forma ser&aacute; m&aacute;s f&aacute;cil el 
producir versiones de habla no inglesa del <b>NEWSie</b> con 
peque&ntilde;as o ninguna modificaci&oacute;n del programa.
</blockquote></p>

<p><b>Programa/s de ayuda</b><br>
<blockquote>
El programa <b>UUD.TTP</b> se incluye con el <b>NEWSie</b> desde la 
versi&oacute;n 0.54. Deber&aacute; de estar localizado en el directorio 
configurado como de trabajo. Este programa da el servicio de 
descodificaci&oacute;n de los datos en formato <u>UUE</u> en la 
recuperaci&oacute;n de mensajes. Estos datos codificados son generalmente 
ficheros binarios (dibujos, fotograf&iacute;as o programas). La 
opci&oacute;n <i>Extraer binarios</i> del men&uacute; <i>Especial</i> llama 
a este programa.<br>
<br>
Desde la versi&oacute;n 0.74 tambi&eacute;n se incluye el programa 
<b>MUNPACK.TTP</b>. Tambi&eacute;n deber&aacute; de estar localizado en el 
directorio de trabajo. Este programa da el servicio de la 
descodificaci&oacute;n de datos codificados en formato <u>MIME</u> (base 
64, etc). La opci&oacute;n <i>Extraer binarios</i> examinar&aacute; el 
fichero actual y seleccionar&aacute; este programa si en el art&iacute;culo 
o en el mensaje encuentra sentencias de control MIME. Muchas gracias al 
programador Jos den Bekker por este programa.
</blockquote></p>

<p><b>Preferencias</b><br>
<blockquote>
Es necesario el fichero <b>PREFS.INF</b> para el correcto funcionamiento 
del <b>NEWSie</b>. Hay un fichero PREFS.INF gen&eacute;rico en el paquete 
de distribuci&oacute;n. Es libre de usar este fichero como base para 
configurar el <b>NEWSie</b> a su gusto. Mire cada una de las cajas de 
di&aacute;logo accesibles a trav&eacute;s de las opciones del men&uacute; 
<i>Opciones</i> para especificar cualquiera de las opciones disponibles.<br>
<br>
Observe que el <b>NEWSie</b> actualizar&aacute; autom&aacute;ticamente su 
actual fichero PREFS.INF para incluir todos los par&aacute;metros 
m&aacute;s recientes cuando ejecute una versi&oacute;n m&aacute;s actual 
del <b>NEWSie</b>.
</blockquote></p>

<p><b>Grupos de noticias a los que est&aacute; suscrito</b><br>
<blockquote>
Es necesario el fichero <b>DEFAULT.GRP</b> para el correcto funcionamiento 
del <b>NEWSie</b>. Hay un fichero DEFAULT.GRP gen&eacute;rico en el paquete 
de distribuci&oacute;n. Puede a&ntilde;adirle nuevos Grupos de Noticias, y 
borrar aquellos a los que no est&eacute; interesado en suscribirse. Puede 
tener varios ficheros de Grupos de Noticias a los que est&eacute; suscrito, 
y usarlos alternativamente. El fichero DEFAULT.GRP ser&aacute; usado por el 
<b>NEWSie</b> en el arranque del programa. Un fichero GRP puede contener 
como m&aacute;ximo hasta 100 nombres de Grupos de Noticias.
</blockquote></p>

<p><b>Todos los Grupos de Noticias</b><br>
<blockquote>
El fichero <b>FULLGRP.TXT</b> es opcional. Esto es as&iacute; porque puede 
ser extremadamente grande, posiblemente ser m&aacute;s grande de 1 
MegaByte. Este fichero es recuperado desde el servidor de noticias 
seleccionado solamente si lo pide. Una vez recuperado, es empleado hasta 
que vuelve a pedirlo. Este fichero contiene una lista de todos los Grupos 
de Noticias que est&aacute; disponibles para la suscripci&oacute;n desde su 
servidor de noticias. Se crea un fichero <b>FULLGRP.IDX</b> cuando se 
ordena el fichero.
</blockquote></p>

<p><b>Buzones y correo</b><br>
<blockquote>
Se puede indicar un directorio para el correo en la caja de di&aacute;logo 
de <i>Opciones de selecci&oacute;n de directorios</i>. Dentro de este 
directorio el <b>NEWSie</b> montar&aacute; los buzones y los mensajes del 
correo. Los buzones de correo normalmente llevar&aacute;n la 
extensi&oacute;n <b>.MBX</b> (<i>MailBoX</i>), y los mensajes del correo 
tendr&aacute;n por nombre <b>MAILnnnn.TXT</b>, donde <i>nnnn</i> es un 
&uacute;nico n&uacute;mero comprendido entre el 0000 y el 9999, ambos 
inclusive. Un buz&oacute;n puede guardar un m&aacute;ximo de 100 mensajes. 
No hay l&iacute;mite del n&uacute;mero de buzones, excepto el espacio 
disponible en disco.
</blockquote></p>

<p><b>Registro</b><br>
<blockquote>
El fichero de registro es un fichero temporal creado por el <b>NEWSie</b> 
durante su funcionamiento. Este fichero es m&aacute;s interesante para el 
autor y para aquellas personas que quieran obtener m&aacute;s 
informaci&oacute;n acerca del trabajo del <b>NEWSie</b> y otros programas 
lectores de noticias del UseNet y las &oacute;rdenes asociadas, protocolos, 
etc. La caja de di&aacute;logo de <i>Opciones del fichero de registro</i> 
le permitir&aacute; configurar la informaci&oacute;n a poner dentro de este 
fichero. El fichero de registro es visualizable a trav&eacute;s de la 
opci&oacute;n <i>Ver fichero registro</i> del men&uacute; <i>Especial</i>.
</blockquote></p>

<p><b>Art&iacute;culos en <i>Offline</i></b><br>
<blockquote>
Si desea usar la caracter&iacute;stica de la lectura de noticias 
desconectado del servidor (<i>Offline</i>), deber&aacute; especificar un 
directorio de Offline (<b>OFFLINE</b> est&aacute; incluido en el paquete de 
distribuci&oacute;n). El <b>NEWSie</b> crear&aacute; un conjunto de 
directorios bajo el seleccionado en el directorio de Offline para cada 
grupo de noticias que puede tener los art&iacute;culos. Los nombres de 
estos directorios son una versi&oacute;n esquem&aacute;tica del nombre del 
Grupo de Noticias. Los art&iacute;culos son colocados en sus respectivos 
directorio en la misma forma que los art&iacute;culos (<b>NNNNNN.TXT</b>) 
le&iacute;dos estando conectado al servidor (<i>Online</i>) en ficheros 
separados.
</blockquote></p>

<p><b>Anuncios en Offline y continuaciones</b><br>
<blockquote>
Los art&iacute;culos se pueden salvar en ficheros cuyos nombres son 
<b>POSTNNNN.TXT</b> en el directorio de trabajo. Hay un fichero de 
&iacute;ndice para estos ficheros denominado <b>POSTS.PBX</b> (<i>PBX</i> 
es similar a <i>MBX</i>, pero su significado es <i>PostBoX</i>). Estos 
ficheros son creados como resultado de un 
<u>Anuncio</u>/<u>Continuaci&oacute;n</u> seguido por un 
<u>Env&iacute;o</u> cuando no se est&aacute; conectado al servidor de 
noticias. En la pr&oacute;xima ocasi&oacute;n que se conecte al servidor, 
estos ficheros ser&aacute;n transmitidos, y borrados del directorio de 
trabajo. Si antes de conectar con el servidor de noticias, decide detener 
alg&uacute;n anuncio, deber&aacute; usar la opci&oacute;n <i>Abrir 
buz&oacute;n Offline</i> en el men&uacute; News para volver a ver y/o 
borrar la ficheros problem&aacute;ticos v&iacute;a tecla <b>[Delete]</b>.
</blockquote></p>

<p><b>Apodos</b><br>
<blockquote>
El fichero <b>NICKNAME.TXT</b> se emplea para almacenar los apodos o alias 
y las direcciones. En futuras versiones, podr&aacute; escoger entre varios 
ficheros, y se podr&aacute;n cambiar las limitaciones de tama&ntilde;o.
</blockquote></p>

<p><b>Servidores FTP</b><br>
<blockquote>
EL fichero <b>DEFAULT.SVR</b> contiene varios nombres de servidores de FTP, 
algunos con la posibilidad de acceso de manera an&oacute;nima. El usuario 
es libre de a&ntilde;adir o borrar los servidores que escoja. El fichero 
puede guardar hasta 30 servidores.<br>
<br>
<b><u>NOTA:</u></b> Este fichero no soporta n&uacute;meros de puerto FTP no 
est&aacute;ndares.
</blockquote></p>

<p><b>Teclas de funci&oacute;n</b><br>
<blockquote>
El fichero <b>FKEYS.TXT</b> est&aacute; en el directorio del programa (por 
ejemplo, en el mismo directorio que el <b>NEWSie</b>). Este fichero es 
cargado en el arranque del programa y activado cuando el usuario pulsa una 
tecla de funci&oacute;n del <b>F1</b> al <b>F10</b>, o del <b>F11</b> al 
<b>F20</b> (<b>Shift F1</b> al <b>Shift F10</b>). El texto de la tecla es 
comparado con las opciones de todos los men&uacute;s de la barra, y si se 
ha encontrado, esa opci&oacute;n es ejecutada. Ejemplo:
<ul>
<li>F1&lt;tab&gt;Salir</li>
<li>F2&lt;tab&gt;Editar apodos...</li>
<li>...</li>
</ul>

Entre el <b>F1</b> y <b>Salir</b> hay un &uacute;nico caracter de 
tabulaci&oacute;n. Las teclas de funci&oacute;n son del <b>F1</b> al 
<b>F20</b>, ambas inclusive. Un ejemplo del fichero est&aacute; 
inclu&iacute;do en el fichero de distribuci&oacute;n. Las definiciones de 
las teclas de funci&oacute;n son editables a trav&eacute;s de la 
opci&oacute;n <i>Teclas de funci&oacute;n...</i> del men&uacute; 
<i>Opciones</i>.
</blockquote></p>

<p><b>Fichero HELP</b><br>
<blockquote>
Estos son ficheros de texto situados dentro del directorio <u>HELP</u> que 
puedes ser visualizados en cualquier momento pulsando la tecla 
<b>[Help]</b>. La ayuda est&aacute; basada en la ventana que se encuentra 
activa. Si no hay ninguna ventana, o la ventana de ayuda es la que 
actualmente est&aacute; activa, se presentar&aacute; el fichero de ayuda 
general.<br>
<br>
En la versi&oacute;n 0.68 y posteriores, el bot&oacute;n derecho del 
rat&oacute;n inicia el proceso de ayuda. Si su ordenador tiene la 
veri&oacute;n del AES 3.3 o posterior, aparecer&aacute; un men&uacute; tipo 
<i>PopUp</i> con opciones adicionales.
</blockquote></p>
</li>

<li><a name="opciones de inicio"><b><u>OPCIONES DE INICIO</u></b></a>
<p>El <b>NEWSie</b> iniciar&aacute; las siguientes caracter&iacute;sticas 
incluidas:
<ul>
<li><a href="#cab">Soporte para el programa cliente de Internet 
<b>CAB</b></a>.</li>
<li><a href="#newsgroups">Seleccionar un fichero de Grupos de Noticias al 
arrancar.</a></li>
<li><a href="#options">Seleccionar un fichero de opciones al 
arrancar.</a></li>
</ul><br>

<p><a name="cab"><b>Soporte para el programa cliente de Internet 
CAB</b></a><br>
<blockquote>
Con la introducci&oacute;n del <b>CAB 1.5</b>, viene la posibilidad de 
llamar a otros programas basados en el <u>URL</u> (<i>Uniform Resource 
Locator</i> o Localizador de Recursos Uniforme). <b>NEWSie</b> es lanzado 
tomando los URLs <i>news:</i>, pero nunca ha sido probado.<br>
<br>
Los siguientes URLs est&aacute;n soportados por el <b>NEWSie</b>:
<ul>
<li><i>news:</i> - el nombre de un grupo de noticias es el &uacute;nico 
par&aacute;metro soportado. La opci&oacute;n del identificado del mensaje 
<message-id> no est&aacute; actualmente soportado por el <b>NEWSie</b>.<br>
<br>
<b><u>NOTA:</u></b> un <i>message-id</i> contiene el caracter '@', y el los 
nombres de los grupos de noticias no.</li>
<li><i>ftp://</i> - los siguientes formatos est&aacute;n soportados:
<ul>
<li>ftp://dominio/directorio</li>
<li>ftp://id_usuario:palabra_clave@dominio/directorio</li>
</ul>
el primero es el denominado <i>an&oacute;nimo</i> y el segundo es el <i>no 
an&oacute;nimo</i>. En este segundo m&eacute;todo se necesita la 
identificaci&oacute;n del usuario y la palabra clave para el dominio. Es 
muy &uacute;til par su uso local, pero nunca se le ocurra ponerlo en las 
p&aacute;ginas Web, dado que podr&iacute;a ser visto por cualquier 
persona.</li>
<li><i>mailto:</i> - seguido de una direcci&oacute;n de correo 
electr&oacute;nica. Esta forma esta actualmente soportada dentro del 
<b>CAB</b>, pero se usa el <b>NEWSie</b>, la caracter&iacute;stica de copia 
del <u>OUTBOX</u> est&aacute; disponible, etc.<br>
<br>
Esta forma ha sido probada bajo el <u>TOS 4.0x</u>, pero <b>no</b> bajo 
<u>MagiC</u>, <u>Geneva</u>, etc.</li>
</ul>
<b><u>NOTA:</u></b> el <b>NEWSie</b> todav&iacute;a no soporta el protocolo 
<u>VA_START.</u>
</blockquote></p>

<p><a name="newsgroups"><b>Seleccionar un fichero de Grupo de Noticias al 
arrancar.</b></a><br>
<blockquote>
El <b>NEWSie</b> tiene la capacidad de ser arrancado con un fichero de 
grupo de noticias en particular. Si se ha definido como una 
<i>Aplicaci&oacute;n Desktop</i> para un fichero de tipo <i>.GRP</i>, el 
<b>NEWSie</b> usar&aacute; el fichero GRP espeficado con una doble 
pulsaci&iacute;on del bot&oacute;n izquierdo del rat&oacute;n en vez del 
fichero <b>DEFAULT.GRP.</b>
</blockquote></p>

<p><a name="options"><b>Seleccionar un fichero de opciones al 
arrancar</b></a><br>
<blockquote>
El <b>NEWSie</b> est&aacute; provisto de la capacidad para arrancar con un 
fichero de Opciones diferente del de <b>PREFS.INF</b> cuando cualquiera de 
los dos botones <b>[Shift]</b> se mantienen pulsados cuando arranca el 
programa. Este generar&aacute; un <i>Selector Carga de Fichero de 
Opciones</i>.<br>
<br>
<b><u>NOTA:</u></b> El fichero <b>PREFS.INF</b> es cargado el primero, 
entonces nuevamente se selecciona el fichero de opciones.<br>
<br>
Vea el fichero <b>IMPROVE.DOC</b> para numerar las mejoras sugeridas.<br>
<br>
Vea el fichero <b>HISTORY.DOC</b> para ver qu&eacute; es lo que se ha 
cambiado respecto a las veriones anteriores.<br>
<br>
Vea el fichero <b>WHATS.NEW</b> para ver qu&eacute; es lo que hay de nuevo 
en esta versi&oacute;n.
</blockquote></p>
</li>
</ol><br>

<a href="index.htm">Volver a men&uacute; principal.</a>
</body>
</html>