<html>
<head>
<title> Ayuda de la ventana del Buz&oacute;n </title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#0000ff">
<h1>Buz&oacute;n</h1>

<p>La ventana Buz&oacute;n del presenta el contenido de varios buzones de 
correo. El <b>NEWSie</b> viene con dos buzones predefinidos, el 
buz&oacute;n de entrada (<i>InBox</i>) y el buz&oacute;n de salida 
(<i>OutBox</i>). En el buz&oacute;n de entrada se encuentran todos los 
mensajes recibidos por la v&iacute;a de la opci&oacute;n <u>Recoger 
correo</u> del men&uacute; <u>Correo</u>. Despu&eacute;s de recoger el 
correo, seleccionando la opci&oacute;n <u>Abrir buz¢n entrada</u> 
aparecer&aacute;n los mensajes con la letra <b><u>U</u></b> en la primera 
columna, indicando que est&aacute;n sin leer.</p><br>

<h3>Uso con el rat&oacute;n:</h3>
<ul type="square">
<li>Con una pulsaci&oacute;n del bot&oacute;n izquierdo del rat&oacute;n 
sobre cualquier mensaje, &eacute;ste quedar&aacute; indicado.</li>
<li>Con una doble pulsaci&oacute;n del bot&oacute;n izquierdo del 
rat&oacute;n sobre cualquier mensaje abrir&aacute; una ventana presentando 
el contenido de dicho mensaje o llamar&aacute; a un visor externo 
(dependiendo de c&oacute;mo haya configurado el <b>NEWSie</b>).</li>
<li>Las funciones normales de las ventanas y la barra de 
desplazamiento.</li>
</ul><br>

<h3>Uso con el teclado:</h3>
<ul type="square">
<li>Con las teclas de cursor de subir y bajar selecciona un mensaje de la 
lista.</li>
<li>La tecla <b>[Return]</b> abre el mensaje escogido.</li>
<li>La tecla <b>[Delete]</b> marca el mensaje escogido para que &eacute;ste 
sea borrado en cuanto se cierre la ventana.</li>
<li>La tecla <b>[t]</b> iniciar&aacute; la <i>transferencia</i> del mensaje 
seleccionado de un buz&oacute;n a otro (incluyendo la creaci&oacute;n de 
uno nuevo). Para crear un nuevo buz&oacute;n, introduzca el nombre del 
buz&oacute;n seguido de la extensi&oacute;n <i>.MBX</i> en el selector de 
ficheros (por ejemplo <i>NUEVO.MBX</i>). (Por supuesto el nombre del 
buz&oacute;n puede ser cualquiera, pero el <b>NEWSie</b> solo ver&aacute; 
aquellos ficheros que tengan la extensi&oacute;n MBX por defecto)</li>
<li>La tecla <b>[e]</b> llamar&aacute; a un editor externo para editar el 
mensaje seleccionado.</li>
<li>Puede ordenar el buz&oacute;n de cualquiera de las tres maneras 
posibles:
<ul type="circle">
<li><b>[a]</b> - por autor.</li>
<li><b>[d]</b> - por fecha.</li>
<li><b>[s]</b> - por tema.</li>
</ul></li>
<li>Las teclas de cursor para subir y bajar junto con la tecla 
<b>[Shift]</b> desplazan una p&aacute;gina.</li>
</ul><br>

<p>Esta ventana tambi&eacute;n se empla para el buz&oacute;n <i>Offline</i> 
de la noticias, el cual contiene art&iacute;culos que se han incorporado o 
tra&iacute;do mientras est&aacute; desconectado del servidor, y que est n 
esperando a ser enviados al mismo.</p><br>

<p>Todas las teclas y acciones con el rat&oacute;n tienen una 
funci&oacute;n similar.</p><br>

<a href="index.htm">Volver a men&uacute; principal.</a>
</body>
</html>