<html>
<head><title>Documentation de Xport2</title></head>

<body BACKGROUND="../IMAGES/MARBLED.GIF" bgcolor="#FFFFFF" text="#004400" LINK="#884400" VLINK="#004488">
<center><b><FONT SIZE=+1>Mode d'emploi</FONT><b></center><P>
<TABLE BORDER=0 CELLPADDING=5 CELLSPACING=0>
<TR><TD><IMG SRC="../IMAGES/BLANC.GIF" ALT="" WIDTH=90 HEIGHT=1 BORDER=0></TD><TD VALIGN=TOP>
<P><BR>
<FONT SIZE=+1>Pr&eacute;ambule</FONT>
<UL>Xport2 est un logiciel de transfert de donn&eacute;es (textes) d&eacute;velopp&eacute; pour
Atari&nbsp;ST et Atari&nbsp;Portfolio.
<P>
Le transfert se fait par le port s&eacute;rie, il faut donc poss&eacute;der le module
"s&eacute;rie" du Portfolio.
<P>
D'autre part, un acc&eacute;l&eacute;rateur port s&eacute;rie du ST (type HSMODEM) permet
d'agrandir les buffers s&eacute;rie d'import-export et de s&eacute;curiser les transferts de
donn&eacute;es. HSMODEM est donc conseill&eacute;, mais pas indispensable.
<P>
Quelque soit le tpe de transfert que vous effectuez, c'est la machine qui importe qui doit
&ecirc;tre activ&eacute;e en premier et &ecirc;tre en attente de celle qui va envoyer les
donn&eacute;es.
<P>
Avant tout transferts, veillez bien &agrave; configurer les param&egrave;tres du port
s&eacute;rie du Portfolio et &agrave; <b>initialiser</b> ce port.</UL>
<P><BR>
<FONT SIZE=+1>Import&nbsp;: Portfolio vers ST</FONT>
<UL>R&eacute;glez la vitesse de transfert en bauds de part et d'autre.<P>
<LI>Sur le ST&nbsp;: lancez l'importation. Vous avez 2 modes&nbsp;: vous pouvez dans le premier
visualiser ce qui arrive et qui consomme beaucoup de temps machine, d'o&ugrave; perte d'octets
si votre Atari fait autre chose en m&ecirc;me temps (calcul POV ou module sonore). Dans le
seconde mode, vous importez &agrave; l'aveugle, sans affichage, d'o&ugrave; une plus grande
s&eacute;curit&eacute;.<P>
Quand l'importation est lanc&eacute;e, Xport2 scrute et r&eacute;cup&egrave;re toutes les
donn&eacute;es qu'il peut lire sur le port s&eacute;rie du ST. L'arr&ecirc;t se fait toujours
manuellement avec un clic souris.<P>
<LI>Sur le Portfolio&nbsp;: vous avez 2 modes d'envoi de vos fichiers. Le premier se fait sous
le DIP&nbsp;OS avec
<PRE>
copy fichier.txt aux
</PRE>
Le second se fait sous xterm1 que vous avez install&eacute; sur le Portfolio, lancez ce
programme, faites (F3 ou Shift+F3) et choisissez le nom du fichier &agrave; envoyer, puis
appuyez sur (Enter).
Le transfert se fait alors.
<P>
<LI>Sur le ST, cliquez pour terminer la r&eacute;cup&eacute;ration des donn&eacute;es et
sauvez-le avec le s&eacute;lecteur de fichier qui appara&icirc;t.</UL>
<P><BR>
<FONT SIZE=+1>Export&nbsp;: ST vers Portfolio</FONT>
<UL><LI>Sur le ST&nbsp;: charger le fichier &agrave; envoyer.
<P>
<LI>Sur le Portfolio&nbsp;: malheureusement, je n'ai r&eacute;ussi qu'&agrave; faire marcher
correctement l'export qu'avec xterm1, et seulement pour des textes. Donc lancez-le, faites
(Shift+F2), choisissez le nom de fichier o&ugrave; xterm1 vers sauver les donn&eacute;es, et faites (Enter).
<P>
<LI>Sur le ST&nbsp;: d&eacute;marrez l'export. Si tout va bien et si c'est du texte, xterm1
affiche ce qu'il re&ccedil;oit. L'export sur le ST se fait en t&acirc;che de fond.
L'arr&ecirc;t est automatique sur le ST (fin de fichier lu) ou manuel en cours de route
(cliquez sur l'option pr&eacute;vue).
<P>
<LI>Sur le Portfolio&nbsp;: quand vous voyez que tout a &eacute;t&eacute;
r&eacute;cup&eacute;r&eacute;, quittez avec (F1).
</UL>
</TD></TR></TABLE>
</TABLE>
</body>
</html>

