<html>
<head>
<title> Ayuda de la Agenda de direcciones </title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#0000ff">
<h1>Agenda de direcciones</h1>
<p>Esta ventana presenta la agenda de direcciones. Esta agenda contiene 
nombre, direcciones de correo e informaci&oacute;n adicional. Cada entrada 
puede ser introducida, actualizada o borrada. Adicionalmente un mensaje 
puede ser enviado al nombre escogido. El tama&ntilde;o de esta agenda de 
direcciones viene limitada por la memoria disponible.</p><br>
 <h3>Uso con el rat&oacute;n:</h3>
<ul type="square">
<li>Las funciones normales de las ventanas y la barra de 
desplazamiento.</li>
<li>Una pulsaci&oacute;n con el bot&oacute;n izquierdo del rat&oacute;n 
selecciona una entrada.</li>
<li>Una doble pulsaci&oacute;n del bot&oacute;n izquierdo del rat&oacute;n 
abre la caja de di&aacute;logo <i>Enviar/Responder/Reenviar</i> correo con 
el nombre y la direcci&oacute;n electr&oacute;nica escogida.</li>
</ul><br>

<h3>Uso con el teclado:</h3>
<ul type="square">
<li>Con la tecla <b>[Insert]</b> abrir&aacute; una caja de di&aacute;logo 
para introducir un nuevo nombre en la agenda. Esta entrada se 
salvar&aacute; en la <u>Agenda de direcciones</u>. La tecla <b>[Delete]</b> 
borrar&aacute; la entrada escogida y mover&aacute; la entradas de debajo 
suyo hacia arriba, actualiz&aacute;ndose la agenda.</li>
<li>La tecla <b>[?]</b> llamar&aacute; a la caja de di&aacute;logo para 
editar la entrada, incluyendo el nombre, la direcci&oacute;n y la 
informaci&oacute;n adicional.</li>
<li>La tecla <b>[s]</b> ordenar&aacute; la agenda por el apellido. Los 
nombres aparecer&aacute;n en el orden de nombre, primer apellido y segundo 
apellido. una vez conclu&iacute;da la ordenaci&oacute;n, la agenda 
ser&aacute; autom&aacute;ticamente actualizada.</li>
<li>La tecla <b>[f]</b> mover&aacute; la agenda hacia adelante o hacia 
atr&aacute;s al intentar encontrar el nombre de un usuario introducido en 
la caja de di logo.</li>
<li>La tecla <b>[Return]</b> abre la caja de di&aacute;logo 
<i>Enviar/Responder/Reenviar</i> con el nombre y la direcci&oacute;n 
escogida. Las teclas de cursor para subir y bajar seleccionan la entrada 
previa/siguiente.</li>
<li>Las teclas de cursor para subir y bajar junto con la tecla 
<b>[Shift]</b> desplazan una p&aacute;gina.</li>
<li>La tecla <b>[Home]</b> te lleva al principio de la agenda, y junto con 
la tecla <b>[Shift]</b> te lleva al final.</li>
</ul>
<a href="index.htm">Volver a men&uacute; principal.</a>
</body>
</html>