<html>
<head>
<title> Ayuda de la ventana de texto de los art&iacute;culos </title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#0000ff">
<h1>Ventana de texto de los art&iacute;culos</h1>
<p>La ventana de texto de art&iacute;culo presenta un art&iacute;culo de 
una noticia. El art&iacute;culo contiene una cabecera y el cuerpo del 
mensaje. La cabecera tiene las l&iacute;neas: <u>Autor</u>, <u>Tema</u>, 
<u>Fecha</u>, etc. El cuerpo tiene el mensaje de respuesta introducido por 
el autor. Cada art&iacute;culo le&iacute;do esta disponible en su disco 
como <i>NNNNNN.TXT</i>, donde <u>NNNNNN</u> es el n&uacute;mero del 
art&iacute;culo. Estos fichero puede ser borrados con s&oacute;lo 
seleccionarlos y pulsar la tecla <b>[Delete]</b> dentro de la ventana. De 
esta forma se proporciona un m&eacute;todo para evitar la 
acumulaci&oacute;n de mensajes no solicitados.</p><br>

<h3>Uso con el rat&oacute;n:</h3>
<ul type="square">
<li>Las funciones normales de las ventanas y la barra de 
desplazamiento.</li>
<li>Una pulsaci&oacute;n con el bot&oacute;n izquierdo del rat&oacute;n en 
un enlace <u>URL</u> (subrayado y de color azul) iniciar&aacute; un intento 
de recuperar y presentar en la ventana del navegador la p&aacute;gina Web a 
la que apunta el enlace.</li>
</ul><br>

<h3>Uso con el teclado:</h3>
<ul type="square">
<li>Las teclas del cursor para subir y bajar desplazan una l&iacute;nea de 
texto.</li>
<li>Las teclas de cursor para subir y bajar junto con la tecla 
<b>[Shift]</b> desplazan una p&aacute;gina.</li>
<li>La tecla <b>[Delete]</b> borra de manera inmediata el 
art&iacute;culo.</li>
</ul><br>

<p>Si prefiere usar un programa como visor externo en vez de una ventana 
del propio <b>NEWSie</b>, puede indicar uno desde la caja de di&aacute;logo 
de <i>Opciones de selecci&oacute;n de directorios</i> (Visualizador 
externo). Una vez hecho, seleccionar la opci&oacute;n <i>Usar visualizador 
externo</i> de la caja de di&aacute;logo de <i>Opciones de lectura de las 
noticias</i>, lo cual provocar&aacute; que el <b>NEWSie</b> llame al 
programa externo pas&aacute;ndole como par&aacute;metro el nombre del 
fichero del art&iacute;culo.</p>
<a href="index.htm">Volver a men&uacute; principal.</a>
</body>
</html>