<html>
<head>
<title> Ayuda de la ventana de Lista nuevos grupos noticias </title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#0000ff">
<h1>Ayuda Lista nuevos grupos noticias</h1>

<p>  La ventana Lista nuevos grupos noticias presenta una lista de grupos de 
  noticias creada despu&eacute;s de una fecha y hora dada. Dicha fecha y hora ha de 
  ser introducida por el usuario en la caja de di&aacute;logo. Esta lista puede 
  estar relacionada y cualquier nombre de grupo de noticias puede ser 
  seleccionado, y suscribirse tambi&eacute;n. Cuando se ha realizado la suscripci&oacute;n, 
  el nombre del grupo de noticias es a&ntilde;adido a la ventana de Grupos de 
  noticias suscrito, e inmediatamente est&aacute; disponible para su uso. Una doble 
  pulsaci&oacute;n del bot&oacute;n izquierdo del rat&oacute;n, o escogiendo la opci&oacute;n <i>Suscribirse </i>
  del men&uacute; <i>Especial</i> de la barra de men&uacute;s realiza la funci&oacute;n de suscripci&oacute;n.</p>

<p>  Si tiene suficiente memoria, en ella se llevar  a cabo la ordenaci&oacute;n de la 
  lista. Esta acci&oacute;n borrar  informaci&oacute;n extra&ntilde;a del fichero <u>NEWGRP.TXT</u> (con 
  el objeto de reducir su tama&ntilde;o) y crear  un fichero <u>NEWGRP.IDX</u> que se 
  emplear  para reducir el tiempo empleado en desplazarse por el fichero.</p><br>


<h3>  Uso con el rat&oacute;n:</h3>
<ul type="square">
<li>  Una pulsaci&oacute;n del rat&oacute;n selecciona (queda indicado con otro color) el 
  grupo de noticias.</li>
  
<li>  Una doble pulsaci&oacute;n llamar  a la caja de di&aacute;logo <i>¿Suscribirse a este 
  grupo?</i>, para suscribirse al grupo de noticias elegido y llevarlo a la 
  ventana de <i>Grupos de noticias suscrito</i>.</li>
    
<li>  Las funciones normales de las ventanas y la barra de desplazamiento.</ii>
</ul><br>
  
    
<h3>  Uso con el teclado:</h3>
<ul type="square">
<li>  Las teclas de cursor para subir y bajar desplazan una l&iacute;nea, y junto con la 
  tecla <b>[Shift]</b> desplazan una p&aacute;gina.</li>

<li>  <b>[s]</b> llamar&aacute; a la caja de di&aacute;logo de <i>Buscar</i> para buscar el siguiente 
      grupo de noticias que m&aacute;s se parezca en la lista. (No se poduce 
      un desplazamiento del contenido de la ventana)</li>
      
<li><b>[m]</b> llamar&aacute; a la caja de di&aacute;logo <i>Iguales</i> en la que presentar&aacute; todos los 
      grupos de noticias que sean iguales a la clave introducida. (No se 
      poduce un desplazamiento del contenido de la ventana)</li>
</ul><br>

<a href="index.htm">Volver a men&uacute; principal.</a>
</body>
</html>