<html>
<head>
<title> Ayuda de la ventana de grupos de noticias suscrito </title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#0000ff">
<h1>Ayuda grupos de noticias suscrito</h1>

<p>La ventana de grupos de noticias suscrito presenta dichos grupos que 
  ha escogido para tomar nota de los nuevos art&iacute;culos. Un grupo de 
  noticias es un &aacute;rea de mensajes sobre un tema concreto.</p>

<p>Hay miles de grupos de noticias, y no todos los servidores de 
  noticias (<u>Proveedor</u> <u>de</u> <u>Servicios</u> <u>de</u> <u>Internet</u> -PSI- o <i>ISP</i> en ingl&eacute;s) 
  pueden ofrecerlos todos. Puede introducir manualmente el nombre de un 
  grupo de noticias al cual est&aacute; interesado en ver, o con una 
  combinaci&oacute;n de las ventanas <i>lista completa grupos noticias</i> y <i>nuevos 
  grupos de noticias</i>, podr&aacute; suscribirse a m&aacute;s grupos.</p>

<p>Si su PSI no dispone de un grupo de noticias en particular en la lista de 
  grupos de noticias suscrito, &eacute;ste estar&aacute; marcado con el car&aacute;cter <i>?</i>
  en la primera columna de la ventana. Puede seleccionar este grupo 
  pero lo &uacute;nico que puede hacer es desuscribirse.</p><br>

<h3>Uso con el rat&oacute;n:</h3>
<ul type="square">
<li>Una pulsaci&oacute;n del rat&oacute;n selecciona (queda indicado con otro color) el 
  grupo de noticias.</li>

<li>Una doble pulsaci&oacute;n del bot&oacute;n del rat&oacute;n iniciar&aacute; la operaci&oacute;n 
  de recuperaci&oacute;n de la lista de art&iacute;culos del grupo de noticias en 
  cuesti&oacute;n y abrir&aacute; la ventana de vista general de art&iacute;culos hasta 
  completarla.
</ul><br>

    
<h3>Uso con el teclado:</h3>
<ul type ="square">
<li>Con la tecla <b>[Return]</b> iniciar&aacute; la operaci&oacute;n de recuperaci&oacute;n de la 
  lista de art&iacute;culos del grupo de noticias en cuesti&oacute;n y abrir  la 
  ventana de vista general de art&iacute;culos hasta completarla.</li>

<li>La tecla <b>[Insert]</b> llamar&aacute; a la caja de di&aacute;logo con el campo del nombre 
  vac&iacute;o.</li>

<li>La tecla <b>[Delete]</b> llamar&aacute; a la caja de di&aacute;logo de cerrar suscripci&oacute;n 
  para el grupo de noticias seleccionado, o con el campo del nombre del 
  mismo vac&iacute;o si no se ha seleccionado ninguno.</li>

<li>La tecla <b>[?]</b> llamar  a la caja de di&aacute;logo de <i>Editar grupo de noticias</i> para 
  permitir la edici&oacute;n de los n&uacute;meros del primero y el &uacute;ltimo art&iacute;culo.</li>
</ul><br>

<a href="index.htm">Volver a men&uacute; principal.</a>
</body>
</html>