<html>
<head>
<title> Ayuda de la ventana de listado de art&iacute;culos
 </title>
</head>
<body bgcolor="#ffffff" text="#000000" link="#0000ff">
<h1>Ayuda listado de art&iacute;culos</h1>

<p>Para cualquier grupo de noticias dado, la selecci&oacute;n del mismo v&iacute;a doble 
  pulsaci&oacute;n del bot&oacute;n izquierdo del rat&oacute;n o la pulsaci&oacute;n de la tecla <b>[Return]</b> 
  en la ventana de <i>Grupo de noticias suscrito</i> iniciar&aacute; la toma de la lista de 
  art&iacute;culos de noticias del servidor. Dicha lista es presentada en una 
  ventana. Esta lista tiene el siguiente formato:
<ul type="disc">
<li>N&uacute;mero de art&iacute;culo</li>
<li>Tema</li>
<li>Autor</li>
<li>Fecha de env&iacute;o</li>
<li>N&uacute;mero de l&iacute;neas del texto del mensaje</li>
</ul></p><br>

<p>Se puede selecionar cualquiera de los art&iacute;culos de esta lista, ya sea con 
  el rat&oacute;n o con las teclas de cursor del teclado. Cuando se ha escogido un 
  art&iacute;culo, &eacute;ste es presentado en color rojo. En caso de usar una resoluci&oacute;n 
  monocrom&aacute;tica, esta selecci&oacute;n se indica con un subrayado.</p>

<p>Se reconocen la referencias de los art&iacute;culos. Estas referencias son un 
  grupo de art&iacute;culos relacionados entre s&iacute;, y est&aacute;n marcados con el signo '+' 
  para el primero de ellos, y con el signo '-' para el/los siguiente/s. Estas 
  referencias se les da el formato dependiendo de c&oacute;mo est&aacute; configuradas las 
  opciones de lectura de noticias <i>Crear referencia</i> y <i>Cortar referencia</i>. 
  Si no esta seleccionada la opci&oacute;n <i>Crear referencia</i>, no se realiza el 
  procesado de las referencias y los art&iacute;culos se ver&aacute;n en orden num&eacute;rico 
  ascendente. Si en cambio esta opci&oacute;n est&aacute; seleccionada, se ver&aacute;n tanto el 
  primer art&iacute;culo como los siguientes. Si est&aacute; seleccionada la opci&oacute;n <i>Cortar 
  referencia</i>, s&oacute;lo se ver&aacute; el primer art&iacute;culo</p><br>

<h3>Uso con el rat&oacute;n:</h3>
<ul type="square">
<li>Una doble pulsaci&oacute;n del bot&oacute;n del rat&oacute;n iniciar&aacute; la recogida del art&iacute;culo 
  seleccionado del servidor de noticias.</li>

<li>Una sola pulsaci&oacute;n selecciona el art&iacute;culo (queda indicado con otro  color).</li>
  
<li>Las funciones normales de las ventanas y la barra de desplazamiento.</li>
</ul><br>  

<h3>Uso con el teclado:</h3>
<ul type="square">
<li>La tecla <b>[Return]</b> iniciar&aacute; la recogida del art&iacute;culo seleccionado del 
  servidor de noticias.</li>

<li>Las teclas de cursor para subir y bajar junto con la tecla <b>[Shift]</b> 
  desplazan una p&aacute;gina.</li>
  
<l>Las teclas de cursor para subir y bajar seleccionan (cambia de color) el 
  art&iacute;culo que esta encima o debajo del art&iacute;culo escogido, y lo selecciona.</li>

<li>Las teclas de cursor para ir hacia la izquierda o hacia la derecha 
  controlan la expansi&oacute;n/corte de las referencias individuales. Seleccionando 
  el primer art&iacute;culo y pulsando la tecla de cursor hacia la derecha 
  presentar&aacute; todos los art&iacute;culos referenciados al primero. Pulsando la tecla 
  de cursor para ir hacia la izquierda en el primer art&iacute;culo o cualquiera de 
  los siguientes, cortar&aacute; la referencia justo donde est&aacute el primer art&iacute;culo.</li>
 
<li>La tecla de cursor para ir hacia la derecha cortar&aacute; una referencia.</li>

<li>La tecla de cursor para ir hacia la izquierda expandir&aacute; una referencia.</li>

<li>Pulsando la tecla <b>[c]</b> permitir&aacute; la cancelaci&oacute;n de un anuncio previamente 
  creado por usted. Esta orden ser&aacute; ignorada si el art&iacute;culo no ha sido 
  anunciado.</li>
</ul><br>

<a href="index.htm">Volver a men&uacute; principal.</a>
</body>
</html>