<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Super Stacy
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0306.htm" target="UDOcon"><img src="udo_up.gif" alt="Stacy" border=0 width="24" height="24"></a>
<a href="030603.htm" target="UDOcon"><img src="udo_lf.gif" alt="Stacy Ram Expansion" border=0 width="24" height="24"></a>
<a href="030605.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stacy 10Mhz" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Super_20Stacy">3.6.4 Super Stacy</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Super-<a href="0306.htm" target="UDOcon">Stacy</a> </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><b> ACHTUNG: </b>
<br>
</p>
<p>Den Text bitte einmal komplett lesen, bevor man sich ans Werk
macht, damit man absch&auml;tzen kann ob man es kann oder nicht!!!
<br>
</p>
<p>
<br>
<br><b> Einleitung </b>
<br>
</p>
<p>Angeregt durch eine Diskussion im MausNet, vor ein paar Jahren, in
deren Verlauf Steffen Engel vom Einbau einer <a href="http://www.wrsonline.de/" target="_top">PAK</a> berichtete, wagte
ich es ebenfalls mir eine Super <b><a href="0306.htm" target="UDOcon">Stacy</a></b> zu bauen. Zumal bei mir
zu Hause noch eine <b><a href="0306.htm" target="UDOcon">Stacy</a></b> arbeitslos in der Ecke rumstand.
<br>
</p>
<p>Eins vorweg, wer das Ganze nachbauen m&ouml;chte, dem sei gesagt,
da&szlig; der Umbau alles andere als trivial ist, gute L&ouml;t- und
vor allem Entl&ouml;t-Kenntnisse sind gefragt, wer zwei linke
H&auml;nde hat, sollte die Finger davon lassen und jemand fragen, der
was davon versteht, denn selbst mit einer linken und einer rechten
Hand ist es manchmal, alles andere als einfach.
<br>
</p>
<p>Ich &uuml;bernehme auch keinerlei Verantwortung, sollte sich
jemand beim nachbauen seine <b><a href="0306.htm" target="UDOcon">Stacy</a> </b> oder andere Dinge
schreddern!
<br>
</p>
<p>Au&szlig;erdem werde ich keinerlei Fragen im Zusammmenhang mit dem
Umbau beantworten, dieser Text ist f&uuml;r erfahrene
L&ouml;tkolbenartisten gedacht und soll nur dazu dienen den Umbau
etwas zu erleichtern.
<br>
</p>
<p>Email-Anfragen zu diesem Thema werden von mir ungelesen
gel&ouml;scht!
<br>
</p>
<p>Auch f&uuml;r jemand der sich die M&ouml;glichkeit offen halten
will, die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> irgend wann mal wieder in den Ursprungszustand
zur&uuml;ckzubauen, ist das Ganze nichts, da ziemlich rabiat mit dem
Geh&auml;use umgegangen wird.:)
<br>
</p>
<p>Man sollte sich f&uuml;r den Umbau auf jeden Fall, sehr viel Zeit
nehmen und entsprechend sorgf&auml;ltig arbeiten, denn, mal eben die
<b><a href="0306.htm" target="UDOcon">Stacy</a> </b> aufr&uuml;sten ist nicht!
<br>
</p>
<p>Ich beschreibe hier verschiedene Sachen die ich mir aus diversen
Hypertexten und Dokus zusammengesucht habe, soda&szlig; ich darauf
nicht n&auml;her eingehen werde, sondern nur Quellen angebe, schon
alleine aus dem Grund, da diverse Basteleien nicht auf meinem Mist
gewachsen sind und mit Copyrights belegt sind.
<br>
</p>
<p>Im einzelnen werde ich beschreiben, wie man die <b><a href="0306.htm" target="UDOcon">Stacy</a> </b>
&uuml;berhaupt aufkriegt (das reicht eigentlich schon f&uuml;r einen
einzelnen Artikel;-), Bearbeiten des Geh&auml;uses, das Verlegen des
<b><a href="0306.htm" target="UDOcon">Stacy</a> </b> Netzteils, Einbau der <a href="http://www.wrsonline.de/" target="_top">PAK</a> und Einbau einer dickeren
Festplatte.
<br>
<br>
<br>
</p>
<p>Als erstes sollte man sich einmal sein Arbeitsger&auml;t
zusammensuchen, unerl&auml;&szlig;lich dabei sind folgende Sachen:
<br>
</p>
<p>
<br>
<br>
</p>
<p><b>Werkzeug: </b>
<br>
</p>
<p>Multimeter!
<br>Feiner L&ouml;tkolben
<br>Feines L&ouml;tzinn
<br>Kleinen Seitenschneider
<br>diverse Schraubenzieher
<br>kleine Flachzange
<br>Hei&szlig;klebepistole
<br>
</p>
<p>
<br><b>Bauteile:</b>
<br>
</p>
<p>64-polige Pr&auml;zisionsfassung
<br>Buchsen-, und Pfostenleisten
<br>5V Positiv-Spannungsregler 2A (78S05)
<br>evtl. Parit&auml;tsgenerator (74F280)
<br>evtl. 33 Ohm Widerstand
<br>Schaltlitze, diverse St&auml;rken
<br>
<br>
</p>
<p><b>Sonstiges:</b>
<br>
</p>
<p>Klebe- bzw. Isolierband
<br>evtl. Schrumpfschlauch
<br>Pappe
<br>Nerven
<br>ruhiges H&auml;ndchen
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Das &ouml;ffnen der <a href="0306.htm" target="UDOcon">Stacy</a> </b>
<br>
<br>
</p>
<div align=center>**** Als allererstes wird die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> vom Netz getrennt!
****
<br>
</div>
<p>
<br>
</p>
<p>Dann dreht man die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> um und schraubt alle
Kreuzschlitzschrauben aus dem Boden, ebenfalls die an der
R&uuml;ckseite befindlichen Schrauben, dann dreht man die
<b><a href="0306.htm" target="UDOcon">Stacy</a></b> wieder um.
<br>
</p>
<p>Das gro&szlig;e Geheimnis beim &ouml;ffnen der <b><a href="0306.htm" target="UDOcon">Stacy</a></b> ist
das Schild auf dem aufgeklappten LC-Display (s. Bilder), dieses sollte
man mit einem spitzen Gegenstand vorsichtig abheben und beiseite
legen, kann man sp&auml;ter wieder aufkleben. Darunter befinden sich
zwei Kreuzschlitzschrauben (rote Pfeile), die es gilt heraus zu
schrauben. Danach kann man mit einem Schraubenzieher versuchen den
Displaydeckel vorsichtig abzuhebeln, nicht mit zuviel Gewalt, dann
brechen die Haltelaschen ab, aber auch nicht zu zaghaft, dann bekommt
man es nicht auf.:)
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/display1.gif" border=0 width="385" height="413"></p><br>
<p align=center><img src="image/display2.gif" border=0 width="358" height="413"></p><br>
<div align=center><tt> Die Displayschrauben </tt>
</div>
<p>
<br>
<br>
</p>
<p>Nun hat man das innenleben des Displays vor sich, nun sollte man
erstmal die Halteschiene, die von oben nach unten &Uuml;ber das
Display geschraubt ist, abschrauben (s. Bilder, alles was es
abzuschrauben gilt ist mit blauen Pfeilen gekennzeichnet). Dann
vorsichtig alle Kabel die von rechts aus dem Geh&auml;use kommen
abziehen (rote Pfeile), bei meiner <b><a href="0306.htm" target="UDOcon">Stacy</a></b> war es kein Problem
die Kabel ohne es sich vorher gemerkt zu haben, wieder aufzustecken,
da die <a href="0f0b.htm" target="UDOcon">Stecker</a> alle unterschiedlich sind und sich nur in einer
Richtung wieder aufschieben lassen. Wie das bei anderen <b>Stacys</b>
aussieht, wei&szlig; ich nat&uuml;rlich nicht, also vor dem abziehen
genau hinschauen, ob man sich vielleicht besser vorher was
aufschreibt. Jetzt kann man das rechte Gelenk, das mit zwei Schrauben
befestigt ist und gleichzeitig als Durchf&uuml;hrung f&Uuml;r den
Displaykabelbaum dient, abschrauben. Am besten schraubt man auch das
linke Gelenk ab, um das komplette Display zu entfernen, aber vorsicht
nicht unbedingt im zugeklappten Zustand abschrauben, Federspannung!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/dspl_opn.gif" border=0 width="583" height="387"></p><br>
<div align=center><tt> Ge&ouml;ffnetes <a href="0306.htm" target="UDOcon">Stacy</a> Display </tt>
</div>
<p>
<br>
<br>
</p>
<p>Danach kann man dann vorsichtig den gesamten oberen Deckel wieder
mit der Schraubenziehermethode auseinander hebeln. Die Kabel lassen
sich jetzt relativ leicht durch das Loch ziehen und man kann den
kompletten Deckel entfernen.
<br>
</p>
<p>
<br>
<br><b><a href="0306.htm" target="UDOcon">Stacy</a> ausweiden </b>
</p>
<p><b>ACHTUNG:</b> Nun kommt noch eine kleine H&uuml;rde bei der man
&auml;u&szlig;erste, absolute Vorsicht walten lassen sollte, das
Abklemmen der Tastatur!
<br>
</p>
<p>Die Tastatur ist mit einem St&uuml;ck Folienkabel mit der
Tochterplatine verbunden, dieses kleine st&uuml;ckchen Plastik
enth&auml;lt aufgedampfte Leiterbahnen und darf auf keinen Fall
geknickt werden!!! Sollte das passieren, braucht man nicht mehr weiter
zu lesen, dann kann man die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> fast wegwerfen, da weder an
die Folie noch an die Tastatur leicht heranzukommen ist!!!
</p>
<p>M&ouml;glicherweise gibt es Tastaturen noch bei <a href="http://www.best-electronics-ca.com/" target="_top">Best-Electronics</a> , also
nochmal Vorsicht!
<br>Man sollte die Tastatur vorsichtig an den hinteren Kanten anheben
und nach vorne klappen, nun zieht man die Verriegelung des Steckers in
dem die Folie auf der Tochterplatine steckt vorsichtig nach vorne,
dann fa&szlig;t man die Folie an der Verdickung (und nur dort!) an und
zieht sie vorsichtig heraus, danach legt man die Tastatur an einen
sicheren Platz mit der Folie nach oben.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tast_stk.gif" border=0 width="637" height="322"></p><br>
<div align=center><tt> Tastaturstecker der <a href="0306.htm" target="UDOcon">Stacy</a> </tt>
</div>
<p>
<br>
<br>
</p>
<p>Auf dem Bild ist der Tastaturstecker zu erkennen, man kann daran
sehen wie der <a href="0f0b.htm" target="UDOcon">Stecker</a> &quot;bedient&quot; werden mu&szlig;. Weiterhin
ist zu erkennen, da&szlig; die Fixierungen f&uuml;r den Tragegriff
herausgeschraubt wurden, dadurch wird beim sp&auml;teren Zusammenbau,
das Einstecken der Tastaturfolie wesentlich erleichtert.
<br>
</p>
<p>So, jetzt hat man das Gr&ouml;bste hinter sich.:) Nun entfernt man
noch den Blechkasten, entkabelt Floppy und Festplatte und schraubt den
Kasten in dem sich beide befinden, los und nimmt ihn heraus.(!nl)
</p>
<p>Jetzt hat man die offene <b><a href="0306.htm" target="UDOcon">Stacy</a></b> vor sich liegen, nun kann
man das <a href="10.htm" target="UDOcon">Netzteil</a> und den &quot;SCSI-Host Adapter&quot; vorsichtig
herausnehmen. Um das <a href="10.htm" target="UDOcon">Netzteil</a> jedoch komplett von der Platine zu
bekommen, mu&szlig; noch das Kabel am Einschalter abgel&ouml;tet
werden. Au&szlig;erdem mu&szlig; noch der <a href="0f0b.htm" target="UDOcon">Stecker</a> der zum LC-Display
f&uuml;hrt abgezogen werden, diesen sollte man bei einem Test auf gar
keinen Fall vergessen wieder einzustecken!! Unter dem <a href="10.htm" target="UDOcon">Netzteil</a>
befindet sich schwarz und 64-polig der 68000er, dem wir uns
sp&auml;ter widmen werden. Es gilt nun noch diverse Schrauben zu
entfernen, den Trackball mit der selben Methode wie die Tastatur
abzuklemmen und danach kann man dann die Platine vorsichtig
herausnehmen.
<br>
</p>
<p>
<br>
<br><b> Batteriefach bearbeiten </b>
<br>
</p>
<p>Bevor jedoch jetzt der L&ouml;tkolben geschwungen wird, gilt es
noch etwas Bastelarbeit zu verrichten, als erstes mu&szlig; das
Batteriefach aus dem oberen Teil des Geh&auml;uses herausgetrennt
werden, weil sp&auml;ter an diese Stelle das <a href="10.htm" target="UDOcon">Netzteil</a> wandert. Wer
jetzt meint, da&szlig; er seine <b><a href="0306.htm" target="UDOcon">Stacy</a></b> aber doch gerne auch
irgend wann mal mit Batterien oder Akkus betreiben m&ouml;chte, dem
sei gesagt, da&szlig; es von Atari nie einen Akku- oder Batteriepack
gab, au&szlig;erdem w&uuml;rde die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> mit solch einem
Akkupack eh nicht besonders lange durchhalten, also weg mit dem
Ding.;-) (s. Bild, etwas verwackelt, aber doch zu erkennen)
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/battfach.gif" border=0 width="547" height="407"></p><br>
<div align=center><tt> Das ausges&auml;gte Batteriefach </tt>
</div>
<p>
<br>
<br>
</p>
<p>Bei mir habe ich das Batteriefach mit einer kleinen 12V
Bohrmaschine mit aufgesetzter Trennscheibe wegges&auml;gt, aber da hat
wahrscheinlich jeder seine eigene Methode.:)
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> <a href="10.htm" target="UDOcon">Netzteil</a> verlegen </b>
<br>
</p>
<p>Nachdem man sich den Plastikstaub abgeklopft und die Nase von
demselben befreit hat, kann man sich ein wenig mit dem <a href="10.htm" target="UDOcon">Netzteil</a>
am&uuml;sieren. Damit das <a href="10.htm" target="UDOcon">Netzteil</a> an seinem neuen Platz keine
unliebsamen Kurzschl&uuml;sse verursacht, sollte man die Unterseite
entweder mit einem dicken St&uuml;ck Pappe oder d&uuml;nnem Sperrholz
isolieren, das man sich entsprechend zurecht schneidet oder s&auml;gt.
Au&szlig;erdem sollte man rund um das <a href="10.htm" target="UDOcon">Netzteil</a> ein Klebeband kleben,
damit keine Kabel oder was auch immer, zwischen Brett/Pappe und
Netzteilplatine gelangen k&ouml;nnen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/netzteil.gif" border=0 width="341" height="150"></p><br>
<div align=center><tt> <a href="10.htm" target="UDOcon">Netzteil</a> mit Sperrholz </tt>
</div>
<p>
<br>
<br>
</p>
<p>Nun nimmt man einen Pfostenstecker, der in die Buchsenleite der
Netzteilplatine pa&szlig;t und eine Buchsenleiste, die auf den
Pfostenstecker der <b><a href="0306.htm" target="UDOcon">Stacy</a></b>-Platine pa&szlig;t und verbindet
beide 1:1 mit Kabeln (etwa 0,5qmm), die lang genug sind das <a href="10.htm" target="UDOcon">Netzteil</a>
sp&auml;ter an seinen neuen Platz zu bringen. Eine weitere
M&ouml;glichkeit w&auml;re, sowohl die Stiftleisten der Hauptplatine,
als auch die Buchsenleisten des Netzteils auszul&ouml;ten und dann mit
Kabeln 1:1 durch zu verbinden. Man sollte hierbei &auml;u&szlig;erste
Sorgfalt walten lassen, am besten mi&szlig;t man beide Kabel noch
komplett durch und untersucht sie gewissenhaft auf Kurzschl&uuml;sse,
denn ein Fehler bei diesen Kabeln hat fatale Folgen f&uuml;r das
Mainboard haben, sprich <b><a href="0306.htm" target="UDOcon">Stacy</a></b> -&gt; M&Uuml;lleimer!!!
<br>
</p>
<p>Jetzt folgt ein kurzer Test, ob das <a href="10.htm" target="UDOcon">Netzteil</a> alles mit Strom
versorgt, dazu setzt man zuerst das Tochterboard wieder ein und
schlie&szlig;t das LC-Display wieder an, wichtig ist das man wirklich
alle Kabel des Displays wieder anst&ouml;pselt, vor allen Dingen der
kleine 2-polige <a href="0f0b.htm" target="UDOcon">Stecker</a> der auf das <a href="10.htm" target="UDOcon">Netzteil</a> gesteckt wird! Hat man
die Steckervariante zum Verlegen des Netzteils gew&auml;hlt, so steckt
man diese unter das <a href="10.htm" target="UDOcon">Netzteil</a> und in das Mainboard, dabei auf die
richtige Reihenfolge der Verbindung achten!! Au&szlig;erdem sollte man
die <a href="0f0b.htm" target="UDOcon">Stecker</a>/Buchsen noch mit etwas Klebeband isolieren. Tastatur und
Trackball m&uuml;ssen f&uuml;r diesen Test nicht unbedingt
angeschlossen werden.
<br>
</p>
<p>Dann noch das Kabel wieder an den Netzschalter l&ouml;ten und noch
einmal genau &Uuml;berpr&uuml;fen, ob man wirklich alles angeschlossen
hat! Nun kann man den Computer einschalten, nach kurzer Zeit sollte
das Display aufleuchten, tut sich nichts sofort wieder ausschalten und
gegebenenfalls die Kabel nocheinmal &Uuml;berpr&uuml;fen. Hat man
senkrechte Streifen auf dem Display, ist irgendwo eine Kabelverbindung
nicht richtig zum <a href="10.htm" target="UDOcon">Netzteil</a> hergestellt, auch in diesem Fall das Kabel
noch einmal sorgf&auml;ltig durchmessen. Nun sollte man noch die
Stiftleisten auf der Hauptplatine im 45 Grad Winkel abbiegen, am
besten die Linke nach links und die Rechte nach rechts, da sonst die
Beschleunigerkarte nicht auf den Prozessorsockel pa&szlig;t. Hat man
die Kabel direkt eingel&ouml;tet entf&auml;llt diese Prozedur
nat&uuml;rlich.:) Nun kann man nochmal einen kleinen Funktionstest
durchf&uuml;hren und wenn alles l&auml;uft, wird wieder alles
abgest&ouml;pselt und -gel&ouml;tet und das Board komplett ausgebaut.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/netzkabl.gif" border=0 width="502" height="347"></p><br>
<div align=center><tt> Verbindung Mainboard - <a href="10.htm" target="UDOcon">Netzteil</a> </tt>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p><b> Prozessor ausl&ouml;ten </b>
<br>
</p>
<p>Dies ist wieder so eine Arbeit, die unheimlich Spa&szlig; macht,
so man eine destruktive Ader in sich tr&auml;gt.;^)
<br>
</p>
<p>Es gibt verschiedene M&ouml;glichkeiten den Prozessor auszubauen,
die sicherste Methode f&uuml;r die Platine ist zugleich auch die
destrukivste, dabei wird der Prozessor n&auml;mlich zerst&ouml;rt, was
aber bei einem Preis von knapp 10 DM f&uuml;r einen 68000er nicht ganz
so tragisch ist. Mir ist es zwar auch schonmal gelungen aus einem
520er den 68000er so auszul&ouml;ten, da&szlig; der Prozessor ganz und
funktionst&uuml;chtig geblieben ist (das war zu Zeiten, als der
68000er noch richtig Geld gekostet hat), allerdings mit dem Erfolg,
da&szlig; das ein oder andere L&ouml;tauge dran glauben mu&szlig;te.
Ich beschreibe hier jedenfalls die destruktive Methode. Man nimmt den
kleinen Seitenschneider und knippst alle Beine des 68000er ab, dann
l&ouml;tet man alle Beinchen mit Hilfe einer L&ouml;tpumpe und
Entl&ouml;tlitze aus und achtet darauf, da&szlig; die L&ouml;taugen
komplett vom L&ouml;tzinn befreit werden. Hat man dies erfolgreich
&Uuml;berstanden, kann man den 64poligen Pr&auml;zisionssockel wieder
an die Stelle l&ouml;ten wo vorher der 68000er (Gott hab't ihn selig:)
sa&szlig;.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/cpusock.gif" border=0 width="368" height="145"></p><br>
<div align=center><tt> <a href="080108.htm" target="UDOcon">CPU</a>-Sockel </tt>
</div>
<p>
<br>
<br>
</p>
<p>Man sollte auf jeden Fall auf &ouml;glichst kurze L&ouml;tzeiten
achten, um die Platine nicht zu besch&auml;digen.
<br>
</p>
<p>Bevor man den <a href="0a.htm" target="UDOcon">Beschleuniger</a> aufsteckt, sollte man sich f&uuml;r
die Unterseite des Beschleunigers, zwecks Isolierung, ein St&uuml;ck
d&uuml;nne Pappe zurechtschneiden und mit einem kleinen klecks
Hei&szlig;kleber befestigen. Jetzt kann man den <a href="0a.htm" target="UDOcon">Beschleuniger</a>
vorsichtig aufstecken, wichtig ist hier noch: da in der <b><a href="0306.htm" target="UDOcon">Stacy</a></b>
meist nur ein TOS 1.0x eingebaut ist, mu&szlig; man daf&uuml;r sorgen,
da&szlig; auf der <a href="http://www.wrsonline.de/" target="_top">PAK</a> ein TOS 3.06 steckt (s. auch Doku zur <a href="http://www.wrsonline.de/" target="_top">PAK</a>,
sonst bootet die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> nicht. Man kann nat&uuml;rlich auch
jeden anderen <a href="080108.htm" target="UDOcon">CPU</a>-<a href="0a.htm" target="UDOcon">Beschleuniger</a> aufstecken, ganz wie's beliebt.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/pak.gif" border=0 width="427" height="277"></p><br>
<div align=center><tt> Die eingesetzte <a href="0a0a.htm" target="UDOcon">PAK</a> in der <a href="0306.htm" target="UDOcon">Stacy</a> </tt>
</div>
<p>
<br>
<br>
</p>
<p>Noch schnell alles verkabelt und wieder einen <b>Testlauf</b>
fahren.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Floppyprobleme </b>
<br>
</p>
<p>Durch den Einbau eines Beschleunigers kann es passieren, da&szlig;
beim Zugriff auf die Floppy, der Rechner abst&uuml;rzt. Dies ist ein
Problem der Spannungsversorgung, der +5 Volt-Zweig ist in der
<b><a href="0306.htm" target="UDOcon">Stacy</a></b> wohl etwas schwach auf der Brust, soda&szlig; es zu
einem Spannungseinbruch bei Diskettenzugriffen kommt. Aber es gibt
Abhilfe, dazu ben&ouml;tigt man den 78S05, mit dem man die +5V aus der
+12V Versorgung erzeugt. Wie genau das gemacht wird finden sie hier an
anderer Stelle, im <a href="0306.htm" target="UDOcon">Stacy</a> Abschnitt, genau beschrieben. Kleine
Anmerkung dazu, die 12V werden von der Festplattenstromversorgung
abgezapft, au&szlig;erdem habe ich den Spannungregler noch mit etwas
Schrumpfschlauch von der Umgebung abgeschirmt. Weiterhin habe ich noch
die Festplattenspannungsversorgung mit einem Y-Kabel versehen,
soda&szlig; ich die +12V bequem &uuml;ber einen <a href="0f0b.htm" target="UDOcon">Stecker</a> entnehmen
konnte und gleichzeitig noch eine Verl&auml;ngerung zur Festplatte
hatte. (s. auch Bild) Wer jetzt genug hat, kann die <b><a href="0306.htm" target="UDOcon">Stacy</a></b>
nat&Uuml;rlich wieder zusammenbauen oder zum Sonderm&uuml;ll bringen,
je nachdem wie erfolgreich man war.;-)
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/spanregl.gif" border=0 width="320" height="351"></p><br>
<div align=center><tt> Spannungsregler </tt>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p><b> Festplatte austauschen </b>
<br>
</p>
<p>In der <b><a href="0306.htm" target="UDOcon">Stacy</a></b> befindet sich meist eine 30 oder 40MB-Platte,
die selbst f&uuml;r Atari-Verh&auml;ltnisse heutzutage etwas mickrig
ist, und da man die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> nun mal gerade auf hat, was liegt
n&auml;her als eine dickere Platte einzubauen. Wenn's denn mal so
einfach w&auml;re. :( Der SCSI Adapter in der <b><a href="0306.htm" target="UDOcon">Stacy</a></b> hat diesen
Namen eigentlich nicht verdient, es ist &uuml;brigens der gleiche wie
im MegaSTe, man ist n&auml;mlich in der Wahl der Festplatte etwas
eingeschr&auml;nkt und auch der Anschlu&szlig; ist eigentlich nicht
so, wie man's von richtigen SCSI-Bussen gewohnt ist.
<br>
</p>
<p>
<br>
</p>
<p>Einige Fakten zum <b><a href="0306.htm" target="UDOcon">Stacy</a></b> Host Adapter mit interner
Festplatte:
<br>
</p>
<p>
<br>
</p>
<p>1. Es l&auml;&szlig;t sich nur eine Platte daran betreiben
<br>2. Die Platte mu&szlig; immer SCSI-ID 0 bekommen
<br>3. Die Platte darf nicht terminiert werden
<br>4. Kein Parity
<br>5. Keine Initiatoridentifizierung
<br>6. max. 1GB
<br>
</p>
<p>
<br>
</p>
<p>Vor allen Dingen Punkt 4,5 und 6 machen bei modernen Platten
Schwierigkeiten, man hat zwei M&ouml;glichkeiten, entweder man sucht
sich eine Festplatte bei der sich das Parity per Jumper abschalten
l&auml;&szlig;t (schwierig) oder man r&uuml;stet den Host Adapter mit
Parity Bit nach, dazu wird der 74F280 ben&ouml;tigt, dies findet man
ebenfalls hier im DOITST-Achiv.
</p>
<p>Dort werden zwei verschiedene Verkabelungen des 74F280
beschrieben, bei dem von mir benutzten 74F280 von Motorola mu&szlig;te
die zweite Verkabelungsvariante durchgef&Uuml;hrt werden, erst danach
lie&szlig; sich eine IBM DSAS Platte mit 548MB ansprechen. Ich habe
die Verkabelung mit Kupferlackdraht durchgef&Uuml;hrt, wie auf den
Bildern zu erkennen ist.
<br>
</p>
<p>Im HTML-Text <a href="http://www.doitarchive.de/homepage.htm" target="_top">DOIT_ST</a> von Robert Schaffner ist eine weitere Variante
beschrieben, Parity nachzur&uuml;sten.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/scsi_o.gif" border=0 width="556" height="286"></p><br>
<div align=center><tt> Die Oberseite </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/scsi_u.gif" border=0 width="556" height="277"></p><br>
<div align=center><tt> Die Unterseite </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Der Deckel geht nicht zu </b>
<br>
</p>
<p>Nur nicht verzweifeln, man glaubt es kaum(ich wollte es zuerst
auch nicht glauben), aber es geht.:) Um den Deckel wieder drauf zu
bekommen, mu&szlig; man noch einen Stehbolzen, der sich genau
&uuml;ber der <a href="0a0a.htm" target="UDOcon">PAK</a> befindet abbrechen, sonst geht' s &uuml;berhaupt
nicht zu. Mit einer <a href="0a0a.htm" target="UDOcon">PAK</a>&lt;/A&gt; pa&szlig;t's wirklich so gerade,
wenn man den Blechkasten wegl&auml;&szlig;t. Hat man das Pech, wie
ich, da&szlig; die Cache-RAMs, die unter den TOS-ROMs auf der <a href="0a0a.htm" target="UDOcon">PAK</a>
sitzen, gesockelt sind, dann sitzen die TOS-ROMs n&auml;mlich noch
eine Etage h&ouml;her und dann geht die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> nicht mehr zu,
also mu&szlig;te ich zumindest die Sockel der Cache RAMs rausholen und
die RAMs direkt auf die Platine l&ouml;ten, dann pa&szlig;t's. Ich
wei&szlig; nicht ob das bei allen <a href="0a0a.htm" target="UDOcon">PAK</a>'s so ist, wenn ja, viel
Spa&szlig;.:-&gt;
<br>
</p>
<p>Bevor man nun alles wieder zusammenbaut, sollte man noch ein
St&uuml;ck d&uuml;nne Pappe zurechtschneiden, das man auf das
Daughterboard und etwas &uuml;ber die <a href="0a0a.htm" target="UDOcon">PAK</a> legt, da die
Tastaturunterseite aus Metall ist.
<br>
</p>
<p>Noch ein paar Worte zu dem was &uuml;brig bleibt, da w&auml;re
zun&auml;chst der Blechkasten, dann nat&uuml;rlich der
zerbr&ouml;selte 68000er, die Festplatte und eine Schraube, die in den
abgebrochenen Stehbolzen geschraubt war. Man sollte m&ouml;glichst
nicht versuchen diese Schraube wieder an ihren alten Platz zu
schrauben, da man sonst. u.U. eine gelochte <a href="0a0a.htm" target="UDOcon">PAK</a> erh&auml;lt, die man
dann auch getrost abheften kann.:)
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/rest.gif" border=0 width="489" height="416"></p><br>
<div align=center><tt> Wir m&uuml;ssen drau&szlig;en bleiben...:) </tt>
</div>
<p>
<br>
<br>
</p>
<p>Nun kann man die <b><a href="0306.htm" target="UDOcon">Stacy</a></b> in umgekehrter Reihenfolge wieder
zusammenbauen, nochmal zur Erinnerung, <b>Vorsicht</b> beim
Einstecken der Tastaturfolie!!!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/Stacy_zu.gif" border=0 width="562" height="316"></p><br>
<div align=center><tt> <a href="10.htm" target="UDOcon">Netzteil</a> der geschlossenen <a href="0306.htm" target="UDOcon">Stacy</a> </tt>
</div>
<p>
<br>
<br>
</p>
<p>Der Lohn, der M&uuml;he ist eine flotte und rasante <b><a href="0306.htm" target="UDOcon">Stacy</a></b>,
mit der es wieder Spa&szlig; macht zu arbeiten. Einziger
Wermutstropfen ist vielleicht, da&szlig; man nur 4MB Arbeitsspeicher
zur Verf&uuml;gung hat, denn f&uuml;r eine FRAK, reicht der Platz
leider nicht mehr aus.
<br>
</p>
<p>Ich w&uuml;nsche nun viel Spa&szlig; beim nachbauen und vor allen
Dingen viel Erfolg.
<br>
<br>
</p>
<p>Have fun!
<br>
</p>
<p>Artikel von: Marc-Anton Kehr
<br>http://www.ndh.net/home/kehr/atari/projekte/S_<a href="0306.htm" target="UDOcon">Stacy</a>.htm
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0306.htm" target="UDOcon"><img src="udo_up.gif" alt="Stacy" border=0 width="24" height="24"></a>
<a href="030603.htm" target="UDOcon"><img src="udo_lf.gif" alt="Stacy Ram Expansion" border=0 width="24" height="24"></a>
<a href="030605.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stacy 10Mhz" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
