<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Atari ST Testkit
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari ST Series Hardware" border=0 width="24" height="24"></a>
<a href="030b.htm" target="UDOcon"><img src="udo_lf.gif" alt="MegaST Bus" border=0 width="24" height="24"></a>
<a href="030d.htm" target="UDOcon"><img src="udo_rg.gif" alt="Symtom" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Atari_20ST_20Testkit">3.12 Atari ST Testkit</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> ATARI Testmodule </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Das Atari &quot;Testkit&quot; wurde in der Anfangszeit
ausschliesslich an authorisierte Atari <a href="1907.htm" target="UDOcon">H&auml;ndler</a> ausgegeben und
sp&auml;ter, bis zum heutigen Tag, bei <a href="1903.htm" target="UDOcon">BEST-Electronics</a> verkauft. Dort
allerdings nicht mehr vollst&auml;ndig.
<br>
</p>
<p>&quot;Insider&quot; besitzen zwei Epromfiles,TEST36.HIH und
TEST36.LOW, welche in zwei Eproms zu brennen sind und auf eine auf
64/128Kbit addressierte Epromkarte zu stecken waren. Eine solche
Epromkarte mit zwei Sockel gab es als c't Bastelprojekt.
<br>
</p>
<p>Damit ist man in der Lage zumindest die wesentlichen Systemteile
eines Atari Computers auf korrekte Funktion zu testen. Rechner
auschalten, Karte in den Romport stecken. Einsteckrichtung beachten,
sonst wird es teuer!
<br>
</p>
<p>Was die meisten nicht besitzen ist das Connection-Kit an dem alle
externen <a href="0f.htm" target="UDOcon">Schnittstellen</a> des Computers angeschlossen werden um
ebenfalls &uuml;berpr&uuml;ft zu werden.
<br>
</p>
<p>Nach dem Einschalten erscheint das Main Menu des Testkit direkt
auf dem Bildschirm.
<br>
<br>
<br>
</p>
<pre>
          Main Menu:

                     ST Diagnostic Test Rev. 3.6
                        (C) 1986, Atari Corp.
          520K Ram [1]   <a href="0f01.htm" target="UDOcon">Keyboard</a> revision 2 [2]   60 Hz [3]

          R Ram Test        O O.S.ROMs       C Color
          K <a href="0f01.htm" target="UDOcon">Keyboard</a>        M MIDI           S Serial RS232
          A <a href="1301.htm" target="UDOcon">Audio</a>           T Timing         D <a href="0f0a.htm" target="UDOcon">DMA Port</a>
          F Floppy Disk     P Printer/Joystick ports
          H High resolution monitor

          Q Run all Tests
          Z Run internal tests (R,O,C,K,A,T)
          E Examine/Modify memory
          ? Help
          B Set RS232 rate
          V Toggle video output--56/60 Hz

          Enter letter(s) and RETURN:

</pre>
<p>Testkits f&uuml;r andere Computer, Testkits mit einer anderen
Versionsnummer erzeugen u.U einen anderen Startbildschirm. Beachten
Sie bitte das die Fehlercodes auf den verschiedenen Computern
unterschiedlich sein k&ouml;nnen, nicht jeder Atari besitzt die
gleichen Hardwarekomponenten.
<br>
</p>
<p>
<br>
<br><b> Avaiable Diagnostic Modules </b>
<br>
</p>
<p>Falcon rev. 1.27 Diagnostic Cartridge
<br>TTDiagnostic Cartridge, Rev. 1.5.
<br>TT Diagnostic Cartridge, Rev. 1.2.
<br><a href="0306.htm" target="UDOcon">Stacy</a> 1, 2, 4 Diagnostic Cartridge
<br>MegaSTE Diagnostic Cartridge, Rev. 1.5
<br>MegaSTE Diagnostic Cartridge, Rev. 1.2
<br>ST / Mega 4.3 Rev. Diagnostic Cartridge
<br>ST / Mega 3.61 Rev. Diagnostic Cartridge
<br>520STE / 1040STE / 4160STE Rev.1.9 Diagnostic Cartridge
<br>520STE / 1040STE / 4160STE Rev. 1.4 Diagnostic Cartridge
<br>
</p>
<p>Hier finden sie die bekannten Ausf&uuml;hrungen der Testkits die
z.T heute noch bei <a href="1903.htm" target="UDOcon">BEST-Electronics</a> zu beziehen sind. Was immer fehlen
wird sind die externen Schnittstellentester.
<br>
</p>
<p>
<br>
<br><b> Die Kurzanleitung </b>
<br>
</p>
<p>Dr&uuml;ckt man die Taste &quot;Q&quot; werden alle Tests direkt
ausgef&uuml;hrt.
<br>Bei dr&uuml;cken der Taste &quot;Z&quot; wird nur Ram, -Rom,
-Color, -Tastatur und ein Timing Test gemacht. Die Taste &quot;E&quot;
&auml;ndert die Hardwareregister. Mit der Taste &quot;B&quot; in
Verbindung mit den Cursortasten &auml;ndert die Baudrate f&uuml;r die
RS232 Schnittstelle. Das &quot;?&quot; oder die &quot;Help&quot; Taste
bringt eine Kurzanleitung auf den Bildschirm und mit der Taste
&quot;V&quot; &auml;ndert man die Frequenz auf 50 oder 60Hz
Darstellung.
<br>
</p>
<p>[1] Arbeitsspeicher, der bei der Initialisierung gefunden wurde.
<br>[2] Version des Tastaturkontrollers.
<br>[3] Bildfrequenz 50Hz oder 60Hz.
<br>
</p>
<p>Liegen schwere Systemfehler vor, die selbst bei gesteckten
Testmodul kein Bild auf den Monitor bringen, m&uuml;ssen Sie sich ein
Nullmodemkabel zurecht l&ouml;ten und diesen Atari mit einem weiteren,
Baugleichen und korrekt funktionieren Atari Computer verbinden:
<br>
<br>
</p>
<pre>
   <a href="0f0b.htm" target="UDOcon">Stecker</a> Rechner 1:    <a href="0f0b.htm" target="UDOcon">Stecker</a> Rechner 2:
   ----------------------------------------
          Pin 2              Pin 3
          Pin 3              Pin 2
          Pin 7              Pin 7

</pre>
<p>
<br>
</p>
<p><a href="0f0b.htm" target="UDOcon">Stecker</a> 1 wird dem &quot;toten&quot; Rechner in die RS232 Buchse
gesteckt und <a href="0f0b.htm" target="UDOcon">Stecker</a> 2 in einen funktionsf&auml;higen Rechner auf
welchem ein VT52 Emulator oder ein ASCII-Terminalprogramm gestartet
sein mu&szlig; (9600 Baud). Danach wird der tote Rechner eingeschaltet
und normalerweise m&uuml;&szlig;te der zweite Rechner jetzt eine oder
mehrere Meldungen ausgeben. Als Grundvoraussetzung m&uuml;ssen
daf&uuml;r die ROM's U4 und U7, der 68000 sowie der <a href="080107.htm" target="UDOcon">GLUE</a> und das
Timing 8 MHZ am Clienten in Ordnung sein.
<br>
</p>
<p>Sobald das defekte System gestartet wird, werden die unteren 2
Kbytes RAM der Bank 0 getestet. Dieser Speicherbereich wird von der
<a href="080108.htm" target="UDOcon">CPU</a> zwingend ben&ouml;tigt. Liegt z.b. ein statischer Ramfehler vor,
l&auml;&szlig;t sich normalerweise das <a href="0901.htm" target="UDOcon">Betriebssystem</a> nicht mehr
starten, wobei auch die Bildschirmausgabe gest&ouml;rt ist oder ganz
ausfallen kann. Dieser Fehler m&uuml;sste dann zuerst behoben werden.
<br>
</p>
<p>Gibt es weder eine Bildschirmanzeige noch eine Datenausgabe auf
einem zweiten Rechner ist der MFP sehr warscheinlich auch defekt.
<br>
</p>
<p>Es erscheinen u.a. folgende Fehlermeldungen:
<br>
</p>
<pre>
(Error Message) ?000000000000000   Fehler Bit 15
(Error Message) 000000000000000?   Fehler Bit 0
(Error Message) ????????00000000   Feh.  Bit 8-15

z.b.: I1 Ram Data Line Error ????????00000000

Statt einem Fragezeichen k&ouml;nnte auch eine 1 angezeigt werden.

I1  R D L E 0000000000000000  0000000000000001 Fehler Bit 0 Bank 0

</pre>
<p>
<br>
<br>
</p>
<p><b> Teststecker f&uuml;r den RS232 Test: </b>
<br>
</p>
<p>Es m&uuml;ssen folgende Pin an den Steckern miteinander verbunden
werden:
<br>
</p>
<p>Pin 2 und 3, Pin 4 und 5, Pin 8 und 20 und 22
<br>
<br><b> MIDI Test: </b>
<br>
</p>
<p>Normales Midikabel verwenden und eine Midiverbindung aufbauen.
<br>Das kann mit einem weiteren Rechner passieren oder einfach eine
Loop-Back-Verbindung am eigenen Rechner herstellen. Mit der Software
&quot;MidiCom&quot; kann man ebenfalls die <a href="0f04.htm" target="UDOcon">Midi-Schnittstelle</a> testen.
Fehlermeldungen der Midischnittstelle werden mit &quot;Mx&quot;
ausgegeben.
<br>
</p>
<p>
<br>
<br><b> DMA und Printer/Joystickport: </b>
<br>
</p>
<p>K&ouml;nnen so einfach nicht getestest werden, daf&uuml;r wird
eine Testplatine ben&ouml;tigt die ca 400.-DM kostet. Der einfachste
Test ist ein Ausdruck auf einem gewiss funktionsf&auml;higen
Epson-Kompatiblen Drucker. Allerdings k&ouml;nnen die Maustasten und
der Joystick bet&auml;tigt werden, es erscheinen dann die
entsprechenden Punkte im Testmen&uuml; nicht als Defekt.
<br>
</p>
<p>Beim DMA Test niemals eine Festplatte einschalten es droht
Datenverlust!
<br>
</p>
<p>Wenn der DMA Test benutzt wird m&uuml;&szlig;te normalerweise nur
die Meldung D0 DMA time-out kommen, dann ist der DMA Kontroller Ok.
Kommen stattdessen die Meldungen D1 und D3 ist der Floppykontroller
defekt in seltenen F&auml;llen der DMA. Funktioniert das System nur
mit gesteckter Epromkarte oder Testmodul nicht, ist der DMA Kontroller
in 80% aller F&auml;lle defekt.
<br>
</p>
<p>
<br>
<br><b> Beispiele f&uuml;r einen RAM-Test </b>
<br>
</p>
<p>Wenn ein Testmodul beim Speichertest, als Beispiel, eine oder
mehrere der nachfolgenden Zeile ausgibt:
<br>
<br>
</p>
<pre>
Fehlermeldung          Bit 0-15 Bank1   Bit 0-15 Bank0   Adresse

I1 RAM/data line error 0000000000000001 1111111111111111 000008

</pre>
<p>
<br>
</p>
<p>bedeutet das in diesem Beispiel das sich hier Bit 0 bis Bit 15 der
Bank 0 vom ST RAM nicht ansprechen lassen w&uuml;rde. Bit 0 der Bank 1
(also der hier:
<br>(0000000000000001) vom ST RAM l&auml;&szlig;t sich ebenfalls nicht
ansprechen.
</p>
<p>Da ist an Adresse 8 (der ersten RAM-Adresse, da davor ROM liegt)
mindestens ein Bit auf 1 anstelle auf 0.
</p>
<p>Das w&uuml;rde in diesem Fall bedeuten das sich ein RAM-Baustein
nicht ansprechen l&auml;sst. Er ist unter umst&auml;nden defekt, oder
der darauf folgende zweite Baustein (also Bank 1) patzt dazwischen
weil eventuell die Selektierung nicht mehr korrekt funktioniert. Man
kann hier nur einzelne RAM-Bausteine abklemmen, also von den
Datenleitungen trennen, um so nach dem defekten RAM suchen. Wenn durch
das Abh&auml;ngen eines RAMs direkt eine weitere Fehlermeldung
angezeigt wird war es der falsche Baustein.
</p>
<p>Lieber etwas gro&szlig;z&uuml;giger Auswechseln. Verschwinden die
Fehler nicht ist in der Adressierung der Rambausteine zu suchen.
<br>
</p>
<p>
<br>
<br><b> Tips: </b>
<br>
</p>
<p>Macht der Rechner auch mit abgezogenen Laufwerk (auch 1040 und
Mega ST) st&auml;ndig einen Reset, sollte man einmal den <a href="080107.htm" target="UDOcon">GLUE</a> ausbauen
und dessen Fassung und die Chipkontakte reinigen. Dieser Chip ist
heute kaum noch zu ersetzen.
<br>
</p>
<p>
<br>
<br><b> Fehlermeldung im <a href="0903.htm" target="UDOcon">Desktop</a> (GEM): </b>
<br>
</p>
<p>Speicherplatz reicht f&uuml;r diese Anwendung nicht aus:
<br>Verbogenes Beinchen im <a href="080105.htm" target="UDOcon">MMU</a>-Sockel, <a href="080105.htm" target="UDOcon">MMU</a> raushebeln und die Beinchen
&uuml;berpr&uuml;fen bzw. gerade biegen.
<br>
<br>Maus setzt ab und zu aus bzw. Ausfall der gesamten Tastatur oder
Tastaturklicken und der Mauszeiger (Biene) bewegt sich st&auml;ndig.
Noisefilter zur Tastatur und oder Tastatur defekt. Testkit bringt
Fehlermeldung: <a href="0f01.htm" target="UDOcon">Keyboard</a> failed.
<br>
<br>Das GEM-<a href="0903.htm" target="UDOcon">Desktop</a> erscheint ohne Icons auf dem Bildschirm oder beim
Diskstation Icon fehlt die Schublade. Testmodul und Ramtest machen
(meistens Bit 5 Bank 0 defekt, austauschen) Notfalls mit
K&auml;ltespray und Dauerlauf Ramtest (R0 eingeben) auf thermische
Fehler testen.
<br>
<br>Kopieren eines Programmes von A-A, A-B, B-A, B-B, danach beim
starten des kopierten Programmes: Fehlermeldung = TOS-Fehler 35.
Vermutlich eine defekte <a href="080108.htm" target="UDOcon">CPU</a>. 68000 wechseln.
<br>
<br>Bild l&auml;uft durch und Floppy Laufwerke werden nicht
angesprochen. Treiberbaustein defekt. Austauschen. Bei einem 260/520
ST ist das U35.
<br>
<br>Verschneites Bild auf dem Fernseher bei Rechnern mit Modulator.
Modulator defekt, austauschen.
<br>
<br>Eine Farbe fehlt an Monitorbuchse ist aber am HF Modulator noch
vorhanden. Treibertransistoren Q3 bis Q5 durchmessen. Warscheinlich
ist einer defekt.
<br>
<br>Diverse Fehler mit Testmodul: T4, R3 etc.Fehler im Ram. Defekte
74LS373 Treiberbausteine wechseln, aber beide !!!
<br>
<br>Wei&szlig;e Punkte, Schwarze Punkte, Streifen auf Bildschirm, nach
anklicken eines Men&uuml;punktes wird der Bildschirm nicht neu
aufgebaut. Bustreiber (74LS244 und 74LS373) haben thermischen Fehler
oder Kontaktschwierigkeiten an Ram's. In harten F&auml;llen
Entst&ouml;rkondensatoren der Ram's auf Kapazit&auml;t und
Kurzschlu&szlig; Durchmessen. Beide Treiber ersetzen bzw. erstmal
nachl&ouml;ten.
<br>
</p>
<p>
<br>
<br><b> SH205 und <a href="0d0201.htm" target="UDOcon">Megafile</a> 20: </b>
<br>
</p>
<p>Nach Formatieren erscheint folgende Meldung: Fatal error on Device
0 Betriebssystemrom sitzt nicht richtig in der Fassung. Rom rausnehmen
und neu einsetzten. Bei Tandon TM262 Laufwerk mu&szlig; der
Schrittmotor von Hand auf Track 0 (wie bei Disks) gebracht werden und
danach die Platte hochfahren.
<br>
</p>
<p>
<br>
<br><b> SM124: </b>
<br>
</p>
<p>Nach dem Einschalten des Comp's,zeigen sich auf dem Bildschirm
R&uuml;cklaufstreifen. R727 (560Kohm) ist zu hochomig und mu&szlig;
ausgetauscht werden. Keine &Auml;nderung wenn man am Poti VR702
(Sub-Bright) die Grundhellikeit nachreguliert.
<br>
<br>Bild nur halb so hoch, aber breiter und keine Einstellung durch
Regler m&ouml;glich. +12V Stromversorgung defekt. IC901 und Q901
&uuml;berpr&uuml;fen und def. Bauteil austauschen.
<br>
<br>Helligkeit l&auml;&szlig;t sich nicht voll aufregeln.Transistor
Q303 austauschen. Spannungsteiler R310=8V und R302=3.6V
<br>
<br>Computer birngt nach einiger zeit kein richtiges Bild mehr und
Monitor ist ok oder Bildschirm bleibt dunkel und Monitor ist ok.
Treiber 74LS04 austauschen, Fehler kann mit K&auml;ltespray gefunden
werden.
<br>
<br>Bei Anschlu&szlig; einer Festplatte oder Laserdrucker st&uuml;rzt
das System ab oder kann nicht booten. Filter an Pin 12 des DMA-Ports
im Recher defekt oder fehlt v&ouml;llig. Das Reset Signal wird mit
Hilfe eines NE556 oder TL7705 erzeugt. St&ouml;rspitzen k&ouml;nnen
dadurch in den Rechner zur&uuml;ckgelangen und erzeugen einen
undefinierten Reset. Als Folge dessen kann in der SH205 der Treiber
des Reseteingangs (74LS123) zerst&ouml;rt werden.
<br>
</p>
<p>
<br>
<br><b> Das Atari Testkit allgemein </b>
<br>
</p>
<p>Das Atari Testmodul ist ein Eprommodul in einer Serie von
Diagnosemodulen f&uuml;r <a href="0305.htm" target="UDOcon">Atari ST</a>, STe und Atari TT Computer. Das
Testkit wurde hergestellt um die Fehlersuche an defekten
Atari-Computern zu erleichtern und schnell defekte Systemkomponenten
ausfindig zu machen. Urspr&uuml;nglich ausschliesslich an
Systemh&auml;nder ausgegeben.
<br>
</p>
<p>Beachten Sie bitte das Romportmodule nur gesteckt werden wenn der
entsprechende Computer komplett ausgeschaltet ist. Das trifft also
auch auf das Testmodul zu. Ein Testmodul besteht aus einer Platine
welche zwei Sockel f&uuml;r zwei St&uuml;ck 27C256 Proms tr&auml;gt,
dieses sog. 128K-Modul reicht aus um die Teststoftware f&uuml;r Atari
Atari Computer unterzubringen.
<br>
</p>
<p>Entfernen Sie niemals das Modul bei eingeschaltetem Rechner. So
vermeiden Sie teuere Sch&auml;den an ihrem System. Wie bei allen
Atari-Computern liegt auch am Atari der Systembus ungepuffert direkt
am Romport an.
<br>
</p>
<p>Alle verf&uuml;gbaren Testkits sind Men&uuml;gesteuert.
<br>
</p>
<p>Nach dem Einstecken eines Moduls und dem Einschalten des Computers
wird die Testsoftware vom Modul/Cardridge direkt in de Arbeitsspeicher
des Rechners geladen. Hierzu mu&szlig; der entsprechende Rechner noch
&uuml;ber gewisse Minimalfunktion verf&uuml;gen!
<br>
</p>
<p>Der Atari bootet von diesem Modul. Hierzu gen&uuml;gen bereits 2
KB aktives Ram im Ger&auml;t. Eben in diesem Moment werden schon die
ersten Tests durchgef&uuml;hrt und zeigen dem Benutzer weitere
Probleme mit einem roten Bildschirm an. Ist kein RAM verf&uuml;gbar
kann das Testkit nicht arbeiten!
<br>
</p>
<p>Ein Testkit &uuml;berpr&uuml;ft den Rechner in verschiedenen
Schritten die alle ein eigenes Men&uuml; haben. Die entsprechenden
Diagnosergebnisse werden auf dem Bildschirm angezeigt oder Anhand der
entsprechende Bildschirm-Hintergrundfarbe angezeigt.
<br>
</p>
<p>Unterteilt sind die Tests in automatisch ablaufende und in Tests
die die Aufmerksamkeit des Benutzers erfordern. Automatisch laufende
Tests dienen so auch dem Dauertest bestimmter Baugruppen oder auch den
sog. &quot;Burn In&quot; bei ehemals fabrikneuen Ger&auml;ten.
<br>
</p>
<p>Eine der Hauptgruppen ist der umfassende Speicher- und
Taktratentest.
<br>Bei verschiedenen Atari Modellen ist das die wichtigste Funktion.
<br>
</p>
<p>Jederzeit wird von diesem Testkit die serielle Schnittstelle
&uuml;berwacht. Das dient f&uuml;r den Fall das am zu testenden Atari
die Tastatur oder/und auch der Bildschirm ausgefallen ist.
S&auml;mmtliche Bildschirmausgaben werden so an einen weiteren Atari
gesendet der hier dann als Terminal fungiert.
<br>
</p>
<p>Ein Atari-Testkit konnte man bis vor einiger Zeit bei der Fa.
Best-Electronics f&uuml;r ca. 80$ US erwerben. Um ein
vollst&auml;ndiges Testkit zu erwerben sind noch einige
Schnittstellenadapter notwendig die Teilweise aber auch selber
Hergestellt werden k&ouml;nnen. Nicht mehr verf&uuml;gbar ist der
Printerport Testadapter welcher auch Paddleports testet. (!Nl)
</p>
<p>
<br>
<br><b> Atari diagnostic parts from BEST </b>
<br>
</p>
<p>RS 232 loop back $ 8.00
<br>Midi loop back $ 4.00
<br>Lan loop back $15.00
<br><a href="1301.htm" target="UDOcon">Audio</a> loop back $20.00
<br>DSP loop back $30.00
<br>Expansionport test fixture $70.00
<br>
<br>
</p>
<p>Die Adressen von Best-Electronics oder der Fa. Wizztronics
entnehmen Sie bitte dem <a href="1907.htm" target="UDOcon">H&auml;ndler</a>-Verzeichniss aus diesem Archiv.
<br>
</p>
<p>Wenn Sie ein Modul ohne Geh&auml;use erhalten stellen Sie sicher
das sie die Karte mit den beiden Eproms nach UNTEN in den Atari
stecken! Module im Plastikkgeh&auml;use werden mit dem Label nach oben
in den Atari gesteckt. Wenn Sie einen bestimmten Test machen wollen
schliessen sie auch den entsprechenden Loopback-Tester an die richtige
<a href="0f.htm" target="UDOcon">Schnittstellen</a> des Atari an. Selbstredend sollte am Monitorport ein
Monitor angesteckt sein. Im g&uuml;nstigsten Fall ist das ein
RGB-Farbmonitor!
<br>
</p>
<p>Nach dem Einschalten des Atari sollten sie den Schiftzug:
<br>
</p>
<p><b> Atari xxx Diagnostic Cardridge </b> auf ihrem Bildschirm
lesen k&ouml;nnen. Bis zu diesem Punkt wurden bereits diverse Tests
vorgenommen dessen Ergebnisse Sie weiter unten finden k&ouml;nnen. Mit
dem Booten von einem solchen Testkit werden s&auml;mtliche Parameter
die bis dahin in einem eventuell vorhandenen NVRAM gespeichert waren
durch die Default-Parameter des Atari-Testkit &uuml;berschrieben.
Beachten sie bitte das nicht alle Atari Computer ein NVRAM enthalten!
<br>
</p>
<p align=center><img src="image/testkit1.gif" border=0 width="258" height="312"></p><br>
<div align=center><tt> Abbildung 2 - Atari Atari Testmodule </tt>
</div>
<p>
<br>
<br><b> Fehlersuche an einem toten Ger&auml;t </b>
<br>
</p>
<p>Wenn Sie ihrem Atari trotz korrektem Anschlu&szlig;, einer
intakten Stromversorgung und einer einwandfreien Peripherie kein Bild
entlocken sollten beginnen Sie mit den weiteren Schritten. Beachten
Sie auch hierzu die Flowcharts.
<br>
</p>
<p>1.
<br>Stellen Sie eine Verbindung zu einem weiteren Atari-Computer her.
<br>Starten Sie auf dieser Maschine ein VT52-Terminalprogramm.
<br>Stellen Sie sich folgendes serielles <a href="11.htm" target="UDOcon">Verbindungskabel</a> selber her:
<br>Das Terminal mu&szlig; auf die Parameter 9600 Baud, 8N1
eingestellt werden.
<br>
</p>
<p>
<br>
</p>
<pre>
Totes Ger&auml;t        Weiterer Atari
------------------------------------------
Pin 2 ----------- Pin 3
Pin 3 ----------- Pin 2
Pin 5 ----------- Pin 5 GND (7 an ST, STE)

</pre>
<p>
<br>
</p>
<p>Setzen Sie das Testmodul in den toten Atari ein.
<br>Schalten Sie den toten Atari ein.
<br>Meldet sich das Diagnosemodul auf dem zweiten Atari benutzen
<br>sie die dort vorhanden Bildschirmausgabe und die Tastatur
<br>f&uuml;r weitere Tests. Sollten Sie nichts sehen beginnen Sie
<br>damit den toten Atari zu zerlegen.
<br>
</p>
<p>2.
<br>Nach dem &ouml;ffen des Ataris ben&ouml;tigen Sie hier nicht
n&auml;her beschriebene Me&szlig;ger&auml;te.
<br>Messen Sie den 32Mhz Takt mit einen Oszilloskop nach.
<br>Das Taktsignal sollte eine gleichf&ouml;rmige stabile Wellenform
haben.
<br>Ist der Takt hier nicht vorhanden ersetzen Sie den Oszillator.
<br>Danach testen Sie bitte den HALT Pin der 68000 <a href="080108.htm" target="UDOcon">CPU</a>.
<br>Wenn Sie hier ein HIGH-Pegel messen ist das in Ordnung.
<br>Bei LOW-Pegel bitte die weiteren Punkte beachten.
<br>
</p>
<p>a.)
<br>
</p>
<p>Testen Sie den Resetschaltungszweig ob von hier st&auml;ndig HALT
geliefert wird.
<br>
</p>
<p>b.)
<br>
</p>
<p>Testen Sie auf einen doppelten Bus-Error. Das bekommt man herraus
in
<br>dem man das BERR-Signal der <a href="080108.htm" target="UDOcon">CPU</a> kontrolliert. Das in ein Input
f&uuml;r die <a href="080108.htm" target="UDOcon">CPU</a>!
<br>Das Signal sollte immer HIGH sein. Sehen Sie hier auf ihrem
Oszilloskop
<br>h&auml;ufig folgende LOW-Impulse so werden diese vom <a href="080107.htm" target="UDOcon">GLUE</a>
generiert.
<br>Das bedeutet das das System, der <a href="080107.htm" target="UDOcon">GLUE</a>, eine Fehlfunktion
festgestellt hat.
<br>
</p>
<p>c.)
<br>
</p>
<p>Stellen Sie hierbei einen Fehler fest ist die <a href="080108.htm" target="UDOcon">CPU</a> nicht in der
Lage
<br>das ROM zu lesen und sie kann auch die Videoausgabe nicht
aktivieren.
<br>Ebenso kann der 68901 nicht initalisiert werden, folglich nutzt
ihnen
<br>auch das Testmodul nichts da die serielle Schnittstelle so nicht
Funktioniert.
<br>Im einfachsten Fall ist die 68000 <a href="080108.htm" target="UDOcon">CPU</a> defekt. Das dr&uuml;ckt sich
manchmal in einer deutlichen Erw&auml;rmung dieses Chips aus. ( Kein
sicheres Zeichen! )
<br>
</p>
<p>Testen Sie die Leitungen XROM3 und XROM4 auf Signale f&uuml;r den
Cardridegeport.
<br>Wenn hier nichts messbar ist sollten Sie dringend den <a href="080107.htm" target="UDOcon">GLUE</a>
wechseln.
<br>Testen Sie danach am <a href="080106.htm" target="UDOcon">Shifter</a> ob Videosignale erzeugt werden.
<br>Tut sich hier nichts testen Sie wieder die Taktsignale, die
Stromversorgung
<br>f&uuml;r den <a href="080106.htm" target="UDOcon">Shifter</a>. Wechseln Sie den <a href="080106.htm" target="UDOcon">Shifter</a> oder die
entsprechenden
<br>fehlerhaften Bauteile. (Takt ect.pp)
<br>Erhalten Sie noch immer kein Display testen Sie das
Chipselekt-Signal am MFP!
<br>Sollte also CS (ChipSelekt) vorhanden sein testen Sie DS
(DataStrobe) am MFP.
<br>Sollte auch das jetzt vorhanden sein fahren Sie mit DTACK fort.
<br>
</p>
<p>Es gibt keinen vern&uuml;nfigen Weg eine defekte <a href="080108.htm" target="UDOcon">CPU</a> zu
lokalisieren.
<br>Einzige der Fall das die <a href="080108.htm" target="UDOcon">CPU</a> so hei&szlig; ist das man sich die
<br>Finger verbrennt deutet darauf hin das der Chip defekt ist.
<br>(Kein sicherer Test!)
<br>
</p>
<p>3.
<br>
</p>
<p>Befindet sie die <a href="080108.htm" target="UDOcon">CPU</a> nicht im HALT-Mode, gibt es keine Bewegungen
auf den
<br>Datenleitungen, versucht die <a href="080108.htm" target="UDOcon">CPU</a> nicht das ROM oder das
Diagnosmodul zu lesen
<br>sollte die <a href="080108.htm" target="UDOcon">CPU</a> gewechselt werden. Sollte die <a href="080108.htm" target="UDOcon">CPU</a> aber das
Diagnosemodul
<br>lesen, das sieht man an den Datenleitungen, besteht die
M&ouml;glichkeit
<br>das die RS232 UND das Videosystem besch&auml;digt sind.
<br>&Uuml;berpr&uuml;fen Sie den Output des MFP wenn das Testmodul
gesteckt ist
<br>und der Atari eingeschaltet wird. Pin 8 am MFP sollte Daten
senden.
<br>
</p>
<p>Beachten Sie dringlich das zum Betrieb der seriellen Schnittstelle
<br>unbedingt die -12V Versorgung intakt sein mu&szlig;!
<br>Ist das alles in Ordnung haben Sie ein Problem mit ihrer
Kabelverbindung
<br>zum externen Terminal.
<br>
</p>
<p>&Uuml;berpr&uuml;fen Sie den <a href="080106.htm" target="UDOcon">Shifter</a>. Benutzen Sie einen
RGB-Monitor, testen Sie
<br>den <a href="080106.htm" target="UDOcon">Shifter</a>-Output.
<br>Sollten Sie einen Monochrome-Monitor benutzen m&uuml;ssen Sie das
Mono-Signal &uuml;berpr&uuml;fen. Messen Sie direkt am Baustein.
<br>
</p>
<p>Laufende Bilder kann man am TV sehen wenn z.B Vsync. fehlt
<br>Ein sicheres Zeichen f&uuml;r einen defekten <a href="080107.htm" target="UDOcon">GLUE</a>
<br>
</p>
<p>Produziert der <a href="080106.htm" target="UDOcon">Shifter</a> ein Videosignal und das Bild ist nicht
lesbar oder
<br>auch nicht vorhanden kann noch ein Problem mit dem Videoram
vorliegen.
<br>Das Testkit sollte diesen Ramfehler leicht aufsp&uuml;ren
k&ouml;nnen.
<br>Stellenweise l&auml;sst sich bei einem defekten <a href="080106.htm" target="UDOcon">Shifter</a> ein
TV-Bild erzeugen wenn man die Pin des Shifters mit der Hand
ber&uuml;hrt.
<br>
</p>
<p>
<br>
<br><b> PowerUp beim Einschalten </b>
<br>
</p>
<p>Beim Einschalten mit eingestecktem Testkit werden die untersten
2KB RAM &uuml;berpr&uuml;ft. Wird hier ein Fehler entdeckt, erfolgt
Meldung an das RS232-Terminal. Fehlt RAM kann kein Stack und kein
Speicher f&uuml;r Systemvariablen angelegt werden. Der Bildschirm
bleibt dunkel und das Testmodul wird die Ramfehler an das Terminal
senden.
<br>
</p>
<p>(Eventuell roter Bildschirm)
<br>
</p>
<p>Ist das <a href="0f01.htm" target="UDOcon">Keyboard</a> besch&auml;digt, wird es deaktiviert, der
Benutzter mu&szlig; das RS232-Terminal benutzen. Alle Tasteneingaben
werden &uuml;ber die serielle Schnittstelle geleitet.
<br>
</p>
<p>
<br>
<br><b> Power Up Sequence </b>
<br>
</p>
<p>Das Testkit erlaubt direkte Systemtest nach dem Einschalten. Alle
Devices oder Subsyteme werden initalisiert und getestet. Sie erhalten
direkt danach den Status der einzelnen Subsysteme direkt auf dem
Bildschirm. Das NVRAM wird dabei auf von Atari festgelegte
Defaultwerte gesetzt. Ihre eigenen Parameter gehen dadurch verloren.
Es wird so Sichergestellt das keine unsinnigen Parameter im eventuell
vorhanden NVRAM vorhanden sind die eine Funktion der Hardware
beeintr&auml;chtigen k&ouml;nnten.
<br>
</p>
<p>Steigt der Atari aus bevor Sie das Men&uuml; des Testkits komplett
auf dem Bildschirm sehen k&ouml;nnen zeigt die letzte
Bildschirmaufschrift die Stelle oder Adresse, das Subsystem an bei
welcher der Absturz erfolgt ist.Hier d&uuml;rfen Sie dann direkt
n&auml;her in die Hardware einsteigen.
<br>
</p>
<p>Die niedrigsten 2 KB RAM werden beim PowerUp getestet, stellt das
Kit hier einen Fehler fest wird dieser &uuml;ber die
RS232-Schnittstelle gesendet. Es kann dann auch keine
Bildschirmausgabe erfolgen. Das Kit wird den Ramtest fortsetzen und
die Meldungen &uuml;ber RS232 ausgeben.
<br>
</p>
<p>
<br>
<br><b> Initalisierung des Systems </b>
<br>
</p>
<p>Der Speicherbereich f&uuml;r den Bildschirmspeicher wird
eingerichtet. Alle Pointer zum lesen und schreiben von Daten werden
gesetzt. Die so festgelegten Adressen werden an die <a href="080108.htm" target="UDOcon">CPU</a>-Register
&uuml;bergeben. Fehler werden &uuml;ber die RS-232 ausgegeben,
nachfolgend wird das zur Verf&uuml;gung stehende RAM getestet.
<br>
</p>
<p>Das Atari RAM wird vom Testkit auf 5 verschiedene Arten
getestet.Hierbei werden alle bekannten Testmuster verwendet. Bei einer
14MB-Maschine dauern diese Tests deutlich l&auml;nger als bei einem
520ST mit ausschliesslich 4 MB Ram!
<br>
</p>
<p>Wird arbeitendes Ram gefunden werden die 68000 Exeption Handler
geladen und der MFP initalisiert. Alle Interrupts eingeschaltet, das
Videosubsystem aktiviert und die RS-232 initalisiert. Danach wird der
Bildschirmspeicher gel&ouml;scht und die erste Meldung erblickt das
Licht der Welt. Ab diesem Punkt ist das System soweit in Ordnung das
diverse weitere Tests vorgenommen werden k&ouml;nnten. Ebenso werden
Meldungen per RS-232 an einen weiteren Atari &uuml;bermittelt. Nach
jeder gestesteten Funktion werden Sie eine Schlu&szlig;meldung oder
eine Fehlermeldung erhalten.
<br>
</p>
<p>
<br>
<br><b> Bus Error </b>
<br>
</p>
<p>Ein Bus-Error tritt z.B beim Versuch auf das ROM zu beschreiben.
Hier sollten Sie einen roten Bildschirm erhalten. Einige Busfehler
erzeugen nur eine Statusmeldung, das System l&auml;uft aber weiter.
<br>
</p>
<p>
<br>
<br><b> FPU Check </b>
<br>
</p>
<p>Dieser Test zeigt Ihnen ob im Atari eine FPU vorhanden ist. Ist
keine FPU eingebaut erhalten Sie die Meldung &quot; No FPU&quot; der
Bildschirm wird dabei aber nicht rot. Das fehlen einer FPU ist bei
einigen Systemen nicht unbedingt ein Fehler.
<br>
</p>
<p>
<br>
<br><b> PSG and PRINTER Port initalisieren </b>
<br>
</p>
<p>Der PSG Chip wird initalisiert, Sound ist abgeschaltet. Der
Druckerport wird in den Testmodus geschaltet. LoopBack <a href="0f0b.htm" target="UDOcon">Stecker</a> ist
Notwendig! Entfernen Sie vorher einen dort angsteckten Drucker!
</p>
<p>
<br>
<br><b>Timer Testing </b>
<br>
</p>
<p>Beim Start des sog. &quot;Timingtest&quot; wird ein eigenes
Programmteil aufgerufen das s&auml;mtliche systemrelevanten Routinen
und Signalabl&auml;ufe testet. Dieses Programmodul generiert seine
eigenen Meldungen. Es werden alle Timer am MFP getestet und die
Ergebnisse an die aufrufende Routine zur&uuml;ckgeliefert. Sobald bei
diesen Tests ein einziger Fehler auftritt wird die Testroutine
abgebrochen und das Ergebniss ausgegeben. Stellt die
Software-Testroutine keinen Fehler in den MFP-Timern fest werden diese
Timer als Referenztimer f&uuml;r weitere Systemtests benutzt.
<br>
</p>
<p>U.a wird dann auch damit der Takt des Hauptsystems, alle kleineren
Taktraten und das Genlock-Interface, bzw. der dazu passende Takt
gr&uuml;ndlich getestet. S&auml;mtliche Meldungen erscheinen auf dem
Bildschirm oder werden auch hier &uuml;ber RS232 ausgegeben.
&quot;pass&quot; bedeutet jeweils das der entsprechende Test
erfolgreich war. Ohne Fehler.
<br>
</p>
<p>Zum allgemeinen Funktionsablauf ist zu sagen das bei dieser
&quot;Messung&quot; ein MFP-Timer gestartet wird und die <a href="080108.htm" target="UDOcon">CPU</a> damit in
eine Instruktionsschleife startet. Ist die Zeit des MFP-Timers
abgelaufen bevor die <a href="080108.htm" target="UDOcon">CPU</a> diese Schleife abgearbeitet hat, ist die
entsprechend getestete Taktrate zu langsam oder das System wird
&uuml;ber Genlock mit einer externen Taktrate gefahren.
<br>
</p>
<p>In diesem Fall wird das Testmodul einen Dauerton generieren, die
Bildschirmausgabe wird gestoppt und der Rechner wird einen Reset
ben&ouml;tigen.
<br>
</p>
<p>Erzeugt diese Test keinen sog. Timeout erfolgt eine entsprechende
positive Meldung und der Test ist beendet.
<br>
</p>
<p>Als Teil des Genlock-Tests wird das sog.
&quot;Pixelcontol-Bit&quot; im SP-Shiftmode Register gesetzt. Sie als
Benutzer k&ouml;nnen dieses Bit quasi als Oszilloskop nutzen da,
sollten Sie das STe-Testboard besitzen, Sie so leicht sehen
k&ouml;nnen ob der Genlock-Pin auf dem Testboard mit der Pixeltaktrate
getoggelt wird. Das Funktioniert nicht wenn ein externer Genlock-Takt
anliegt!
<br>
</p>
<p>&quot;Genlock&quot; ist nicht bei allen Atari Modellen
verf&uuml;gbar!
<br>
</p>
<p>
<br>
<br><b> Clean Up </b>
<br>
</p>
<p>Unter diesem Punkt wird das <a href="0f01.htm" target="UDOcon">Keyboard</a> neu initalisiert. Die
Taktrate wird neu gesetzt und der <a href="080108.htm" target="UDOcon">CPU</a> Cache abgeschaltet. Nach einer
Sekunde Pause wird der Bildschirm gel&ouml;scht und neu aufgebaut.
<br>
</p>
<p>
<br>
<br><b> Fehlermeldungen bei allgemeinen Tests </b>
<br>
</p>
<p>Diese und einige der folgenden Fehler k&ouml;nnen u.U sofort nach
dem Einschalten auftreten.
<br>
</p>
<dl>
<dt><b>R0</b></dt><dd> Low memory failed while setting up to run test.
<br>&nbsp;
<dt><b>R1</b></dt><dd> Failed walking 1s or 0s.
<br>Fehlerhafte Adressleitung(en)
<br>&nbsp;
<dt><b>R2</b></dt><dd> Failed address (counting pattern) Auch das kann eine fehlerhafte
Adressleitung sein.
<br>(Kontaktproblem an <a href="080105.htm" target="UDOcon">MMU</a>)
<br>
<br>&nbsp;
<dt><b>R3</b></dt><dd> Failed 64k boundary test. Probable failure im <a href="080105.htm" target="UDOcon">MMU</a>.
<br>Fehler im unteren Speicherbereich.
<br>
<br>&nbsp;
<dt><b>R4</b></dt><dd> Failed displaying area tested (<a href="12.htm" target="UDOcon">Video</a> Ram).
<br>Fehler im Videospeicher.
<br>
<br>&nbsp;
<dt><b>I1</b></dt><dd> RAM data line is stuck.
<br>Eine Datenleitung zum RAM ist besch&auml;digt
<br>Es kann auch eine Unterbrechung oder ein Kurzschlu&szlig; sein
<br>
<br>&nbsp;
<dt><b>I2</b></dt><dd> RAM disturbance. Location is altered by write to another
location.
<br>Allgemeiner Ramfehler
<br>
<br>&nbsp;
<dt><b>I3</b></dt><dd> RAM addressing. Wrong location is being addressed.
<br>Falsche Adresse im RAM
<br>
<br>&nbsp;
<dt><b>I4</b></dt><dd> <a href="080105.htm" target="UDOcon">MMU</a> error. No DTACK after RAM access.
<br>Fehler in der Speicherverwaltung
<br>Es kommt kein DTACK nach dem RAM-Zugriff
<br>
<br>&nbsp;
<dt><b>I5</b></dt><dd> RAM sizing error. Uppermost address fails.
<br>Fehlerhafte Speichererkennung
<br>Die h&ouml;chste Adresse im RAM ist falsch
<br>
<br>&nbsp;
<dt><b>I6</b></dt><dd> Bus error handling failed. Bus error occurred (on purpose), but
<br>caused a crash system was unable to read the vector from RAM
<br>
<br>&nbsp;
<dt><b>I7</b></dt><dd> Bus error not detected. COMBEL not asserting Bus error or
<br>signal is not reaching the 68030
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br><b> Systemtiming testen </b>
<br>
</p>
<dl>
<dt><b>T0</b></dt><dd> MFP timers failed.
<br>Das testen der MFP-Timer ist fehlgeschlagen
<br>
<br>&nbsp;
<dt><b>T1</b></dt><dd> Vertical sync timing failed.
<br>Timing des vertikalen Sycronsignal ist ausserhalb der Toleranz
<br>
<br>&nbsp;
<dt><b>T2</b></dt><dd> Horiontal sync timing failed
<br>Timing des Horizontal-Sycronsignals ist ausserhalb der Toleranz
<br>
<br>&nbsp;
<dt><b>T3</b></dt><dd> Display enable interrupt failed
<br>Bildschirminterrupt ist nicht vorhanden
<br>
<br>&nbsp;
<dt><b>T4</b></dt><dd> Memory controller video address counter failed
<br>Der Adressz&auml;hler des Videorams arbeitet Fehlerhaft
<br>
<br>&nbsp;
<dt><b>T5</b></dt><dd> PSG Bus test. PSG chips is causing a bus error by staying on the
<br>data bus too long.
<br>Der <a href="080109.htm" target="UDOcon">Soundchip</a> hat einen Busfehler erzeugt
<br>
<br>&nbsp;
<dt><b>T6</b></dt><dd> Floppy Disk Controller Bus test. <a href="040a.htm" target="UDOcon">AJAX</a> Chip is causing a bus error
<br>by staying on the bus too long.
<br>Der Floppycontroller hat einen Buserror erzeugt
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br><b> <a href="080104.htm" target="UDOcon">Blitter</a> Test </b>
<br>
</p>
<dl>
<dt><b>G1</b></dt><dd> Internes Ram im Blitterchip kann defekt sein.
<br>&nbsp;
<dt><b>G2</b></dt><dd> Ausgabemaske defekt
<br>&nbsp;
<dt><b>G3</b></dt><dd> Operationsfehler, Zugriff, falsches Kommando.
<br>&nbsp;
<dt><b>G4</b></dt><dd> Interne Ramoperation falsch
<br>&nbsp;
<dt><b>G5</b></dt><dd> Verarbeitungsfehler in einer internen Operation
<br>&nbsp;
<dt><b>G6</b></dt><dd> Invertiertes Berechnen liefert ein falsches Ergebniss
<br>&nbsp;
<dt><b>G7</b></dt><dd> Ausnahmeverarbeitung (force extra source read)
<br>&nbsp;
<dt><b>G8</b></dt><dd> Verwischte Darstellung, das gezeichnetes Muster ist nicht korrekt
<br>&nbsp;
<dt><b>G9</b></dt><dd> X Z&auml;hlung fehlerhaft
<br>&nbsp;
<dt><b>G10</b></dt><dd> Y Z&auml;hlung fehlerhaft
<br>&nbsp;
<dt><b>G11</b></dt><dd> Time Out bei internen Berechnungen aufgetreten
<br>&nbsp;
<dt><b>G12</b></dt><dd> Adre&szlig;z&auml;hler falsch
<br>&nbsp;
<dt><b>G13</b></dt><dd> <a href="080104.htm" target="UDOcon">Blitter</a> Bus Error
<br>&nbsp;
</dl>
<p>
<br>
<br><b> ROM Test </b>
<br>
</p>
<p>Beim Romtests werden die ROM-Bausteine in dem entsprechenden
Computer ausgelesen und die Checksumme errechnet. Die Module ermitteln
Checksummen f&uuml;r ROMs die in USA/Canada, England, Frankreich,
Deutschland und Spanien eingesetzt wurden. (PAL und NTSC Norm).
</p>
<pre>
   ROM Addresse:
   Gerade  ,  Ungerade             192K TOS-ROM       16K BOOT-ROM
   ----------------------------------------------------------------
   U4(HI-0),  U7(LO-0)             FC0000-FCFFFF      FC0000-FC4000
   U3(HI-1),  U6(LO-1)             FD0000-FDFFFF
   U2(HI-2),  U5(LO-2)             FE0000-FEFFFF

                                   256K TOS-ROM (1040STE)
                                   E00000-E40000

                                   512K TOS-ROM (TT030)
                                   E00000-E80000
</pre>
<p>Wichtig zu Wissen ist die Tatsache das gepachte ROM-Versionen
-auch- keine korrekte Checksumme erzeugen und somit als Defekt
angezeigt werden. Wenn sie sich in dem Fall nicht sicher sind ob die
TOS ROMs oder Eproms defekt sind bleibt nur der Test in einem
Baugleichen Atari Computer.
<br>
</p>
<p>Das Testen u. Vergleichen mit einem Eprommer geht nat&uuml;rlich
auch, vorausgesetzt man besitzt das originale File das vormals in das
Eprom gebrannt wurde.
<br>
</p>
<p>
<br>
<br><b> RAM und SRAM Test </b>
<br>
</p>
<p>Die ausf&uuml;hrlichen RAM-Tests starten mit dem testen des 32K
SRAM. Es werden bei jedem Ramtest unterschiedliche Testmuster in den
entsprechenden Speicher geschrieben und dann wieder gelesen.
<br>
</p>
<p>Der Reihe nach laufen so Tests mit 11, 00 und AA sowie 55
Bitmustern ab. Danach werden die Muster zuf&auml;llig geschrieben und
wieder gelesen. Nach dem SRAM beginnt der Test des Systemrams. Das
Systemram wird in drei Stufen getestet, zuerst die untersten 2K, dann
der Bereich bis 64K und als letztes alles was &uuml;ber diesen 64K
liegt.
<br>
</p>
<p>Das DSP SRAM wird mit den gleichen Mustern getestet. Nachfolgend
eventuell m&ouml;gliche Fehlermeldungen.
<br>
</p>
<p>Wird ein Ramfehler erkannt wechselt die Bildschirmfarbe nach Rot
und es wird eine Reihe von Beept&ouml;nen ausgegeben, einem Fehlercode
folgt die zutreffende Adresse des Ram an dem der entsprechende Fehler
entdeckt wurde. Mit diesen Daten lassen sich dann die Adressleitungen
und auch der entsprechende Speicherchip ausfindig machen.
<br>
</p>
<pre>Beispiel:
Code  Adresse  Write   Read    Fehlerbit
-------------------------------------------
R3    45603E   W:603E  R:613C  bad bits 1,8
-------------------------------------------
Art   Adresse  W-Data  R-Data  Speicherzelle

</pre>
<p>
<br>
</p>
<p>Ein gefundener Fehler wird mit der Fehlerart, seiner Adresse, den
in diese Zelle geschriebenen Wert, den gelesenen Wert und die Angabe
der betroffenen Speicherbits ausgegeben.
</p>
<p>
<br>
<br><b> Spezielle Meldungen beim Ramtest </b>
<br>
</p>
<dl>
<dt><b>R0</b></dt><dd> Low memory failed while setting up to run test
<br>Die untersten 2K Ram stehen nicht zur Verf&uuml;gung
<br>
<br>&nbsp;
<dt><b>R1</b></dt><dd> Failed walking 1s or 0s
<br>Problem mit den Adressleitungenm, Treiber defekt
<br>
<br>&nbsp;
<dt><b>R2</b></dt><dd> Failed address (counting pattern)
<br>Keinen Zugriff auf diese Adresse
<br>
<br>&nbsp;
<dt><b>R3</b></dt><dd> Failed 64k boundary test. Probable failure in Memory Controller
<br>M&ouml;glicherweise Fehler im Videoram oder in den untersten
2Kbyte
<br>
<br>&nbsp;
<dt><b>R4</b></dt><dd> Failed while displying area tested (<a href="12.htm" target="UDOcon">Video</a> RAM)
<br>Fehler beim Testen des Videospeichers
<br>
<br>&nbsp;
<dt><b>DSP4</b></dt><dd> SRAM Test Timeout. Test started but never completed
<br>Timeout beim SRAM Test
<br>
<br>&nbsp;
<dt><b>DSP5</b></dt><dd> SRAM failure. RAM failure during SRAM test
<br>(Nicht bei allen Modellen!!)
<br>
<br>
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br><b> MIDI Test </b>
<br>
</p>
<p>Der Miditest kann nur erfolgreich abgeschlossen werden wenn an
beiden Midibuchsen der Midi-Loopbackstecker angeschlossen wurde. Das
kommerzielle ferige Loopback-Kabel hat zu diesem Zweck ein Leuchtdiode
im Kabel die blinkt sofern Daten gesendet werden. Zum Test wird ein
Datenpacket versendet welches sogleich auf der zweiten Midibuchse
wieder emfpfangen und mit den eben gesendeten Daten verglichen wird.
Zu bemerken w&auml;re noch das nicht alle Kabel die man erh&auml;lt
eine LED eingebaut haben!
<br>
</p>
<p>Wenn dieser Test gestartet wurde wird gleichzeitig der Interrupt
vom 8650 &uuml;berpr&uuml;ft der am MFP dann ankommen sollte.
<br>
</p>
<p>Nachfolgend die Midi-Fehlermeldungen des Testmoduls.
<br>
</p>
<dl>
<dt><b>M0</b></dt><dd> Data not received. Indicates a broken data line
<br>Daten konnten nicht empfangen werden
<br>Vermutlicher Kablebruch oder Schnittstellendefekt
<br>
<br>&nbsp;
<dt><b>M1</b></dt><dd> Write/Read data mismatch. The data written was not the same as
the data read
<br>Lese- oder Schreibfehler. Die Daten die gesendet wurden konnten
<br>nicht oder nur falsch gelesen werden
<br>
<br>&nbsp;
<dt><b>M2</b></dt><dd> Input frame error or noisy signal
<br>Kein Signal oder unvollst&auml;ndiges schlechtes Midi-Signal
<br>
<br>&nbsp;
<dt><b>M3</b></dt><dd> Input parity error.
<br>Midi Input ist nicht korrekt
<br>
<br>&nbsp;
<dt><b>M4</b></dt><dd> Input data overrun. The 6850 received a byte before the previous
byte was read
<br>Zuviele Daten. Der 6850 emfp&auml;ngt Daten bevor welche gesendet
wurden
<br>
<br>&nbsp;
<br>
<br>
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br><b> serielle Schnittstelle </b>
<br>
</p>
<p>Beachten sie bitte das alle diese Tests den externen
Loopback-Teststecker voraussetzen. Ohne den Loopback werden alle Tests
negativ erscheinen. Wenn die serielle Schnittstelle nicht funktioniert
hat das leider oft einen defekten MFP als Ursache. In dem Fall kann
auch keine Verbindung zu einem funktionierendem Atari hergestellt
werden. Im Fehlerfall mu&szlig; zwingend die serielle Schnittstelle
zuerst repariert werden.
<br>
</p>
<dl>
<dt><b>S0</b></dt><dd>
<br>&nbsp;
<br>Data not received.
<br>MFP Pin 8 nach J6 Pin 2 &uuml;ber 1488 nach J6 Pin 3 nach MFP Pin
9 &uuml;ber 1489 messen. (Ohmmeter)
<br>&nbsp;
<dt><b>S1</b></dt><dd> Data mismatch. Siehe oben.
<br>&nbsp;
<dt><b>S2</b></dt><dd> Input frame error.
<br>Vermutlich basierend auf einem defekten MFP.
<br>&nbsp;
<dt><b>S3</b></dt><dd> Input parity error. Siehe oben.
<br>&nbsp;
<dt><b>S4</b></dt><dd> Input data overrun.
<br>
<br>&nbsp;
<dt><b>S5</b></dt><dd> No IRQ. <a href="080108.htm" target="UDOcon">CPU</a> oder <a href="080107.htm" target="UDOcon">GLUE</a> IRQ testen.
<br>&nbsp;
<dt><b>S6</b></dt><dd> Transmit error. Vermutlich defekter MFP Port.
<br>&nbsp;
<dt><b>S7</b></dt><dd> Transmit error interrupt
<br>&nbsp;
<dt><b>S8</b></dt><dd> Receive error interrupt
<br>&nbsp;
<dt><b>S9</b></dt><dd> RI/DTR connection.
<br>&nbsp;
<dt><b>SA</b></dt><dd> DCD/DTR connection. DTR hat keine Verbindung mit DCD.
<br>&nbsp;
<dt><b>SB</b></dt><dd> RTS/CTS connection. RTS hat keine Verbindung mit CTS.
<br>&nbsp;
</dl>
<p>
<br>
<br><b> Floppy Disk Test </b>
<br>
<br>
</p>
<p>Wenn Sie den Test f&uuml;r das Diskettenlaufwerk anw&auml;hlen
wird eine Testreihe gestartet die sich aus sieben Punkten
zusammensetzt.
<br>
</p>
<dl>
<dt><b>Floppy Quick Test</b></dt><dd> Sofern das Diskettenlaufwerk installiert ist und dieser Testpunkt
<br>aufgerufen wird, startet hier das formatieren, schreiben und lesen
<br>von Track 79 und Track 0 einer eingelegten Diskette
<br>Bei einer doppelseitigen Diskette findet dieser Test
logischerweise
<br>auf beiden Seiten dieser Diskette statt.
<br>Ist das Diskettenlaufwerk nicht installeriert wird an dieser
Stelle
<br>&uuml;berpr&uuml;ft ob das Drive aktiv ist und ob es sich um ein
ein- oder
<br>doppelseitiges Laufwerk handelt
<br>Bevor man diesen Test startet kann man allerdings schon im
Hauptmen&uuml;
<br>direkt unter dem RAM-Test sehen ob das Diskettenlaufwerk aktiv ist
<br>
<br>&nbsp;
<dt><b>Read Track</b></dt><dd> Kontinuierliches lesen eines Track von einer speziellen analogen
<br>Testdiskette. Zum Start kann ein bestimmter Track ausgew&auml;hlt
werden
<br>Default-Lesetrack ist Track 40 eingestellt
<br>
<br>&nbsp;
<dt><b>Interchangeabilitiy Test</b></dt><dd> Hier wird &uuml;berpr&uuml;ft ob das Laufwerk in der Lage ist
eine Diskette
<br>zu erkennen die mit einen anderen Laufwerk/Computer formatiert
wurde
<br>
<br>&nbsp;
<dt><b>Disk exerciser</b></dt><dd> Ein <a href="0b04.htm" target="UDOcon">Disketten</a> / Drive Dauertest
<br>Es werden alle Tracks einer Diskette f&uuml;r eine bestimmte dauer
getestet
<br>
<br>&nbsp;
<dt><b>Copy Protect Tracks</b></dt><dd> Testet die Tracks 80 - 82 einer eingelegten Diskette
<br>Einige Softwarehersteller ben&uuml;tzen diese Spuren f&uuml;r
einen Kopierschutz
<br>WARNUNG: Nicht alle <a href="0b.htm" target="UDOcon">Diskettenlaufwerke</a> k&ouml;nnen auf diesen
Spuren lesen
<br>und schreiben, mechanische Sch&auml;den am Laufwerk sind nicht
ausgeschlossen!!
<br>
<br>&nbsp;
<dt><b>Test Speed</b></dt><dd> Dieser Test &uuml;berpr&uuml;ft die Drehzahl des
Diskettenlaufwerks
<br>Die Geschwindigkeit wird am Bildschirm angezeigt
<br>Eine Drehzahl von 196-204 Upm (Millisekunden) ist f&uuml;r ein
Atari-Kompatibles Diskettenlaufwerk akzeptabel
<br>H&ouml;here oder niedrigere Drehzahlen f&uuml;hren zur
inkompatibilit&auml;t mit andern Drives
<br>Der Test wird mit einem Tastendruck beendet
<br>
<br>&nbsp;
<dt><b>Install Disk</b></dt><dd> Hier geben Sie spezifisch f&uuml;r ihren Atari an welchen Typ
<br>von Diskettenlaufwerk sie einbauen wollen
<br>
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Ist einer oder mehrere Testzyklen vom Hauptmen&uuml; aus
angew&auml;hlt wird das spezielle Floppy-Men&uuml; nicht angezeigt,
hier startet der &quot;Quick-Test&quot; automatisch. Mit diesem Test
ist es weiterhin m&ouml;glich den Schreibschutz des Laufwerks zu
testen. Beachten Sie bitte das die Daten auf einer eingelegten
Diskette &uuml;berschrieben werden!
<br>
</p>
<p>
<br>
<br><b> DMA </b>
<br>
</p>
<p>Alle DMA Tests k&ouml;nnen nur mit der externen Testplatine
gemacht werden. Die Daten auf einer angeschlossenen Festplatte werden
besch&auml;digt!
<br>
</p>
<dl>
<dt><b>D0</b></dt><dd> DMA time out. Signalpegel von den Signalen HDINT und HDRQ, Pin
23, &uuml;berpr&uuml;fen. Vergleiche Sie das Signal HDINT mit INTR Pin
34 am MFP.
<br>&nbsp;
<dt><b>D1</b></dt><dd> DMA counter error.
<br>&nbsp;
<dt><b>D2</b></dt><dd> Data mismatch error. Eventuell defekter Floppycontroller.
Vorsicht..
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>
<br>
<br><b> Printer und Joystick Test </b>
<br>
</p>
<p>Das Anschu&szlig;kit f&uuml;r den Drucker- und die Joystickports
erlaubt das senden von Testdaten &uuml;ber den Druckerport. Diese
Daten werden auf dem Testboard von einem Latch empfangen und wieder an
den Druckerport gesendet. Tests f&uuml;r die Joystickports generieren
Daten die &uuml;ber den Druckerport zu den verschiedenen
Joystick-Eing&auml;ngen geschickt werden. Die Tastatur liest diese
Daten in den Antwortpaketen die die <a href="080108.htm" target="UDOcon">CPU</a> versendet.
<br>
</p>
<p>S&auml;mtliche Richtungsangaben, das Bet&auml;tigen der
Feuerkn&ouml;pfe sowie die Testes der Paddle- und
Lightgun-Anschl&uuml;sse kann nur so getestet werden. Es ist im
&uuml;brigen die gleiche Testplatine wie sie auch f&uuml;r
STe-Computer zum Einsatz kommt.
<br>
</p>
<p>Folgende Fehlermeldungen kann das Testkit erzeugen:
<br>
</p>
<dl>
<dt><b>P0</b></dt><dd> Printer port error
<br>Data read from the printer port was not what was written
<br>Daten die von Druckerport gelesen werden sind die nicht die
<br>gleichen Daten die zuvor geschrieben wurden
<br>
<br>&nbsp;
<dt><b>P1</b></dt><dd> Busy input error
<br>The input to the MFP is not being read, or the STROBE output from
<br>the PSG is not funcioning, or Joystick Port 0 Pin 3 is not
connected
<br>Das Busysignal l&ouml;st am MFP keinen Interrupt aus
<br>Entweder erzeugt der PSG-Chip kein STROBE-Signal oder am Joystick
0
<br>ist Pin 3 nicht angeschlossen. Es kann auch der PSG defekt sein
<br>
<br>&nbsp;
<dt><b>J0</b></dt><dd> Joystick port 0
<br>The keyboard input is not functioning
<br>Es k&ouml;nnen keine Inputs von diesem Joystick gelesen werden
<br>
<br>&nbsp;
<dt><b>J1</b></dt><dd> Joystick port 1
<br>The keyboard input is not functioning
<br>Es k&ouml;nnen keine Inputs von diesem Joystick gelesen werden
<br>
<br>&nbsp;
<dt><b>J2</b></dt><dd> Joystick time out
<br>Joystick inputs were simulated by outputting data on the printer
port
<br>and routing via the test fixture to the joystick ports. Joystick
inputs
<br>are detected by the keyboard and sent to the <a href="080108.htm" target="UDOcon">CPU</a> via the 6850
(<a href="08010a.htm" target="UDOcon">ACIA</a>)
<br>This error can be caused by printer port failure (code P0),
keyoard failure
<br>or keyboard-<a href="080108.htm" target="UDOcon">CPU</a> communication line
<br>Die Joystick Inputs die &uuml;ber den Druckerport generiert wurden
und &uuml;ber das
<br>externe Testboard zu den Joystick-Eing&auml;ngen geroutet wurden
sind fehlerhaft
<br>Dieser Fehler kann auf einen defekt der Tastatur-<a href="08010a.htm" target="UDOcon">ACIA</a>, einen
defekt am PSG
<br>oder aber auch auf einen defekt der seriellen Leitung zwischen
<a href="0f01.htm" target="UDOcon">Keyboard</a>-<a href="080108.htm" target="UDOcon">CPU</a>
<br>und der ACAI hinweisen
<br>
<br>&nbsp;
<dt><b>J3</b></dt><dd> Left button input
<br>Input not seen by the test board
<br>Die linke Taste kann nicht emfpangen werden
<br>
<br>&nbsp;
<dt><b>J4</b></dt><dd> Right button input
<br>Not seen by the test board
<br>Die rechte Taste kann nicht empfangen werden
<br>
<br>&nbsp;
<dt><b>J5</b></dt><dd> Aux joystick direction
<br>Game controller board (J500, J501) direction bits
<br>U511 is used to drive the input via the test fixture. The
hexadecimal data
<br>following corresponds to bits read from latches U510 and U512,
where one
<br>indicates an error. For example, 0002 indicates and error at J500
Pin 3
<br>Die Richtungstasten des Joystick erzeugen an den Latches U510 /
U512 bestimmte &quot;Richtungs-Bits&quot; die als hexadezimale Daten
weitergegeben werden
<br>Eines der beiden Latches zeigt Fehler an!
<br>Als Beispiel: 0002 zeigt einen Fehler an J500 Pin 3 an
<br>
<br>&nbsp;
<dt><b>J6</b></dt><dd> Aux fire button
<br>Fire buttons are read from U509. Signal is driven via the test
fixture
<br>from the output of U511
<br>Latch U509 liest die &quot;Firebuttons&quot; vom Joystick
<br>
<br>&nbsp;
<dt><b>J7</b></dt><dd> Paddle
<br>The inputs are driven by either 5V/100Ohm or 5V/1MOhm on the test
fixture
<br>This current charges the RC network on the Atari, varying the
output pulse
<br>of the LM556
<br>Das Testboard generriert analoge &quot;Steuerdaten&quot; f&uuml;r
die RC-Glieder
<br>Einmal sind das 5V/100Ohm und 5V/1MOhm, diese Inputs werden an die
internen
<br>RC-Glieder angelegt und Steuern entsprechend den LM556
<br>(Welcher die Daten an den Combel weiterreicht)
<br>
<br>&nbsp;
<dt><b>J8</b></dt><dd> Light gun
<br>The light gun (XPEN) input is toggled at three poins on the screen
<br>(the video adress counter is used to find the position of the
screen
<br>The Combel should return the X/Y coordinates of the screen
position
<br>&Uuml;ber den XPEN Pin werden Daten eines Lichtpunktes auf dem
Bildschirm geliefert
<br>Der Videoadressenz&auml;hler wird benutzt um die Position auf dem
Schirm zu finden
<br>Der Combel liefert danach die relevante X/Y Koordinate auf dem
Bildschirm
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br><b> <a href="0f01.htm" target="UDOcon">Keyboard</a> Test </b>
<br>
</p>
<dl>
<dt><b>K0</b></dt><dd> Eine oder mehrere Taste(n) klemmt, dazu wird der <a href="1908.htm" target="UDOcon">Scancode</a> dieser
Taste ausgegeben.
<br>&nbsp;
<dt><b>K1</b></dt><dd> <a href="0f01.htm" target="UDOcon">Keyboard</a> not responding
<br>
<br>&nbsp;
<br>Die Tastatur kommuniziert nicht. Das kann ein defekter
Tastaturprozessor sein, aber auch eine defekte <a href="08010a.htm" target="UDOcon">ACIA</a> 6850.
M&ouml;glicherweise gibt es einen Kabelbruch im Tastaturanschlu&szlig;
oder es ist eine kalte L&ouml;tstelle am Steckanschlu&szlig;.
<br>&nbsp;
<dt><b>K2</b></dt><dd> <a href="0f01.htm" target="UDOcon">Keyboard</a> status error
<br>
<br>&nbsp;
<br>Der Selbsttest beim einschalten war nicht erfolgreich. Tastatur
<a href="080108.htm" target="UDOcon">CPU</a> ersetzen oder die ganze Tastatur austauschen.
<br>&nbsp;
</dl>
<p>
<br>
<br><b> Romport / Expansions Bus </b>
<br>
</p>
<p>Das Anschu&szlig;kit f&uuml;r den Expansionsport erlaubt es den
gesamten Romport mit allen Adress- und Datenleitungen komplett zu
testen. Der Testanschlu&szlig; hat einen Speicher von 64Kb statischem
Ram und ist mit Jumpern auch auf 128K selektierbar. Dieses Ram wird
beim PowerUp adressiert von $FC000 bis $FDFFFF und kann per Software
in den Bereich von $FA0000 bis $FDFFFF gemappt werden.
<br>
</p>
<p>Dieser Speicherbereich ist nicht bei allen Modellen gleich!
<br>
</p>
<p>Das ist der eigentliche Modul - Bereich im Ram. Das bedeutet das
die Software des Testmoduls hier geladen werden kann um dann aus dem
statischen Ram gestartet zu werden. Der 'Romport-Tester' kann
ebendfalls so Konfiguriert werden das er die beiden Eproms aus dem
Testmodul auf seiner eigenen Platine tragen und auch ausf&uuml;hren
kann.
<br>
</p>
<p>Bevor Sie jedoch die schlimmsten Bef&uuml;rchtungen anstellen
sollten Sie einfach nachsehen ob die bei einigen Modellen vorhandene
Romport-Sicherung noch intakt ist, n&auml;heres dazu finden Sie unter
Expansionsport oder Romport. Auch ist es durch normalen
Verschlei&szlig; m&ouml;glich das die Karte welche Sie in den Romport
gesteckt haben einfach keinen richtigen Kontakt zu der Federleiste
herstellen kann. U.u liegt es einfach nur an verschmutzten Kontakten.
<br>
</p>
<p>Die Kontaktfl&auml;chen der Module / Karten lassen sich gut mit
einem normalen Radiergummi reinigen. Hier gen&uuml;gt -leichtes-
Rubbeln mit der blauen Seite. Die Kontaktfedern der Romportbuchse
bed&uuml;rfen eigentlich keiner Wartung.
<br>
</p>
<p>Sollten Kontaktfedern verbogen oder gar Kurzgeschlossen sein sind
Sie gut beraten die ganze Buchse komplett Auszutauschen. Das
Nachbiegen einzelner Kontaktfedern wird nur in den wenigsten
F&auml;llen gl&uuml;cklich enden
<br>
</p>
<p>Bei einer normalen Testkonfiguration hat der Porttester folgende
Hardware:
<br>
</p>
<p>Controllregister F70000-F70002
<br>Extener <a href="080104.htm" target="UDOcon">Blitter</a> F78A00-F78A3F
<br>64K / 120 nS. statisches Ram von FC0000 bis FCFFFF
<br>
</p>
<p>Die Testzyklen f&uuml;r den Romport laufen nach folgendem Schema
ab:
<br>
</p>
<dl>
<dt><b>Step 1</b></dt><dd> Die 64K Ram werden benutzt um die Adressleitungen A0-A15
<br>und alle Datenleitungen auf offene oder kurzgeschlossene
<br>Verbindungen zu pr&uuml;fen
<br>
<br>&nbsp;
<dt><b>Step 2</b></dt><dd> Die Adressleitungen A16-A32 werden beim lesen von den oberen 256
Adressen
<br>und dem Zwischenspeichern in einem Latch Adresse f&uuml;r Adresse
getestet
<br>
<br>&nbsp;
<dt><b>Step 3</b></dt><dd> Der externe <a href="080104.htm" target="UDOcon">Blitter</a> hat einige Modifikationen um den Atari
internen
<br><a href="080104.htm" target="UDOcon">Blitter</a> testen zu k&ouml;nnen. Dieser Test kontrolliert die
Master-
<br>Handshakeleitungen komplett
<br>
<br>&nbsp;
<dt><b>Step 4</b></dt><dd> Dieser Schritt testet die Interrupts nach ihrer Priorit&auml;t
<br>Getestet wird Interrupt 1,3,5 sowie 6
<br>Gefolgt vom Bus Error, HALT, RESET und 500Khz
<br>
<br>&nbsp;
</dl>
<p>Beachten Sie bitte das folgende Meldungen nur erscheinen wenn der
externe Romporttester vorhanden und auch angeschlossen ist
<br>Folgende Fehlermeldungen kann der Romporttest erzeugen:
<br>
</p>
<dl>
<dt><b>Spurious Interrupt 5</b></dt><dd> Ein Interrupt wurde auf Level 5 empfangen
<br>COMBEL, MFP und Interruptleitung 5 testen
<br>
<br>&nbsp;
<dt><b>Spurious Interrupt 1</b></dt><dd> Ein Interrupt wurde auf Level 1 empfangen
<br>COMBEL, MFP und Interruptleitung 1 testen
<br>
<br>&nbsp;
<dt><b>Spurious Interrupt 6</b></dt><dd> Ein Interrupt wurde auf Level 6 empfangen
<br>COMBEL, MFP und Interruptleitung 6 testen
<br>
<br>&nbsp;
<dt><b>Bus Error from Interrupt Level 6</b></dt><dd> Ein Buserror ist w&auml;hrend dem Test von Interrupt 6
aufgetreten
<br>COMBEL, MFP und Interruptleitung 6 testen
<br>
<br>&nbsp;
<dt><b>Bus Error</b></dt><dd> Ein Buserror ist w&auml;hrend dem Test aufgetreten
<br>COMBEL testen
<br>
<br>&nbsp;
<dt><b>Spurious Interrupt</b></dt><dd> Ein Interrupt wurde w&auml;hrend dem Test empfangen
<br>Alle Interruptleitungen testen
<br>MFP, COMBEL testen
<br>
<br>&nbsp;
<dt><b>Adress Error</b></dt><dd> Ein Interrupt wurde w&auml;hrend dem Test empfangen
<br>Alle Interruptleitungen testen
<br>COMBEL, MC68030 und alle Adressleitungen auf Unterbrechung
<br>oder Kurzschlu&szlig; testen!
<br>
<br>&nbsp;
<dt><b>Halt Failed Test</b></dt><dd> Eine 'HALT' Operation ist Fehlgeschlagen
<br>COMBEL, HALT-Leitung und <a href="080108.htm" target="UDOcon">CPU</a> testen
<br>
<br>&nbsp;
<dt><b>500Khz Clock Stuck Low</b></dt><dd> Die 500KHz Taktleitung ist tot oder der Takt ist zu niedrig
<br>COMBEL und die Taktleitung testen
<br>
<br>&nbsp;
<dt><b>500Khz Clock Stuck High</b></dt><dd> Die 500KHz Taktleitung ist tot oder der Takt ist zu hoch
<br>COMBEL und die Taktleitung testen
<br>
<br>&nbsp;
<dt><b>Printer is not Responding</b></dt><dd> Der Druckeranschlu&szlig; gibt keine Antwort
<br>Die Druckerdatenleitungen testen
<br>SDMA, COMBEL und PSG testen
<br>
<br>&nbsp;
<dt><b>Bus Error Signal Stuck Low</b></dt><dd> Das Bus Error Signal fehlt
<br>COMBEL und die Bus Error Leitung testen
<br>
<br>&nbsp;
<dt><b>Bus Error Signal Stuck High</b></dt><dd> Das Bus Error Signal ist dauernd vorhanden
<br>COMBEL und die Bus Error Leitung testen
<br>
<br>&nbsp;
<dt><b><a href="080104.htm" target="UDOcon">Blitter</a> Failed Test</b></dt><dd> Test des externen Blitters ist fehlgeschlagen
<br>COMBEL und alle Adress- und Datenleitungen testen
<br>
<br>&nbsp;
<dt><b>Expansions Port is not connected</b></dt><dd> Das Testboard f&uuml;r den Romport ist nicht angesteckt worden
<br>
<br>&nbsp;
<dt><b>Adress Latch Failed</b></dt><dd> Das Latch f&uuml;r die Adressen hat einen fehler
<br>COMBEL testen
<br>
<br>&nbsp;
<dt><b>Interrupt Level 1 failed</b></dt><dd> Der Interrupt Level 1 ist fehlerhaft
<br>Testen Sie den COMBEL, MFP und die Interruptleitung 1
<br>
<br>&nbsp;
<dt><b>Interrupt Level 3 failed</b></dt><dd> Der Interrupt Level 3 ist fehlerhaft
<br>Testen Sie den COMBEL, MFP und die Interruptleitung 3
<br>
<br>&nbsp;
<dt><b>Interrrupt Level 5 failed</b></dt><dd> Der Interrupt Level 5 ist fehlerhaft
<br>Testen Sie den COMBEL, MFP und die Interruptleitung 5
<br>
<br>&nbsp;
<dt><b>Interrupt Level 6 failed</b></dt><dd> Der Interrupt Level 6 ist fehlerhaft
<br>Testen Sie den COMBEL, MFP und die Interruptleitung 6
<br>
<br>&nbsp;
<dt><b>Interrupt Priority failed</b></dt><dd> Der Interrupt-Priorit&auml;tstest ist fehlgeschlagen
<br>MFP, COMBEL und die Interruptleitungen testen
<br>
<br>&nbsp;
<dt><b>Ram failed</b></dt><dd> Der Ramtest ist fehlgeschlagen
<br>Den COMBEL sowie alle Adress- und Datenleitungen testen
<br>
<br>&nbsp;
</dl>
<p>An dieser Stelle ist &uuml;brigens f&uuml;r jeden gut zu erkennen
das es nicht m&ouml;glich ist mit dem Testmodul alleine bestimmte
Fehler eines Ataris zu erkennen. Nur mit den externen und
Zus&auml;tzlichen Testbaugruppen ist ein ausf&uuml;hrlicher und
kompletter Test der Hardware m&ouml;glich. Beachten Sie hier jedoch
auch das ihnen die teuerste Testhardware auch das denken nicht
abnehmen wird.
<br>
</p>
<p>
<br>
<br>
</p>
<p>Wenn Sie eine defekte Einheit reparieren wollen sollten Sie sich
so weit wie m&ouml;glich an die einzelnen Schritte der Grafiken
halten. Nur so ist es m&ouml;glich gezielt und ohne sich zu verheddern
einen bestimmten Fehler zu finden. Sehr viele Fehler werden damit
beginnen das der Atari keine Bildschirmausgabe erzeugt.
<br>
</p>
<p>Sollten Sie keine Bildschirmausgabe haben k&ouml;nnen Sie auch
zuerst versuchen die H- und Vsync. Signale im Atari zu lokalieren.
Werden die nicht erzeugt liegt das meistens an einem defekten COMBEL,
<a href="080107.htm" target="UDOcon">GLUE</a> oder SHIFTER.
<br>
</p>
<p>Abschlie&szlig;end bleibt noch zu sagen das das hier auf keinen
Fall und unter keinen Umst&auml;nden das Manual f&uuml;r eben das
Atari-Testkit ersetzt wird! Es k&ouml;nnen hier lediglich einige
erg&auml;nzende Tips und &uuml;bersetzte Fehlermeldungen wiedergegeben
werden um so die Arbeit, eine n&ouml;tige Reparatur am Atari
wesentlich zu erleicherten Auch hat diese Zusammenstellung keinen
Anspruch auf Vollst&auml;ndigkeit
<br>Es werden nur Punkte wiedergegeben die ich selber schon benutzen
musste
<br>
<br>
<br><b> Note: </b>
<br>
</p>
<p>Beachten Sie bitte das bei einmaligen einstecken eines Testmoduls
in einen Atari Atari F030 oder einen Atari TT dessen Setup im NVRAM
komplett durch das Default-Setting des Testkits &uuml;berschrieben
wird. Keine Panik, Ihr Rechner bootet nachher wie gewohnt auch von der
IDE-Festplatte. Allerdings ist die Landessprache, die Keyboardbelegung
und die Bildschirmaufl&ouml;sung verstellt. Ebenso stimmt die Uhrzeit
und das Datum nicht mehr
<br>
</p>
<p>Benutzen Sie folgende Programme von einer 1.4 MB HD-Diskette:
<br>
</p>
<p>BOOTKONF.PRG 1.3 von Uwe Seimet
<br>CONFIG.PRG von Atari Corp.
<br>RESETNVR.PRG von Atari Corp.
<br>
</p>
<p>BOOTKONF.PRG dient dazu alle NVRAM-Parameter einzustellen. Mit
CONFIG.PRG stellen Sie den Rechner auf ihre Landessprache ein.
RESETNVR.PRG sollten Sie auf einer Diskette im Autoordner liegen
haben, das ist f&uuml;r den Fall in dem ihr Atari Falcon, TT nichts
mehr tut, booten Sie dann einmal von dieser Diskette. Alle
Parametereingaben aus beiden Programmen werden erst nach einem
erneuten Kaltstart des Systems aktiv!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari ST Series Hardware" border=0 width="24" height="24"></a>
<a href="030b.htm" target="UDOcon"><img src="udo_lf.gif" alt="MegaST Bus" border=0 width="24" height="24"></a>
<a href="030d.htm" target="UDOcon"><img src="udo_rg.gif" alt="Symtom" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
