<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Startrak Hardware
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0504.htm" target="UDOcon"><img src="udo_up.gif" alt="Milan Audio Hardware" border=0 width="24" height="24"></a>
<a href="0504.htm" target="UDOcon"><img src="udo_lf.gif" alt="Milan Audio Hardware" border=0 width="24" height="24"></a>
<a href="0505.htm" target="UDOcon"><img src="udo_rg.gif" alt="Milan Video Hardware" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Startrak_20Hardware">5.4.1 Startrak Hardware</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Die Startrack-Karte am MILAN </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Die StarTrack Audiokarte ist neben den andern Ausf&uuml;hrungen
nun auch f&uuml;r den Milan verf&uuml;gbar. Von der Milan GmbH wurde
hierf&uuml;r extra ein Adapter von VME auf PCI entwickelt (PCI to VME
Bridge) und auf einer der Atari-Messe vorgef&uuml;hrt.
<br>
</p>
<p>Die Startrack-Audiokarte profitiert von der enormen
Leistungsf&auml;higkeit des PCI-Bus, da die Audiokarte ungebremst mit
PCI-Takt angesteuert wird. Die Software l&auml;uft laut Hersteller
einwandfrei auf dem Milan.
<br>
</p>
<p>Damit steht nun auch f&uuml;r den Milan eine professionelle
Audiokarte und <a href="1301.htm" target="UDOcon">Audio</a> Mastering-Software zur Verf&uuml;gung.
<br>
<br>
<br>
</p>
<p><b> Die folgenden Programme laufen einwandfrei </b>
<br>
</p>
<p>- Soundpools DSP-Suite (Analyser,Equalizer,De-Noiser,Dynamite)
<br>- VoXX
<br>- Winrec
<br>- Trackcom
<br>- Zero-X
<br>- Frak,Frakt-me (Fraktale mit DSP-Support)
<br>- Gemjing
<br>- AIFF-Player
<br>- Gem-Mpeg (MPEGVideo-Decoder)
<br>- Aniplayer
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Features der Software </b>
<br>
</p>
<p>Voller 24Bit-Support:
<br>
</p>
<p>Alle Funktionen sind nun ebenfalls mit 24Bit Aufl&ouml;sung
nutzbar und wurden f&uuml;r die 24Bit-Aufl&ouml;sung angepasst. Im
<a href="080108.htm" target="UDOcon">CPU</a>-Mode sind die vollen 24Bit nutzbar, bei derzeit ca. 8-12 Spuren.
Ausserdem k&ouml;nnen 16Bit-Samples im Tracker ohne
Qualit&auml;tsverlust (24Bit <a href="080108.htm" target="UDOcon">CPU</a>-Mode) gemischt werden ! Ebenfalls
&ouml;nnen 24Bit-Samples und 16Bit-Samples auch zusammen verwendet und
gemischt werden
<br>
<br>Plugin-Schnittstelle:
<br>
</p>
<p>Es gibt nun eine Plugin-Schnittstelle f&uuml;r <a href="080108.htm" target="UDOcon">CPU</a>-Effekte und
Zusatzprogramme. Es k&ouml;nnen bis zu 5 Plugins pro Effektweg
verwendet werden. Dabei kann ein Plugin auch mehrmals in den Effektweg
eingebunden werden
<br>(Effektlisten im Plugin Config-Dialog)
<br>
<br>DSP-Plugins:
<br>
</p>
<p>Die parametrischen DSP-Effektplugins von WINREC k&ouml;nnen in
StarTrack eingebunden werden. TT-<a href="080105.htm" target="UDOcon">MMU</a> Programm f&uuml;r den TT spiegelt
die DSP-Register in den Falcon Adressbereich (F&uuml;r max.
Kompatibilit&auml;t) Das Peakmeter-Fenster wurde komplett
&uuml;berarbeitet (dB-Einteilung, alternierendes Peakhold) Das
Peakmeter hat nun besonders im oberen Aufl&ouml;sungsbereich von -6
bis 0 dB eine sehr feine Aufl&ouml;sung. Bei gr&ouml;&szlig;erem
Peakmeter-Fenster wird die Darstellung der Zeitanzeige deutlich
vergr&ouml;&szlig;ert dargestellt. Die Samplewert-Anzeige im Editor
wurde f&uuml;r einen ausreichenden Wertebereich auf 10 Stellen
erweitert. Au&szlig;erdem ist der Wert nun durch eine 1000er
Punktaufteilung besser lesbar.
<br>
</p>
<p>Editor und Tracker haben nun eine Zeitachsenbeschriftung bekommen.
<br>Speicherverwaltung komplett &uuml;berarbeitet, nutzt den Speicher
jetzt besser aus (vor allem auf Systemen mit ST UND TT-Ram).
<br>
</p>
<p>Schnellerer Bildaufbau durch Hintergrund-Screenrefresh
<br>Schlecht lesbare Beschriftungen bei gro&szlig;en Aufl&ouml;sungen
wurden entsprechend vergr&ouml;&szlig;ert.
<br>
</p>
<p>Startup-Soundutility f&uuml;r den Autoordner bzw.
MagiC-Startordner. Hiermit kann beim Start ein beliebiges Soundfile
abgespielt werden.
<br>
<br>
</p>
<p>Smpte-Frames:
<br>Nun Einteilung in 24,25,30,75(CD) und 100 frames ausw&auml;hlbar.
Alle Zeitangaben arbeiten dann ebenfalls in der entsprechenden
Frameeinteilung.
<br>
</p>
<p>Tastatur-Shortcuts f&uuml;r die wichtigsten Funktionen
<br>
</p>
<p>Das Update auf V2.0 ist voraussichtlich ab September 98
erh&auml;ltlich
<br>
<br>
<br>Alle technischen Daten (c) der jeweiligen Hersteller
<br>
<br>
<br>
</p>
<p align=center><img src="image/startrak.gif" border=0 width="707" height="521"></p><br>
<div align=center><tt> Abbildung 1 - <a href="1304.htm" target="UDOcon">Startrak</a> Midi </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br><b> STARTRACK-Harddisk Recording </b>
<br>
</p>
<p>F&uuml;r alle Atari TT,Hades &amp; Medusa-Systeme mit VME-Bus gibt
es die Startrack-Hardware.
<br>
</p>
<p>Die STARTRACK-Harddisk-Recording Soundkarte ist eine
4Layer-Platine. Die Karte besitzt digitale Ein/Ausg&auml;nge in Cinch
und Opto-Ausf&uuml;hrung und versteht die Consumer-Norm SP/DIF, aber
auch die Studioausf&uuml;hrung AES/EBU. Die Karte erkennt auch Fehler
in der digitalen <a href="1507.htm" target="UDOcon">Daten&uuml;bertragung</a> und zeigt die Art des Fehlers
an. Die Samplerate der digitalen Aufnahme wird
hardwarem&auml;&szlig;ig erkannt und im Programm ausgewertet und
angezeigt. Der Kopierschutz kann aus SCMS-gesch&uuml;tzten
Digitalaufnahmen vollst&auml;ndig entfernt werden. Eigene Aufnahmen
per Soundkarte k&ouml;nnen verlustfrei digital zur&uuml;ck per
DAT/DCC/MD &uuml;berspielt werden.
<br>
</p>
<p>Dabei kann gew&auml;hlt werden ob anschlie&szlig;end keine Kopien,
eine Kopie oder mehrere Kopien der Aufnahme m&ouml;glich bzw. erlaubt
sind. An Frequenzen verarbeiten die digitalen Eing&auml;nge
32/44.1/48kHz und dank allerneuester SP/DIF-Chips auch 96kHz
Samplerate. Hiermit ist sogar 24Bit-Mastering m&ouml;glich. Es sind
au&szlig;erdem je ein Stereo 16Bit A/D und 18Bit D/A-Wandler auf der
Karte mit 64fachem Oversampling und Sigma-Delta-Linearwandlern. Das
sind keine Billigwandler wie im Atari Falcon oder auf den meisten
PC-Soundkarten sondern erstklassige Wandler deren Qualit&auml;t von
HIFI-Zeitschriften bereits gew&uuml;rdigt wurden. Zusammen mit den
Digitaleing&auml;ngen kann die Karte im Vierkanal-Modus arbeiten.
Dabei kann man gleichzeitig vier Kan&auml;le aufnehmen und
wiedergeben. Eine De-Emphasis-Schaltung ist auch integriert und diese
kann &uuml;ber das Programm gesteuert werden. Das ist n&ouml;tig weil
einige CDs (z.B. von Heaven 17) zwecks Rauschminderung mit stark
angehobenen H&ouml;hen auf der CD verewigt wurden.
<br>
</p>
<p>Die Karte besitzt digital steuerbare
Highend-Lautst&auml;rkeregler/verst&auml;rker im Bereich -96dB bis
+32dB, kanalgetrennt regelbar mit 256 Abstufungen f&uuml;r den
A/D-Wandler (Aufnahme) und auch f&uuml;r den D/A-Wandler (Wiedergabe).
Mit der Karte ist nat&uuml;rlich auch Harddisk-Recording m&ouml;glich.
Man kann die Karte durch eine Erweiterungsplatine mit einem Motorola
DSP56002-66MHz (doppelte Falcon-Leistung) aufr&uuml;sten der
standardm&auml;&szlig;ig &uuml;ber zus&auml;tzliche 128K x 24Bit
SRAM/12ns verf&uuml;gt (viermal soviel wie im Falcon) Der DSP ist aber
f&uuml;r Harddisk-Recording nicht unbedingt n&ouml;tig, da die Karte
den Transfer selbst puffert. Daher steht der DSP quasi komplett
f&uuml;r Effekt-Berechnungen zur Verf&uuml;gung. Auf der
DSP-Erweiterung befindet sich auch ein Falcon-kompatibler DSP-Port
f&uuml;r Erweiterungen (Analog8, ADAT, JAM In/Out) z.B. auf 8
Einzelausg&auml;nge. Optional gibt es einen aufgebohrten
DSP-Doubleport f&uuml;r 2 Erweiterungen (2x Analog8, JAM-Out) f&uuml;r
bis zu 16 Einzelausg&auml;nge! Der DSP-Debugport (ONCE) ist
serienm&auml;&szlig;ig vorhanden und erlaubt Entwicklern und
Programmierern das komfortable Hardware-Debugging von DSP-Programmen.
Dieser Port ist kompatibel zum Entwicklungstool EVM56002 von Motorola.
Die Debug-Software ist kostenlos erh&auml;ltlich und erlaubt u.a.
Breakpoints, Trace, Auslesen und &Auml;ndern von Registern usw.
&Uuml;ber den DSP-Slot der HDR-Soundkarte sind prinzipiell auch andere
DSPs oder Erweiterungen denkbar.
<br>
</p>
<p>Anregungen hierzu sind durchaus erw&uuml;nscht. Durch eine weitere
Zusatzplatine kann das System voll studiotauglich gemacht werden, d.h.
h&ouml;here Line-Pegel und alle Anschl&uuml;sse in
XLR-Anschlu&szlig;norm. Die 3 digitalen Eing&auml;nge (optisch,koaxial
und AES/EBU) k&ouml;nnen &uuml;ber das Sample-Editor-Programm
umgeschaltet werden. Das erspart st&auml;ndiges Umstecken der Kabel.
Die A/D und D/A-Wandler k&ouml;nnen mit den &uuml;blichen 32/44.1 und
48kHz arbeiten, au&szlig;erdem aber noch mit
8/11/12/16/16.5/22.1/24/33.1 kHz und einem optional extern angelegten
Takt (Wordclock) der durch 768/512/384 oder 256 intern geteilt wird.
Der Wandlertakt kann au&szlig;erdem &uuml;ber ein Koaxkabel mit einem
CD-Laufwerk verbunden werden. Das ist bei einigen HighEnd-Laufwerken
m&ouml;glich und verhindert wirkungsvoll Jitter.
<br>
</p>
<p>Definitiv wird auf der DSP- Erweiterung ein Motorola DSP56002 mit
66MHz Taktrate verwendet, der voll kompatibel zum im Falcon
verwendeten DSP56001 ist. Dieser bringt die doppelte Leistung
verglichen zum Falcon. In Zeiten hoher <a href="080108.htm" target="UDOcon">CPU</a>-Taktfrequenzen scheint das
nicht allzu hoch zu sein, man darf jedoch nicht vergessen das der DSP
ein auf die Signalverarbeitung hochoptimierter Chip ist, der mehrere
Befehle gleichzeitig verarbeiten kann und ohne Waitstates (bei 66MHz
alle 15ns) auf den Speicher zugreift. Auf der DSP-Karte ist
zus&auml;tzlich ein sehr schneller Cache-Speicher mit 128K x 24Bit
SRAM. Das ist viermal soviel wie im Falcon und ist fast der maximal
m&ouml;gliche Speicherausbau den der DSP ansprechen kann.
<br>
</p>
<p>In Verbindung mit der DSP-Erweiterung ist es m&ouml;glich, die
Karte im Vierspurbetrieb zu nutzen. Dabei werden die digitalen
SP/DIF-Anschl&uuml;sse als weiterer Stereo Ein- und Ausgang gemeinsam
mit den Analoganschl&uuml;ssen genutzt. Der Debug-Port (ONCE) ist
serienm&auml;&szlig;ig vorhanden. Hiermit und mit einem PC-Debugger
der kostenlos erh&auml;ltlich ist, kann man in den DSP-Programmablauf
eingreifen, direkt Registerinhalte einsehen und ver&auml;ndern usw.
Debug-Port ist hier f&uuml;r mit dem PC &uuml;ber einen seriellen
COM-Port verbunden. und ist kompatibel zum Motorola
EVM56002-Entwicklungsboard. Au&szlig;erdem ist dabei auch gleich noch
eine serielle Verbindung zum Host-Port des DSP abgefallen. F&uuml;r
mehr Sound werden nun die allerneuesten SP/DIF-ICs verwendet, die
sogar ein rein digitales 24Bit-Mastering mit 96kHz Samplerate
erlauben. Somit d&uuml;rfte dies weltweit die erste Samplingkarte mit
96kHz-Verarbeitung sein. Au&szlig;erdem ist es durch einen
gr&ouml;&szlig;eren (leider auch teureren) Chip nun m&ouml;glich,
&uuml;ber einen erweiterten DSP-Port (DSP-Doubleport-Option) sogar
zwei Falcon-Erweiterungen parallel zu betreiben.
<br>
</p>
<p>
<br>
</p>
<p><b> Was das bedeutet ? </b>
<br>
</p>
<p>Man kann z.B. zwei Soundpool-Analog8 anschlie&szlig;en, und hat
dann 16 !! Einzelausg&auml;nge. Dabei werden alle 16 Kan&auml;le mit
den vollen 16Bit verarbeitet und ausgegeben (keine Falcon-&uuml;bliche
Datenreduktion f&uuml;r 16 Spur-Modus). Da dieses Feature aber nicht
von jedem gebraucht wird und die Karte dadurch teurer w&uuml;rde, gibt
es dieses Feature nur optional gegen Aufpreis. Man kann diesen
DSP-Doubleport aber jederzeit bei Bedarf nachr&uuml;sten lassen. Die
Soundkarte wurde gr&uuml;ndlich auf dem TT getestet. Da die
Rechenleistung einer 68030er <a href="080108.htm" target="UDOcon">CPU</a> nicht allzu hoch ist, empfiehlt sich
hier unbedingt die DSP-Erweiterung die den TT beim Mischen u.a.
deutlich entlastet. So sind mit der DSP-Erweiterung auch auf dem TT
problemlos 8 Spuren/48kHz m&ouml;glich. Die StarTrack-Audiokarte und
die DSP-Erweiterung ist seit September 1997 erh&auml;ltlich.
<br>
</p>
<p>
<br><b> II. Die Software </b>
<br>
</p>
<p>Die nachfolgende Beschreibung bezieht sich auf die Alpha-Version
der STARTRACK-Software V1.05a und die Leistungsmerkmale k&ouml;nnen
(und werden) sich sicherlich bis zur Final-Version noch &auml;ndern!
Alle Fenster sind, wo dies sinnvoll ist, nonmodal und k&ouml;nnen
ge&ouml;ffnet bleiben.
<br>
</p>
<p>
<br><b> -Edit-Fenster (immer offen, unmodal) </b>
<br>
</p>
<p>Das ist die Schaltzentrale des Programms. Von hier aus werden
s&auml;mtliche Bearbeitungsfunktionen ausgef&uuml;hrt. Zentraler
Bestandteil des Edit-Fensters ist die graphische Darstellung der
Samples. Direkt per Drag und Drop k&ouml;nnen Marker verschoben und
gesetzt, Samples im Speicher kopiert und verschoben werden.
Nat&uuml;rlich k&ouml;nnen nicht nur Samples im Speicher (destruktiv)
bearbeitet werden. Es gibt einen virtual-mode wo auf Festplatte
gespeicherte Samples die nicht komplett in den Speicher passen,
genauso bearbeitet werden k&ouml;nnen. Wenn man versucht ein File zu
laden, da&szlig; nicht mehr in den Speicher pa&szlig;t, erscheint eine
Dialogbox, in der man w&auml;hlen kann, ob man die virtuelle
Bearbeitung w&uuml;nscht, oder ob man nur einen Block laden
m&ouml;chte. Diesen Block kann man frei w&auml;hlen und kann sich den
ausgew&auml;hlten Teil vor dem laden anh&ouml;ren, um zu testen ob man
den richtigen Teil erwischt hat. Der Editor ist zur Kontrolle und zur
direkten Ver&auml;nderung von Sampledaten gedacht und arbeitet
deswegen destruktiv direkt auf die Daten.
<br>
</p>
<p>Die Marker f&uuml;r (S)tart, (E)nde, E(I)nleitung und (R)elease
werden als senkrechte Linien im Editor dargestellt. Man kann sie
direkt per Maus an eine andere Position draggen. Das geht auch durch
direkte Dateneingabe. Diese Marker k&ouml;nnen auch per Drag&amp;Drop
auf das Clipboard-Symbol (Sternenflottenabzeichen-Button unten rechts)
kopiert werden, indem die entsprechenden Buttons in das Clipboard
gezogen werden, um sie von dort wieder auf einen anderen Platz zu
kopieren (auf Marker-Button S,E,I oder R draggen). Wenn man alle
Marker eines Eintrags gleichzeitig kopieren m&ouml;chte, draggt man
stattdessen den Button mit der Markernummer. Es gibt 100
Markerpositionen. Man kann jedem Eintrag einen Kommentar geben, um die
Marker besser auseinanderhalten zu k&ouml;nnen. Zoom &amp;
Scroll-Funktionen sind ebenso vorhanden wie die M&ouml;glichkeit
mehrere Samples zusammenzuf&uuml;gen. Samples k&ouml;nnen
nachtr&auml;glich weich ein und ausgeblendet werden. Daf&uuml;r gibt
es sogar einen Fade-Editor in dem man die Fader-Kurve frei editieren
kann. Man kann Knackser in einer Aufnahme im Editor direkt mit der
Maus entfernen bzw. die Werte den Schwingungen anpassen. Zoomkommandos
werden automatisch aufgezeichnet und bei
Zoom-R&uuml;ckw&auml;rtsschritten landet man genau an der Stelle an
der man vorher im Editor war. Die Marker kann man auch direkt per
Dateneingabe in Samples oder Zeiteinheiten (sec) eingeben. Die
Aufnahme/Wiedergabe-Funktionen k&ouml;nnen hier direkt ausgef&uuml;hrt
werden. Dabei zeigt ein Marker die momentane Wiedergabe/Aufnahmestelle
an (bei Aufnahme/Wiedergabe aus dem Speicher). Man kann auch
gleichzeitig ein Sample abspielen lassen w&auml;hrend man ein neues
Sample aufnimmt. Das ist praktisch um zeitsynchron weitere Spuren
aufzunehmen, wie das z.B. in Tonstudios geschieht. (z.B. zuerst die
Aufnahme des Schlagzeug, dann Ba&szlig;, Leadguitar, Stimme) Der
Editor bietet eine Nullstellen-Suchfunktion die einfach per Drag und
Drop funktioniert. Man nimmt einen Marker und dr&uuml;ckt die linke
oder rechte Shifttaste. L&auml;&szlig;t man den Marker nun los, sucht
der Marker die n&auml;chste Nullstelle links oder rechts vom
Ausgangspunkt wo man losgelassen hat. So einfach ist das - sehr
praktisch um Loop-Punkte zu finden.
<br>
</p>
<p>Man kann im Editor Teile eines Samples loopen und auch per
Midi-<a href="0f01.htm" target="UDOcon">Keyboard</a> abspielen. Daf&uuml;r legt man das Sample einfach auf
einen einstellbaren Midikanal und dessen Midinote.
<br>
</p>
<p>Der Editor hat auch eine Auto-Backup-Funktion die es erlaubt,
automatisch nach einer eingestellten Zeit eine Sicherungskopie auf
Festplatte zu machen. Das Programm erlaubt die Bearbeitung folgender
Sampleformate:
<br>
<br>S16,WAV,AVR,SND,SD,AU und SMP.
<br>
</p>
<p>Es gibt vielf&auml;ltige Einstellungsm&ouml;glichkeiten im Setup
um die Darstellung im Editor,Pfade etc. einzustellen. Man kann auch
einstellen, das s&auml;mtliche ge&ouml;ffneten Fenster beim
n&auml;chsten Start des Programms an exakt der gleichen Stelle
erscheinen. Alle wichtigen Einstellungen k&ouml;nnen ebenso
abgespeichert werden und werden beim n&auml;chsten Start automatisch
gesetzt. Am oberen Rand des Editfensters sind allerlei Buttons
f&uuml;r die gebr&auml;uchlichsten Funktionen und zum Aufruf von
weiteren Fenstern. Als da w&auml;ren:
<br>
</p>
<p>
<br><b> - Connection-Fenster (unmodal) </b>
<br>
</p>
<p>&#149; Anzeige von Fehlercodes und Samplerate der digitalen
Eing&auml;nge
<br>&#149; Anzeige der Aufnahmeart der digitalen Eing&auml;nge
(SCMS,Emphasis,<a href="1301.htm" target="UDOcon">Audio</a>/Data,Consumer/Professional)
<br>&#149; Einstellung der Samplerate und Eingangswahl
<br>
<br>
</p>
<p><b>- Editor-Toolbar (unmodal) </b>
<br>
</p>
<p>mit Funktionen f&uuml;r
Cut,Insert,Space,Optimize,Resample,Stereo/Mono,Negate,Change
<br>
</p>
<p>&#149; Cut zum Schneiden von Samples (Cut in/out/del)
<br>&#149; Insert zum zusammenf&uuml;gen von mehreren Samples
<br>&#149; Space zum Einf&uuml;gen von Leerstellen
<br>&#149; Optimize zum korrigieren der Lautst&auml;rke
<br>&#149; Resample zum ver&auml;ndern der Samplerate bzw. der
Geschwindigkeit
<br>&#149; Stereo/Mono zur Monoumwandlung von Stereoaufnahmen
<br>&#149; Negate zum negieren der Sampledaten (positive Schwingungen
werden negativ und umgekehrt)
<br>&#149; Change zum wechseln der Kan&auml;le von links nach rechts
und umgekehrt
<br>
</p>
<p>
<br><b> - Peakmeter (unmodal) </b>
<br>
</p>
<p>Das ist das zentrale Fenster f&uuml;r die Aufnahme und Wiedergabe.
<br>
</p>
<p>Man kann das zwar auch im Edit-Fenster machen, aber das Peakmeter
ist komfortabler. Man hat eine sehr genaue Aussteuerungsanzeige mit
Lautst&auml;rkeregler, eine Mute-Taste, einen Balance-Regler, eine
Aufnahmezeit- Anzeige, Peak- und Errorz&auml;hler zur Fehleranzeige.
Damit kann man sehr schnell feststellen, ob man &uuml;bersteuert oder
der eigene Rechner zu wenig Rechenzeit bietet
(Puffer&uuml;berlauf-Sampledaten gehen verloren), weil zu viele
Programme laufen (MTOS,Magic) oder der Rechner einfach zu langsam ist
(68000er).
<br>
</p>
<p>So kann z.B. die Aufnahme im Peakmeter-Fenster geschehen und durch
einen Klick auf das Edit-Fenster wird das gerade aufgenommene Sample
im Edit-Fenster dargestellt und kann bearbeitet werden -
&auml;u&szlig;erst praktisch. Das Peakfenster bietet die &uuml;blichen
Steuerfunktionen eines Cassettendecks (Aufnahme,Wiedergabe,Stop,Pause)
Au&szlig;erdem kann bei Aufnahme optional auf einen einstellbaren
Lautst&auml;rkepegel gewartet werden, um die Aufnahme bei einsetzen
der Musik zu starten. Und nat&uuml;rlich kann man w&auml;hlen, ob die
Aufnahme bzw. Wiedergabe in den Speicher oder auf Festplatte erfolgen
soll. Diese Steuerfunktionen hat man auch im Edit-Fenster nur das man
dort auf eine Aussteuerungsanzeige verzichten mu&szlig;.
<br>
</p>
<p>Bei der direkten Aufnahme auf Festplatte wird vor dem
Aufnahmestart ein INF-File angelegt, in dem die Samplerate, Datum der
Aufnahme, Loop-Marker und ein Kommentar vermerkt werden. Diesen
Kommentar kann man in einem Edit-Feld eingeben. Das kann man z.B.
f&uuml;r eine genauere Titelbeschreibung mit Aufnahmequelle verwenden.
Damit lassen sich Aufnahmen sp&auml;ter leichter identifizieren und
ausw&auml;hlen. Dieses INF-File wird beim laden angezeigt, oder in der
speziellen Fileselect-Box (siehe Musicbox). Bei der Aufnahme wird eine
&quot;.PBF&quot;-Datei angelegt, in der eine komprimierte Version des
Amplitudenverlaufs gespeichert wird. Das beschleunigt den
Bildschirmaufbau beim laden von sehr langen Samples enorm, da
normalerweise alle Samplewerte zur Berechnung der
Amplitudendarstellung herangezogen werden was bei 50-100MB schon etwas
dauern kann. Statt dessen wird daher w&auml;hrend der Aufnahme schon
eine Berechnung vorgenommen und abgespeichert. Diese werden dann statt
dessen zur Berechnung herangezogen. Also quasi ein Amplituden-Caching.
;-) Aufnahmen von den digitalen Eing&auml;ngen k&ouml;nnen
nat&uuml;rlich nicht ausgesteuert werden (wozu auch). Die Aussteuerung
kann man auch noch nachtr&auml;glich bei der Wiedergabe kontrollieren
(also sehen).
<br>
</p>
<p>
<br><b>- Midi und Playlist-Fenster (unmodal) </b>
<br>
</p>
<p>Hier kann man die auf Festplatte gesammelten Samples auf
entsprechende Midikan&auml;le und Midinoten verteilen, und so die
Samples auf einem <a href="0f01.htm" target="UDOcon">Keyboard</a> &quot;spielen&quot; Es gibt hier eine
sogenannte Playlist, in der die Samples aufgef&uuml;hrt werden. Man
kann hier f&uuml;r jedes Sample einstellen, ob die Samples beim
abspielen geloopt werden sollen und mit welcher Samplerate sie
abgespielt werden sollen. Hier gibt es auch wieder Kopierfunktionen
(Drag und Drop) und jede Menge Editierfunktionen um Sampleteile
auszuw&auml;hlen (Startposition,Endposition, Abh&ouml;r- und
Aufnahmem&ouml;glichkeiten). Um einen Eintrag zu kopieren, zieht man
den entsprechenden Edit-Button auf das Clipboard. Anschlie&szlig;end
kann man den Eintrag aus dem Clipboard auf das Edit-Button draggen, in
den der Eintrag kopiert werden soll. Au&szlig;erdem lassen sich diese
Midi-Playlisten abspeichern und laden.
<br>
</p>
<p>Die Playlist-Dateien tragen die Endung &quot;.ARR&quot;
<br>
</p>
<p>
<br><b> - Loopfenster (unmodal) </b>
<br>
</p>
<p>Hier kann man einstellen, ob ein Sample vorw&auml;rts,
r&uuml;ckw&auml;rts oder cross (vorw&auml;rts, dann
r&uuml;ckw&auml;rts)gespielt werden soll.
<br>
</p>
<p>
<br>
</p>
<p><b> - Fader-Fenster (unmodal) </b>
<br>
</p>
<p>Hier kann man den Fade-In und Fade-Out-Verlauf editieren. Man kann
neue Verl&auml;ufe per Maus zeichnen oder auf vorgefertigte
Verl&auml;ufe zur&uuml;ckgreifen (linear,square,exp,sqrt,log). Diese
Verl&auml;ufe kann man abspeichern und laden (Fileendung
&quot;.FAD&quot;.
<br>
</p>
<p>
<br><b> - Monitor (funktion) </b>
<br>
</p>
<p>Mit dieser Funktion kann man kontrollieren, ob die Samples vom
Eingang bis zum Ausgang korrekt verarbeitet werden.
<br>
</p>
<p>
<br><b> - Midi-Note (modal) </b>
<br>
</p>
<p>Hier kann man die Midinote und dessen Kanal einstellen
</p>
<p>
<br><b> - Load und Save (modal) </b>
<br>
</p>
<p>Hier kann man den Speicherinhalt bzw. das Sample abspeichern oder
laden. Beim laden kann man w&auml;hlen, ob nur dieses eine Sample in
den Speicher soll (dann wird vorher der Speicher gel&ouml;scht und
dann das Sample an den Anfang geladen) oder ob es an das Ende der
schon im Speicher stehenden Samples angeh&auml;ngt werden soll. Beim
speichern kann man w&auml;hlen, ob der gesamte Speicherinhalt
abgespeichert werden soll, oder nur ein Bereich, der durch Savemarker
vorher bestimmt wurde.
<br>
</p>
<p>
<br><b> - DSP-Toolbar (unmodal) </b>
<br>
</p>
<p>Hier kann man die Effekte in den DSP (sofern vorhanden) laden. Zur
Auswahl stehen momentan Echo,Lowpass,Flanger,Chorus,Pinknoise und
Bypass. Vorgesehen (sp&auml;ter) sind noch Hall, High und Bandpass,
Equalizer. Da STARTRACK die DSP-Programme im LOD-Format verarbeitet
und diese &uuml;ber die DSP-Toolbar auch ladbar sind, steht eigenen
DSP-Programmen nichts im Wege.
<br>
</p>
<p>
<br><b> - Musicbox-Fileselector (unmodal) </b>
<br>
</p>
<p>Hier kann man eine Playlist definieren (per Fileselektor) um ganze
Titel in einer festgelegten Reihenfolge abzuspielen. Diese Playlist
kann abgespeichert und geladen werden (Fileendung
&quot;.BOX&quot;).Man definiert zuerst einen Suchpfad f&uuml;r Samples
und addiert diesen Pfad zu einer Pfadliste (Fileendung
&quot;.SEL&quot;) mit &quot;ADD&quot;.
<br>
</p>
<p>So kann man mehrere Suchpfade definieren in denen gesucht werden
soll. M&ouml;chte man eine neue Pfadliste definieren dr&uuml;ckt man
auf den Button &quot;NEW&quot;. Die gefundenen Samples werden
aufgelistet und vorhandene Kommentare zu den Aufnahmen werden
angezeigt um die Suche in gro&szlig;en Datenbest&auml;nden zu
erleichtern. Dann w&auml;hlt man die Samples aus, die man spielen
m&ouml;chte und f&uuml;gt sie in die Playlist ein. Wenn man dann den
Musicbox-Button dr&uuml;ckt, bekommt man statt der Liste aller Samples
nun die ausgew&auml;hlten Samples pr&auml;sentiert. Mit diesem Button
kann man zwischen der Gesamtdarstellung und der Playlist wechseln. Nun
noch Play dr&uuml;cken - und ab geht die Musicbox. Eine
Anspielfunktion ist auch vorhanden, bei der jeder Titel 10 Sekunden
angespielt wird. Man kann dieses Fenster auch benutzen um Samples in
den Editor zu laden. Das ist komfortabler, da alle Suchpfade
automatisch durchforstet werden, und nur die Sample-Dateien mit
Kommentaren angezeigt werden.
<br>
</p>
<p>
<br><b> - Multitrack-Fenster (unmodal) </b>
<br>
</p>
<p>Das ist wohl eines der wichtigsten Fenster. Die X-Achse definiert
die Zeiteinheit und auf der Y-Achse sind die Spuren angeordnet. Hier
kann man eine Playlist f&uuml;r bis zu 99 Stereokan&auml;le
definieren. Davon k&ouml;nnen bis zu 16 Kan&auml;le ausgew&auml;hlt
und in Echtzeit gemischt und wiedergegeben werden (wie bei einem
16Spur-Tonband). Daf&uuml;r ben&ouml;tigt man keinen DSP. Ein
schneller TOS-Computer (Medusa,Hades) ist schnell genug um ohne DSP
auskommen zu k&ouml;nnen. Der TT schafft 8 Spuren mit 48kHz,
allerdings nur mit DSP-Erweiterungsplatine, da die Rechenleistung
sonst nicht ausreicht. In erster Linie h&auml;ngt die Spuranzahl von
der Rechnergeschwindigkeit und von der Geschwindigkeit der Festplatte
ab. In diesem Fenster kann man also die Samples die auf der Festplatte
liegen, zu einem &quot;Song&quot; arrangieren. Man l&auml;dt dazu die
Samples und bestimmt grob per Abh&ouml;ren
(PLAY,STOP,Pause,Vorlauf,R&uuml;cklauf,Aufnahme) den Start und das
Ende eines Samples (nicht-destruktiv,Sampledaten werden nicht
ver&auml;ndert) Man kann dann mittels Buttons oder Werteeingabe den
Start und das Ende eines Samples feinjustieren oder man &uuml;bernimmt
einfach die mit im Sample abgespeicherten Loop-Marken f&uuml;r Start
und Ende. Das Sample kann man danach wenn n&ouml;tig per Drag und Drop
an eine andere Abspielposition verschieben, oder auch &uuml;ber
Werteeingabe auf eine neue Position setzen. Da man auch hier Zoom- und
Scrollfunktionen benutzen kann, geht das gerade per Drag &amp; Drop
sehr genau. Man kann die Samples hier auch &uuml;ber das Clipboard per
Drag&amp;Drop kopieren. Das geht auch mit kompletten Spuren. Es gibt
einen Fileselector der alle bisher benutzten Samples nach ihrer
Reihenfolge auflistet.
<br>
</p>
<p>Hier kann man auch gezielt nach einem bestimmten Sample suchen
lassen, das dann in die linke obere Ecke des Trakker-Fensters
gescrollt wird. Hier k&ouml;nnen auch die Kommentare f&uuml;r die
einzelnen Samples editiert werden. Dabei wird dann nachher in der
linken oberen Ecke jedes Sampleblocks entweder der Filename oder der
Kommentar eingeblendet. Der Lautst&auml;rkeverlauf (Amplitude) der
Samples wird im Fenster auf Wunsch abgeschaltet und es erscheint nur
ein Block der die L&auml;nge des Samples definiert. Dadurch bekommt
man einen schnelleren Bildaufbau (wichtig f&uuml;r leistungsschwache
Rechner). Es ist aber besser die Darstellung der Amplituden
einzuschalten, da man dann sehr genau die Samples der verschiedenen
Spuren aufeinander trimmen kann um z.B. mit einem bestimmten Rhythmus
synchron zu sein.
<br>
</p>
<p>Man selektiert ein Sample mit der linken Maustaste, verschieben
kann man es mit gedr&uuml;ckter rechter Maustaste (unter MagicMac
Apfel-Symbol + Maustaste). H&auml;lt man zus&auml;tzlich hierbei die
linke Shifttaste gedr&uuml;ckt, wird das selektierte Sample beim
Loslassen der Maustaste hinter das davor liegende Sample gesetzt.
H&auml;lt man statt dessen die rechte Shifttaste zus&auml;tzlich
gedr&uuml;ckt, wandert das Sample direkt vor das dahinterliegende
Sample. Das ist praktisch um mehrere Samples ohne Zwischenraum
aneinanderzureihen um so, z.B. bei geeigneten Loopmarken,
Wiederholungen zu erzeugen. H&auml;lt man stattdessen zus&auml;tzlich
die ALT-Taste gedr&uuml;ckt, kann man die Samplebl&ouml;cke direkt per
Drag&amp;Drop kopieren. H&auml;lt man die Tasten ALT &amp; Ctrl(Strg)
statt dessen gedr&uuml;ckt, kann man das Sample per Drag&amp;Drop in
das Clipboard kopieren. Will man nun eine Kopie einf&uuml;gen, klickt
man mit der linken Maustaste auf das Clipboard und f&uuml;gt das
Sample in die Playlist ein. Man kann den Start und das Ende eines
Samples auch per Marker direkt bestimmen. Dazu wird bei
gedr&uuml;ckter Ctrl(Strg)-Taste und gedr&uuml;ckter linker Maustaste
das Sample in den Editor geladen und man bestimmt dort per Marker
Start und Ende. Hat man das gemacht, selektiert man den Quit-Button im
Editor. Dabei wird dann ausnahmsweise nicht das Programm beendet
sondern die Marker in den Tracker &uuml;bernommen. Ganze Spuren kann
man kopieren indem man den Button mit der Spurnummer selektiert und in
das Clipboard zieht. Anschlie&szlig;end zieht man das Clipboard (bzw.
das dann erscheinende, vorher kopierte Spurbutton) auf den Spurbutton,
auf den kopiert werden soll. Die Playlist kann man nat&uuml;rlich auch
speichern und laden (Fileendung &quot;.TRK&quot;). Die komplette
Bearbeitung der Samples (wie auch im Midi-Playlistfenster) erfolgt
nichtdestruktiv, d.h. ohne die Sampledaten tats&auml;chlich zu
ver&auml;ndern. Eine SMPTE-Synchronisierung via MTC ist zwar
vorgesehen aber noch nicht implementiert.
<br>
</p>
<p>
<br><b> - Setup-Fenster (modal) </b> 8!nl)
</p>
<p>&#149; vertical lines: Darstellung der Samples als Peaks (Striche)
bei Zoom gr&ouml;&szlig;er als 1:1
<br>&#149; link dots: Verbindung der Samples durch eine
Ann&auml;herungskurve bei Zoom gr&ouml;&szlig;er als 1:1
<br>&#149; fill spaces: F&uuml;llung der Zwischenr&auml;ume bei Zoom
gr&ouml;&szlig;er als 1:1
<br>&#149; horizontal-lines: Horizontale Markierung bei 20/40/60/80 %
Amplitude zur besseren Lesbarkeit.
<br>&#149; Y-autozoom: Zoomt die Amplitude automatisch bis zum
h&ouml;chsten vorhandenen Samplewert
<br>
</p>
<p>&#149; grid: farbige Markierung der geladenen Samples und graues
Hintergrundmuster
<br>&#149; autorecord treshold: Ansprechschwelle in dB f&uuml;r die
Aufnahmeamplitude bei Auto-Record-Automatik
<br>
</p>
<p>&#149; malloc: Anzahl Bytes in Hex des f&uuml;r das Programm
reservierten Speichers
<br>
</p>
<p>&#149; record-time: einstellbare default-Aufnahmezeit. Kann
jederzeit vor der Aufnahme ge&auml;ndert werden. Als
Arbeitserleichterung um nicht immer wieder die gleiche Aufnahmezeit
einstellen zu m&uuml;ssen. Eine Aufnahme ist aber trotzdem jederzeit
durch STOP zu beenden.
<br>
</p>
<p>&#149; HDD-Sektoren: Gr&ouml;&szlig;e der Zugriffsbl&ouml;cke auf
der Festplatte. Sollte vorerst immer auf 16384 gesetzt bleiben.
<br>
</p>
<p>&#149; digital-in clock: Wenn gesetzt, wird alles vom digitalen
Eingangstakt synchronisiert bzw. getaktet. Die Taktratenauswahl ist
dann gesperrt und richtet sich nach dem Eingangstakt. Betrifft vor
allem die Aufnahme und Wiedergabe &uuml;ber die A/D und D/A-Wandler.
<br>
</p>
<p>&#149; sampledata-defaultpath: Der Name sagt es schon: Pfad
f&uuml;r die Sampleaufnahme- und Wiedergabe. Alle anderen Files werden
im Startpfad des Programms angelegt/gesucht.
<br>
</p>
<p>&#149; default format: Art des File-extenders f&uuml;r
Samplefiles, also das voreingestellte Sampleformat.
<br>
</p>
<p>Es kann aber jederzeit ein anderes benutzt werden. Es ist
lediglich eine Arbeitserleichterung bei der Arbeit.
<br>
</p>
<p>&#149; 3D: farbige Darstellung der Programmoberfl&auml;che im
Multitos-Look (soweit m&ouml;glich) wird erst nach Neustart
ber&uuml;cksichtigt !
<br>&#149; flip: wenn gesetzt, springt die Function-Auswahl im
Edit-Fenster nach der Benutzung wieder auf MARK (weil meistbenutztes
Feature) wenn gel&ouml;scht, bleibt die zuletzt benutzte Funktion
eingestellt.
<br>
</p>
<p>&#149; 0-XSNAP: Suche nach Null-Durchg&auml;ngen im Sample (zwecks
Loop-Punkt) mittels Shift erm&ouml;glichen.
<br>&#149; Menue: Men&uuml;erzeugung an der oberen Bildschirmkante
wird erst nach Neustart ber&uuml;cksichtigt!
<br>&#149; Time: Zeitanzeige im Edit-Info und
Auto-Backup-M&ouml;glichkeit erlauben.
<br>&#149; Show: Anzeige der Zeitposition der Maus bzw. Marker im
Edit-Info
<br>&#149; Turbo: f&uuml;r zeitoptimierte Aufnahme/Wiedergabe bei
normalen STs wegen geringer Rechenleistung. Relikt aus vergangener
Zeit. Sollte vorerst eingeschaltet bleiben. Wird demn&auml;chst anders
gel&ouml;st.
<br>
</p>
<p>&#149; Freeze:wenn gesetzt dann merkt sich das Programm die
Fenster-Positionen bei SAVE im Setup (und nur dann !) und setzt diese
Fenster wieder auf die gleichen Positionen beim n&auml;chsten Start
des Programms.
<br>&#149; View: Hier kann die Samplewert-Darstellung zwischen Zeit
(in 1/100 sec) und Samples ausgew&auml;hlt werden.
<br>&#149; Save: Speichern der Setup-Datei &quot;SMP16.INF&quot;
<br>&#149; Load: Laden der Setup-Datei. Das passiert auch automatisch
beim Start des Programms.
<br>
</p>
<p>Die Demoversion enth&auml;lt einen solchen Hypertext der direkt im
Programm &uuml;ber die Help-Taste aufgerufen werden kann. Der
Hypertext arbeitet mit 1stGuide. Beim Kauf der Vollversion oder der
Startrack-Karte ist zus&auml;tzlich auch ein Handbuch enthalten. Die
Gr&ouml;&szlig;e der Fenster ist bewu&szlig;t auf max. 640x400
beschr&auml;nkt worden, um auch ohne Gro&szlig;bildschirm in
ST-Aufl&ouml;sung arbeiten zu k&ouml;nnen. Ab einer Aufl&ouml;sung von
1024x768 werden f&uuml;r Editor und Tracker gr&ouml;&szlig;ere Fenster
erzeugt. Demn&auml;chst werden aber Fenster implementiert, die in
ihrer Gr&ouml;&szlig;e ver&auml;nderbar sind. Aber auch so kriegt man
den Bildschirm mit den vielen nonmodalen Fenstern voll. Das Programm
sollte eigentlich auf jeder Grafikkarte (vorzugsweise in Farbe)
laufen.
<br>
</p>
<p>Noch ein Tip: Man sollte sich ruhig die Arbeit machen,
&uuml;berall mal draufzuklicken. Manche Funktion ist im Editor gut
versteckt, wenn man nicht wei&szlig; wo man suchen soll. Das Programm
ist auch mit Sicherheit noch nicht fehlerfrei. Es ist halt eine noch
in heftiger Entwicklung befindliche Alpha-Version!
<br>
<br>Zu den Preisen:
<br>
</p>
<p>Die Startrack-Karte kostet incl. Editing- und Mastering-Software =
1495 DM
<br>
</p>
<p>DSP-Erweiterung mit Motorola 56002 (100% kompatibel zum
Falcon-DSP), DSP-Port f&uuml;r Falcon-Erweiterungen (Soundpool Analog8
&amp; ADAT,Jam IN/Out etc.),Motorola ONCE (Debug-Port,voll kompatibel
zu Motorola EVM56002) = 550 DM
<br>
</p>
<p>Startrack-Karte, DSP-Erweiterung &amp; Software komplett = 1950 DM
<br>
</p>
<p>Editing- und Mastering-Software einzeln = 348 DM
<br>
</p>
<p>Optionen:
<br>
</p>
<p>Erweiterter DSP-Port zum Anschlu&szlig; von 2 Port-Erweiterungen
(z.B. 2 x Analog8 = 16 Einzelausg&auml;nge) incl. Software = 200 DM
<br>
</p>
<p>XLR-Erweiterung a.A.
<br>
</p>
<p>Die Kontakt-Adresse:
<br>Stephan Wilhelm, Niehler Str. 312, 50735 K&ouml;ln
<br>
<br>Au&szlig;erdem bin ich im MausNet unter Emailadresse &quot;Stephan
Wilhelm @ K2&quot; oder im <a href="17.htm" target="UDOcon">Internet</a> unter
Emailadresse&quot;stepwil@aol.com zu erreichen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0504.htm" target="UDOcon"><img src="udo_up.gif" alt="Milan Audio Hardware" border=0 width="24" height="24"></a>
<a href="0504.htm" target="UDOcon"><img src="udo_lf.gif" alt="Milan Audio Hardware" border=0 width="24" height="24"></a>
<a href="0505.htm" target="UDOcon"><img src="udo_rg.gif" alt="Milan Video Hardware" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
