<!doctype html>
<html lang="de">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Milan Erweiterungskarten
</title>
<link rel=home href="doitst1h.html" title="Homepage">
<link href="css/bootstrap.min.css" rel="stylesheet">
<link href="css/styles.css" rel="stylesheet">
</head>
<body>
<div class="container-fluid">
<div class="row">
<div class="col-md-12">


<table class="navigation"><tr><td valign=top>
<a href="00con.html" ><img class="img-fluid" src="navi/udo_hm.gif" alt="Home"  width="24" height="24"></a>
<a href="05.html" ><img class="img-fluid" src="navi/udo_up.gif" alt="Milan Hardware"  width="24" height="24"></a>
<a href="0508.html" ><img class="img-fluid" src="navi/udo_lf.gif" alt="Milan ISA Bus"  width="24" height="24"></a>
<a href="050a.html" ><img class="img-fluid" src="navi/udo_rg.gif" alt="Milan PCI Hardware 1"  width="24" height="24"></a>
</td></tr></table>
<table  cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Milan_20Erweiterungskarten">5.9 Milan Erweiterungskarten</a></h1>
<p align=center><img class="img-fluid" src="image/sline.gif"  width="640" height="2"></p><br>
<p><tt> Erweiterungskaten, Kartentypen, Ein- und Ausbau </tt>
<br>
<br>
</p>
<p><img class="img-fluid" src="image/deutsch.gif"  width="35" height="22"></p><br>
<p><img class="img-fluid" src="image/english.gif"  width="35" height="22"></p><br>
<p>Nachfolgend finden sie einige Worte zum korrekten Ein- und
Ausbauen von Erweiterungskarten die zum Atari MILAN passen.
<br>Siehe auch PCI &amp; Co
<br>
</p>
<p>
<br>Sie werden folgende Karten finden:
<br>- Grafikkarten
<br>- SCSI Karte
<br>- UltraWide SCSI Karte
<br>- Atari Midi-Erweiterung
<br>- Atari Romport-Erweiterung
<br>
</p>
<p><b> Allgemeines zu Erweiterungskarten </b>
<br>
<br>
</p>
<p>Zum Ein- und Ausbauen von PCI-Steckkarten gibt es nicht viel zu
sagen, sie m&uuml;ssen auf alle F&auml;lle nur wenig wichtige
Gegebenheiten beachten. Sonderkarten haben einen eigenen Abschnitt.
<br>
</p>
<dl>
<dt><b>Schritt 1 - allgemeiner Einbau</b></dt><dd> Der Ein- und Ausbau von Erweiterungskarten in den MILAN gestaltet
sich meistens rein mechanischer Natur. Stellen sie das Geh&auml;use
auf eine stabile Unterlage und entfernen sie die
Geh&auml;useschrauben. Entfernen sie das Geh&auml;useoberteil und
legen sie es zur Seite. Verlieren sie die Schrauben nicht.
<br>
<br>&nbsp;
<dt><b>Schritt 2 - lokalisieren und Platz schaffen</b></dt><dd> Suchen sie sich f&uuml;r ihre neue Karte einen freien Platz oder
versuchen sie durch das Umstecken schon vorhandener Karten besseren
Platz zu schaffen. Bedenken sie dabei bitte das Grafikkarten immer am
besten so weit wie m&ouml;glich vom <a href="10.html" >Netzteil</a> entfernt eingesteckt
werden sollten. Das vermindert beeintr&auml;chtigungen der
Bildqualit&auml;t. Controller mit Flachbandkabeln stecken besser am
Rand des Mainboard, so versperren die breiten Kabel nicht unn&ouml;tig
Platz.
<br>
<br>&nbsp;
<dt><b>Schritt 3 - Das einstecken einer Karte</b></dt><dd> Fassen sie niemals in den Slot! Beachten sie bitte unbedingt das
alle Karten m&ouml;glichst gerade und nicht mit Gewalt gegen einen
freien PCI-Slot gedr&uuml;ckt werden. Die Karte sollte leicht aber
bestimmt in den Slot rutschen. Achten sie darauf das die Karte
gleichm&auml;ssig tief in dem Slot steckt. Ist das nicht der Fall
entfernen sie die Karte und bearbeiten sie den Metalhalter solange bis
die Karte gerade in den den Slot auf dem Mainboard passt. Befestigen
sie die neue Karte immer mit der Geh&auml;useschraube an der
Buchsenseite. Das ist mechanisch Unbedingt erforderlich. Vermeiden sie
das ber&uuml;hren der Bauteile und der goldfarbenen Slotkontakte der
Karte auf jeden Fall! Ersteres wegen statischer Elektrizit&auml;t,
letzeres wegen Korrosion. Vermeiden sie immer Druck auf die auf der
Karte angebrachten Bauteile.
<br>
<br>&nbsp;
<dt><b>Schritt 4 - Konfigurieren</b></dt><dd> Bei PCI-Karten gibt idR nichts zu Konfigurieren. Das passiert
auch beim MILAN idR mit Plug &amp; Play. Lesen sie die Anleitung ihrer
Karte. Beachten sie eventuell vorhandene Jumper.
<br>
<br>&nbsp;
<dt><b>Schritt 5 - Kabelmontage</b></dt><dd> Wenn die neue Karte einen Flachbandanschlu&szlig; besitzt stecken
sie dieses Kabel erst nach der Kartenmontage auf die Karte. IdR sind
die daf&uuml;r notwendigen Buchsen immer so angeordnet das dieses
Nachtr&auml;glich leicht m&ouml;glich ist. Beachten sie immer die
farbige Ader eines Flachbandkabels! IdR ist das auf der Steckkarte und
an dem folgenden Ger&auml;t immer Pin 1. Verwechslungen sind so
Minimal.
<br>
<br>&nbsp;
<dt><b>Schritt 6 - Grafikkarte</b></dt><dd> Achten sie auf einen zur Karte passenden Monitor! Beachten sie
eventuelle Jumper auf ihrer Grafikkarte. Beachten sie die
Einstellungen f&uuml;r Interlace Mode! Die MILAN Videoaufl&ouml;sungen
finden sie unter Milan VGA Standard hier in dieser FAQ.
<br>
<br>&nbsp;
<dt><b>Schritt 7 - Schnittstellenkarte</b></dt><dd> Der Milan besitzt 2 serielle <a href="0f.html" >Schnittstellen</a>. Es ist aber
m&ouml;glich mit einer Karte weitere serielle <a href="0f.html" >Schnittstellen</a>
nachzur&uuml;sten. Achten sie bitte auf die Anleitung die dieser Karte
beiliegt.
<br>
<br>&nbsp;
<dt><b>Schritt 8 - Wohin mit den Kabeln</b></dt><dd> Kabel kreuz und quer im Rechner sind optisch unsch&ouml;n,
behindern die Luftzirkulation und fangennur Staub ein. Zum verlegen
diverser Flachbandkabel finden sie im einschl&auml;gigen Fachhandel
dazu Kabelbinder, selbstklebende Flachbandhalter f&uuml;r wenig Geld.
Ein aufger&auml;umtes Geh&auml;use zeugt von technischem
Verst&auml;ndniss
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br><b> Atari kompatible <a href="0f.html" >Schnittstellen</a> </b>
<br>
</p>
<dl>
<dt><b>Atari Romport Schnittstelle</b></dt><dd> Hier fehlen die technischen Daten und Bilder und Verweise
<br>&nbsp;
<dt><b>Atari Midi Schnittstelle</b></dt><dd> Hier fehlen technische Daten und Bilder und Verweise
<br>&nbsp;
<dt><b>Atari kompatible Soundkarten</b></dt><dd> Hier fehlen technische Daten und Bilder und Verweise
<br>&nbsp;
</dl>
<p>
<br>
<br><b> PCI EtherNet Netzwerkkarten </b>
<br>
</p>
<dl>
<dt><b>Ethernet</b></dt><dd> Hier fehlen die technischen Daten und Bilder und Verweise
<br>&nbsp;
</dl>
<p>
<br>
<br>Siehe zu allen PCI-Karten auch PCI &amp; Co
<br>
<br>
<br>
</p>
<hr>
</td></tr></table>
<table class="navigation"><tr><td valign=top>
<a href="00con.html" ><img class="img-fluid" src="navi/udo_hm.gif" alt="Home"  width="24" height="24"></a>
<a href="05.html" ><img class="img-fluid" src="navi/udo_up.gif" alt="Milan Hardware"  width="24" height="24"></a>
<a href="0508.html" ><img class="img-fluid" src="navi/udo_lf.gif" alt="Milan ISA Bus"  width="24" height="24"></a>
<a href="050a.html" ><img class="img-fluid" src="navi/udo_rg.gif" alt="Milan PCI Hardware 1"  width="24" height="24"></a>
</td></tr></table>
</div> <!-- col-md-12 -->
</div> <!-- row -->
</div> <!-- container -->
</body>
</html>
