<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: SpeedUp 16
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0a.htm" target="UDOcon"><img src="udo_up.gif" alt="Beschleuniger" border=0 width="24" height="24"></a>
<a href="0a.htm" target="UDOcon"><img src="udo_lf.gif" alt="Beschleuniger" border=0 width="24" height="24"></a>
<a href="0a02.htm" target="UDOcon"><img src="udo_rg.gif" alt="MightyMic" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="SpeedUp_2016">10.1 SpeedUp 16</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Das 16 Mhz-Board aus der c't (Speedup 16) </tt>
<br>
</p>
<p>- <a href="0201.htm" target="UDOcon">Autor</a>
<br>
</p>
<p>Robert Schaffner
<br>Am Sch&auml;ferpfad 10
<br>63303 Dreieich
<br>
</p>
<p>Nach anf&auml;nglichen Lieferschwierigkeiten der verschiedenen
Anbieter ist es nun m&ouml;glich die Baus&auml;tze oder eine fertig
best&uuml;ckte Platine zu bekommen. Den Bausatz kann man z.B bei der
Firma Edicta in Stuttgard f&uuml;r 99DM bekommen. Der <a href="0201.htm" target="UDOcon">Autor</a> selber
bietet eine Fertigversion f&uuml;r 145 DM an.
<br>
</p>
<p>Beim Heisse Verlag in Hannover bekommt man die leere Platine schon
f&uuml;r 19 DM , allerdings leider nur gegen Vorkasse.
<br>
</p>
<p>Die Platinen sind in einer guten Qualit&auml;t zu bekommen,
Stellenweise wird der Bausatz sogar mit dem ben&ouml;tigtem
Prozessorsockel versprochen. Bei mir wurder der dann nicht!
Mitgeliefert. Reklamationen wurden einfach ignoriert. Auch glaubt so
manche nahmhafte Lieferfirma das es gen&uuml;ge, wenn man die doch
eigentlich recht empfindlichen elektronischen Bauteile in einem
normalen Briefumschlag verschickt.
<br>
</p>
<p>Das Disaster beim Auspacken ist phantastisch, eine n&auml;here
Beschreibung solcher Sparma&szlig;nahmen lassen wir mal unter den
Tisch fallen. Es reicht schon wenn man 64 Prozessor-Pins wieder so
hinbiegen mu&szlig;, das die anschliessend auch wieder in die
Sil-Streifen passen !!!
<br>
</p>
<p>Ich m&ouml;chte doch gerne mal den Eink&auml;ufer einer solchen
Firma erleben wenn ein Zulieferbetrieb f&uuml;r elektronische Bauteile
in einer solchen Verpackung liefern w&uuml;rde !!
<br>
</p>
<p>!! Bitte etwas mehr Etikette meine Herren !!
<br>
</p>
<p>Das gilt auch f&uuml;r Lieferungen an bl&ouml;de ST-User!
<br>
</p>
<p>Es gibt nat&uuml;rlich auch Firmen die zur Versendung ihrer
Baus&auml;tze eine kleine Kunststoffschachtel verwenden, die idR
f&uuml;r elektronische Bauteile besser geeignet sein d&uuml;rfte.
Komischerweise ist der Bausatz dadurch auch nicht teuerer geworden.
Man k&ouml;nnte vermuten das die, die billig Verpacken irgendwie nicht
richtig mit der Materie vertraut sind. Umsatzzahlen sind auch
wichtiger !
<br>
</p>
<p>Kommen wir zum Zusammenbau der Platine, Vorlagenbedingt ist es bei
jeder Platine, egal woher, v&ouml;llig gleich. Der Sockel zum
Aufl&ouml;ten auf den alten Prozessor sollte schon etwas besseres
sein, vieleicht mit gedrehten Pins. Der Aufbau dieses Bausatzes ist
recht einfach, da erstens die Platine einen Bauteileaufdruck besitzt
und zweitens man hoffentlich die c't mit der Ausgabe 10/90 besitzt und
auch den Artikel gelesen hat.
<br>
</p>
<p>Der Verlag liefert gegen einen Aufpreis von 5 DM eine Fotokopie
des entsprechenden Artikel aus der c't.
<br>
</p>
<p>Bei der Fa.Issendorff, ebenfalls aus Hannover bekommt man meist
die Kopie beigelegt, somit dann keinerlei Probleme mit dem Aufbau
entstehen d&uuml;rften. (Dort wird auch 'Knitterfrei' in einer
Kunststoffbox geliefert) :-)
<br>
</p>
<p>Nach dem man die Platine begutachtet hat kann man nun mit der
Best&uuml;ckung beginnen. Zuerst werden alle passiven Bauteile
eingel&ouml;tet, d.h die Widerst&auml;nde und die Kondensatoren.
Leider ist hier wegen der geringen gr&ouml;&szlig;e der Platine auf
die Verwendung von IC-Sockeln verzichtet worden, deshalb sollte man
Gewissenhaft an die Einl&ouml;tung der verschiedenen Halbleiter
herrangehen. Sind die Bauteile erst einmal festgel&ouml;tet, so ist
eine &Auml;nderung nur schwer m&ouml;glich , auch ist eine gewisse
'Verunstaltung' der Platine nicht auszuschliessen. Aufgrund der
Feinheit und der N&auml;he zu benachbarten Leiterbahnen ist sowieso
eindringlich auf sauberes Arbeiten zu achten.
<br>
</p>
<p>Beim Einl&ouml;ten der TTL-ICs bitte darauf achten das die
Bauteile so nahe wie m&ouml;glich auf der Platine aufliegen .Es
mu&szlig; sp&auml;ter noch der neue Prozessor dar&uuml;ber passen !
Auch die L&ouml;tbeine der ICs die auf der Unterseite verl&ouml;tet
werden, sollte man sehr kurz &uuml;ber der L&ouml;tstelle abkneifen.
Darunter sitzt schlie&szlig;lich der 'alte' Prozessor. Sind die
Best&uuml;ckungsarbeiten abgeschlossen, sollte man die Platine
nochmals einer genauen Besichtigung unterziehen. An der Platine
befindet sich ein Anschlu&szlig; f&uuml;r eine 'Turbo-Anzeige-LED'
dieser Anschlu&szlig; stellt die volle Rechnerbetriebspannung zur
Verf&uuml;gung die dort angeschlossene LED mmu&szlig;! also unbedingt
&uuml;ber einen Vorwiderstand von ca.330 Ohm betrieben werden. Diesen
Widerstand kann man z.B hochkant in das 'A' Loch der Platine
einl&ouml;ten. An das andere Ende dann gleich die LED, &uuml;ber ein
entsprechend langes Kabel verbinden. Leider ist es nur m&ouml;glich
diese Erweiterung im Rechner zu testen.
<br>
</p>
<p>Am Rechner selber ist auch ein kleiner aber gravierender Eingriff
n&ouml;tig um die Erweiterung einbauen zu k&ouml;nnen. Man kann zum
einen den 'alten' 8Mhz Prozessor komplett durch ausl&ouml;ten oder
erst durch Abschneiden und dann Ausl&ouml;ten der einzelnen
Anschlu&szlig;pins entfernen. Von dem 'Ausschalten'der <a href="080108.htm" target="UDOcon">CPU</a>, welches
genauestens in der c't beschrieben wurde ist dringend Abzuraten, das
Funktioniert n&auml;hmlich leider so nicht !!
<br>Es w&auml;hre warscheinlich mit Pin 12 gegangen, aber nicht mit
Pin 17. (Aber wer will das schon probieren ...??)
<br>
</p>
<p>Auf jeden Fall mu&szlig; aber ein freier Sockel vorhanden sein, in
den die 16Mhz-Erweiterung hinein gesteckt wird. Das Ausl&ouml;ten
sollten nur 'L&ouml;tprofis' vornehmen, da man im Handumdrehen die
Durchkontaktierungen der Rechnerplatine mit dem Prozessor komplett
herrausreist, was wiederum die Rechnerplatine schnell unbrauchbar
werden l&auml;sst. Die gemeinten Leute d&uuml;rfen sich wieder setzen
<br>
</p>
<p>Es sollte hierbei auf kurze und genaue L&ouml;tungen geachtet
werden ! Selbst wenn sp&auml;ter die Erweiterung nicht Funktionieren
sollte ist mit dem einsetzen eines 8 Mhz Prozessors die Welt wieder in
Ordnung. Die 16 Mhz-Prozessorplatine ist so vorbereitet das man auch
einen 8 Mhz Prozessor aufstecken kann. In diesen Fall nur ohne
weggebogene Pin's 10 und 15. Etwas kniffelig ist noch das suchen des
'<a href="080109.htm" target="UDOcon">Soundchip</a>-Selectsignals' (SNDCS) welches an verschieden Stellen auf
der Hauptplatine abgegriffen werden kann, dazu sollte man am besten
einen ST <a href="190d.htm" target="UDOcon">Schaltplan</a> verwenden. Mittlerweile gibt es so viele
verschiede Platinenlayouts der ST Platine so da&szlig; man einfach
besser in den entsprechenden <a href="190d.htm" target="UDOcon">Schaltplan</a> hinein sehen sollte. Mit dem
Durchgangspr&uuml;fer geht das auch, dauert aber sehr lange.
<br>
</p>
<p>Bei einigen Modellen kann man die Leitung an Pin 12 oder Pin 3 von
U20 anl&ouml;ten, das ist ein normaler TTL-Baustein der sich in der
N&auml;he des Soundchips befinden sollte. Man mu&szlig; hierbei nicht
unbedingt an dem <a href="080107.htm" target="UDOcon">GLUE</a>-Baustein herruml&ouml;ten (Pin 53) Der
TTL-Baustein ist einfach viel billiger...
<br>
</p>
<p>Diese Leitung bitte nicht Verwechseln mit der Steuerleitung A7 des
Soundchips, die zur Umschaltung von 8 auf 16 Mhz verwendet werden
kann.
<br>
</p>
<p>Ist das neue Triebwerk installiert und Kontrolliert, kann man den
Rechner wie gewohnt Einschalten, er sollte sich mit dem <a href="0903.htm" target="UDOcon">Desktop</a>
melden. Nat&uuml;rlich etwas schneller als sonst. Sollte sich nicht
mal der Bildschirm erhellen, ist der Recher sofort Abzuschalten und
die Platine auf richtigen Sitz zu kontrollieren. Die Fehlersuche auf
der Prozessoerplatine ist durch die Packungsdichte recht schwierig...
<br>
</p>
<p>Bei Verwendung eines ROM-TOS in original Atari Roms sollten keine
Probleme auftreten, da die Original-Roms eine Zugriffszeit von nur
100nS besitzen, bei Verwendung von selbstgefrickelten Eproms sollten
unbedingt schnelle 120er oder eben 105er CMos-Typen verwendet werden,
niemals langsamere ! Es kommt sonst mit Sicherheit zu
Timing-Problemen, die 16Mhz <a href="080108.htm" target="UDOcon">CPU</a> greift um einiges schneller in den
ROM-Speicher als die alte <a href="080108.htm" target="UDOcon">CPU</a>. Wenn die ersten Tests gemacht wurden
kann man ruhig mal w&auml;hrend des Betriebes auf 8 Mhz
zur&uuml;ckschalten um so mal gleich einen Eindruck von der
Geschwindigkeit zu bekommen. Als Umschalter sollte man einen
'Entprellten' teueren Schalter verwenden. Da sich der Rechner an der
Umschaltung meist 'verschluckt' Genauer: Der Umschalter 'prellt' und
der Rechner kann die vielzahl dieser 'Impulse' nicht Interpretieren
und st&uuml;rzt so einfach ab Leider besitzt diese preiswerte
Erweiterung keinen Cache-Speicher auf der Platine, es w&auml;hre damit
noch eine weitere Geschwindikeitsteigerung zu erreichen.
Selbstverst&auml;ndlich w&auml;re es dann auch um einiges Teuerer.
F&uuml;r Leute die sich damit Zufriedengeben, ist diese Erweiterung
genau richtig.
<br>
</p>
<p>Beim Bootvorgang kann man weiterhin Turbo oder Quick_ST mitladen.
Der Rechner ist somit kaum zu bremsen.
<br>
</p>
<p>Die in der c't erw&auml;hnten Schwierigkeiten mit den
Floppylaufwerken konnte ich bis jetzt zwar best&auml;tigen, aber nicht
feststellen das man sich gr&ouml;&szlig;ere Gedanken darum zu machen
braucht. Wie gehabt, sollte der Motor einmal nicht schnell genug sein,
wiederholt man den Ladevorgang einfach nochmal. Eine weitere Hilfe ist
das Programm 'NERVER.PRG'. Mit diesem c't-Programm im Autoordner des
Bootlaufwerkes wird die Alertbox erst beim dritten Fehlversuch
auftauchen, d.h der Rechner versucht 3 mal das aktuelle
Diskettenlaufwerk (selbst&auml;ndig) anzusprechen, erst danach
erscheint die &uuml;bliche Alertbox. Der Motor im Diskettenlaufwerk
hat also gen&uuml;gend Zeit seine Solldrehzahl zu erreichen. Man
sollte also mit diesem Progr&auml;mmchen keinerlei Probleme haben.
<br>
</p>
<p>Die Umschaltung zwischen 8 und 16 Mhz per Software ist
nat&uuml;rlich eine elegante L&ouml;sung, die allerdings nicht auf
allen Rechnern funktioniert. Bei ST-Systemen bei denen der Monitor
automatisch und ohne Reset von Monochrom nach Farbe umgeschaltet wird,
geht die Softwareumschaltung nicht. Die Softwareumschaltung 'lebt' von
dem freien Port auf dem <a href="080109.htm" target="UDOcon">Soundchip</a> (Pin 14 / A7) der dann eben per
Umschaltsoftware bedient wird. Man kann auch den Port A6 verwenden,
der ja anscheinend in den meisten Rechnern auch noch frei ist. Dazu
mu&szlig; allerdings dann die Software angepasst werden. Ich
pers&ouml;nlich Bevorzuge die Umschaltung mit einem Schalter, der an
genau den gleichen Anschlu&szlig; der Prozessorplatine angeschlossen
wird. Der frei Pin des Schalters wird einfach mit Masse verbunden.
<br>
</p>
<p>Somit hat man dann immer noch die M&ouml;glichkeit frei einen
Auto-Monitor Umschalter zu betreiben.
<br>
</p>
<p>Die Erweiterung macht insgesammt eigentlich einen
vern&uuml;nftigen Eindruck welcher leider durch das zu
unterschiedliche Rechnertiming zunichte gemacht wird.
<br>Jedem ST Rechner sein eigenes Timing !
<br>
</p>
<p>Auch ist die Zuf&uuml;hrung des 16Mhz Taktes vom <a href="080106.htm" target="UDOcon">Shifter</a> nicht
ganz unproblematisch, auch hier kommt es zu 'verschiebungen' der
Phasenlage dieses Signals. Ein 'sauberer' 16Mhz Betrieb ist so dann
schwer m&ouml;glich.
<br>
</p>
<p>Es kommt also auch vor das die Erweiterung im Rechner
&uuml;berhaupt nicht arbeitet. Oder nur bis zu einem bestimmten
Erw&auml;rmungsgrad der <a href="080108.htm" target="UDOcon">CPU</a>. Aber dann in einem weiteren Rechner
gesteckt, Tadellos funktioniert.
<br>
</p>
<p>Mit Sicherheit ist diese Erweiterung, entgegen der Aussage in der
c't , noch nicht ganz Ausgereift. Der <a href="0201.htm" target="UDOcon">Autor</a> sollte die Sache vieleicht
nochmal &Uuml;berarbeiten, oder wenigstens seine Post beantworten.
<br>
</p>
<p>Schriftliche, vor Weihnachten '90 gestellte Anfragen an den <a href="0201.htm" target="UDOcon">Autor</a>
selber bez&uuml;glich der Probleme mit der Speedup16 Platine warten
noch heute auf eine Antwort.
<br>
</p>
<p>Mit 100%tiger Sicherheit ist man mit einem Ad_Speed oder einer
SpeedPlus- Erweiterung besser bedient. Wenn diese auch wesentlich
teuerer sind, daf&uuml;r aber auf Anhieb funktionieren und man keinen
eigenen Gehirnsaft opfern mu&szlig; :-)
<br>
</p>
<p>Wer allerdings nicht viel Geld ausgeben will/kann, sollte diese
Sache mal ins Auge fassen, allerdings nur mit entsprechendem
Messger&auml;tepark. (Als gut gemeinter Tip zum Schlu&szlig;) Im
&uuml;brigen habe ich die Taktzuf&uuml;hrung vom <a href="080106.htm" target="UDOcon">Shifter</a> bis zur
SpeedUP-Platine mit d&uuml;nnem WireWarp-Draht gemacht, diesen auch
ganz dicht an der ST-Platine verlegt. Nur so war ein stabiler Betrieb
zu erreichen, freie Verdrahtung, auch mit Ferritperlen auf der Leitung
haben nicht Funktioniert. Der n&auml;chste Schritt d&uuml;rfte wohl
eine Art 'Koaxialkabel' werden :-) Diese Erweiterung belastet die
Takterzeugung vor dem <a href="080106.htm" target="UDOcon">Shifter</a> nicht ganz unerheblich, man kann einen
'Buffer' in Erw&auml;gung ziehen der die Signalflanken 'gerade'
h&auml;lt.
<br>
</p>
<p>ids MR.T 1062 HND
<br>R.Schaffner (c) 90'/91'
<br>
</p>
<p><tt> SpeedUp 16 </tt>
</p>
<p>Wo hast Du die Platine her? Gibts da noch mehr davon? Was kosten
die? Was kosten die Teile? Wenn sie l&auml;uft: Wieviel bringt sie?
<br>
</p>
<p>In den c't-Ausgaben 1/91 S.10 und 2/91 S.11 waren nochmal
&Auml;nderungen.
<br>
</p>
<p>Hier die Informationen aus c't 1/91:
<br>
</p>
<p>In der Projektbeschreibung wurde vorgeschlagen, die <a href="080108.htm" target="UDOcon">CPU</a>
'auszuschalten' statt auszul&ouml;ten. Leider ist der <a href="0201.htm" target="UDOcon">Autor</a> einer
Fehlinformation aufgesessen, die in einem Fachbuch verbreitet wird.
Die 8-MHz-<a href="080108.htm" target="UDOcon">CPU</a> sollte vollst&auml;ndig ersetzt werden.
<br>Eine bestimmte ST-Serie aus neuerer Produktion, die mit <a href="080107.htm" target="UDOcon">GLUE</a> und
<a href="080105.htm" target="UDOcon">MMU</a> des Herstellers IMP ausger&uuml;stet ist, arbeitet nicht mit
Speedup-16 zusammen. An einer Probleml&ouml;sung wird gearbeitet. In
&auml;lteren STs finden sich nach Berichten von Lesern gelegentlich
ROM-Bausteine von NEC, die f&uuml;r den 16-MHz-Betrieb zu langsam
sind. Hier w&auml;re ein Austausch gegen 120ns-EPROMs erforderlich.
Exemplarische Timingunterschiede f&uuml;hren bei einigen STs zu
Instabilit&auml;t im 16-MHz-Betrieb. Hier l&auml;&szlig;t sich in der
Regel durch Verk&uuml;rzen der mit IC5 eingestellten
DTACK-Verz&ouml;gerung Abhilfe schaffen: trennen sie die im Layout
vorhandene Verbindung zwischen Pin 3 des DS1000M-125 und der mittleren
L&ouml;tinsel un stellen Sie eine Verbindung zu Pin 6 her.
<br>
</p>
<p>und die aus c't 2/91:
<br>
<br>
</p>
<p>Im <a href="190d.htm" target="UDOcon">Schaltplan</a> auf Seite 336 sind zwei Anschl&uuml;sse von IC6, Pin
13 und Pin 14, miteinander vertauscht. Die Platine ist jedoch korrekt
ausgef&uuml;hrt. Wie schon in Ausgabe 1/90 [&lt;- Kopfkratz, da stand
wirklich 90, dabei erschien das Projekt erst in der 10/90 ...]
berichtet, funktioniert die Speedup-16-Karte bisher nicht in STs, die
mit Chips&auml;tzen des Herstellers IMP ausgestattet waren. Abhilfe
konnte jedoch in einigen F&auml;llen durch Invertieren des
16-MHz-Signals erzielt werden. In anderen F&auml;llen brachte die
abgebildete, etwas aufwendigere Zusatzschaltung den Erfolg. Sie formt
aus dem 8-MHz-Takt ein 16-MHz-Taktsignal mit definierter Phasenlage.
<br>
</p>
<pre>
8MHz      /----\
---+------|    |
   |      |&gt;=1 |------------------------ 16 MHz
   |   /--|    |
   |   |  \----/               74 F 86
   |   |
   |   \----------------------------------------\
   |                                            |
   |  /-----------------+----+---- +5V          |
   |  |                 |    |                  |
   |  |                 #    |                  |
   |  |             10k #    |  /----\          |
   |  | /----\          #    \--|    |   560 R  |       Drei Exor-Gatter
   |  \-|    |   560 R  |       |&gt;=1 |---#####--+       erzeugen 16 MHz aus
   |    |&gt;=1 |---#####--+-------|    |          |       dem 8-Mhz-Taktsignal
   \----|    |          |       \----/          |
        \----/          |                       |
                       === 22p             22p ===
                        |                       |
                        |                       |
                        \-----------------------+---- GND

</pre>
<p>Originaltext von 1990.
<br>Originalfassung zusammengetragener <a href="0205.htm" target="UDOcon">Information</a>.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0a.htm" target="UDOcon"><img src="udo_up.gif" alt="Beschleuniger" border=0 width="24" height="24"></a>
<a href="0a.htm" target="UDOcon"><img src="udo_lf.gif" alt="Beschleuniger" border=0 width="24" height="24"></a>
<a href="0a02.htm" target="UDOcon"><img src="udo_rg.gif" alt="MightyMic" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
