<!doctype html>
<html lang="de">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: FAB HD Modul
</title>
<link rel=home href="doitst1h.html" title="Homepage">
<link href="css/bootstrap.min.css" rel="stylesheet">
<link href="css/styles.css" rel="stylesheet">
</head>
<body>
<div class="container-fluid">
<div class="row">
<div class="col-md-12">


<table class="navigation"><tr><td valign=top>
<a href="00con.html" ><img class="img-fluid" src="navi/udo_hm.gif" alt="Home"  width="24" height="24"></a>
<a href="0b03.html" ><img class="img-fluid" src="navi/udo_up.gif" alt="HD Disk ST"  width="24" height="24"></a>
<a href="0b0303.html" ><img class="img-fluid" src="navi/udo_lf.gif" alt="HD Switch"  width="24" height="24"></a>
<a href="0b0305.html" ><img class="img-fluid" src="navi/udo_rg.gif" alt="HD Modul"  width="24" height="24"></a>
</td></tr></table>
<table  cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="FAB_20HD_20Modul">11.3.4 FAB HD Modul</a></h1>
<p align=center><img class="img-fluid" src="image/sline.gif"  width="640" height="2"></p><br>
<p><tt> FAB HD-Modul </tt>
<br>
<br>
</p>
<p><img class="img-fluid" src="image/deutsch.gif"  width="35" height="22"></p><br>
<p>
<br>
</p>
<p><b> 1) Was kann das FAB (C) HD-Modul? </b>
<br>
</p>
<p>Der Takteingang des Floppy Controllers wird entweder mit 16 MHz
aus dem eigenen Oszillator (keine <a href="080106.html" >Shifter</a>-Belastung) f&uuml;r den HD
Modus oder mit durch Teilung erzeugten 8 MHz (wie Originalzustand)
f&uuml;r den DD-Modus ver- sorgt.
<br>
</p>
<p>
<br>
<br><b> 2) Welches Eingangssignal wird ben&ouml;tigt? </b>
<br>
</p>
<p>Das Modul wird durch den Low-aktiven Eingang in den HD-Modus
geschaltet. Eine Verkn&uuml;pfung mit Selektsignalen erfolgt nicht.
Nach der Shugart-Norm sind Ausg&auml;nge der Floppys lowaktiv und nur
aktiv, w&auml;hrend das Laufwerk selektiert ist. VIELE
FLOPPY-HERSTELLER HALTEN SICH NICHT AN DIESE NORM. Beim <a href="0201.html" >Autor</a> arbeiten
Citizen Laufwerke, bei denen eine Br&uuml;cke gel&ouml;tet werden
mu&szlig;te, ein NEC Laufwerk gibt nach L&ouml;ten einer Br&uuml;cke
das Signal OHNE Ber&uuml;cksichtigung des Select. Selbst bei nur einem
Laufwerk w&auml;re dann BEI NICHT EINGELEGTER DISKETTE die hohe
Frequenz st&auml;ndig aktiviert, was mit Sicherheit zu thermischen
Problemen f&uuml;hrt. Das (auch sonst empfehlenswerte) TEAC FD-235HF
funktioniert mit folgen- den Jumpern:
(E4-E3)(D3-C3)(B4-A4)(B3-A3)(E1-D1) und ein Select. Das HD Signal
liegt &uuml;blicherweise auf Pin 2. Dieser ist im <a href="0305.html" >Atari ST</a> nicht
belegt.
<br>
</p>
<p>
<br>
<br><b> 3) Welcher Einbauvarianten gibt es? </b>
</p>
<p>Das Modul kann mit den drei hervorgehobenen Pins AUF den
Controller gel&ouml;tet werden. Die Verbindung von Pin 18 (Takteingang
des Controllers) ist dann auf der Platine oder am Bein des Controllers
zu trennen.
<br>
</p>
<p>Alternativ (und besser) wird der Controller ausgel&ouml;tet und
durch einen Sockel ersetzt. ES MUSS DAF&Uuml;R EIN EINFACHER SOCKEL
_OHNE_ GEDREHTE KON- TAKTE VERWENDET WERDEN. Als Controller Sockel auf
der Modul Platine werden wire-wrap Fassungsleisten verwendet. Pin 18
wird nach dem Einl&ouml;ten abgekniffen.
<br>
</p>
<p>Der Eingang wird mit der Leitung 2 des Shugart Busses verbunden.
<br>
</p>
<p>
<br>
<br><b> 4) Was ist beim Aufbau zu beachten? </b>
<br>
</p>
<p>Die ICs werden nicht gesockelt. Viele Pins werden auf beiden
Seiten der Platine verl&ouml;tet. VORSICHT: Die Unterseiten der beiden
ICs sind nicht zug&auml;nglich, wenn das andere eingesetzt ist. Es
mu&szlig; erst eine Pinreihe abgebogen und von unten verl&ouml;tet,
dann das zweite IC eingesetzt und von unten verl&ouml;tet und zum
Schlu&szlig; das erste IC zur&uuml;ckgebogen und mit der zweiten
Pinreihe verl&ouml;tet werden. die L&ouml;tungen von oben sind
nat&uuml;rlich kein Problem, allerdings sollten die Fassungsstreifen
als letztes ein- gesetzt werden.
<br>
</p>
<p>
<br>
<br><b>5) Geht es noch billiger? </b>
<br>
</p>
<p>Der Oszillator macht allein etwa die H&auml;lfte der Gesamtkosten
aus. Ohne ihn liegen diese unter zehn Mark. Er kann ohne weiteres weg
gelassen und die 16 MHz vom <a href="080106.html" >Shifter</a> (bzw. irgeneiner g&uuml;nstig
gelegenen Durchkontak- tierung) abgegriffen werden. F&uuml;r
h&ouml;here Betriebssicherheit und geringere Belastung eines teuren
Spezialbauteils wird davon aber abgeraten.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b>6) Und wo kriege ich das her? </b>
<br>
</p>
<p>Alle Bauteile sind handels&uuml;blich. Die Platine kann f&uuml;r
DM 5,- (ungebohrt und nat&uuml;rlich nicht durchkontaktiert) vom <a href="0201.html" >Autor</a>
bezogen werden. Da ich sie auch erst bestellen mu&szlig;, kann das
aber etwas dauern. Das Porto ist in den DM 5.- nat&uuml;rlich _nicht_
enthalten.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b>7) Noch Fragen? </b>
</p>
<p>Der <a href="0201.html" >Autor</a> kann erreicht werden &uuml;ber:
<br>
</p>
<p>Mausnet:
<br>Axel Berger @ RS
<br>
</p>
<p>Post:
<br>Dipl.-Ing. F. Axel Berger
<br>Johann-H&auml;ck-Stra&szlig;e 14
<br>DW-5068 Odenthal-Heide
<br>
</p>
<p>(frankierter R&uuml;ckumschlag bitte!(
<br>
</p>
<p>Tel: 02174/ 41824
<br>Fax: 02174/ 4241
<br>
</p>
<p>Dies ist die erste Version der Anleitung (die Schaltung selbst
l&auml;uft schon l&auml;nger zuverl&auml;ssig mit WD 1772-02-02 und
auch mit VLSI 1772) Um Korrekturen und Hinweise wird gebeten.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img class="img-fluid" src="image/fabhd.gif"  width="800" height="460"></p><br>
<div align=center><tt> Abbildung 1 - Layout, L&ouml;t- und Best&uuml;ckungsseite
</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<hr>
</td></tr></table>
<table class="navigation"><tr><td valign=top>
<a href="00con.html" ><img class="img-fluid" src="navi/udo_hm.gif" alt="Home"  width="24" height="24"></a>
<a href="0b03.html" ><img class="img-fluid" src="navi/udo_up.gif" alt="HD Disk ST"  width="24" height="24"></a>
<a href="0b0303.html" ><img class="img-fluid" src="navi/udo_lf.gif" alt="HD Switch"  width="24" height="24"></a>
<a href="0b0305.html" ><img class="img-fluid" src="navi/udo_rg.gif" alt="HD Modul"  width="24" height="24"></a>
</td></tr></table>
</div> <!-- col-md-12 -->
</div> <!-- row -->
</div> <!-- container -->
</body>
</html>
