<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Speichererweiterung ST
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0e.htm" target="UDOcon"><img src="udo_up.gif" alt="Speichererweiterungen" border=0 width="24" height="24"></a>
<a href="0e.htm" target="UDOcon"><img src="udo_lf.gif" alt="Speichererweiterungen" border=0 width="24" height="24"></a>
<a href="0e0101.htm" target="UDOcon"><img src="udo_rg.gif" alt="2.5 MB RAM" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Speichererweiterung_20ST">14.1 Speichererweiterung ST</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Speichererweitungen f&uuml;r Atari Computer </tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<p>Erweitern oder nicht?
<br>
<br>
<br>
</p>
<p>Speichererweiterung f&uuml;r die ST-Rechner sind Preiswerter
geworden, so ist es jetzt m&ouml;glich den Rechner doch noch etwas zu
erweitern. Noch vor knapp einem halben Jahr waren die Speicherchips
noch sehr teuer. Nun kann man doch schon f&uuml;r 14DM die sehr
begehrten Megabit-Chips bekommen, auch die 256K-Bit Chips sind im
Preis erheblich billiger geworden sie kosten noch so um die 5 DM pro
St&uuml;ck. Das l&auml;sst es zu die ST-Rechner auf verschiedene Arten
zu erweitern. Zum Teil mit den 'Huckepack-L&ouml;sungen', zum anderen
Teil mit den steckbaren oder l&ouml;tbaren Erweiterungsplatinen die
&uuml;berall Angeboten werden.
<br>
</p>
<p>Die steckbaren <a href="0e.htm" target="UDOcon">Speichererweiterungen</a> stellen hierbei die
einfachste, leider aber auch die etwas teuere L&ouml;sung dar.
Steckbare Erweiterungen gibt es in den gr&ouml;&szlig;en 512 Kbyte,
2.5 Mbyte und auf eben 4 Mbyte Vollausbau. Die einigerma&szlig;en
brauchbaren Platinen werden von z.B von Gentec oder H&amp;S
vertrieben, man kann die Platinen teilweise best&uuml;ckt oder als
reine Leerkarte bei diesen Firmen bekommen. Allerdings l&auml;sst die
Lieferzeit von 2-3 Monaten eines manchen Zubeh&ouml;r- Lieferranten
die Lust hier schnell schwinden. Warum diese Lieferzeiten entstehen
ist mir reichlich Schleierhaft. Gut, die Zeit kann man f&uuml;r
Sammelbestellungen der RAM-Bausteine gut verwenden, hier macht die
Menge einen g&uuml;nstigen Preis!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ram1.gif" border=0 width="350" height="311"></p><br>
<div align=center><tt> Abbildung 1 - Eine ST Speichererweiterung </tt>
</div>
<p>
<br>
<br>
</p>
<p>Eine Erweiterung auf 2.5Mbyte, voll Best&uuml;ckt und zum
Einstecken kostet momentan ca.600 DM, auf 4Myte immerhin das Doppelte.
Diese (fast) fertige L&ouml;sungen sind nat&uuml;rlich f&uuml;r die
meisten User auch noch zu teuer. Mir auf jeden Fall. Also kommen
eigentlich nur die Leerkarten, oder eben Huckepack-L&ouml;sungen in
Frage, Bei den Huckepack-L&ouml;sungen werden Ram-Bausteine auf eben
schon im Rechner vorhandene Bauteile gel&ouml;tet. Der Nachteil ist
hier eine schlechte Servicem&ouml;glickeit im Fehlerfall. Beim
Bestellen einer Leerkarte sollte auf alle F&auml;lle genau das Baujahr
und der genaue Rechnertyp angegeben werden, vollsteckbare Platinen
eigenen sich nur f&uuml;r Rechner bei denen der <a href="080106.htm" target="UDOcon">Shifter</a> sowie <a href="080105.htm" target="UDOcon">MMU</a>
gesockelt sind. Ansonsten wird es nicht passen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ram2.gif" border=0 width="331" height="312"></p><br>
<div align=center><tt> Abbildung 2 - Eine ST Speichererweiterung </tt>
</div>
<p>
<br>
<br>
</p>
<p>Platinen gibt es auch f&uuml;r die MegaST-Serie, wobei hier jedoch
das nachtr&auml;gliche Einl&ouml;ten von IC-Sockeln und das
best&uuml;cken mit Megabit Chips vorzuziehen w&auml;hre, diese
L&ouml;sung w&auml;hre hier wesentlich einfacher.
<br>
</p>
<p>Sollte die <a href="080105.htm" target="UDOcon">MMU</a> nicht gesockelt sein gibt es noch die
M&ouml;glichkeit eine 'Teill&ouml;tbare' Platine zu Bestellen. Es
m&uuml;ssen dann je nach Hersteller bis zu 18 Dr&auml;hte auf der
Rechnerplatine an verschiedenen Punkten angel&ouml;tet werden. Das
sollten nur Leute machen die wissen wie man einen L&ouml;tkolben
anfassen mu&szlig;, nein das war jetzt kein Witz. Ausserdem ist es
sp&auml;ter etwas l&auml;stig die Erweiterung mal eben aus dem Rechner
zu nehmen, man bleibt ja mit ca. 18 Leitungen verbunden. Es mu&szlig;
dann eben wieder gel&ouml;tet werden, was der Rechnerplatine eben auch
nicht immer gut bekommt.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ram3.gif" border=0 width="271" height="312"></p><br>
<div align=center><tt> Abbildung 3 - Eine ST typische Speichererweiterung </tt>
</div>
<p>
<br>
<br>
</p>
<p>Die Steckbare sowie die teill&ouml;tbare L&ouml;sung ben&ouml;tigt
ausserdem einen gesockelten <a href="080106.htm" target="UDOcon">Shifter</a> (Videochip). Die Platinen besitzen
einen Stecksockel der anstelle des Shifters in dessen Sockel
eingesteckt wird. Der vorher ausgebaute <a href="080106.htm" target="UDOcon">Shifter</a> wird in der richtigen
Richtung nun auf die Erweiterungskarte gesteckt, Notfalls mu&szlig;
man sich die Steckrichtung des Shifters eben voher mit einem Filzstift
markieren. Bei den ST-Modellen mu&szlig; der Abschirmk&auml;fig der
sich um den <a href="080106.htm" target="UDOcon">Shifter</a> herrum befindet zur Platinenmitte hin entfernt
werden. (In Richtung der <a href="080105.htm" target="UDOcon">MMU</a>) Die Dr&auml;hte, die bei der
teill&ouml;tbaren Platine herrumh&auml;ngen werden bis auf die
Stromversorgung alle in der N&auml;he der <a href="080105.htm" target="UDOcon">MMU</a> von unten auf der
Rechnerplatine verl&ouml;tet. Gl&uuml;cklicherweise befindet sich hier
ein gro&szlig;es Loch in der Platine durch das man die Leitungen
f&uuml;hren kann. Diese Arbeit verlangt etwas Fingerspitzen
gef&uuml;hl, die L&ouml;taugen an der <a href="080105.htm" target="UDOcon">MMU</a> sind sehr Nahe beieinander,
zu schnell sind 2 L&ouml;taugen miteinander verbunden was dann mit
Sicherheit zu Fehlfunktionen f&uuml;hrt wird es nicht Entdeckt. Auch
Zerst&ouml;rungen einzelner Rambausteine sind nicht
auszuschlie&szlig;en. Die restlichen Verbindungen sind ja durch den
Shiftersockel gew&auml;hrleistet. Zu Beachten ist nat&uuml;rlich die
mitglieferte Einbauanleitung, die je nach Hersteller mehr oder weniger
gut ist und auch Bilder hat.
<br>
</p>
<p>Der Einbau einer vollsteckbaren Platine gestaltet sich
Naturgem&auml;&szlig; etwas einfacher da hier einfach nicht
gel&ouml;tet werden mu&szlig;. Alle Verbindungen werden durch das
aufstecken auf den Shiftersockel sowie einer kleinen
<a href="080105.htm" target="UDOcon">MMU</a>-Adapterplatine hergestellt.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ram.gif" border=0 width="371" height="196"></p><br>
<div align=center><tt> Abbildung 4 - verschiedene Speicherbausteine zum
Aufr&uuml;sten </tt>
</div>
<p>
<br>
<br>
</p>
<p>Die <a href="080105.htm" target="UDOcon">MMU</a>-Adapterplatine ist mit einem Flachbandkabel mit der
Erweiterungsplatine verbunden. Zu Beachten w&auml;hre hier das diese
sehr kleinen vergoldeten Steckkontakte f&uuml;r den <a href="080105.htm" target="UDOcon">MMU</a>-Sockel
wirklich wie ein rohes Ei zu Behandlen sind. Mehrfaches Ein- bzw.
Ausbauen sollte man der Betriebssicherheit zuliebe unterlassen. Das
<a href="11.htm" target="UDOcon">Verbindungskabel</a> ist Hersteller bedingt, genau so Kurz bzw. lang das
die Adapterplatine nur in einer Richtung auf die <a href="080105.htm" target="UDOcon">MMU</a> aufsteckbar ist.
Beim aufstecken der Platine sind die Ministeckkontakte auf der
Unterseite mit besonderer Vorsicht zu behandeln, sie sind sehr
Empfindlich und sehr schnell verbogen. Auch k&ouml;nnte das Fingern an
den Stiften kann nach einiger Zeit zu Korrosion f&uuml;hren, was eben
auch nicht unbedingt sein mu&szlig;. Die Stifte des <a href="080105.htm" target="UDOcon">MMU</a>-Adapters
keinesfalls zwischen die Kontakte der <a href="080105.htm" target="UDOcon">MMU</a> und des Sockels stecken, der
<a href="080105.htm" target="UDOcon">MMU</a>-Sockel hat etwas zu seinen &auml;u&szlig;eren R&auml;dern hin die
gleichen Kontakte nocheinmal, nur dahinein werden die Beinchen der
Adapterplatine gesteckt, auch nur so ist eine sichere Kontaktgabe
gew&auml;hrleistet. Im andern Fall w&uuml;rde man die feinen
Kontaktzungen des <a href="080105.htm" target="UDOcon">MMU</a>-Sockel soweit verbiegen das ein sicherer Sitz
des <a href="080105.htm" target="UDOcon">MMU</a>-Chips nicht mehr gegeben ist. Fehler im Betrieb w&auml;hre die
sichere Folge.
<br>
</p>
<p>Man sollte auf keinen Fall die Adapterplatine zuerst auf die <a href="080105.htm" target="UDOcon">MMU</a>
stecken! Ein Hantieren mit der eigentlichen Erweiterungsplatine
belastet die Steckverbindung sowie das Flachbandkabel unn&ouml;tig.
<br>
</p>
<p>Bei allen Platinenl&ouml;sungen ist darauf zu achten das die
Speicherchips die richtige bzw. markierte Einbaulage bekommen. Die
Platine l&auml;sst sich im ausgebauten Zustand am einfachsten mit den
Speicherchips best&uuml;cken. Wenn die Platine im Rechner schon
gesteckt ist k&ouml;nnen durch das eindr&uuml;cken der Chips in die 16
oder 32 Chip Sockel Besch&auml;digungen an der Platine oder des
Shiftersockels bzw. auch der eigentlichen Rechnerplatine auftreten.
Die Fehler die daraus entstehen k&ouml;nnen sind unter Umst&auml;nden
schwer zu lokalisieren und nur mit geeigneten Messmitteln
(Oszilloskop) Ohmeter und einem Atari Testmodul zu finden. Ein teurer
Werkstattbesuch k&ouml;nnte die Folge sein.
<br>
</p>
<p>Manche Platinen erzeugen nach einem l&auml;ngeren Betrieb des
Rechners ein leichtes Bildschirmflimmern, meistens aber kaum zu sehen.
Das kommt durch die jetzt etwas erh&ouml;hte Stromaufnahme aus dem
<a href="10.htm" target="UDOcon">Netzteil</a> des Rechners. Eine Abhilfe bringt das Verst&auml;rken der
Masseverbindung zur Erweiterungsplatine in etwa durch aufl&ouml;ten
einer zus&auml;tzlichen Masse- verbindung oder durch verst&auml;rken
der Masseleiterbahnen auf der Platine. Diese Dinge treten nicht
grunds&auml;tzlich bei allen Erweiterungen auf. Meistens sind es etwas
&auml;ltere ST Modelle bei denen das <a href="10.htm" target="UDOcon">Netzteil</a> schon gut ausgelastet
ist. Und die Urspr&uuml;nglich auch ja nur f&uuml;r 512K bzw. 1 Mbyte
Ram gedacht waren. Selbst hier gibt es aber einige Wirkungsvolle
&Auml;nderungen die am Ende trozdem das angestrebte Ergebniss
erreichen.
<br>
</p>
<p>Leider l&auml;st sich die Funktionsf&auml;higkeit einer solchen
Erweiterung nun mal eben nur im Rechner testen. Wenn alle Schritte der
Einbauanleitung gemacht wurden, die Platine(n) auf einen festen Sitz
kontrolliert wurden k&ouml;nnte man den Rechner eigentlich schon mal
ausprobieren. Den Monitor anschlie&szlig;en, die (das)
Diskettenlaufwerk(e) sowie die Festplatte, das Modem und Drucker sind
nicht erforderlich. Auch braucht das Geh&auml;use vorerst mal nicht
zugeschraubt werden. Ein Test der Rechnerplatine mit angeschlossener
Tastatur auf einer isolierten Tischauflage reicht erstmal aus,
zugeschraubt wird erst wenn alles in Ordnung ist und keine Fehler
auftreten. Auch werden wir beim Zuschrauben des originalen
Rechnergeh&auml;uses auf die verschieden langen Schrauben achten, gell
:-), einige meiner beliebten Pappenheimer haben seither drei
h&auml;ssliche Dellen direkt auf der Recheroberseite im Plastik.
<br>
</p>
<p>Nach dem Einschalten nicht erschrecken wenn der Rechner sich nicht
innerhalb der gewohnten Zeit mit dem <a href="0903.htm" target="UDOcon">Desktop</a> meldet, der neue Speicher
braucht etwas mehr Zeit beim Systemstart zum testen. Der Rechner
testet beim einschalten die Speicherkonfiguration, das bedeutet das
512K oder 1Mbyte Speicher schneller beschrieben und gelesen wird wie
ein Speicher mit 2.5 Mbyte oder gar 4 Mbyte. Man kann dann den
vorhanden Speicher mit dem Installieren einer gro&szlig;en Ramdisk
oder der Info-Funktion von z.B 1St Word ausprobieren. Auch gibt es
gen&uuml;gend andere Programme mit denen sich die Systemkonfiguration
ausgeben l&auml;sst, mit einem Monitor kann man auch Versuchen in die
neuen Speicheradressen zu schreiben (je nach Ausbau verschieden) um es
dann eben wieder zu lesen. Bei einer Erweiterung auf 2.5 Mbyte
m&uuml;ssten sich so etwa 2.48 Millionen freie Bytes melden. In
GFA-Basic l&auml;st sich die Sache mit (Fre(0) erfragen.
<br>
</p>
<p>Nach diesem Test kann man das ST Geh&auml;use geschlossen werden.
<br>
</p>
<p>F&uuml;r alle die ihren Rechner nur um zus&auml;tzliche 512K auf 1
Mbyte erweitern wollen, folgendes git nur f&uuml;r 260/520 Computer!
<br>
</p>
<p>Benutzt wurde eine Speicherweiterungskarte der Fa.CSF, es wurde
diese Karte gew&auml;hlt da sie Ordentlich und Robust aufgebaut ist.
Und auch von technischen Laien ohne gr&ouml;&szlig;ere Probleme
eingebaut werden kann. Der Erweiterungskarte liegt eine
Einbauanleitung in Form eines DIN A4 Blattes bei, was mehr oder
weniger ausreichend ist!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ctrst.gif" border=0 width="636" height="230"></p><br>
<div align=center><tt> Abbildung 5 - Eine moderne ST Speichererweiterung </tt>
</div>
<p>
<br>
<br>
</p>
<p>Die mir zuletzt f&uuml;r den <a href="0305.htm" target="UDOcon">Atari ST</a> gefertigte
Speichererweiterung war die CENTRam ST von Centek. Auch diese Karte
d&uuml;rfte nur noch gebraucht zu erhalten sein. Der Einbau ist
vollkommen unproblematisch.
<br>
</p>
<p>
<br>
<br><b> Vor dem Einbau </b>
<br>
</p>
<dl>
<dt><b>Step 1</b></dt><dd> Den Rechner durch entfernen der 6 Schrauben auf der Unterseite
&ouml;ffnen.
<br>
<br>&nbsp;
<dt><b>Step 2</b></dt><dd> Oberes Geh&auml;useteil entfernen, die Tastatur aus der Halterung
nehmen und
<br>vorsichtig das Keyboardkabel abziehen, danach die 6 Blechlaschen
des
<br>Abschirmbleches geradebiegen und die Blechhaube nach oben
abziehen.
<br>
<br>&nbsp;
<dt><b>Step 3</b></dt><dd> Als n&auml;chstes die Blechabdeckung des Videoshifters entfernen.
<br>(Nach oben abziehen, der Deckel ist nur Aufgesteckt)
<br>
<br>&nbsp;
<dt><b>Step 4</b></dt><dd> Den Rechner mit der Stromversorgungsbuchse nach rechts hinten auf
den
<br>Tisch legen, jetzt den Blechrahmen der Shifterbox mit einem
Scharfen
<br>Seitenschneider, links in Richtung der <a href="080105.htm" target="UDOcon">MMU</a> ausschneiden.
<br>(In Richtung der beiden quadratischen Chips).
<br>Am einfachsten den ganzen Blechrahmen Ausl&ouml;ten, der Deckel
<br>passt Hinterher meistens nicht mehr korrekt!
<br>
<br>&nbsp;
<dt><b>Step 5</b></dt><dd> Den Metallb&uuml;gel der <a href="080105.htm" target="UDOcon">MMU</a> vorsichtig! Entfernen und die kleine
Adapter-
<br>platine vorsichtig in die Fassung dr&uuml;cken.
<br>Achtung nicht die Anschlusstifte der Adapterplatine zwischen die
Anschluss-
<br>beinchen der <a href="080105.htm" target="UDOcon">MMU</a> und des Sockels dr&uuml;cken, das geht nicht.!!
<br>Der <a href="080105.htm" target="UDOcon">MMU</a>-Sockel hat die Kontakte etwas entfernt von den
Anschlu&szlig;beinen
<br>nochmal, hier hinein m&uuml;ssen die Stifte der Adapterplatine!
<br>Es passt nur in einer Richtung !!
<br>
<br>&nbsp;
<dt><b>Step 6</b></dt><dd> Den Videoshifter langsam aus der Fassung hebeln, die Richtung
merken!
<br>Jetzt die Erweiterungskarte mit der Stiftreihe in die Fassung des
<a href="12.htm" target="UDOcon">Video</a>-
<br>shifters dr&uuml;cken, das kann etwas schwer gehen.
<br>Es geht auch nur in eine Richtung, in der anderen Richtung ist das
Kabel
<br>zur Adapterplatine zu kurz.
<br>
<br>&nbsp;
<dt><b>Step 7</b></dt><dd> Jetzt den Videoshifter in der gemerkten Richtung auf die
daf&uuml;r
<br>vorgesehene Fassung der Erweiterungskarte stecken und alles auf
festen
<br>Sitz kontrollieren. Besonders aber die Adapterplatine auf der <a href="080105.htm" target="UDOcon">MMU</a>.
<br>
<br>&nbsp;
<dt><b>Step 8</b></dt><dd> Die Tastatur wieder anstecken und auf die vorgesehene Stelle
legen.
<br>Das <a href="10.htm" target="UDOcon">Netzteil</a>, den Monitor und das Floppy anschliessen, danach
Einschalten.
<br>In Basic l&auml;sst sich der freie Speicherplatz mit (? Fre(0))
abfragen.
<br>Einfacher ist es eine Ramdisk mit 700K zu installieren, oder ein
Programm
<br>zu laden welches auch Auskunft &uuml;ber den Ramspeicher erteilt.
<br>
<br>&nbsp;
<dt><b>Step 9</b></dt><dd> Alles Ausschalten und den Rechner wieder Zuschrauben,
nat&uuml;rlich achten
<br>wir auf die verschieden langen Schrauben, oder?
<br>(Es gibt sonst so h&auml;ssliche Beulen auf der Oberseite)
<br>
<br>&nbsp;
<br>Bei normalen Rechnern ohne geladene ACC's m&uuml;ssten so ca.910
Kb frei sein.
<br>
<br>&nbsp;
</dl>
<p>Ein jeglicher Speicherausbau der ST Serie wird im
Speicherkonfigurations- register festgehalten welches sich an der
Adresse $ FF 8001 befindet.
<br>
</p>
<p>
<br>
<br>
<br>
</p>
<p>
<br>
</p>
<div align=center><table border=1 frame=box>
<caption align=bottom>Tabelle 77: 8 Bit-Ram Konfigurationsregister $FF8001</caption>
<tr>
  <td align=left valign=top>Bit 3 2 1 0</td>
  <td align=left valign=top>Speicher</td>
  <td align=left valign=top>Konfiguration</td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top>BANK 0</td>
  <td align=left valign=top>BANK1</td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>0 0 0 0</td>
  <td align=left valign=top>128K</td>
  <td align=left valign=top>128K</td>
</tr>
<tr>
  <td align=left valign=top>0 0 0 1</td>
  <td align=left valign=top>128K</td>
  <td align=left valign=top>512K</td>
</tr>
<tr>
  <td align=left valign=top>0 0 1 0</td>
  <td align=left valign=top>128K</td>
  <td align=left valign=top>2Mb</td>
</tr>
<tr>
  <td align=left valign=top>0 0 1 1</td>
  <td align=left valign=top>reserviert</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>0 1 0 0</td>
  <td align=left valign=top>512K</td>
  <td align=left valign=top>128K</td>
</tr>
<tr>
  <td align=left valign=top>0 1 0 1</td>
  <td align=left valign=top>512K</td>
  <td align=left valign=top>512K</td>
</tr>
<tr>
  <td align=left valign=top>0 1 1 0</td>
  <td align=left valign=top>512K</td>
  <td align=left valign=top>2Mb</td>
</tr>
<tr>
  <td align=left valign=top>0 1 1 1</td>
  <td align=left valign=top>reserviert</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>1 0 0 0</td>
  <td align=left valign=top>2Mb</td>
  <td align=left valign=top>128K</td>
</tr>
<tr>
  <td align=left valign=top>1 0 0 1</td>
  <td align=left valign=top>2Mb</td>
  <td align=left valign=top>512K</td>
</tr>
<tr>
  <td align=left valign=top>1 0 1 0</td>
  <td align=left valign=top>2Mb</td>
  <td align=left valign=top>2Mb</td>
</tr>
<tr>
  <td align=left valign=top>1 0 1 1</td>
  <td align=left valign=top>reserviert</td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>1 1 x x</td>
  <td align=left valign=top>reserviert</td>
  <td align=left valign=top></td>
</tr>
</table></div>

<p>
<br>* ACHTUNG! nur in den 4 unteren Bit's wird der Ausbau
festgehalten.
<br>
<br>
</p>
<p>Die Best&uuml;ckung der Ramb&auml;nke kann mit 64Kbit, 256Kbit und
mit 1Mbit-Chip's erfolgen, die zus&auml;tzlichen Erweiterungskarten
lassen allerdings nur die Best&uuml;ckung mit 256kBit und 1Mbit-Chips
zu. Die Aufgabe des Registers besteht darin die unterschiedlichen
Ausbaustufen zu einem durchgehend adressierbaren Speicherbereich zu
verbinden. Egal mit was die B&auml;nke best&uuml;ckt wurden. Dieses
Konfigurationsregister kann beschrieben und gelesen werden.
Irgendwelche exotischen, erfundene andere Bankbelegungen werden
*immer* mit einem Busfehler belohnt.
<br>
</p>
<p>Erweiterungen auf 2.5 /3 /4 / 4.5 /5 Mbyte werden mit 1Mbit 511000
Chips, Zugriffszeiten zwischen 70 u. Max 100 nS best&uuml;ckt. z.B
Siemens Die Erweiterungen auf 512K werden meist mit dem 256Kbit 41256
Chips, Zugriffszeit zwischen 70 u. Max 120 nS best&uuml;ckt.
Vereinzelt hat es vor einiger Zeit auch Platinen gegeben z.B auf 2.5
Mbyte die eine wahlweise Best&uuml;ckung mit 256K oder 1Mbit Chips
zugelassen haben, ob die noch gehandelt werden kann ich nicht sagen.
<br>
</p>
<p>Neuerdings werden auch Erweiterungen von bis zu 14 Mbyte auf einer
Platine angeboten, die Preise daf&uuml;r sind allerdings horrend.
Sobald ich erfahre wie diese m&auml;chtige Erweiterung mit dem Rechner
verbunden wird ,gibt es hierzu einen kleinen Bericht.
<br>
</p>
<p>Wem die Platinenl&ouml;sungen zu teuer sind mu&szlig; dann auf die
selbstgestrickten Erweiterungen aus den Fachzeitschriften zugreifen.
Z.b zu der recht guten Beschreibung aus der c't oder eben anderer
Zeitschriften. Es sollte dann allerdings wirklich nur von erfahrenen
L&ouml;tern gemacht werden. Der Eingriff in den, ja eigentlich
funktionierenden Rechner ist hier schon gravierend und ist an manchen
Stellen sp&auml;ter, wenn es eventuell nicht geklappt hat unter
Umst&auml;nden dann leidernicht mehr r&uuml;ckg&auml;ngig zu machen.
(c't Anleitung) So wird bei einer Aufr&uuml;stungsanleitung empfohlen
die alten Speicherchips mit einem Seitenschneider abzuschneiden, um
die Schnippel dann besser Ausl&ouml;ten zu k&ouml;nnen, wie zum Teufel
soll man das wieder R&uuml;ckg&auml;ngig machen? Abgeschnitten bleibt
Abgeschnitten, oder ? Auch bieten einige Wald- und Wiesenanbieter
Speicherweiterungen zum selbst Einbau an. Manchmal kann die aber kein
Techniker einbauen! So m&uuml;ssen dann die Chips in irgendwelche
l&auml;cherliche und Schief ausges&auml;gte (Versuchboard's) Platinen
eingel&ouml;tet werden,die wiederum dann mit blanken Drahtenden eben
mehr schlecht wie recht mit der Rechnerplatine verbunden werden
sollten.
<br>
</p>
<p>In den meisten Rechnermodellen sind die Speicherchips eben mal
eingel&ouml;tet. Atari wollte sicher kein Geld f&uuml;r ein paar
Sockel ausgeben. Nun mu&szlig; ja bei einer Aufr&uuml;stung auf z.B 4
Mbyte der gesammte vorhandene Speicher ausgel&ouml;tet oder eben
Abgeschnitten werden. So gesehen bei einer
Telefonnummern-Speichererweiterungsfirma (Ich glaube, es wei&szlig;
jeder wer gemeint ist !?) Kostenpunkt lockere 1200 DM!
<br>
</p>
<p>Nat&uuml;rlich kann man den Rechner ja auch (gegen Aufpreis) zur
Aufr&uuml;stung einschicken...... (oder so !?!?)
<br>
</p>
<p>Die meisten Pin's der Speicherchips sind auf der Rechnerplatine
durchkontaktiert und auf der Platinenoberseite bzw. Unterseite mit
sehr d&uuml;nnen Leiterbahnen verbunden. Beim Ausl&ouml;ten der
vorhanden Chip's kommt es nun vor das man beim aushebeln der Speicher
eine solche Durchkontaktierung mit aus dem Loch reist. An der sog.
Hohlniete h&auml;ngt dann die Leiterbahn welche sich dann wie eine
Wurstpelle wundersch&ouml;n von der Platine l&ouml;sen l&auml;sst. Mit
einem kurzen Satz, der Rechner ist einfach im Eimer bzw. sehr schwer
zu Reparieren, das Handf&auml;deln mit WireWrap-Draht ist nicht
jedermans Sache. Wohl aber mit dem richtigen Zeitaufwand zu machen.
Einige Klugschei&szlig;er haben da ja schon ausf&uuml;hrlich Lehrgeld
bezahlt!
<br>
</p>
<p>Beim Abschneiden der Chip-Beinchen ist das Risiko zwar etwas
geringer, aber daf&uuml;r lassen sich die Speicherchips nur noch in
den Abfall bef&ouml;rdern. Funktionieren w&uuml;rden sie ja schon
noch, aber ohne Beinchen ?) Auch das Ausl&ouml;ten der abgeschnittenen
Beinchen ist ein reines Geduldsspiel, 256 L&ouml;cher ben&ouml;tigen
schon so Ihre Zeit. Hier sei dringend Abgeraten, es spart eine ganze
menge &Auml;rger und auch Geld. Etwas anderes ist es mit dem Huckepack
aufl&ouml;ten von neuen Chips auf die bereits vorhandenen Speicher.
Man kann so sehr g&uuml;nstig zu etwas mehr Speicher kommen, einfach
ist es so z.B einen 520STM auf 1 Mbyte aufzur&uuml;sten. Es
m&uuml;ssen in diesem Falle auch nur einige Pins der neuen Bausteine
nachverdrahtet und von der <a href="080105.htm" target="UDOcon">MMU</a> herangef&uuml;hrt werden. Alle anderen
Pins werden ja mit dem 'Unterman' verl&ouml;tet. Im wesentlichen
Handelt es sich hierbei um die <a href="080105.htm" target="UDOcon">MMU</a>-Steuerleitungen f&uuml;r die
h&ouml;here Bank/Adresse. Was allerdings Sp&auml;ter auch keinen
weiteren Ausbau mehr zul&auml;sst. Es ist aber die schnellste und
billigste Methode zu 1 Mbyte Speicher zu kommen. Beim Aufl&ouml;ten
solcher zus&auml;tzlicher Chips sollte man auch auf einen kleinen
Abstand zu dem unteren IC einhalten, er dient der besseren
Luftzirkulation und somit einer l&auml;ngeren Lebensauer der Speicher.
Eine genaue Beschreibung zu geben w&auml;hre allerdings m&uuml;hselig,
zumal diese Aufr&uuml;stanleitung in jedem Soderheft zu finden ist.
Das Huckepack aufl&ouml;ten von Megabitchips ist Grunds&auml;tzlich
deshalb auch m&ouml;glich da die Pinkompatibilit&auml;t der
Speicherchips untereinander teilweise gegeben ist. Ausnahmen sind die
zus&auml;tzlichen Adressleitungen, 2 Pins mehr und eine leicht
unterschiedliche Grundbelegung. Diese Unzul&auml;nglichkeiten
m&uuml;ssten dann mit einem etwas gr&ouml;sserem Verdrahtungsaufwand
beseitigt werden, der allerdings auch nur von ge&uuml;bten Leuten
vorgenommen werden sollte. Die vielen 'Dr&auml;htchen' die dann zu
sehen w&auml;ren sind nicht sch&ouml;n, aber der Rechner h&auml;tte
somit auch ohne Platine 2.5 Mbyte Ram.
<br>
</p>
<p>Eine Reparatur oder ein Austausch des Speichers w&uuml;rde sich
bei dieser L&ouml;sung h&ouml;chst umst&auml;ndlich und Zeitaufwendig
gestalten. Im gro&szlig;en und ganzen sind solche Erweiterungen mehr
'Zusammengebastelt' als 'Erweitert', auch wird niemand f&uuml;r diese
Art der Aufr&uuml;stung eine Funktionsgaratie geben oder
&uuml;bernehmen wollen. Und der weniger ge&uuml;bte User sollte
sowieso die Finger davon lassen. Es geht halt den Umst&auml;nden
entsprechend schnell.
<br>
</p>
<p>Die zu allen L&ouml;sungen zu bevorzugenden Megabit-Speicherchips
kann man in fast allen g&auml;ngigen Elektronik-Versandfirmen
bekommen, die Ausnahme sind die gro&szlig;en
Elektonik-Versandh&auml;user. Die Chips werden in den meisten
Computerfachzeitschriften wesentlich billiger angeboten, zumal diese
Anbieter auf Tagespreisbasis arbeiten. Man kann auf diese Art und
Weise einen g&uuml;nstigen Einkaufspreis erzielen der sich noch
verbilligt wenn sich einige Leute ihre Rechner gemeinsam Erweitern
wollen. Die Preise werden dann meist noch mal nach Mengen gestaffelt,
d.h man kann die Chips bei einer Abnahme von ca. 200-300 St&uuml;ck zu
einem wirklich guten Preis bekommen.
<br>
</p>
<p>Mit einem solchen aufger&uuml;stetem Rechner l&auml;sst es sich
viel bequemer Arbeiten, z.B sind endlich die gro&szlig;en
DTP-Programme ohne Einschr&auml;nkung benutzbar und der Rechner
l&auml;sst sich mit geeigneter Software 'teilen' d.h es ist
m&ouml;glich mehrere Programme gleichzeitig im Speicher zu haben,
zwischen denen dann bei Bedarf nur umgeschaltet wird. Auch ist das
Arbeiten mit einer gro&szlig;en Ramdisk kein Problem mehr, da einfach
genug Ram vorhanden ist, eine Ramdisk die ein komplettes Programm
einschliesslich der zu bearbeiten Dateien beinhaltet ist einfach nicht
zu &uuml;bertreffen. Auch mu&szlig; nicht bei jedem Bootvorgang
&uuml;berlegt werden welche .ACC's jetzt geladen werden oder nicht. Es
f&auml;llt einfach so nicht mehr in's Gewicht.
<br>
</p>
<p>
<br>
<br><b> Legal RAM values </b>
<br>
</p>
<p>The 64 returned by your question is simply the upper sixteen bits
of the full 32 bit amount (in hexadecimal it's &quot;0040&quot;). The
least-significant sixteen bits (stored at &amp;h430) should be all
zeroes.
<br>
</p>
<p>In this case, for all known legal RAM values for an ST/STE
computer, you'd get:
<br>
</p>
<p>
<br>
<br>
</p>
<p>
<br>
</p>
<div align=center><table border=1 frame=box>
<caption align=bottom>Tabelle 78: Legal RAM values for an ST/STE computer</caption>
<tr>
  <td align=left valign=top>Bit</td>
  <td align=left valign=top>Size</td>
  <td align=left valign=top>KB</td>
  <td align=left valign=top>Hex</td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>8</td>
  <td align=left valign=top>524288</td>
  <td align=left valign=top>512k</td>
  <td align=left valign=top>00080000</td>
</tr>
<tr>
  <td align=left valign=top>16</td>
  <td align=left valign=top>1048576</td>
  <td align=left valign=top>1000k</td>
  <td align=left valign=top>00100000</td>
</tr>
<tr>
  <td align=left valign=top>32</td>
  <td align=left valign=top>2097152</td>
  <td align=left valign=top>2000k</td>
  <td align=left valign=top>00200000</td>
</tr>
<tr>
  <td align=left valign=top>40</td>
  <td align=left valign=top>2621440</td>
  <td align=left valign=top>2500k</td>
  <td align=left valign=top>00280000</td>
</tr>
<tr>
  <td align=left valign=top>64</td>
  <td align=left valign=top>4194304</td>
  <td align=left valign=top>4000&szlig;k</td>
  <td align=left valign=top>00400000</td>
</tr>
</table></div>

<p>
<br>
</p>
<p>In case you're wondering, the address you are peeking at is what
is called a &quot;system variable&quot;, and is stored in RAM by TOS
after it starts up and has worked out how much RAM you have installed.
<br>
</p>
<p>If your machine has &quot;alternative&quot; or &quot;TT&quot; RAM,
(this requires a 32-bit <a href="080108.htm" target="UDOcon">CPU</a> ie 68020 or better) then look at the four
bytes at address &amp;h5a4 will tell you the end of
&quot;alternative&quot; RAM. If there isn't any, then this location
should contain the value zero. If not, (assuming you only retrieve the
upper 16 bits at the address, rather than the 32 bit value required)
then subtract 256, and then divide by 16 and you will get the amount
of alternative/fast/TT RAM.
<br>
</p>
<p>(Note to the programmers out there : the addresses I've given in
these articles are in protected memory, so you must be in the 68k
<a href="080108.htm" target="UDOcon">CPU</a>'s &quot;Supervisor mode&quot; to access them, otherwise you'll get
a multi-bomb crash. Basic appears to do this mode-swap for you)
<br>
</p>
<p>As long as your machine is fully TOS compatible, the addresses
I've given you will work on any ST/TT/Falcon/clone machine.
<br>
</p>
<p>
<br>
<br><b> Arbeitsspeichergr&ouml;&szlig;en </b>
<br>
</p>
<p>
<br>
</p>
<pre>Computer  ST Ram min. -max  Fast Ram   Maximale Ausbaugr&ouml;&szlig;e
-----------------------------------------------------------
ST        256Kb-1Mb                    1Mb
MegaST      1Mb-4Mb                    4Mb

MegaSTe   128Kb / 256Kb (2 oder 4 64k-SIMMs)
-----------------------------------------------------------
ST/MegaST 256Kb-12mb                   12Mb (mit Erweiterungen)
TT/STe      2Mb-4Mb                     6Mb
TT/STe      2Mb-10Mb       4Mb-16Mb    26Mb
TT                                    256Mb TT-RAM mit MagnumTT.
Milan       6Mb-128Mb                 128Mb (512MB mit 4 128MB-SIMMs)
-----------------------------------------------------------
</pre>
<p>
<br>
</p>
<p>STe verh&auml;lt sich wie ST. Bei Modellen mit SIMMs eben auch
128K/256K m&ouml;glich. Die Recher wurden so nie ausgeliefert. Das
meiste sind Selbstbaul&ouml;sungen die sie teilweise hier im Archiv
finden.
<br>
</p>
<p>
<br>
<br>Grundlage: <a href="1604.htm" target="UDOcon">ST-Computer</a> 2/90
<br><a href="0201.htm" target="UDOcon">Autor</a>: MR.T
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<p>0
</p>
<ul>
<li>14.1.1 <a href="0e0101.htm" target="UDOcon">2.5 MB RAM</a></li>
<li>14.1.2 <a href="0e0102.htm" target="UDOcon">520STFM Ram</a></li>
<li>14.1.3 <a href="0e0103.htm" target="UDOcon">Ram mit IMP MMU</a></li>
<li>14.1.4 <a href="0e0104.htm" target="UDOcon">16MB Ram</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0e.htm" target="UDOcon"><img src="udo_up.gif" alt="Speichererweiterungen" border=0 width="24" height="24"></a>
<a href="0e.htm" target="UDOcon"><img src="udo_lf.gif" alt="Speichererweiterungen" border=0 width="24" height="24"></a>
<a href="0e0101.htm" target="UDOcon"><img src="udo_rg.gif" alt="2.5 MB RAM" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
