<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: RS-Turbo
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_lf.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0302.htm" target="UDOcon"><img src="udo_rg.gif" alt="RSVE" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="RS-Turbo">15.3.1 RS-Turbo</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Beschleunigen der seriellen Schnittstelle mit RS-Turbo </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<p>RS-TURBO, h&ouml;here Baudraten f&uuml;r die serielle
Schnittstelle des ST (ebenfalls verwendbar f&uuml;r Modem1 der MegaSTE
und TT Computer)
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Sinn und Zweck des RS-TURBO </b>
<br>(Stand:4.7.94)
<br>
</p>
<p>RS-TURBO erm&ouml;glicht die Benutzung von h&ouml;heren Datenraten
als 19200Bd auf der seriellen Schnittstelle Modem1. M&ouml;glich sind
38400, 57600 und 115200Bd. (Bei den Fertigmodulen jetzt auch 76800Bd.)
<br>
</p>
<p>RS-TURBO ist in der Ansteuerung kompatibel zu RS_Speed von Stephan
Skrodzki @KA und basiert auf dem <a href="0f0302.htm" target="UDOcon">RSVE</a> von Harum Scheutzow.
<br>
</p>
<p>RS-TURBO ben&ouml;tigt nur vier Kabel zum Anschlu&szlig; im
Computer. Deshalb ist au&szlig;er dem Quarzoszillator und dem GAL16v8
noch ein 74HC-Schaltkreis f&uuml;r 1 DM vorhanden. Da nur zwei Kabel
am MFP angeschlossen werden m&uuml;ssen, ist die Arbeit besonders bei
den mit Quadpack-MFP ausgestatteten TTs und MegaSTEs wesentlich
einfacher.
<br>
<br>
<br>
</p>
<p><b> <a href="0206.htm" target="UDOcon">Copyright</a> </b>
<br>
</p>
<p>RS-TURBO darf f&uuml;r den Eigenbedarf gebaut werden. Gegen den
Aufbau f&uuml;r gute Freunde habe ich ebenfalls nichts. Dabei darf der
Bastler aber keinen Gewinn damit machen. Eine kommerzielle Fertigung
oder Verwertung ist nur mit meiner schriftlichen Zustimmung erlaubt.
Es werden die Treiber von Harun Scheutzow empfohlen, die, zusammen mit
GSZRZ, eine erhebliche Geschwindig- keitssteigerung bringen. Und ich
(Erik) bitte alle Benutzer dieser Treiber, die freiwillige Spende an
Harun Scheutzow zu entrichten.
<br>
</p>
<p>Ich habe diese Bauanleitung sorgf&auml;ltig &uuml;berpr&uuml;ft.
Ich hafte in keiner Weise f&uuml;r eventuelle Fehler und/oder (daraus
resultierende) Besch&auml;digungen irgendwelcher Objekte oder
Subjekte.
<br>
</p>
<p>In diesem Paket sind alle Informationen zu RS-TURBO enthalten.
Schriftliche Anfragen werden nur beantwortet, wenn R&uuml;ckporto
beiliegt.
<br>
</p>
<p>RS-TURBO basiert auf dem <a href="0f0302.htm" target="UDOcon">RSVE</a> von Harum Scheutzow.
<br>
</p>
<p>RS-TURBO (mit der ge&auml;nderten Platine f&uuml;r Quarzbetrieb
und f&uuml;r 4,9152MHz- Quarz) ist von Erik Kerger (Adresse/Tel./Fax
siehe unten).
<br>
</p>
<p>Wer sich die Platine nicht selbst herstellen will, kann sich eine
Platine f&uuml;r <a href="0f0302.htm" target="UDOcon">RSVE</a> oder sogar einen Fertigbaustein bei Harum
Scheutzow kaufen (s.u.).
<br>
</p>
<p>Ich werde Platinen und GALs auf Anfrage verkaufen, die Preise: GAL
und Platine DM13, Fertigmodul DM40, jeweils plus DM5 Porto/Verpackung
bei Voraus- kasse (Kto. 702649, BLZ 202 203 00, Verbraucherbank
Hamburg; bitte per Fax 040-490 81 59 bestellen. Adresse auf der
&Uuml;berweisung reicht nicht!!!)
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Langsamkeit der <a href="1604.htm" target="UDOcon">ST-Computer</a> mit TOS </b>
<br>
</p>
<p>Bei Geschwindigkeiten &uuml;ber 19200Bd gibt es ein generelles
Problem mit dem <a href="0901.htm" target="UDOcon">Betriebssystem</a> des ST und den DF&Uuml;-Programmen.
Wenn ein Programm im Polling den MFP bedient, kann problemlos eine
Datenrate von 115200Bd ausgenutzt werden, indem wirklich 11520cps
(Character per Second) &uuml;bertragen werden. Werden jedoch die
BIOS-I/O-Routinen benutzt, so kann ein 8MHz ST bei ZMODEM-Senden
maximal 2500cps und beim Empfangen 2000cps erreichen. Wenn der
RTS/CTS-Patch/Optimierer HSMODEM installiert wurde, erh&ouml;hen sich
diese Werte auf &uuml;ber 4000cps. Es mu&szlig; bei 38400Bd also immer
der RTS/CTS-Handshake genutzt werden, da der ST beim Empfangen sonst
Zeichen verlieren w&uuml;rde. Immerhin erlauben die Interruptroutinen
des ST noch eine Baudrate von 38400, indem sie rechtzeitig die Zeichen
abholen, im Puffer ablegen und bei vollem Puffer der Gegenstelle das
Senden verbieten. Eine &Uuml;bertragung mit 57600 und 115200 ist
jedoch selbst f&uuml;r die Interruptroutinen zu schnell, sie schaffen
es nicht, rechtzeitig die eintreffenden Zeichen abzuholen oder der
Gegenstelle das Senden zu verbieten.
<br>
</p>
<p>Wenn ein 16MHz-Speeder installiert ist (z.B.
serienm&auml;&szlig;ig im MegaSTE), so sind auch 38400Bd mit etwa
3000cps m&ouml;glich (oder noch mehr mit HSMODEM). (HSMODEM1 bzw.
HSMODA0x stammt von Harum Scheutzow, Adresse s.u.)
</p>
<p>HSMODEM wird dringend empfohlen, besonders mit Ziegler-Z-Modem auf
8MHz-ST-Computern kann eine erhebliche Geschwindigkeitssteigerung
erziehlt werden. Au&szlig;erdem installiert HSMODEM einen <a href="0f0302.htm" target="UDOcon">RSVE</a>-Cookie,
der z.B. bei Connect zur Anzeige der wirklichen Baudrate f&uuml;hrt.
&Uuml;ber den RSVF-Cookie ist ein Zugriff auf besonders schnelle,
Blockorientierte Treiber m&ouml;glich. Mit GSZRZ ab V 3.8 wird das
neue Treiber-Konzept unterst&uuml;tzt (HSMODA0x). Damit ist auch auf
einem 8MHz-ST der Betrieb mit 57600Bd m&ouml;glich!
<br>
</p>
<p>
<br>
<br><b> Technische Kurzerkl&auml;rung </b>
<br>
</p>
<p>TID ist der Timer D Ausgang des MFP, der normalerweise den
Baudratentakt lieferte. Dieser ist 16mal so gro&szlig; wie die
Baudrate.
<br>
</p>
<p>Gal liefert f&uuml;r 38400Bd sowieso immer 614400Hz
(m&uuml;&szlig;te nicht sein, ist aber n&uuml;tzlich, wird deshalb
nicht wegoptimiert). Damit wird ein 12Bit-Z&auml;hler 74HC4040
betrieben (von dem nur die unteren acht Bit ausgewertet werden),
solange TID L ist.
<br>
<br>
</p>
<pre>
Baud  Impulse  Fangbereich  Wirkung          BD1   BD2
200    96                   alte Baudraten    L     L
150   128      112..135     115200Bd ein      H     L
134   143      136..159      57600Bd ein      H     H
110   174      160..223      38400Bd ein      L     H
50-80                        76800Bd ein (nur Fertigmodul)

</pre>
<p>
<br>
</p>
<p>Baudraten 75 und 50 nicht setzen, da das TOS diese falsch
einstellt. Wenn man sie direkt richtig einsetzt, werden aus 75Bd
(256Impulse mod 256 = 0) immer 75Bd und aus 50Bd (384Impulse mod 256 =
128) immer 115200Bd (Beim Feritigmodul werden aus 50Bd 76800Bd
gemacht).
<br>
</p>
<p>Alle Fangbereich-Grenzwerte sind durch 8 teilbar. Die unteren drei
Bit des Z&auml;hlers werden deshalb nicht ausgewertet.
<br>
</p>
<p>Zwei Trick-Register speichern den Z&auml;hlerstand bei der TID
L/H-Flanke. BD1 wird f&uuml;r 112..157 und BD2 f&uuml;r 136..223 aktiv
(H).
<br>
</p>
<p>Je nach Trickregisterinhalt wird TID, T1 (Quarztakt), T2 (Quarz/2)
oder T3 (Quarz/3) an den Ausgang TUA gelegt. (Beim 4,1952MHz-Quarz
entsprechend Quarz/4 oder Quarz/8)
<br>
</p>
<p>Die neuen Fertigmodule lassen bei eingestellten 50Bd auch 76800Bd
zu. Die Taktteilung arbeitet hier anders, eine genaue Erkl&auml;rung
w&uuml;rde zu weit f&uuml;hren.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Schlu&szlig;bemerkung </b>
<br>
</p>
<p>Wie bereits gesagt, besiert die Schaltung auf dem <a href="0f0302.htm" target="UDOcon">RSVE</a> von Harum
Scheutzow. Er vertreibt auch Fertigversionen f&uuml;r 60DM, Platinen
(33*29mm) f&uuml;r 14DM und das GAL f&uuml;r 6DM (ca. Preise).
<br>
</p>
<p>Seine Adresse:
<br>Harum Scheutzow
<br>Dresdener Stra&szlig;e 83
<br>10179 Berlin
<br>
<br>
</p>
<p>Ich hoffe, die neue Platine und die M&ouml;glichkeit, auch Quarze
verwenden zu k&ouml;nnen, machen RS-TURBO noch interessanter. Die
RS-TURBO Fertigmodule und der Platinen/GAL-Satz machen aus 50Bd
zus&auml;tzlich 76800Bd, daf&uuml;r wird der 4,1952 MHz-Quarz nicht
mehr unterst&uuml;tzt (nur noch auf Anfrage!). RS-TURBO hat nichts mit
Harun Scheutzow zu tut, anfragen dazu nur an mich, Erik Kerger,
senden!
<br>
</p>
<p>Hamburg, 04.07.1994
<br>
<br>
</p>
<p>Erik Kerger (Auch EWK in der D-BOX Hamburg)
<br>W&ouml;rdenmoorweg 42
<br>22415 Hamburg
<br>
</p>
<p>Tel. 040/520 74 08
<br>Fax: 040/490 81 59
<br>
</p>
<p>Fragen bitte nur mit Angabe einer Fax-Nummer, sonst per Brief mit
R&uuml;ck- porto! Ich bin nicht &uuml;ber Netze erreichbar!
<br>
</p>
<p>
<br>
<br><b> Hinweise zu RSTURBO2.PRG </b>
<br>
</p>
<p>Die neuen Treiber von Harum Scheutzow bieten &uuml;ber den
RSVF-Cookie die M&ouml;g- lichkeit, die mit der Schnittstelle
m&ouml;glichen Baudraten abzufragen. Dabei werden f&uuml;r den
<a href="0f0302.htm" target="UDOcon">RSVE</a>/RS-SPEED/RS-TURBO auch die h&ouml;heren Baudraten 38400Bd,
57600Bd und 115200Bd gemeldet. Das Programm RSTURBO2.PRG wird im
AUTO-Ordner NACH dem HSMODEM1 bzw. NACH dem MFP-Treiber gestartet. Die
Baudratentabelle wird dann so angepasst, da&szlig; statt 50Bd nun
76800Bd angezeigt werden.
<br>
</p>
<p>F&uuml;r <a href="0f0302.htm" target="UDOcon">RSVE</a>, f&uuml;r RS-SPEED und f&uuml;r &auml;ltere RS-TURBO
ist dieses Programm nicht sinnvoll, da die 76800Bd hier NICHT
verf&uuml;gbar sind! &Auml;ltere RS-TURBOs k&ouml;nnen von mir
umger&uuml;stet werden, dazu das Modul zusammen mit einem V-Scheck (DM
15,-) an mich einsenden. Ich sende es umgebaut zur&uuml;ck!
<br>
<br>
</p>
<p>Die normalen Routinen im TOS sind (leider in allen Versionen)
fehlerhaft, und f&uuml;r h&ouml;here Baudraten als 19200Bd zu langsam
(au&szlig;er vielleicht MegaSTE).
<br>
</p>
<p>Bei Problemen (CRC-Error, Retrys) sollten daher alle ACCs und alle
Zweifel- haften Auto-Ordner-Programme entfernt werden. Druch Tests
kann man dann den Schuldigen langsam einkreisen.
<br>
</p>
<p>Und nochwas: mit den HSMODA0x-Treibern l&auml;uft 57600Bd auf
einem 8MHz-ST. Bei mir jedenfalls. Es gibt Modems wie z.B. das Zyxel,
die die Daten m&ouml;glich gleichm&auml;&szlig;ig an den ST
weiterleiten. Das ist nat&uuml;rlich wesentlich unkritischer als die
daten in Bl&ouml;cken mit der maximalen Geschwindigkeit zum ST zu
jagen. Da kann es schonmal sein, da&szlig; ein Zeichen nicht
rechtzeitig abgeholt werden kann, und das f&uuml;hrt dann zu
CRC-Fehlern.
<br>
</p>
<p>Ich benutze das GSZRZ von M. Ziegler und habe festgestellt,
da&szlig; es schneller ist als z.B. das interne Z-Modem von Connect.
<br>
</p>
<p>Im Zweifelsfalle w&uuml;rde ich zu 38400Bd auf einem 8MHz-ST
raten, das l&auml;uft mit einem RS-Treiber problemlos und reicht in
den meisten F&auml;llen wirklich aus. Nur die &Uuml;bertragung von
ungepackten Texten kann dank V42bis und 19200Bd- &Uuml;bertragung
(Zyxel E+) bis zu 4500cps erreichen, bei 38400Bd jedoch nur max.
3700cps.
<br>
</p>
<p>Wer die 76800Bd ausnutzen m&ouml;chte, mu&szlig; einen Speeder im
ST haben, oder einen MegaSTE oder TT. Mit 8MHz ist da nicht viel zu
machen!
<br>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/rsturbo.gif" border=0 width="587" height="506"></p><br>
<div align=center><tt> Abbildung 1 - Das RSTurbo Board </tt>
</div>
<p>
<br>
<br>
</p>
<p><b> Zum Best&uuml;ckungsplan (Platine RS-TURBO 2.3) </b>
<br>
<br>Ben&ouml;tigte Bauteile
<br>
</p>
<p>Z&auml;hler 74HC4040 (der normale CMOS 4040 ist zu langsam!)
<br>GAL 16V8, programmiert f&uuml;r RS-TURBO
<br>Keramikkondensator 100nF,
<br>
</p>
<p>entweder: Quarzoszillator 1,8432MHz (bessere L&ouml;sung!)
<br>oder:
<br>Quarz 1,8432MHz b.z.w. 4,9152MHz (siehe unten),
<br>2 Kondensatoren 47pF (keramisch, RM 2,5, bei 4MHz 33pF!)
<br>1 Widerstand 1MOhm, 1 Widerstand 4,7kOhm
<br>
<br>optional:
<br>2 Widerst&auml;nde 560 Ohm, 1 Leuchtdiode zweifarbig (drei
Anschl&uuml;sse!).
<br>
<br>Optional:
<br>Steckerleiste 8-Pol mit <a href="0f0b.htm" target="UDOcon">Stecker</a> zum Anschlu&szlig; an den
Computer,
<br>sonst etwas Flachbandkabel.
<br>
<br>
<br>
</p>
<p><b> Wichtig: </b>
<br>
<br>
</p>
<p>F&uuml;r 4,1952MHz-Quarz mu&szlig; die Leiterbahn an Pin 9 vom GAL
nach Masse (Pin 10) aufgetrennt werden und zwischen die Punkte A und B
eine Br&uuml;cke gelegt werden.
<br>
</p>
<p>Der Quarz sollte liegend montiert werden, dazu die
Anschlu&szlig;dr&auml;hte aber nicht direkt am Geh&auml;use biegen,
sie k&ouml;nnen sonst leicht abbrechen! F&uuml;r die ICs werden
Fassungen empfohlen. Die ICs sind gegen Spannungen durch statische
Aufladung empfindlich, daher auf Schutzma&szlig;nahmen (Erdung)
achten!
<br>
</p>
<p>F&uuml;r die Anschl&uuml;sse kann man eine 8-polige Steckleiste
nehmen (dabei einen Pin abkneifen) oder Flachkabel direkt an die
Platine l&ouml;ten (3-polig zur LED und 4-polig zum Computer). Bei
farbigem Flachkabel ist eine Verwechslung ausge- schlossen.
<br>
<br>
<br>
</p>
<p><b> Hinweise zum Einbau </b>
<br>
<br>
</p>
<p>Vorsicht: das ber&uuml;hren des Netzteils im 1040 oder Mega ST(E)
oder TT kann t&ouml;dlich sein! Das &Ouml;ffnen des Geh&auml;uses
beendet den Garantieanspruch! Keine Haftung f&uuml;r Sch&auml;den, die
durch fehlerhaften Einbau entstehen!
<br>
<br>
<br>
</p>
<p><b> Anschl&uuml;sse der Schaltung: </b>
<br>
<br>+5 Volt: an +5V (z.B. Pin 11 des MFP)
<br>TID(16): an Pin16 des MFP
<br>TUA(10): an Pin7 oder Pin10 des MFP
<br>Masse: an GND (z.B. Pin 36 des MFP)
<br>
<br>Minus: Mittelanschlu&szlig; der Anzeige-LED
<br>Rot: Anode der Anzeige-LED f&uuml;r Rot (flache Seite am
Geh&auml;use)
<br>Gr&uuml;n Anode der Anzeige-LED f&uuml;r Gr&uuml;n
<br>
<br>Der MFP hat normalerweise den Aufdruck MC68901. Alle hier
angegebenen Pin-Nummern beziehen sich auf den 48poligen MFP im
DIL-Geh&auml;use. Wenn ein 52poliger MFP im Quadpack-Geh&auml;use
vorhanden ist, wie z.B. im TT, so gilt folgende Zuordnung der
Pin-Nummern:
<br>
<br>
</p>
<pre>
     48pol.DIL 52pol.Quad

       Pin7      Pin8
       Pin10     Pin11
       Pin16     Pin18

</pre>
<p>
<br>Am MFP sind auf der Computerplatine Pin 7, Pin 10 und Pin 16
untereinander verbunden. Die Verbindung zwischen Pin 7 und Pin 10
mu&szlig; erhalten bleiben, die Verbindung dieser beiden Pins zu Pin
16 mu&szlig; aber aufgetrennt werden. Wenn die entsprechende
Leiterbahn nicht auffindbar ist, kann Pin 16 auch direkt &uuml;ber der
Computerplatine vorsichtig durchtrennt werden. (Beim TT verl&auml;uft
die Bahn auf der Oberseite direkt vor dem MFP.)
<br>
</p>
<p>Die Spannungen k&ouml;nnen meist an einem Kondensator in der
n&auml;he des MFP abge- nommen werden (nachmessen!), es ist aber auch
m&ouml;glich, an die entsprechenden Pins des MFP zu gehen.
<br>
<br>
<br>
</p>
<p><b> ACHTUNG: </b>
<br>
<br>an den Anschl&uuml;ssen des MFP nur m&ouml;glichst kurz
l&ouml;ten! Vorkehrungen gegen statische Aufladung treffen! Bei
Verpolung werden die ICs auf dem RS-TURBO zerst&ouml;rt!!!!
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Baudraten </b>
<br>
<br>
</p>
<p>Hier nochmal die ohne RS-TURBO m&ouml;glichen Baudraten:
<br>19200, 9600, 4800, 2400, 2000, 1800, 1200,
<br>600, 300, 200, 150, 134, 110,
<br>75 (das TOS stellt aber 120 ein!!!),
<br>50 (das TOS stellt aber 80 ein!!!)
<br>
<br>
</p>
<pre>
RS-TURBO konvertiert folgende Baudraten:                      (mit 4,9152MHz)
150 (eingestellt) -&gt; 115200 (real)   LED rot                      (76800)
134 (eingestellt) -&gt;  57600 (real)   LED orange (rot+gr&uuml;n)        (38400)
110 (eingestellt) -&gt;  38400 (real)   LED gr&uuml;n                     (38400)
 50 (eingestellt) -&gt;  76800 (real)   LED gr&uuml;n (nur Fertigmodul, 50..80 Bd!)

</pre>
<p>
<br><b> Zum Schlu&szlig; </b>
<br>
<br>
</p>
<p>Ein Test des RS-TURBO ist einfach: mit einem Terminalprogramm oder
im Kontrollfeld nacheinander auf 110 Bd, 134 Bd und 150 Bd stellen,
Die LED von RS-TURBO mu&szlig; dann gr&uuml;n, orange bzw. rot
leuchten.
<br>
</p>
<p>Die Fertigmodule wurden von mir bereits getestet, man kann also
gleich loslegen!
<br>
</p>
<p>Falls RS-TURBO wieder ausgebaut werden soll (Verkauf des
Rechners), mu&szlig; nur die Verbindung von Pin 7 und Pin 10 des MFP
zu Pin 16 wieder hergestellt werden.
<br>
</p>
<p>Viel Spa&szlig; mit RS-TURBO!
<br>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_lf.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0302.htm" target="UDOcon"><img src="udo_rg.gif" alt="RSVE" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
