<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: RGB / FBAS-Wandler
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="12.htm" target="UDOcon"><img src="udo_up.gif" alt="Video" border=0 width="24" height="24"></a>
<a href="120907.htm" target="UDOcon"><img src="udo_lf.gif" alt="ST to Commodore 1084" border=0 width="24" height="24"></a>
<a href="120a01.htm" target="UDOcon"><img src="udo_rg.gif" alt="RGB / VGA-Wandler" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="RGB_20_2F_20FBAS-Wandler">18.10 RGB / FBAS-Wandler</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> RGB/FBAS-Wandler f&uuml;r ATARI ST </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Nach dem sich viele Leute einen ST Computer zugelegt haben sollte
man sich eventuell Gedanken &uuml;ber farbige Bilder machen. Da die
ST's meist mit einem Monochrome Monitor gekauft werden ist es nicht
besonders einfach Farbprogramme laufen zu lassen. Die sogenannten
Farbemulatoren die sich so im Umlauf befinden sind auch nicht das
gelbe vom Ei, sie bringen eher Nach- als Vorteile mit sich. Vorteile
bietet der 520STM mit seinem eingebautem HF-Modulator. Doch dieser hat
leider auch nur den halben Speicher. (512K) Besitzer eines TV mit
EURO-SCART haben es da besonders einfach, man mu&szlig; sich
blo&szlig; das dazu passende Kabel kaufen und schon geht es los. Nun
gibt es ja noch die M&ouml;glichkeit einen HF-Modulator zu kaufen.
Leider sind diese &quot;Zus&auml;tze&quot; leider nicht gerade billig
und oft l&auml;sst auch die Bildqualit&auml;t sehr zu w&uuml;nschen
&uuml;brig !
<br>
</p>
<p>Manche bringen es gerade mal so auf C64er Qualit&auml;t. Das es
Nat&uuml;rlich auch anders geht ist keine Frage. Leser der c't werden
die Schaltung kennen oder schon gebaut haben. In der c't SPECIAL 3/88
ist der Wandler nochmals genaustens Beschrieben mit Layout und
<a href="190d.htm" target="UDOcon">Schaltplan</a>, die fertige Platine gibt es im Platinenversand der c't und
kostet 22 DM. Die anderen Bauteile kommen so in etwa auf 20 DM.
Kernst&uuml;ck der Schaltung ist der MC 1377 von Motorola, Kostenpunkt
ca. 7 DM Er beinhaltet einen kompletten RGB/Fbas-Wandler der extern
nur mit sehr wenigen passiven Bauelementen beschaltet werden
mu&szlig;. Es wird somit m&ouml;glich OHNE Eingriff in den Rechner
Farbbilder auf einem TV darzustellen (&Uuml;ber Zus&auml;tzlichen
HF-Modulator) d.h die Schaltung liefert ein komplettes Farb-<a href="12.htm" target="UDOcon">Video</a>
Signal welches zum Ansteuern von Videorecordern oder eines
Monitor/TV's mit sogenantem Fbas Eingang gen&uuml;gt. (<a href="12.htm" target="UDOcon">Video</a> Chinch)
<br>Spezialisten kommen nat&uuml;rlich auf die Idee mit dem jetzt
vorhanden Fbas- Signal einen HF-Modulator anzusteuern. Dieser wird
einfach aus einem alten Sinclair Spectrum oder aus &auml;lteren
Commodore Computern ausgebaut. Ich habe die Schaltung nachgebaut und
betreibe Sie seit langem mit verschiedenen Rechnern ....(260/520+) Die
Platine sollte in ein Geh&auml;use eingebaut werden, gut
bel&uuml;ftet, der MC1377 wird etwas Warm !
<br>
</p>
<p>Benutzt man nur das PAL/Fbas-Signal ist die Bildqualit&auml;t
relativ gut RGB Monitorbenutzer werden an der Bildqualit&auml;t zwar
zu meckern haben, aber deshalb haben sie ja einen EXTRA-Monitor :-)
<br>
</p>
<p>Wie Funktioniert es:
<br>
<br>Um aus einem RGB-Signal ein Fbas-Signal zu generieren werden die
Signale RGB in einer Matrix gemischt, dabei entsteht ein Signal das
die Helligkeits- werte des Bildes beschreibt. Dazu wird ein
Farbtr&auml;ger von 4,433168 MHz Moduliert um die komplette
<a href="0205.htm" target="UDOcon">Information</a> &uuml;bertragen zu k&ouml;nnen. Dabei ist dann f&uuml;r
jede Farbe eine bestimmte Phasenlage zust&auml;ndig, die mit jeder
&uuml;bertragenen Zeile um 180 Grad gedreht wird. Als Erkennung
f&uuml;r den Empf&auml;nger da&szlig; eine <a href="0205.htm" target="UDOcon">Information</a> vorliegt
mu&szlig; noch das Burst-Signal mit &uuml;bertragen werden, zusammen
mit dem V und H-SYNC. Signalen ergibt sich dann das komplette
Bildsignal.
<br>
<br>
<br>
</p>
<p align=center><img src="image/rgbfbas.gif" border=0 width="692" height="415"></p><br>
<div align=center><tt> Abbildung 1 - RGB / FBAS-Wandler </tt>
</div>
<p>
<br>
<br>Der Abgleich der fertig aufgebauten Schaltung ist nicht besonders
Schwierig aber auch nichts f&uuml;r reine Laien. Wenn alles noch mal
Kontrolliert ist, probiert man das ganze am besten einfach aus. Dazu
sollten alle Potis erstmal in die Mittenstellung gebracht werden und
dann mit Gef&uuml;hl LANGSAM verdreht werden bis erst mal
&quot;irgendwas&quot; auf dem Bildschirm zu sehen ist.
<br>
</p>
<p>Sollte das Bild nur zur H&auml;lfte sichtbar sein oder etwas
verzerrt sollte ein 50/60Hz Umschaltprogramm auf dem Rechner
mitgebootet werden. Ich habe diese Schaltung als besonders
&quot;Nachbaufreundlich&quot; empfunden da Sie auch auf Anhieb
einwandfrei funktioniert hat, somit sollte es m&ouml;glich sein das es
auch Leute nachbauen k&ouml;nnen die etwas weniger mit Elektronik zu
tun haben. Es ist ausserdem auch die anscheinend billigste
L&ouml;sung, der Kostenaufwand f&uuml;r alle Teile
einschlie&szlig;lich Platine h&auml;lt sich stark in Grenzen.
<br>
</p>
<p>Es sollte hier lediglich auf eine Lowcost-M&ouml;glichkeit
hingewiesen werden.
<br>
</p>
<p>Grundlagen aus der c't
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li>18.10.1 <a href="120a01.htm" target="UDOcon">RGB / VGA-Wandler</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="12.htm" target="UDOcon"><img src="udo_up.gif" alt="Video" border=0 width="24" height="24"></a>
<a href="120907.htm" target="UDOcon"><img src="udo_lf.gif" alt="ST to Commodore 1084" border=0 width="24" height="24"></a>
<a href="120a01.htm" target="UDOcon"><img src="udo_rg.gif" alt="RGB / VGA-Wandler" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
