<!doctype html>
<html lang="de">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: TV-Modulator
</title>
<link rel=home href="doitst1h.html" title="Homepage">
<link href="css/bootstrap.min.css" rel="stylesheet">
<link href="css/styles.css" rel="stylesheet">
</head>
<body>
<div class="container-fluid">
<div class="row">
<div class="col-md-12">


<table class="navigation"><tr><td valign=top>
<a href="00con.html" ><img class="img-fluid" src="navi/udo_hm.gif" alt="Home"  width="24" height="24"></a>
<a href="12.html" ><img class="img-fluid" src="navi/udo_up.gif" alt="Video"  width="24" height="24"></a>
<a href="120a01.html" ><img class="img-fluid" src="navi/udo_lf.gif" alt="RGB / VGA-Wandler"  width="24" height="24"></a>
<a href="120c.html" ><img class="img-fluid" src="navi/udo_rg.gif" alt="Shifter"  width="24" height="24"></a>
</td></tr></table>
<table  cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="TV-Modulator">18.11 TV-Modulator</a></h1>
<p align=center><img class="img-fluid" src="image/sline.gif"  width="640" height="2"></p><br>
<p><tt> Der TV-Modulator an Atari Computern </tt>
<br>
<br>
</p>
<p><img class="img-fluid" src="image/deutsch.gif"  width="35" height="22"></p><br>
<p>In einigen Atari Computern befindet sich ein TV-Modulator der das
Videosignal und ein Gemisch aus linkem und rechtem Stereo- Audiosignal
mit einem (HF) hochfrequentem Tr&auml;gersignal versieht damit beides
&uuml;ber die Antennenbuchse an der Ger&auml;ter&uuml;ckseite auf ein
handels&uuml;bliches TV-Ger&auml;t &uuml;bertragen werden kann.
<br>
</p>
<p>Beachten sie bitte das diese Antennenbuche zwar aussieht wie eine
Chinch-Buchse, daher aber noch lange kein Niederfrequentes FBAS-Signal
liefert.
<br>
</p>
<p>Das HF-Signal wird in USA mit dem NTSC-Verfahren, w&auml;rend in
Europa das hier gel&auml;ufige PAL-Verfahren benutzt wird, auf ein
TV-Ger&auml;t &uuml;bertragen. Einige SECAM-Ger&auml;te (Frankreich)
soll es auch gegeben haben.
<br>
</p>
<p>Der jeweils verwendete Modulator ist ein fertiges Modul dessen
Innenleben uns nicht interessiert da dies weder einfach zu Reparieren
noch einfach Abzugleichen ist. Hat der TV-Modulator einen defekt
sollte dieser stets nur komplett Ersetzt werden. Es ist nur
ausschliesslich so zu Gew&auml;hrleisten das dieses Modul andere
Empf&auml;nger nicht st&ouml;rt. Um das innere Reparieren zu
k&ouml;nnen sind umfangreiche Kenntnisse in HF-Technik und der
entsprechende Messger&auml;tepark erforderlich.
<br>
</p>
<p>Der TV-Modulator sitzt an der R&uuml;ckwand des Computers und ist
anhand der runden RCA-Buchse zu erkennen. Es kann hier ausschliesslich
ein hochfrequentes Antennensignal entnommen werden wenn am Atari
-kein- weiterer Monitor angeschlossen ist. Der Monitordetect Pin ist
dabei offen, also nicht auf GND geschaltet.
<br>
</p>
<p>
<br>
<br><b> Die Anschl&uuml;sse </b>
<br>
</p>
<p>Pin 1 am Modulatoranschlu&szlig; ist die Versorgungsspannung von
+5 Volt.
<br>
</p>
<p>Das Audiosignal wird im Modulator auf den HF-Tr&auml;ger
aufmoduliert, mit einer ZF (Zwischenfrequenz) von 4.5Mhz, wie bei PAL
&uuml;blich.
<br>
</p>
<p>Pin 2 bringt das PAL-Videosignal dem bereits auch das Horizontal-
und das Vertikale Synconisationssignal aufgemischt wurde. Aus dem im
Rechner vorhandenen HSYNC und VSYNC wird ein Signalgemisch gebildet
das an Pin 2 angelegt wird.
<br>
</p>
<p>Aus den Farbinformationen R, G und B zusammen mit den eben
genannte Syncronisationssignalen wird ein FBAS-Videosignal erzeugt das
&uuml;ber verschiedene passive Bauteile an Pin 2 des Modulators
angelegt wird.
<br>
</p>
<p>Das Signal ist an dieser Stelle fertig um es z.B mit einem
FBAS-Videomonitor sichbar zu machen.
<br>
</p>
<p>Gar kein Videosignal hat auch oft zur Ursache das im Computer
keine +12V vorhanden sind! &Uuml;berpr&uuml;fen sie das am <a href="10.html" >Netzteil</a>
bzw. an anderen Bauteilen die mit +12V betrieben werden.
<br>
</p>
<p>
<br>
<br><b> HF-Signal </b>
<br>
</p>
<p>Der TV-Modulator moduliert das FBAS-Signal legiglich auf einen
HF-Tr&auml;ger um es per Antenneneingang an einem TV-Ger&auml;t
benutzen zu k&ouml;nnen. Auch kommt der Ton erst im Modulator zum
HF-Signal hinzu. Im &uuml;brigen ist der Sendekanal UHF-Kanal 36. Oft
auch VHF Kanal 14-16 bzw. VHF Low, auf Kanal 2-3. Benutzen sie einfach
den Sendersuchlauf am TV-Ger&auml;t. Mit einem TV-Modulator hat man
meistens entweder ein gutes Bild und einen schlechten Ton, oder einen
besseren Ton und ein krisseliges Bild. Beides zusammen in guter
Qualit&auml;t ist eher selten.
</p>
<p>Schalten Sie AFC aus, verwenden sie bei schlechten Bild die
Feineinstellung am TV-Ger&auml;t. Zumeist erh&auml;lt man ein gutes
Bild und einen schlechteren Ton oder einen guten Ton und ein
schlechters Bild. Eine gute Qualit&auml;t beider Signale ist fast
ausgeschlossen.
<br>
</p>
<p>
<br>
<br>
</p>
<hr>
</td></tr></table>
<table class="navigation"><tr><td valign=top>
<a href="00con.html" ><img class="img-fluid" src="navi/udo_hm.gif" alt="Home"  width="24" height="24"></a>
<a href="12.html" ><img class="img-fluid" src="navi/udo_up.gif" alt="Video"  width="24" height="24"></a>
<a href="120a01.html" ><img class="img-fluid" src="navi/udo_lf.gif" alt="RGB / VGA-Wandler"  width="24" height="24"></a>
<a href="120c.html" ><img class="img-fluid" src="navi/udo_rg.gif" alt="Shifter"  width="24" height="24"></a>
</td></tr></table>
</div> <!-- col-md-12 -->
</div> <!-- row -->
</div> <!-- container -->
</body>
</html>
