<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Centronics-Buffer
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="1405.htm" target="UDOcon"><img src="udo_lf.gif" alt="L&uuml;fterregelung" border=0 width="24" height="24"></a>
<a href="1407.htm" target="UDOcon"><img src="udo_rg.gif" alt="RS232 Tester" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Centronics-Buffer">20.6 Centronics-Buffer</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Antrieb f&uuml;r den Drucker </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Der im ST-Magazin 3/89 vorgestellte Druckertreiber stellt einen
h&ouml;chst einfachen und sicheren Hardwarezusatz dar. Zum einen
k&ouml;nnen die verwendeten Drucker die sonst in unmittelbarer
N&auml;he des Computers stehen etwas weiter entfernt Aufgestellt
werden und die so empfindliche <a href="0f07.htm" target="UDOcon">Druckerschnittstelle</a> wird gegen
&Uuml;berlastung und Zerst&ouml;rung durch &auml;ltere Drucker
gesch&uuml;tzt. Bei &auml;lteren Druckermodellen sind manchmal zu
gro&szlig;e Abschlu&szlig;widerst&auml;nde eingebaut (Pulldown) die
dann nach einiger Zeit den <a href="0f.htm" target="UDOcon">Schnittstellen</a>- baustein &uuml;berlasten
bzw. ein korrektes Arbeiten des Druckers &uuml;berhaupt nicht
Zulassen. Die Schaltung besteht aus zwei einfachen
Open-Collector-Treibern die zusammen etwa zwischen 2 und 4 DM kosten
d&uuml;rften. Leider Funktioniert diese Schaltung nur in eine
Richtung, d.h es k&ouml;nnen &uuml;ber den Centronics Port bei
angesteckter Schaltung keine Daten mehr eingelesen werden.
<br>
</p>
<p>Der Vorteil dieser Schaltung liegt klar auf der Hand, sollte
tats&auml;chlich am Drucker oder an der Verbindungsleitung zwischen
Computer und Drucker irgend ein Defekt auftreten so ist der Computer
durch diese Schaltung ausreichend Gesch&uuml;tzt. Auch ist es
m&ouml;glich den Drucker etwas 'weiter' d.h bis zu 5-10 Meter vom
Computer weg aufzustellen.
<br>
</p>
<p>Im Ernstfall kostet es dann neue Treiber IC's und nicht den
teueren, langwierigen Aufenthalt in einer Reparaturwerkstatt um eben
einen <a href="080109.htm" target="UDOcon">Soundchip</a> zu tauschen, sofern man das nicht selber machen kann.
Falls man die Sache wirklich nicht selbst beheben kann w&uuml;rden
hier im Ernstfall ca. 200DM inkl. <a href="080109.htm" target="UDOcon">Soundchip</a> anfallen.
<br>
</p>
<p>Man k&ouml;nnte der Einfachheit wegen sogar auf das Herstellen
einer Platine verzichten und das ganze in F&auml;deltechnik auf einer
kleinen Lochraster- platte aufbauen. Auf alle F&auml;lle mu&szlig; die
Schaltung ausreichend getestet werden bevor Sie mit dem Computer
verbunden wird, ausserdem sollte man das Ding sp&auml;ter in ein
Geh&auml;use einbauen, was der Betriebssicherheit und dem Aussehen
ungemein zugute kommt.
<br>
<br>
<br>
</p>
<p align=center><img src="image/pdriver.gif" border=0 width="600" height="352"></p><br>
<div align=center><tt> Abbildung 1 - Einfacher Buffer f&uuml;r Centronics </tt>
</div>
<p>
<br>
<br>Es gibt im Handel fertige sog. C64 Modulgeh&auml;use, das ist ein
kleines Geh&auml;use an dem man beidseitig einen 25 poligen D-Sub
<a href="0f0b.htm" target="UDOcon">Stecker</a> anbringen kann.
<br>In diesem Geh&auml;use selber ist nicht sonderlich viel Platz, man
mu&szlig; also eine Lochrsterplatine seht genau zuschneiden damit
diese in das Geh&auml;use passen wird. Die Treiberelektronik mu&szlig;
sehr platzsparend Verdrahtet werden. Ansonsten geht die Schachtel
nicht zu :) Diese L&ouml;sung ist warscheinlich die beste, da es
solche Druckertreiber genau in eben auch in dieser Form zu kaufen
gibt. Allerdings liegt der Preis um ein vielfaches h&ouml;her. Als
D-Sub-Verbindungen habe ich Exemplare mit abgewinkelten
L&ouml;tstiften genommen, einzigster Nachteil, das Rasterma&szlig;
passt nicht in jede Lochrasterplatine. Es geht aber wenn man die
L&ouml;tstifte ein wenig anpasst. Die Verdrahtung selber ist in
F&auml;deltechnik, das ist einfach und bei farbigen Dr&auml;hten auch
noch relativ &Uuml;bersichtlich.
<br>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="1405.htm" target="UDOcon"><img src="udo_lf.gif" alt="L&uuml;fterregelung" border=0 width="24" height="24"></a>
<a href="1407.htm" target="UDOcon"><img src="udo_rg.gif" alt="RS232 Tester" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
