<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Ethernet Project am Romport
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="18.htm" target="UDOcon"><img src="udo_up.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="1801.htm" target="UDOcon"><img src="udo_lf.gif" alt="Atari NetWork" border=0 width="24" height="24"></a>
<a href="1803.htm" target="UDOcon"><img src="udo_rg.gif" alt="Ethernet Project ASCI port" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Ethernet_20Project_20am_20Romport">24.2 Ethernet Project am Romport</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Atari Computer &uuml;ber den Romport mit einem LAN verbinden
</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Ethernet Project, bestehend aus Hard- &amp; Software. Die Treiber
sind f&uuml;r <a href="1701.htm" target="UDOcon">STinG</a> ausgelegt. Ben&ouml;tigt wird die Hardware, die
Treiber und ein &quot;Parallel Pocket Ethernet Adapter&quot; mit einem
Realtek RTL 8012 Chip. Die Hardware wird in den ROM-Port gesteckt und
daran der &quot;Pocket Adapter&quot; angeschlossen. Mittels BNC oder
UTP l&auml;&szlig;t sich der Atari an ein LAN anschlie&szlig;en.
<br>
</p>
<p>Dieses Projekt hatte das Ziel auf m&ouml;glichst einfache Art
Atari-Rechner LAN-F&auml;hig zu machen. Dabei stand im Vordergrund
nicht in die Rechnerhardware einzugreifen, oder bestimmte Componenten
vorauszusetzen. Au&szlig;er dem Rom-Port. So ist es m&ouml;glich
Rechner-Typen vom 520er mit TOS 1.02, wobei <a href="1701.htm" target="UDOcon">STinG</a> von Diskette
gebootet wurde, bis zum TT oder Falcon in ein LAN zu integrieren.
Inwieweit die Hard- und Software auch auf ROM-Karten des Milans laufen
bleibt abzuwarten.
<br>
<br>
<br>
</p>
<p><b> Beschreibung der Hardware </b>
<br>
</p>
<p>Als Erstes soll die Harware beschrieben werden, die aus zwei
Teilen besteht. Zum einen das Parallel-Port-Interface, welches in den
ROM-Port gesteckt wird und einen Parallel-Port (abgespeckte
EPP-Mode-Version) f&uuml;r den Pocket-LAN-Adapter zur verf&uuml;gung
stellt. Die Schaltung ist komplett mit SMD-Bausteinen best&uuml;ckt,
was sie sehr klein macht. Die Kontakte f&uuml;r den ROM-Port sind
vergoldet um Kontaktproblemen durch Oxidation vorzubeugen. Einzig der
mechanische Halt ist ein Problem. Die Platine l&auml;st sich nicht
veranken oder festschrauben. Man mu&szlig; selbst daf&uuml;r sorgen,
das die Platine nicht durch versehentliches ziehen an der
Ethernet-Leitung aus dem ROM-Port herausgerissen wird.
<br>
</p>
<p>Zum anderen der LAN-Adapter vom Typ E3000II. Er besitzt einen BNC
und UTP Anschlu&szlig;. Der noch aufgef&uuml;hrte Multiplexer Parallel
Port kann auf Atari-Rechnern nicht genutzt werden. Funktionieren
sollten auch andere Pocket-Lan-Adapter mit RTL 8012 Chip. Gefertigt
wird meines Wissens nur noch der E3000II. Mit Spannung wird der
LAN-Adapter mit einem separaten <a href="10.htm" target="UDOcon">Netzteil</a> versorgt. Messungen der
Stromaufnahme haben allerdings gezeigt das er auch &uuml;ber den
ROM-Port mit Spannung versorgt werden kann. Zuk&uuml;nftige Interfaces
erhalten einen Anschlu&szlig;, mit dem man den LAN-Adapter vom
Interface aus mit Spannung versorgen kann.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/romlan.gif" border=0 width="200" height="89"></p><br>
<div align=center><tt> Abbildung 1 - Der Romportadapter f&uuml;r den Pocked Adapter
</tt>
<br>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p align=center><img src="image/romlan1.gif" border=0 width="450" height="273"></p><br>
<div align=center><tt> Abbildung 2 - Ein passender LAN Pocked Adapter </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>
<br><b> Beschreibung der Software </b>
<br>
</p>
<p>Die Treiber sind f&uuml;r <a href="1701.htm" target="UDOcon">STinG</a> ausgelegt und laufen unter MagiC
bzw. TOS, stammen von Vassilis Papathanassiou und sind Freeware.
Vielen dank an Vassilis f&uuml;r die Gute Arbeit. Voraussetzung ist
eine funktionierende <a href="1701.htm" target="UDOcon">STinG</a> installation der Version 1.20 oder
h&ouml;her.
<br>
</p>
<p>Demn&auml;chst wird es auch MiNTNet-Treiber geben!
<br>
</p>
<p>
<br>
<br><b> Beschreibung einer m&ouml;glichen <a href="0204.htm" target="UDOcon">Installation</a> </b>
<br>
</p>
<p>Der Pocket LAN-Adapter vom Typ E3000II besitzt einen BNC und UTP
Anschlu&szlig;. Der noch vorhandene Multiplexer Parallel Port kann auf
Atari-Rechnern generell nicht genutzt werden. Funktionieren sollten
auch andere Pocket-Lan-Adapter mit RTL 8012 Chip.
<br>
</p>
<p>Es ist mit dieser Erweiterung m&ouml;glich Atari- und Macintosh
oder auch PCs und Amiga Computer zusammen per Ethernet zu verbinden.
<br>
</p>
<p>Hier laufen zwei Macintosh Maschinen, beide mit MacOS9 und ein
Atari Falcon F030 zusammen an einem Netzwerk dessen Mittelpunkt ein
10/100Mbit Ethernet Hub und ein G3 Mac, mit Softwarerouter, ist. Der
Atari Falcon ist mit der ROM Port Ethernetkarte ausgestattet. Alle
Rechner sind mit UTP-Kabeln verbunden. Alle k&ouml;nnen &uuml;ber den
G3 Mac, der als Router fungiert, darauf l&auml;uft
&quot;IPNetRouter&quot;, eine Shareware, selbstst&auml;ndig in das
<a href="17.htm" target="UDOcon">Internet</a> einw&auml;hlen.
<br>
</p>
<p>Auf dem Falcon, als ein m&ouml;gliches Beispiel, kann ein FTP
Server laufen. Dies erm&ouml;glicht dann direkten Dateiaustausch mit
anderen Computern.
<br>
</p>
<p>Generell sind die Macintosh dabei &uuml;ber TCP/IP zu betreiben.
AppleTalk, l&auml;uft weiterhin nebenbei, also kein Problem.
<br>
</p>
<p>Vorhandene, Ethernet-f&auml;hige Drucker, k&ouml;nnen so direkt
eingebunden werden. Momentan ist mir allerdings kein
Atari-Druckertreiber bekannt der einen Ethernet-Drucker
unterst&uuml;tzen w&uuml;rde.
<br>
</p>
<p>
<br>
<br><b> Einbinden des Falcon in ein Ethernet </b>
<br>
</p>
<p><b> Systemvoraussetzungen </b>
<br>
</p>
<p>Sie sollten einen Atari-Computer mit ROM-Port besitzen. Getestet
wurde der EtherNet-Adapter auf folgender Hardware:
<br>
</p>
<p>1040STF
<br>520ST
<br>1040STF mit PAK68020, 40MHz und FRAK, 8MB
<br>TT030 mit und ohne NOVA-Grafikkarte
<br>Mega STE
<br>Falcon
<br>
<br>
</p>
<p>Inwieweit die Hardware auch auf ROM-Port Karten des Milan/Hades
funktioniert bleibt abzuwarten da dies offensichtlich noch niemand
versucht hat.
<br>
<br>
<br>
</p>
<p><b> Notwendige Software </b>
<br>
</p>
<p>Voraussetzung f&uuml;r den Betrieb der EtherNet-Treiber ist eine
komplett funktionionsf&auml;hige <a href="1701.htm" target="UDOcon">STinG</a> <a href="0204.htm" target="UDOcon">Installation</a> Version 1.26 oder
h&ouml;her. Wie <a href="1701.htm" target="UDOcon">STinG</a> installiert wird, falls nicht vorhanden,
entnehmen sie bitte der <a href="1701.htm" target="UDOcon">STinG</a>-Dokumentation, die dem <a href="1701.htm" target="UDOcon">STinG</a> Paket
beiliegt oder der deutschen <a href="1701.htm" target="UDOcon">STinG</a>-Dokumentation von Finn Bastinansen.
<br>
</p>
<p>
<br>
<br><b> Anschlu&szlig; der Hardware </b>
<br>
</p>
<p>Zuerst wird der Pocket-LAN-Adapter mit der 25 poligen SUB-D Buchse
des Flachbandkabels vom ROM-Port Interface verbunden. Alle weiteren
Schritte d&uuml;rfen generell nur durchgef&uuml;hrt werden, wenn der
Atari Falcon ohne Spannung, also komplett ausgeschaltet ist.
<br>
</p>
<p>Anschlu&szlig;arbeiten bei eingeschaltetem Computer
besch&auml;digen die Hardware!
<br>
</p>
<p>Bitte achten Sie dabei generell auf die richtige Lage des
Interfaces!
<br><tt>Oben </tt> ist leicht an den beiden SMD ICs und dem
Anschlu&szlig; f&uuml;r das Flachbandkabel zu erkennen. Beim
Einstecken in den ROM-Port ist darauf zu achten, das die Platine nicht
verkantet wird. Ist das der Fall kann die Platine nicht korrekt
eingesteckt werden und besch&auml;digt eventuell die Computerhardware.
<br>
</p>
<p>Den LAN-Adapter jetzt noch mit dem mitgelieferten <a href="10.htm" target="UDOcon">Netzteil</a>
verbinden.
<br>Achten Sie darauf das immer zuerst der LAN-Adapter einzuschalten
ist, erst danach schalten Sie den den Computer ein!
<br>
</p>
<p>
<br>
<br><b> <a href="0204.htm" target="UDOcon">Installation</a> der Software </b>
<br>
</p>
<p>Falls auf ihrem Atari noch kein <a href="1701.htm" target="UDOcon">STinG</a> TCP/IP Stack installiert ist
sollten sie dies nun nachholen. Wie <a href="1701.htm" target="UDOcon">STinG</a> installiert und generell
konfiguriert wird, entnehmen sie bitte der <a href="1701.htm" target="UDOcon">STinG</a>-Dokumentation. Hier
im Archiv finden Sie eine Anleitung um mit <a href="1701.htm" target="UDOcon">STinG</a> eine Modemeinwahl in
das <a href="17.htm" target="UDOcon">Internet</a> herstellen zu k&ouml;nnen. Diese Einstellungen
k&ouml;nnen mit den n&ouml;tigen Etherneteinstellungen &uuml;bernommen
werden.
<br>
</p>
<p>
<br>
<br><b> EtherNet Treiber installieren unter <a href="1701.htm" target="UDOcon">STinG</a> </b>
<br>
</p>
<p>Im Verzeichnis EtherNet auf der Diskette befindet sich der Treiber
ether_pa.stx.
<br>Kopieren sie diesen in das StinG Verzeichnis auf ihrer Festplatte.
Dahin wo sich alle anderen .stx-Treiber befinden. Das hier schon
vorhandene ether.stx, aus dem <a href="1701.htm" target="UDOcon">STinG</a>-Paket, sollten Sie dabei entfernen
da sonst sp&auml;ter zwei EtherNet-Eintr&auml;ge im <a href="1701.htm" target="UDOcon">STinG</a> Port Setup
CPX geben wird.
<br>
</p>
<p>Das CPX-Modul &quot;STNGPORT.CPX&quot;, welches sich im CPX-Ordner
auf der Diskette befindet, ersetzt das in ihrem CPX-Ordner, auf ihrer
Festplatte, vorhandene gleichnamige CPX-Modul aus dem orignal
<a href="1701.htm" target="UDOcon">STinG</a>-Paket.
<br>
</p>
<p>Vergessen Sie das k&ouml;nnen sie den Adapter nicht konfigurieren.
<br>
</p>
<p>Nachdem Sie den Rechner neu gebootet haben, das zwingend, sind im
CPX-Modul '<a href="1701.htm" target="UDOcon">STinG</a> Port Setup' einige weitere Einstellungen zu
t&auml;tigen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/eth_ad.gif" border=0 width="259" height="197"></p><br>
<p>
<br>
<br>
</p>
<p>W&auml;hlen Sie 'EtherNet' und 'Addressing' an:
<br>
</p>
<p>Tragen Sie hier die IP Adresse ihres Falcon ein. Jeder Computer in
einem Netzwerk braucht eine eigene eindeutige IP Adresse. Der Bereich
192.168.x.x empfiehlt sich, da dieser speziell f&uuml;r lokale
Netzwerke reserviert ist und nicht im <a href="17.htm" target="UDOcon">Internet</a> auftaucht oder dort
hineingebracht wird. Als Subnet Mask 255.255.255.0 eintragen.
<br>MTU 1500
<br>
</p>
<p>Wechseln Sie jetzt zu 'General' wechseln:
<br>Unter 'Choose Hardware' den RTL8012 ausw&auml;hlen, es d&uuml;rfte
das einzigste sein was sie hier ausw&auml;hlen k&ouml;nnen.
<br>
</p>
<p>Bei 'MAC' die MAC-Adresse des LAN-Adapters eintragen. Diese steht,
zumeist noch Handschriftlich, auf der R&uuml;ckseite des Pocket
LAN-Adapters.
</p>
<p>Momentan kann die Ethetnet-Software diese Adresse leider noch
nicht auslesen, deher mu&szlig; man die Mac-Adresse leider noch von
Hand eintragen. Klicken Sie jetzt auf 'Active' und speichern Sie mit
'SAVE' die aktuelle Konfiguration. Beenden Sie mit 'OK'. Dieser Teil
der Konfiguration ist damit beendet.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tcp.gif" border=0 width="258" height="196"></p><br>
<p>
<br>
<br>
</p>
<p>Als n&auml;chstes folgen Einstellungen im CPX-Modul '<a href="1701.htm" target="UDOcon">STinG</a>
Protocols'.
<br>
</p>
<p>Zuerst 'TCP' w&auml;hlen:
<br>Hier m&uuml;ssen ein paar Werte angepasst werden.
<br>Max. Segment Size: 1460
<br>Receive Window: 23360
<br>First local port: 1024
<br>Default TTL: 126
<br>
</p>
<p>
<br>
</p>
<p>Nun 'Resolver' w&auml;hlen:
<br>Diese Einstellungen sind notwendig, wenn man mit dem Atari ins
<a href="17.htm" target="UDOcon">Internet</a> will, also z.B. Mails, News holen oder Surfen will. Dazu aber
sp&auml;ter noch mehr.
<br>Bei 'Name Server' den seines Providers eintragen.
<br>Bei 'Domain' ebenfalls die seines Providers oder freilassen.
<br>
</p>
<p>Das ganze ebenfalls Abspeichern und mit OK beenden.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/resolver.gif" border=0 width="259" height="197"></p><br>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Einbinden in ein vorhandenes LAN </b>
<br>
</p>
<p>Hier wird beschrieben wie der Computer in ein schon bestehendes
Netzwerk via Ethernet korrekt eingebunden wird. Dabei wird der Atari
Computer keine Routing-Aufgaben &uuml;bernehmen, d.h. mit dem Atari
wird keine Verbindung zum <a href="17.htm" target="UDOcon">Internet</a> &uuml;ber ein Modem aufgebaut, und
es sind keine weitere Computer z.B. an der Midi. oder der seriellen
Schnittstelle angeschlossen.
<br>
</p>
<p>
<br>Grunds&auml;tzlich bestehen mit dem E3000II Pocket LAN Adapter
zwei M&ouml;glichkeiten um sich damit an ein bereits vorhandenes
Netzwerk anzuschliessen.
<br>
</p>
<p>Die eine ist &uuml;ber ein BNC Kabel, welches maximal 185 Meter
lang sein darf, generell an beiden Enden mit einem
Abschlu&szlig;-Widerstand zu terminieren ist und maximal 10Mbit
schnell sein wird. Wird dieses L&ouml;sung irgendwo mechanisch
unterbrochen kann keiner der an diese L&ouml;sung angeschlossenen
Computer, Endger&auml;te, ein Datenpaket senden oder empfangen.
</p>
<p>Wichtigster Punkt ist die korrekte 50 Ohm Terminierung an jedem
Kabelende.
<br>
</p>
<p>Die andere M&ouml;glichkeit besteht darin, mittels TP-Kabel (RJ45)
eine Verbindung herzustellen.
<br>
</p>
<p>Der Vorteil dieser Methode liegt darin, dass jederzeit ein
weiterer Computer angeschlossen werden kann, ohne das das komplette
Netzwerk in dieser Zeit lahmgelegt ist. Der Nachteil, man braucht ab
zwei Rechner, Endger&auml;te immer einen Hub, Switch oder einen
Netzwerkrouter.
<br>
</p>
<p>Diese L&ouml;sung erlaubt 100Mbit
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/utp.gif" border=0 width="489" height="463"></p><br>
<p>
<br>
<br>
</p>
<p>w Der LAN-Adapter unterst&uuml;tzt beide M&ouml;glichkeiten und
erkennt die jeweils von ihnen verwendete gew&auml;hlte L&ouml;sung
selbst&auml;ndig. Beides zusammen Funktioniert generell nicht.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Einbinden in ein LAN </b>
<br>
</p>
<p><a href="1701.htm" target="UDOcon">STinG</a> wei&szlig; &uuml;ber seine &quot;ROUTE.TAB&quot; wohin es
die Daten schicken mu&szlig;. Die ROUTE.TAB - Datei befindet sich
ebenfalls im <a href="1701.htm" target="UDOcon">STinG</a>-Verzeichniss, direkt bei den *.stx Treiber-Dateien.
So sieht z.B. ein einfaches Netzwerk aus.
<br>
</p>
<p>Bet&auml;tigen sie &quot;Reload ROUTE.TAB&quot; im <a href="1701.htm" target="UDOcon">STinG</a> Port
Setup CPX wenn Sie eine &Auml;nderung an der ROUTE.TAB vorgenommen
haben. Das neu booten des Rechners ist hier nicht erforderlich.
<br>
</p>
<p>Computer 1 befindet sich in dem Netzwerk 192.168.x.x und hat die
IP 192.168.x.1.
<br>&ouml;ber Computer 4, der die IP 192.168.x.9 hat, ist er mit dem
<a href="17.htm" target="UDOcon">Internet</a> verbunden.
<br>Wir betrachten jetzt die 'ROUTE.TAB' von Computer 1.
<br>
</p>
<p>
<br>
</p>
<pre>0.0.0.0         0.0.0.0         EtherNet        192.168.2.9
</pre>
<p>
<br>
</p>
<p>Das ist der einzige Eintrag, der aktiv sein darf. Die 192.168.x.9
ist die IP eines Gateway-Rechners und kann nat&uuml;rlich auch jede
andere IP-Adresse sein. Sie mu&szlig; dann nur in der 'ROUTE.TAB'
angepasst werden. Jetzt nochmal das '<a href="1701.htm" target="UDOcon">STinG</a> Port Setup' aufrufen und
'Reload Routing Table' anw&auml;hlen und auf 'OK' gehen. Nun sollte
ihr Atari Computer erreichbar sein. Dies kann durch 'Pingen' der
einzelnen Rechner gepr&uuml;ft werden.
<br>
</p>
<p>Im Dialer ist unter Tools eine solche Funktion vorhanden. Alle
Computer von 1-3, sofern dies Atari Computer sind, erhalten diese
'ROUTE.TAB'
<br>
</p>
<p>
<br>
<br><b> ATARI Computer als Gateway konfigurieren </b>
<br>
</p>
<p>Soll der Atari Computer als Gateway f&uuml;r die Computer 1-3
arbeiten und ist &uuml;ber z.B. Serial 1 mit einem Modem verbunden,
mit dem wiederum eine Verbindung ins <a href="17.htm" target="UDOcon">Internet</a> hergestellt wird,
sollten Sie wie folgt vorgehen:
<br>
</p>
<p>Konfigurieren Sie <a href="1701.htm" target="UDOcon">STinG</a> so das ganz normal eine Verbindung,
&uuml;ber ihr Modem, zu ihrem <a href="17.htm" target="UDOcon">Internet</a>-Provider aufgenommen werden
kann. Nachlesen kann man dies ebenfalls in der <a href="1701.htm" target="UDOcon">STinG</a>-Dokumentation.
<br>
<br>
</p>
<p>Funktioniert die Einwahl und sie haben Internetzugriff, kann mit
dem Erweitern der 'ROUTE.TAB' begonnen werden. Die 'ROUTE.TAB' wird
sich jetzt wie folgt ver&auml;ndern m&uuml;ssen:
<br>
<br>
</p>
<pre>0.0.0.0         0.0.0.0         Modem 2         0.0.0.0
</pre>
<p>Dies ist die 'Default Route'. Erg&auml;nzen Sie die ROUTE.TAB mit
folgender Zeile:
<br>
<br>
</p>
<pre>192.168.x.0     255.255.255.0   EtherNet        0.0.0.0
</pre>
<p>
<br>Und zwar mu&szlig; diese Zeile vor der 'Default-Route' stehen,
soda&szlig; die komplette 'ROUTE.TAB' so aussieht:
<br>
</p>
<pre>192.168.2.0     255.255.255.0   EtherNet        0.0.0.0
0.0.0.0         0.0.0.0         Modem 2         0.0.0.0
</pre>
<p>
<br>
</p>
<p>Beachten Sie bitte zwingend das die Konfiguration in diesen
Beispielen nat&uuml;rlich voraussetzt das Sie ihre eigenen IP-Adressen
verwenden, das die IPs verwenden die in ihrem lokalen Netzwerk
vorhanden, benutzbar und f&uuml;r Sie freigegeben sind.
<br>
</p>
<p>Beachten Sie das nicht ist kein Zugriff m&ouml;glich.
<br>
</p>
<p>Im <a href="1701.htm" target="UDOcon">STinG</a>-Dialer mu&szlig; jetzt noch unter 'Configs' -
'Miscellaneous' f&uuml;r den seriellen Port, der mit dem Modem
verbunden ist, 'Use IP Masquerading' aktiviert werden. Auch das ist
zwingend f&uuml;r den Gateway-Betrieb! Nun noch auf 'Acept' klicken
und die neue Konfiguration mit 'Save' abspeichern.
<br>
</p>
<p>Rufen Sie jetzt noch einmal das '<a href="1701.htm" target="UDOcon">STinG</a> Port Setup' auf.
<br>'Reload Routing Table' anw&auml;hlen und auf 'OK' klicken. Nun
sollte, nachdem sie auf diesem Atari in das <a href="17.htm" target="UDOcon">Internet</a> eingew&auml;hlt
haben, auch allen anderen Computern der Zugang zum <a href="17.htm" target="UDOcon">Internet</a>, &uuml;ber
diesen Atari, m&ouml;glich sein.
<br>
</p>
<p>Beachten Sie bitte das dieses Gateway Systemperformance auf dem
Atari ben&ouml;tigt!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/adapt2.gif" border=0 width="191" height="228"></p><br>
<div align=center><tt> Abbildung 3 - Das neueste Romport-Interface </tt>
<br>
</div>
<p>
<br>
<br>Dieses neue Interface ist so kurz das die Platine komplette in die
Geh&auml;useaussparung des Romport an allen orignalen
Rechnergeh&auml;usen passt und somit daran verschwindet. Die Platine
ist ansich nur noch 3.7 cm lang.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/rtl_8bit.gif" border=0 width="640" height="728"></p><br>
<div align=center><tt> Abbildung 4 - Romport-Interface Schaltung </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Der Romportadaper ist im ein paralleles Interface welches Daten-
und Steuerleitungen f&uuml;r den Ethernet-Adapter buffert.
<br>
</p>
<p>Mit einer korrekten <a href="1701.htm" target="UDOcon">STinG</a>-Konfiguration kann der Atari im LAN,
zusammen mit Computern anderer Plattformen, auch <a href="1705.htm" target="UDOcon">DSL</a> benutzen.
<br>
</p>
<p>
<br>
<br><a href="0201.htm" target="UDOcon">Autor</a>: Edgar Hilgart
<br>Email: Elmar.Hilgart@asamnet.de
<br><a href="http://www.asamnet.de/~hilgarte/index.htm" target="_top">Romport Hardware</a>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="18.htm" target="UDOcon"><img src="udo_up.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="1801.htm" target="UDOcon"><img src="udo_lf.gif" alt="Atari NetWork" border=0 width="24" height="24"></a>
<a href="1803.htm" target="UDOcon"><img src="udo_rg.gif" alt="Ethernet Project ASCI port" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
