<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 28.07.2001 -->
<html>
<head>
<title>
PROFIJAG - Tips u. Tricks zum 64-Bit Atari Jaguar: Videoport
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="webmaster@doitarchive.de">
<link rev=made href="mailto:webmaster@doitarchive.de" title="E-Mail">
<link rel=home href="profijag.htm" title="Homepage">
</head>
<body background="image" bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellspacing=0 cellpadding=0 width="100%">
<tr>
<td valign=top width="128">
<table border=0 cellpadding=0 cellspacing=0 width="128">
<tr><td align=center><a href="01.htm"><img src="icon/but.gif" alt="PROFIJAG" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="02.htm"><img src="icon/but1.gif" alt="64-Bit Jaguar Hardware" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="03.htm"><img src="icon/but7.gif" alt="External Hardware" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="04.htm"><img src="icon/but6.gif" alt="Developer" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="05.htm"><img src="icon/but2.gif" alt="VLM" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="06.htm"><img src="icon/but3.gif" alt="Jaguar Modul-Spiele" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="07.htm"><img src="icon/but4.gif" alt="Jaguar CD-ROM Spiele" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="08.htm"><img src="icon/but5.gif" alt="Anhang" border=0 width="100" height="30"></a></td></tr>
</table>
</td>
<td valign=top width="100%">
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="profijag.htm"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="02.htm"><img src="udo_up.gif" alt="64-Bit Jaguar Hardware" border=0 width="24" height="24"></a>
<a href="0205.htm"><img src="udo_lf.gif" alt="Ersatzteil" border=0 width="24" height="24"></a>
<a href="0207.htm"><img src="udo_rg.gif" alt="RGB-Monitor" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Videoport">2.6 Videoport</a></h1>
<p><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p><tt>Jaguar - Videoport </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Der JAGUAR besitzt einen DSP-Port und einen 12 poligen
Steckanschlu&szlig; auf seiner R&uuml;ckseite an dem alle n&ouml;tigen
Signalen anliegen um auf diversen Monitoren ein Bild darzustellen.
Neben den RGB-Signalen befinden sich hier auch die diversen
Syncronisatiossigale um sogar einen S-VHS Anschlu&szlig; zu
realisieren. Eine normale Antennenbuchse erlaubt den einfachen
Anschlu&szlig; an ein beliebiges TV-Ger&auml;t. Mit der richtigen
Verkabelung ist es also ohne weiteres m&ouml;glich auf guten
TV-Ger&auml;ten, Monitoren ein RGB-Bild zu erzeugen. Das ergibt auch
die beste Bilddarstellung nach dem S-VHS Signal. Sicherer ist es
allerdings die Composit-Video Verkabelung herzustellen da es nur hier
auch m&ouml;glich ist das JAGUAR-Bild auf einem handels&uuml;blichen
Videorecorder aufzuzeichnen.
<br>
</p>
<p>RGB-Recorder findet man idR nur in Studios. Diese Ger&auml;te sind
wesentlich teuerer und Zuhause recht selten.
<br>
</p>
<p>Die Pinbelegung f&uuml;r den n&ouml;tigen 12 poligen
Platinenstecker k&ouml;nnen Sie aus dem Bild entnehmen welches hier
beiliegt. Die Aufzeichnung auf einen Videorecorder klappt
&uuml;brigens nur korrekt wenn man keinen US-JAGUAR gekauft hat. Auch
mit einer 50/60Hz-Umschaltung ist da so leider nichts zu machen.
<br>
</p>
<p align=center><img src="image/jagport.gif" border=0 width="640" height="400"></p><br>
<div align=center><tt> Abbildung 1 - Jaguar Platinenstecker </tt>
</div>
<p>Hier nun meine eigene Pinbelegung f&uuml;r ein Kabel das ich
selber an meinem JAGUAR verwende. Das Kabel erm&ouml;glicht eine R,G,B
sowie eine Composit-Darstellung auf dem TV-Ger&auml;t das einen
Euro-Scartanschlu&szlig; besitzt. Auch die Schaltspannung zum
korrekten automatischen Umschalten des TV-Ger&auml;tes auf
Signaleingabe per Scart ist hier realisiert. Die Pinbeleung
k&ouml;nnen Sie aus untenstehender Tabelle entnehmen. Die besten
Ergebnisse erzielt man man immer mit RGB-Aschlu&szlig;.
<br>
</p>
<p>Auch sollte man, sofern man nicht in der Lage sich selber ein
Kabel zu bauen, die *CATBOX* in's Auge fassen. Eine <a href="0301.htm">CatBox</a> stellt alle
Anschlu&szlig;m&ouml;glichkeiten des JAGUARS komplett an mehreren
Steckern bereit. Hier braucht man dann lediglich im Laden das
entsprechende Verbindungskabel kaufen. Scartkabel z.B findet man in
jeder Videoabteilung. F&uuml;r rund 135 DM kommt man hier in den
Genuss einen Adapter zu besitzen der eigentlich alle Anschl&uuml;sse
und Signale eines Jaguars Benutzerfreundlich zur freien Verf&uuml;gung
stellt.
<br>
</p>
<p>Eine Reparatur der <a href="0210.htm">Konsole</a> die durch unsachgem&auml;ssen
Anschlu&szlig; zerst&ouml;rt wurde kann diesen Betrag leicht um das
doppelte bis hin zum Neukauf einer JAGUAR-<a href="0210.htm">Konsole</a> steigern!
<br>
</p>
<pre>Die Belegung des 4-Bit Jaguar Videoports

Oben      Signal               Unten     Signal
_____________________________________________

Component Side A               Solderside B

Pin  1A = Audio Left           Pin  1B = Audio Right
Pin  2A = Audio GND            Pin  2B = Audio GND
Pin  3A = NC                   Pin  3B = Video GND
Pin  4A = Video GNG            Pin  4B = RED (RGB)
Pin  5A = BLUE (RGB)           Pin  5B = VSL (V-SYNC)
Pin  6A = HSL1 (H-SYNC)        Pin  6B = NC
Pin  7A = GREEN (RGB)          Pin  7B = VIDEO GND
Pin  8A = S_COLOR              Pin  8B = S_LUMA
Pin  9A = NC                   Pin  9B = GND via C48 (CS)
Pin 10A = INC                  Pin 10B = Video GND
Pin 11A = +9V via R83 (100 R)  Pin 11B = COMPOSITE VIDEO
Pin 12A = NC                   PIN 12B = NC

</pre>
<p>Selbstredend werden f&uuml;r dies Kabelbelegung nicht alle Signale
ben&ouml;tigt die der JAGUAR zur Verf&uuml;gung stellt. Beim
anl&ouml;ten an einen Scartstecker sollte man schon genau aufpassen,
Fehlbelegungen f&uuml;hren direkt zum Misserfolg oder einem sehr
schlechten Bild. Sollte das TV-Ger&auml;t kein Stereoempf&auml;nger
sein kann man hier auch gleichzeitig f&uuml;r eine richtige
Chinchverbindung zur Stereoanlage sorgen. Stereoanlagen entwickeln
dann z.B auch die richtigen Bassverh&auml;ltnisse. Sehr brauchbar bei
z.B <a href="0605.htm">Alien vs Predator</a>.
<br>
</p>
<p align=center><img src="image/jagstek1.gif" border=0 width="490" height="330"></p><br>
<div align=center><tt> Abbildung 2 - Ein passender Platinenstecker</tt>
</div>
<p>Ab hier erfolgt eine genaue Beschreibung &uuml;ber die Herstellung
eines passenden Platinensteckers f&uuml;r den Anschlu&szlig; mit einem
richtigen abgeschirmtem Rundkabel.
<br>
</p>
<pre>
Material: 2 Meter abgeschirmtes Kabel mit mindestens 8 Adern
          1 Euro-Scartstecker
          1 PC-Slotstecker oder 2 x 12 poliger Platinenkantenstecker
          1 flaches Sub-D-Steckergeh&auml;use (Suchen!)
          15 cm Doppellitze, einzeln Abgeschirmt
          (Mikrofonlitze)
          2 Chinch-Kupplungen

Werkzeug:
          L&ouml;tkolben ca. 15 Watt (Mehr als Aussreichend!)
          kleine Eisens&auml;ge
          Feile und/oder etwas Schmirgelpapier
          2 Komponentenkleber
          versch. Schrumpfschl&auml;uche
          kleiner Seitenschneider
          Schraubendreher

*****************************************************************
** Eine gewerbliche Nutzung, auch der Bilder aus diesem Archiv **
**                      ist Untersagt                          **
*****************************************************************


</pre>
<p align=center><img src="image/jagscar.gif" border=0 width="390" height="370"></p><br>
<div align=center><tt> Abbildung 3 - Scartkabel f&uuml;r den Jaguar </tt>
<br>
</div>
<p>Der Flachkabelanschlu&szlig; eines JAGUARs an den heimischen
Fernseher mit Scartstecker ist nicht gerade die beste L&ouml;sung,
jedenfalls sieht das immer &quot;gebastelt&quot; aus. Zudem fehlt dem
Kabel eine jegliche Abschirmung. Das ist zwar bei niederfrequenten
Videosignalen nicht unbedingt Erforderlich tr&auml;gt aber auch zur
Verbesserung der Bildqualti&auml;t bei und das Kabel ist sicherer vor
Besch&auml;digungen. Es kann eine h&ouml;here St&ouml;rsicherheit
erlangt werden wenn an den Scartsteckern die Abschirmung sprich der
Blechrand mit GND verbunden wird. Das ist nicht zwingend Erforderlich!
<br>
</p>
<p>Verwendet wird bei dieser L&ouml;sung ein handels&uuml;blicher
21poliger Euro-Scartstecker und mehradriges Rundkabel, beides im
Elektronikshop erh&auml;ltlich. Da wir ein geschirmtes Rundkabel
verwenden wollen ist es hier schlecht m&ouml;glich einen Stecker zum
aufquetschen zu Verwenden. Nach langem suchen habe ich ein
Steckergeh&auml;use eines 25poligen D-Sub-Steckers gefunden das ohne
zu s&auml;gen in die hintere Aussparung am Jaguar passt. Auch
m&uuml;ssen hierzu die beiden F&uuml;hrungsstreifen aus Plastik nicht
aus dem JAGUAR herrausgefeilt werden. Man mu&szlig; wirklich etwas
l&auml;nger suchen um ein solches flaches Steckergeh&auml;use zu
finden, eine Bezugsquelle kann ich hier nicht angeben da auf dem
Geh&auml;use leider kein Hersteller vermerkt ist. F&uuml;r die Freaks:
Den Stecker habe ich von einer &quot;Berthold&quot;- Belichteranlage
&quot;entliehen&quot; und zwar verwendete diese irma f&uuml;r
&auml;ltere serielle &Uuml;bertragungen diese extrem flachen
Steckergeh&auml;use, warum wei&szlig; kein Mensch. Das
Steckergeh&auml;use ist aus schwarzen Kunststoff, passt im Design also
genau zum JAGUAR. Es ist also so das das Geh&auml;use im eigentlichen
Steckbereich so flach sein mu&szlig; das es ohne Gewaltanwendung in
das Hinterteil des JAGUARs passt, geht das nicht w&uuml;rde das
Geh&auml;use nach oben und unten weggebogen. F&uuml;r die
Jaguarplatine und das Geh&auml;use also eine gro&szlig;e und schlechte
Belastung, man sollte das dringend vermeiden. Ebenfalls im
Elektronikladen gibt es sog. &quot;Slotstecker&quot;, das sind die
Buchsenleisten wie sie z.B auf jedem PC-Motherboard zu finden sind,
wohl dem der jetzt ein altes zum Schlachten rumliegen hat. Verwendung
fanden diese Platinenverbinder schon bei ZX81 &uuml;ber den Spectrum,
dem C64, bis jetzt eben auch letztendlich der JAGUAR. Vom
Rasterma&szlig; her passen bisher die PC-Slotleisten am besten. Auf
keinen Fall passen solche &quot;Userportstecker&quot; inklusive
Geh&auml;use vom C64.
<br>
</p>
<p>S&auml;mtliche Computer hatten auf ihrer R&uuml;ckseite stets ein
St&uuml;ck Platine herrausragen das der Aussenwelt als Schnittstelle
dienen sollte. Dementsprechend lustig war es auch immer einen
passenden Stecker zu finden wenn man nicht die originalen
Zusatzger&auml;te f&uuml;r viel Geld kaufen wollte.
<br>
</p>
<p>Hier bildet der JAGUAR also auch keine Ausnahme. Man hat noch
Gl&uuml;ck gehabt das hier ein g&auml;ngiges Rasterma&szlig; der
Industrie verwendung gefunden hat.
<br>
</p>
<p>Wir verwenden also einen &quot;PC-Slot&quot; der auf der einen
Seite auf genau 26 Pole gek&uuml;rzt wird. Das geht sehr einfach mit
einer kleinen Eisens&auml;ge. Man s&auml;gt genau hinter dem
n&auml;chsten Plastik-Trennsteg und hat somit auch gleich das
&quot;Endst&uuml;ck&quot; hergestellt. Die S&auml;gespuren
gl&auml;ttet man mit einer Feile oder etwas Schmirgelpapier.
Ben&ouml;tigt werden 26 Pole, 24 um genau zu sein. 12 oben f&uuml;r
die &quot;A&quot;-Signale und 12 unten f&uuml;r die
&quot;B&quot;-Signale. Die beiden restlichen Pole kann man entweder in
der Mitte zusammenl&ouml;ten, oder wie in der ST-Computer auch schon
beschrieben, entfernen und durch ein Platinenst&uuml;ckchen ersetzen
das da dann eingeklebt wird. Beides dient dazu den Stecker gegen
unbeabsichtiges Verrutschen oder falsches Aufstecken zu sichern. Die
Kontaktzungen des &quot;Slots&quot; liegen dann auf jedem Fall beim
aufstecken auf den JAGUAR genau auf den Kontakten der Jaguar-Platine
und sollten so einen Kurzschlu&szlig; ect.pp der Signale verhindern.
Nach dem der Platinenverbinder (Slot) wie bereits beschrieben
vorbereitet wurde kann man den nun mit Zwei-Komponentenkleber in die
eine H&auml;lfte des Steckergeh&auml;uses einkleben. Das sollte so
passieren das der Kleber in keinem Fall die Kontaktfedern des
Slotsteckers verklebt. Die Aussenkante des Slotsteckers bildet dabei
mit der Vorderkante des Steckergeh&auml;uses eine Linie. Der Slot
sollte dabei von vorne auf den Slotstecker gesehen auch so ziemlich
genau in der Mitte des Steckergeh&auml;uses plaziert werden. Bitte
beigelegtes .GIF-Bild hierzu beachten. Sobald der Kleber
ausgeh&auml;rtet ist, auf der Heizung geht das wesentlich schneller,
kann damit begonnen werden die eigentliche &quot;Steckprobe&quot; zu
machen. Hierzu sollte bereits die seitliche Arretierung vorgenommen
wurden sein da der Stecker ansonsten nicht genau angepasst werden
kann. (Zusammenl&ouml;ten der verbleibenden 2 Pins (A+B)) oder
Platinenst&uuml;ck einkleben.
<br>
</p>
<p align=center><img src="image/jagscart.gif" border=0 width="600" height="350"></p><br>
<div align=center><tt> Abbildung 4 - Jaguar Selbstbau-Scartkabel</tt>
</div>
<p>JAGUAR - &quot;Slotstecker&quot; (Auf die Kontaktfedern gesehen)
<br>(DAS IST NICHT DIE L&Ouml;TSEITE!!)
<br>
</p>
<pre>
12            1
|---------------|     Oben  = &quot;A&quot;-Signale
| oooooooooooox |     o = Kontaktfeder
| oooooooooooox |     x = Arretierung
|---------------|     Unten = &quot;B&quot;-Signale

 12 11 10 9 8 7 6 5 4 3 2 1

</pre>
<p>Der Pin mit der Nr. 1 liegt links neben der Arretierung,
abz&uuml;glich der beiden Pins f&uuml;r die Arretierung verbleiben
also oben und unten jeweils genau 12 Pins &uuml;brig die die
Verbindung zum Scart-Anschlu&szlig; bzw. zur Aussenwelt herstellen
werden.
<br>
</p>
<p>Die Kabelfarben Rot, Gr&uuml;n sowie Blau kann man
zweckm&auml;ssig f&uuml;r das R-,G- und B-Signal verwenden, das
erleichert die Arbeit beim verdrahten. Den anderen Signalen kann man
jede andere noch freie Farbe zuordnen.
<br>
</p>
<pre>
Die Pinbelegung meines eigenen Scart-Kabels

Jaguar OUT                 Euro-Scart IN     Signal
------------------------------------------------------------------------
1A       ---------------------  6            Audio Links
1B       ---------------------  2            Audio Rechts
2A/2B    ---------------------  4            Audio GND     ---|
4B       --------------------- 15            Rot IN           |
5A       ---------------------  7            Blau IN          |-- Kabel-
7A       --------------------- 11            Gr&uuml;n IN          |   schirm
10B      --------------------- 17            Video GND     ---|
11B      --------------------- 20            Composit Video
11A      ---------------------  8            Schaltspannung (ab +8V)
5B       --------------------- 16            Video Sync. ***
------------------------------------------------------------------------

*** Pin 16 bleibt bei mir weiterhin Unbeschaltet da das bei
    meinen beiden TV-Ger&auml;ten nicht Funktioniert. Auch wenn die
    *ST-Computer* das so als &quot;Korrektur&quot; abgedruckt hat
    funktioniert das so nicht!

    Beide Ger&auml;te haben PIN 8 (Schaltspannung) und PIN 16 (Video
    Sync.) mit einer Diodenschaltung verkn&uuml;pft. (Wired OR)

                      1N4148 (Diode)
    Scart Pin 8   -----&gt;&gt;&gt;&gt;&gt;--------|
                                    |
    Scart Pin 16  -----&gt;&gt;&gt;&gt;&gt;--------|
                                    |------&gt;  Scart-Logik im
                                              TV-Ger&auml;t

</pre>
<p>Nach der Beschreibung von Peter Doerwald@WI2 sollte das
Funktionieren wenn Pin 16 des Scartsteckers mit PIN 6A (Chroma) des
JAGUARS verbunden wird. Das habe ich nicht nachgepr&uuml;ft. Mein
Kabel funktioniert mit der Beschreibung von oben bisher an *jedem* der
getesteten Scart-TV.
<br>
</p>
<pre>
TV-Ger&auml;te:             Recorder:
---------------------------------
Panasonic              Panasonic
Grundig
Phillips
Goldstar               Goldstar

</pre>
<p>Sind Pin 8 + 16 belegt erzeugt es bei mir nur ein wildes
Bildgeflimmere. Also arbeite ich lieber mit dem Composit-Videosignal.
Die R,G,B-Verbindungen k&ouml;nnen hierbei auch noch (bei mir)
weggelassen werden. Was auch den Vorteil besitzt das man Bilder vom
JAGUAR auf diesem Weg auch direkt auf VHS Aufzeichnen kann. Ohne
Umwege. Ohne Schaltspannung an Pin 8 geht es jedenfalls sicher nicht.
Andere TV-Ger&auml;te arbeiten mit den R,G,B-Signalen wenn PIN 16 des
Scart-Steckers mit 6A des JAGUARs verbunden wird.
<br>
</p>
<p>Alle Signale haben GND an 2A/2B/10B/7B als Bezugspunkt bzw. liegen
nachher im TV sowieso alle zusammen auf einem einzigen
GND-Bezugspunkt. Hier kann auch die Abschirmung angeschlossen werden.
<br>(Wobei hier auch extra Pin 9B vorhanden ist)!
<br>
</p>
<p>In diesem Archiv existieren einige Bilder die einmal das ganze
Kabel sowie den JAGUAR-Portstecker einmal von vorne und einmal von der
L&ouml;tseite her zeigen. Hier kann man auch sehr sch&ouml;n die
beiden am Scartstecker extra herrausgef&uuml;hrten Chinch-Kupplungen
sehen, die dazu dienen den JAGUAR-Sound &uuml;ber die Stereoanlage mit
gen&uuml;gend Power abzuspielen. Den Ton am TC-Ger&auml;t kann man zu
diesem zweck leise Stellen. Der Jaguar-Portstecker ist auf allen
Bildern ohne Deckel, das Geh&auml;useoberteil wurde zur besseren
Ansicht abgeschraubt. Auf der L&ouml;tseite kann man links und rechts
neben dem eigentlichen Steckerteil die Klebemasse ausmachen, der
Stecker darf logischerweise nur am Steckerunterteil und im
Seitenbereich geklebt werden. Die L&ouml;tstifte und die Drahtenden
sind mit Schrumpfschlauch isoliert.
<br>
</p>
<p>Die Bilder haben diese Querstreifen &uuml;brigens mit Absicht.
<br>Man kann das als eine Art Kopierschutz betrachten.
<br>
</p>
<p>In die Chinchbuchsen wird jeweils ein Teil des doppeladrigen
Kabels eingel&ouml;tet, und zwar so das jeweils die einzelne Ader an
dem Mittenkontakt der Buchse und das Schirmgeflecht an der
Au&szlig;enh&uuml;lse der Chinchbuchse anliegt. Hat man das f&uuml;r
beide Buchsen erledigt werden die beiden freien Enden im Scartstecker
angel&ouml;tet.
<br>
</p>
<p>Selbstredend k&ouml;nnen hier auch Einbau-Chinchbuchsen in den
hinteren Teil des Scartsteckers eingebaut werden sofern der Platz
daf&uuml;r aussreicht. Hier enf&auml;llt dann die Doppellitze welche
aus dem Scartstecker rausbaumelt. Das Funktioniert auch mit denen in
der ersten Zeit verkauften Flachbandkabel mit denen der JAGUAR an
Scart-TVs angschlossen wurde.
<br>
</p>
<pre>
Scart Pin 6 ------------------------------o Chinch links
Scart Pin 4 ############################### GND

Scart Pin 4 ############################### GND
Scart Pin 2 ------------------------------o Chinch rechts

# = Abschirmgeflecht
o = Chinch Mittenkontakt
- = Das 'innere' Dr&auml;htchen

</pre>
<p>Diese extra Verbindung wird im Scartstecker an den schon bereits
belegten Pins f&uuml;r die Audiosignale angeschlossen. Einfach
dazul&ouml;ten, Pin 6 tr&auml;gt das linke Audiosignal. Pin 2
tr&auml;gt das rechte Audiosignal, f&uuml;r beide ist ebenfalls
Scart-Pin 4 der Bezugspunkt (GND)
<br>
</p>
<p>Nat&uuml;rlich kann an den so herrausgef&uuml;hren
Audio-Anschl&uuml;ssen auch wieder die Stereoanlage oder die
hauseigenen Br&uuml;llw&uuml;rfel, sprich die alten billigen
Aktivboxen des PCs angesteckt werden. Bei letzterem sollte man sich
dann aber auch nicht &uuml;ber die relativ schlechte Tonqualit&auml;t
&auml;rgern. Eine Ausnahme bilden hier Aktivboxen die richtig Geld
kosten. Kleine billige Plastikboxen klingen halt auch billig.
<br>
</p>
<p>Im &uuml;brigen wird bei einem TV-Ger&auml;t ohne Stereoton der
linke und rechte Stereo-Kanal des JAGUARs mit folgender Schaltung
zusammengelegt. Die Toninformation wird zusammen in Mono
wiedergegeben. Es gehen so keine Toninformationen verloren die sich
nur auf einem der beiden Stereokan&auml;le abspielen.
<br>
</p>
<pre>
                 Widerstand
    Scart Pin 6 ----###---+
                          +------&gt; TV-Ton
    Scart Pin 2 ----###---+
                 Widerstand

    Scart GND   -----------------&gt; TV-GND

</pre>
<p>GND wird mit GND vom TV verbunden. Die Tonqualit&auml;t ist
entsprechend Mies, aber besser als nichts. Die Widerst&auml;nde
sollten mindenstens 1 KOhm haben, niemals kleiner. Gr&ouml;&szlig;er
besser f&uuml;r den JAG.
<br>
</p>
<p>Die Anleitung dient zum Herstellen einer sicheren Verbindung
zwischen dem Atari-Jaguar und einem Scart-TV. Es kann keine Haftung
f&uuml;r selbstverschuldete Sch&auml;den &uuml;bernommen werden. Diese
Anleitung gibt das wieder was bei mir seit einiger Zeit korrekt
arbeitet. F&uuml;r Fehler die beim Nachbau entstanden sind kann keine
Haftung &uuml;bernommen werden.
<br>
</p>
<p>Eine gewerbliche Nutzung, insbesondere der beigef&uuml;gten Bilder
ist Untersagt und nur durch vorherige R&uuml;cksprache m&ouml;glich!
Die Streifen in den Bildern wurden mit Absicht produziert.
<br>
<br>
<br>
</p>
<p align=center><img src="image/borderli.gif" border=0 width="590" height="18"></p><br>
<p align=center><img src="image/jag.gif" border=0 width="130" height="108"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:webmaster@doitarchive.de">webmaster@doitarchive.de</a>)<br>
Letzte Aktualisierung am 28. Juli 2001</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="profijag.htm"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="02.htm"><img src="udo_up.gif" alt="64-Bit Jaguar Hardware" border=0 width="24" height="24"></a>
<a href="0205.htm"><img src="udo_lf.gif" alt="Ersatzteil" border=0 width="24" height="24"></a>
<a href="0207.htm"><img src="udo_rg.gif" alt="RGB-Monitor" border=0 width="24" height="24"></a>
</td></tr></table>
</td></tr>
</table>
</body></html>
