<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 28.07.2001 -->
<html>
<head>
<title>
PROFIJAG - Tips u. Tricks zum 64-Bit Atari Jaguar: Myst
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="webmaster@doitarchive.de">
<link rev=made href="mailto:webmaster@doitarchive.de" title="E-Mail">
<link rel=home href="profijag.htm" title="Homepage">
</head>
<body background="image" bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellspacing=0 cellpadding=0 width="100%">
<tr>
<td valign=top width="128">
<table border=0 cellpadding=0 cellspacing=0 width="128">
<tr><td align=center><a href="01.htm"><img src="icon/but.gif" alt="PROFIJAG" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="02.htm"><img src="icon/but1.gif" alt="64-Bit Jaguar Hardware" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="03.htm"><img src="icon/but7.gif" alt="External Hardware" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="04.htm"><img src="icon/but6.gif" alt="Developer" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="05.htm"><img src="icon/but2.gif" alt="VLM" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="06.htm"><img src="icon/but3.gif" alt="Jaguar Modul-Spiele" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="07.htm"><img src="icon/but4.gif" alt="Jaguar CD-ROM Spiele" border=0 width="100" height="30"></a></td></tr>
<tr><td align=center><a href="08.htm"><img src="icon/but5.gif" alt="Anhang" border=0 width="100" height="30"></a></td></tr>
</table>
</td>
<td valign=top width="100%">
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="profijag.htm"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="07.htm"><img src="udo_up.gif" alt="Jaguar CD-ROM Spiele" border=0 width="24" height="24"></a>
<a href="0701.htm"><img src="udo_lf.gif" alt="Primal Rage" border=0 width="24" height="24"></a>
<a href="0703.htm"><img src="udo_rg.gif" alt="Blue Lightning" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Myst">7.2 Myst</a></h1>
<p><img src="image/bombline.gif" border=0 width="590" height="24"></p><br>
<p><tt> Tips und L&ouml;sungen zu Myst</tt>
</p>
<p align=center><img src="image/myst.gif" border=0 width="320" height="240"></p><br>
<p><b>Gamecheats</b>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<pre>
Codes w&auml;hred dem Spiel eingeben, dabei &quot;Option&quot; dr&uuml;cken:

Alle Schutzfunktionen aufheben:

Taste :  B B B B C C B B A B      B A B C B A A A B C
und   :  5 5 8 7 2 7 0 0 1 7      # 6 5 6 3 0 3 7 5 7
Der Reihe nach bet&auml;tigen.

Alle blauen und roten Seiten, sowie alle wei&szlig;en Seiten:

Taste:  A C A A B C C B C B      A A B B B C C B B A
und  :  5 1 5 4 # # 7 0 7 5      3 4 2 2 3 # 2 6 7 *
Der Reihe nach dr&uuml;cken.

Im Planetarium einstellen:
     : May 22, 1970 6:30am

Man sieht am &quot;Atari Geb&auml;ude&quot; die MYST-Crew auf dem Balkon.

</pre>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><b> Buch 1 </b>
</p>
<p>* Ich habe dieses Zeitalter Channelwood genannt, und es ist eine
ganz andere Welt. Es ist zwar genau so, wie ich es mir vorgestellt
hatte, doch es ist trotzdem erstaunlich, es mit eigenen Augen zu
sehen. In diesem Zeitalter ist, soweit ich sehen kann, alles mit
Ausnahme einer kleinen Felseninsel mit Wasser bedeckt. Anderswo gibt
es nur B&auml;ume, die direkt aus dem Wasser wachsen. Myriaden von
d&uuml;nnen, h&ouml;lzernen &Uuml;berg&auml;ngen sind knapp &uuml;ber
dem Wasser gebaut und verschwinden im Wald. Ich nehme an, sie wurden
vor l&auml;ngerer Zeit gebaut, denn sie sehen alt aus. Ich brenne
darauf, mehr &uuml;ber dieses Land und seine Leute zu erfahren, aber
ich bin sp&auml;t hier angekommen und mu&szlig; mich ausruhen.
</p>
<p>* Heute morgen weckten mich seltsame Ger&auml;usche auf, die vom
Pfad, neben dem ich schlief, her kamen. Ich sah, wie sich eine Gruppe
affenartiger Wesen in meine Richtung bewegte. Sie hatten mich noch
nicht bemerkt. Ich f&uuml;hlte mich durch ihre Anwesenheit nicht
bedroht. Ihre Reaktion auf mich h&auml;tte ich niemals erwartet.
Nachdem sie mich kurze Zeit angestarrt hatten, fielen sie auf ihre
Knie und begannen mit etwas, das wie eine Art Anbetungszeremonie
aussah. Ich versuchte, mit ihnen zu sprechen, aber sie verstanden
meine Sprache nicht. Stattdessen gaben sie mir mit begeisterten
Handbewegungen zu verstehen, da&szlig; ich ihnen folgen solle. Als wir
gingen, begann ich zu bemerken, da&szlig; das Wasser unter uns seine
Farbe wechselte. Langsam und subtil wechselte es von dunkelblau zu
einem schmutzigen Orange. Dann von schmutzigem Orange zu einer
wundersch&ouml;nen Klarheit. Ich war so faziniert von dem Wasser,
da&szlig; ich kaum bemerkte, da&szlig; wir an einer Leiter angekommen
waren. Wir kletterten die Leiter hoch, die uns in ihr Dorf
f&uuml;hrte. Dieses liegt etwa zehn Meter &uuml;ber dem Wasserspiegel
und ist nur mit Strickleitern erreichbar, die von den niedrigeren
Pfaden auf die Ebene des Dorfes etwa auf halber H&ouml;he der
gro&szlig;en B&auml;ume reichen. Es ist sehr interessant, diese Leute
bei der Erledigung ihrer t&auml;glichen Aufgaben zu beobachten. Nicht
einmal nach Stunden der Beobachtung verstand ich genau, was sie taten.
</p>
<p>* Bei Sonnenuntergang gaben sie mir Zeichen, da&szlig; ich mit
ihnen kommen solle. Ich folgte den Wesen zum Eingang einer riesigen
H&uuml;tte. Seltsamerweise wirkte diese, sobald ich drinnen war,
gr&ouml;&szlig;er als von au&szlig;en. Die W&auml;nde waren mit
gl&auml;nzenden Metallen dekoriert, und in der Mitte der H&uuml;tte
sa&szlig; der F&uuml;hrer dieser Leute. Zumindest schien er das zu
sein, denn er sa&szlig; einen Meter &uuml;ber dem Fu&szlig;boden auf
einem dicken Thron. Wachen umgaben das starke Wesen, da in viele
exotische, farbenpr&auml;chtige Stoffe geh&uuml;llt war. Neben dem
F&uuml;hrer sa&szlig; ein sehr alter Mensch. Er wirkte zumindest in
gewissem Ma&szlig;e menschlich. Sein Haar, das ihm nur im Gesicht und
auf dem Kopf wuchs, war vollkommen grau, beinahe wei&szlig;, und hing
in sehr langen Str&auml;hnen rund um seinen gebrechlichen K&ouml;rper
herunter.
</p>
<p>Sein d&uuml;nner Kopf hing schlaff an einem fast schon grotesken
Hals, der nicht in der Lage war, seinen Kopf zu st&uuml;tzen, so
da&szlig; er mich h&auml;tte ansehen k&ouml;nnen. Doch was f&uuml;r
eine &Uuml;berraschung - dieses Wesen konnte meine Sprache. Kurz
danach wurde mir mit einigen Handbewegungen, die anscheinend sagten,
da&szlig; ich schlafen gehen solle, ein Bett zugewiesen. Ich freue
mich schon, mehr zu erfahren.
</p>
<p>Wie ich vermutet hatte, ist dieses uralte Wesen ein Mensch. Doch
er ist so alt, da&szlig; er selbst sein Alter nicht mehr wei&szlig;,
und wirkt beinahe irr. Die Baumbewohner verehren ihn jedoch beinahe
wie einen Gott. Sie behandeln mich auf die gleiche Weise, was in mir
ein sehr unbehagliches Gef&uuml;hl hervorruft. Es ist nahezu
unm&ouml;glich, diesen Alten zu verstehen. Seine Stimme ist schwach,
aber doch temperamentvoll. Er hat viel von der Sprache der
Baumbewohner angenommen.
</p>
<p>Er selbst erz&auml;hlte mir, er habe unsere eigene Sprache seit
einer Ewigkeit nicht mehr gesprochen. Er versuchte, mir die <a href="0806.htm">Geschichte</a>
des Ortes zu erz&auml;hlen. Das folgende ist meine beste
&quot;&Uuml;bersetzung&quot; dessen, was er mir erz&auml;hlt hat:
</p>
<p>Vor vielen Jahren lebten die Menschen und die Baumbewohner
zusammen an diesem Ort, der zu jener Zeit eine riesige Insel war. Sie
hatten sehr wenig miteinander zu tun. Die Menschen lebten auf dem
Boden und die Baumbewohner hoch &uuml;ber den Menschen. Gelegentlich
wurde die Ruhe auf der Insel durch ein mysteri&ouml;ses Grollen
gest&ouml;rt, das willk&uuml;rlich auftrat (so etwas wie tektonische
oder vulkanische T&auml;tigkeit vermute ich). Die manchmal leichten,
manchmal schweren Beben dauerten stets nur kurze Zeit. Sie h&ouml;rten
dann auf, und alles konnte wieder normal werden. Eines Tages
&auml;nderten sich die Dinge. Das Grollen begann und wuchs schnell auf
eine noch nie dagewesene St&auml;rke an. Bald wurde klar, da&szlig;
die ganze Insel langsam in den sie umgebenden Ozean sank. Viele der
Menschen starben an jenem Tag, doch zuerst opferten sie sich, um die
Insel vor dem Untergang zu retten. Die Menschen, die diese Katastrophe
&uuml;berlebt hatten, begannen in den B&auml;umen zu leben, wo sie
nach und nach ausstarben - vielleicht, weil sie f&uuml;r eine solche
Umwelt so wenig ger&uuml;stet waren, aber ich bin mir nicht
sicher.&quot; Dies ist die <a href="0806.htm">Geschichte</a>, die mir der alte Mann
erz&auml;hlt hat, doch viele Einzelheiten sind sehr unklar in meinem
Geist. Besonders verwirrt mich, wie die Menschen die Insel vor dem
vollkommenen Versinken bewahrt haben. Tats&auml;chlich bezweifle ich
die Genauigkeit dieses Teils der <a href="0806.htm">Geschichte</a>. Die Insel mu&szlig; von
selbst aufgeh&ouml;rt haben zu sinken. Trotzdem glaubt der alte Mann
an die Wahrheit der <a href="0806.htm">Geschichte</a> als sei er selbst dabeigewesen. Und die
Baumbewohner beten ihn und offenbar alle Menschen wie Helden oder
G&ouml;tter an. Der alte Mann hat unsere Unterhaltung heute mit einem
Ereignis beendet, das ich niemals vergessen werde. Er begann, meine
H&auml;nde fest zu umklammern, und murmelte etwas von &quot;Ruhe&quot;
und &quot;schlafen&quot;. Dann sagte er: &quot;Wir haben dich schon
fr&uuml;her erwartet.&quot; Dies erf&uuml;llte mich sofort mit einer
Art Grauen. Mit gro&szlig;er M&uuml;he stand er auf. Ich versuchte,
ihm zu helfen, doch er schob mit mit mehr Kraft, als ich seinem
gebrechlichen K&ouml;rper zugetraut h&auml;tte, zur&uuml;ck. Die
Baumbewohner versammelten sich schweigend und mit ernsten Gesichtern
um ihn. Dann knieten sie vor ihm nieder. Er ging zu jedem und legte
ihm seine Hand auf den Kopf. Die ganze Zeit murmelte er dabei Worte,
die ich nicht verstand. Schlie&szlig;lich wandte er sich mir zu und
l&auml;chelte. Dann schlo&szlig; er seine Augen, ging zur T&uuml;r
hinaus auf den schmalen Pfad zu, hoch in den B&auml;umen. Die
Baumbewohner schwiegen. Sie begannen, die n&auml;chste Strickleiter
hinunter zu prozessieren. Als ich hinunterkletterte sah ich, wie
mehrere von ihnen die Leiche aufhoben (er war auf eine niedrigere
Ebene des Pfades gefallen) und sie davontrugen. Sie legten ihn am Ende
einer pier&auml;hnlichen Konstruktion hin. Unter Verwendung einer
kleinen Menge eines Trankes z&uuml;ndete eines der Baumwesen den Pier
an, und ich beobachtete, wie ihn die Flammen umz&uuml;ngelten. Im
Laufe dieser seltsamen &quot;Bestattung&quot; nahm das Wasser um den
Pier eine tr&uuml;be gr&uuml;ne Farbe an.
</p>
<p>* Heute morgen erwachte ich und konnte die Ereignisse des
vergangenen Abends kaum glauben. Soweit ich sehen kann ist das Wasser
jetzt tr&uuml;blich gr&uuml;n. Aus irgendeinem Grund &auml;ndert das
Wasser seine Farbe nicht mehr.
</p>
<p>W&auml;hrend ich auf den Pfaden wandere, beobachten mich die
Wesen, sind gespannt, was ich wohl als n&auml;chstes tue. St&auml;ndig
bieten sie mir seltsame Objekte der Zuneigung an. Ich habe sogar Essen
vor der T&uuml;r des Zimmers, in dem ich geschlafen hatte, gefunden.
Diese Wesen sind eine einzigartige Rasse. Ich hoffe, bald ihre Sprache
zu erlernen, damit ich mehr von ihnen lernen kann.
</p>
<p>* Ich habe jetzt mit Unterbrechungen drei Monate in dieser Welt
gelebt, und die Baumbewohner haben gro&szlig;e Gastfreundschaft an den
Tag gelegt. Ich beginne sogar, ihre Sprache ein bi&szlig;chen zu
lernen. Ich habe beschlossen, f&uuml;r einen l&auml;ngeren Aufenthalt
mit meiner geliebten Frau und meinen S&ouml;hnen nach Hause
zur&uuml;ckzukehren, und hoffentlich mit ihnen hierher
zur&uuml;ckzukommen. Ich bin mir jedoch sicher, da&szlig; Catherine
sich wieder einmal weigern wird. Ich glaube, dieses Zeitalter
w&auml;re eine wunderbare Erfahrung f&uuml;r sie alle, und ich
zumindest freue mich darauf, die Reaktion von Sirrus und Achenar auf
seine seltsamen Bewohner zu sehen.
</p>
<p>* Wie erwartet kommt Catherine nicht mit. Meine S&ouml;hne sind
mit mir zur&uuml;ckgekehrt, und ihnen gef&auml;llt dieses Zeitalter
sehr. Sie kommen sehr gut mit den Baumbewohnern zurecht und lernen
ihre Sprache erstaunlich schnell. Ich bezweifle nicht, da&szlig; es
nicht mehr allzu lange dauern wird, bis sie mit den Baumbewohnern
besser als ich selbst sprechen k&ouml;nnen.
</p>
<p>* Ich gehe morgen weg, um nachzusehen, wie die Dinge im
Osmsianischen Zeitalter laufen. Sirrus hat vorgeschlagen, da&szlig;
ich ihm und seinem Bruder erlaube, zu bleiben. Obwohl mich der Gedanke
beunruhigt, wei&szlig; ich, da&szlig; die Jungen schnell heranwachsen.
Die Gastfreundschaft dieser Kreaturen ist derart gro&szlig;, da&szlig;
ich mir keinen besseren Ort denken k&ouml;nnte, wo ich sie f&uuml;r
eine kurze Weile alleine lassen w&uuml;rde. Ich werde also ihrer Bitte
nachgeben. Ich warnte die Jungen, den Respekt, den die Baumbewohner
vor ihren Ideen haben, nicht auszunutzen. Sie scheinen meine Warnung
zu verstehen und ich vertraue ihnen, da&szlig; sie sie befolgen
werden.
</p>
<p>* Sehr zu meinem Entsetzen erfuhr ich bei meiner Ankunft in
Everdunes, da&szlig; Pran und ihre Leute immer noch von den Chochties
bedroht werden. Ich f&uuml;rchte um ihr &Uuml;berleben und
beabsichtige, bald wieder zu ihnen zur&uuml;ckzukehren, wenn ich mich
um Sirrus und Achenar hier gek&uuml;mmert habe. (Weitere Informationen
im Tagebuch von Everdunes). Nachdem ich Sirrus und Achenar beobachtet
habe, sehe ich, da&szlig; sie mit allem sehr gut fertig werden, und
ich glaube, da&szlig; ich beruhigt sein kann und mich nicht zu sorgen
brauche, sie wieder und etwas l&auml;nger in Channelwood
zur&uuml;ckzulassen.
</p>
<p>* Die Baumbewohner scheinen etwas betr&uuml;bt dar&uuml;ber zu
sein, da&szlig; ich weggehe, freuen sich aber, da&szlig; Sirrus und
Achenar wieder dableiben.
</p>
<p>* Ich bin seit mehr als drei Tagen weg und bin an vielen
verschiedenen Orten gewesen. Ich mu&szlig;te Sirrus und Achenar heute
Prans Tod mitteilen, und sie waren sichtlich ersch&uuml;ttert,
obgleich sie sich nur aus ihrer Kindheit an sie erinnerten. Catherine
hat vorgeschlagen, da&szlig; es klug w&auml;re, wenn Sirrus und
Achenar f&uuml;r eine Weile nicht in Channelwood w&auml;ren, und da
mu&szlig; ich ihr recht geben. Sie kommen mit mir zur&uuml;ck, wenn
ich wieder gehe.
</p>
<p>* Ich habe meinen S&ouml;hnen gesagt, da&szlig; sie mit mir in
zwei Tagen zur&uuml;ckkehren. Sie haben mir die ganze Nacht ein
Abenteuer erz&auml;hlt, das sie in meiner Abwesenheit erlebt haben und
das au&szlig;erordentlich bemerkenswert war. Es scheint, sie haben mit
den Wesen ein Boot gebaut und sind in die umliegenden Gew&auml;sser
hinausgefahren. Ich h&ouml;re gerne die aufgeregten Schilderungen
ihrer Abenteuer und mu&szlig; dabei an meine eigenen Abenteuer als
Kind denken.
</p>
<p>* Ich verstehe endlich, warum mir die Baumbewohner so viel Tinte
gegeben haben und darauf bestanden, da&szlig; ich damit schreibe. Wenn
ich mir einige meiner alten Eintr&auml;ge ansehe, stelle ich nun fest,
da&szlig; die Tinte, die ich f&uuml;r schwarz gehalten hatte, mehrere
verschiedene Farben angenommen hat. Ich habe einigen Wesen mein
Tagebuch gezeigt, und sie bogen sich vor Lachen. Ich wu&szlig;te
nicht, da&szlig; sie so einen Sinn f&uuml;r Humor haben. Sogar jetzt,
wenn ich mir das &auml;u&szlig;erst &quot;farbige&quot; Tagebuch
ansehe, kann ich nicht umhin, selbst zu lachen.
</p>
<p>* Wir kehren morgen zur&uuml;ck. Meine S&ouml;hne verbringen also
die letzte Nacht hier bei den Wesen. Sie haben mir gesagt, sie
w&uuml;rden gerne wieder nach Channelwood kommen, und fragten auch, ob
sie einige der anderen Zeitalter alleine besuchten k&ouml;nnten.
Obgleich ich ihre Bitte noch &uuml;berdenken mu&szlig;, glaube ich,
da&szlig; sie mir bewiesen haben, wie vertrauensw&uuml;rdig und
verantwortungsbewu&szlig;t sie sind. Catherine wird mir bei der
Entscheidung helfen, ob sie schon alleine reisen k&ouml;nnten.
Einstweilen mu&szlig; ich mich von den Wesen verabschieden, denn ich
wei&szlig; nicht, wie lange es dauern wird, bis ich dieses Zeitalter
wieder besuchen werde.
</p>
<p><b> Buch 2 </b>
</p>
<p>* Emmit war der erste, der auf den Felsen lebte. Er nannte sie
&quot;die Felsen&quot;, denn genau das waren sie: eine Gruppe spitzer
Felsen, zusammengeschmiegt inmitten eines gro&szlig;en Meeres. Hier
lebte Emmit: er geno&szlig; das Leben. Emmit schwamm gelegentlich zu
anderen Felsen in der N&auml;he, denn die Entfernungen waren nie zu
gro&szlig;. Eines Tages erschien Emmit auf den Felsen ohne
ersichtlichen Grund eine andere Person. Emmit nannte diese neue Person
Branch. Emmit und Branch wurden schnell Freunde und gingen oft
miteinander schwimmen oder Fische jagen. Emmit zeigte Branch die
einfache H&ouml;hle, in der er auf dem gr&ouml;&szlig;ten Felsen
lebte. Bald entdeckte auch Branch einen Ort, an dem er leben wollte,
und der befand sich auch auf dem gr&ouml;&szlig;ten Felsen. Die Sonne
schien in ihrer Welt stets hell und das Wasser war immer klar. So
konnten sie beinahe auf den Grund des tiefen Ozeans blicken, der sie
umgab. Obgleich die Sonne st&auml;ndig schien, war es den Jungen nie
zu hei&szlig;. Stets blies eine leichte Brise vom Norden und
k&uuml;hlte die Umgebung ab. Eines Tages, als Branch schwamm und im
Wasser seinen Spa&szlig; hatte, sah er einen anderen Jungen
herumschwimmen. Branch brachte den neuen Jungen zu Emmit und wollte
wissen, wie er hei&szlig;en solle. Emmit wollte ihn Will nennen. Will
wurde schnell in die Gruppe aufgenommen, und die drei Jungen schwammen
und erfreuten sich an ihrer vollkommenen Welt.
</p>
<p>Das hat man mir zumindest erz&auml;hlt, als ich heute auf der
Insel ankam. Emmit, Branch und Will waren zuerst &uuml;berrascht, als
sie mich sahen, doch noch bevor die Nacht vorr&uuml;ber war, wurden
wir alle gute Freunde.
</p>
<p>* Heute, am zweiten Tag in diesem neu geschaffenen Zeitalter,
geschah etwas Merkw&uuml;rdiges. Mir kam es nicht seltsam vor, doch
die drei Jungen verstanden nicht, was vor sich ging. Als ich entspannt
unter einem gro&szlig;en Baum auf der kleineren Felseninsel lag,
begann es zu regnen. Es war ein angenehmer Regen, der etwa eine Stunde
am Morgen anhielt. Ich erkl&auml;rte den Jungen, da&szlig; der Regen
nicht sch&auml;dlich sei, doch ganz offensichtlich hatten sie Angst.
Bevor ich heute Nacht ins Bett ging, sagte ich den Jungen, da&szlig;
ich am folgenden Tag weggehen w&uuml;rde. Ich erkl&auml;rte ihnen,
da&szlig; ich w&auml;hrend meiner Abwesenheit eine &uuml;berraschende
Ver&auml;nderung an ihrer Welt vornehmen w&uuml;rde. Das verstanden
sie nicht. (Nicht, da&szlig; ich das etwa erwartet h&auml;tte.)
</p>
<p>* Ich verstehe immer noch nicht ganz, was heute geschehen ist. Ich
experimentierte mit der &quot;Kunst&quot; - ich testete die Grenzen
der Regeln, die mir mein Vater diktiert hatte. Ich versuchte, ein Boot
zu schaffen, indem ich es in die Welt schrieb. Ich dachte, alles sei
richtig geplant, doch irgendwie wurde das Boot vom Felsen ergriffen
und brach entzwei. Obwohl dieser Test nicht so ausging, wie ich
gehofft hatte, habe ich nun die Antworten auf einige der Fragen, die
mein Vater niemals beantwortete, gefunden.
</p>
<p>Was das Boot angeht, kann ich sehen, da&szlig; es den Jungen
trotzdem gefallen hat, und das freut mich. Sie haben den ganzen Tag
darauf gespielt. Obgleich sich das Boot nicht bewegen l&auml;&szlig;t,
habe ich gerne auf ihm studiert. Es ist eine viel robustere Plattform,
als die gezackten Felsen. Im Laufe meiner Beobachtungen habe ich
einige sehr interessante Dinge &uuml;ber das Sonnensystem dieses
Zeitalters gelernt.
</p>
<p>* Die N&auml;chte hier sind unwahrscheinlich sch&ouml;n. Ich habe
eine Reihe von Sternbildern, die &uuml;ber mir vorbeiziehen, notiert
und benannt. In der Nacht erhasche ich au&szlig;erdem Lichtschimmer am
Horizont, und wei&szlig; noch nicht, ob es sich dabei um ein
nat&uuml;rliches Ph&auml;nomen oder andere Leute auf entlegenen Inseln
oder Felsen handelt. Ich m&ouml;chte sehr gerne herausfinden, was
davon nun der Fall ist. (Ich nehme eher an, da&szlig; es andere Leute
sind, was das Erscheinen von Branch und Will erkl&auml;ren
w&uuml;rde.)
</p>
<p>* Der Regen war heute etwas st&auml;rker als gew&ouml;hnlich.
Gerade als die Jungen sich an die leichten Regenf&auml;lle
gew&ouml;hnt hatten, kam ein kleines Gewitter. Der st&auml;rkere Regen
machte ihnen Angst - vom Blitz und Donner ganz zu schweigen. Wenn es,
wie die Jungen mir erz&auml;hlt haben, hier bis vor kurzem keinen
Regen gegeben hat, w&uuml;rde ich gerne herausfinden, warum es ihn
jetzt gibt. Wie dem auch sei, ich habe mich entschlossen, f&uuml;r
kurze Zeit nach Hause zur&uuml;ckzukehren. Ich habe mir Pl&auml;ne
f&uuml;r einen Leuchtturm durch den Kopf gehen lassen, den ich bald zu
bauen hoffe. Wenn wir ein helles Licht am Horizont scheinen lassen,
dann best&auml;tigt sich vielleicht mein Verdacht auf weitere
Bewohner. Das Licht w&uuml;rde sie neugierig machen, und sie
w&uuml;rden losziehen und seinen Ursprung suchen - vorausgesetzt sie
haben die Mittel dazu.
</p>
<p>Ich bin mit vielen Werkzeugen zur&uuml;ckgekehrt, die ich f&uuml;r
den Bau des Leuchtturms brauchen werde. Ich habe beschlossen,
da&szlig; wenn der Leuchtturm erst einmal fertig ist, ich einige Zeit
weggehen werde und der Phantasie der Welt ihren eigenen Lauf lassen
werde.
</p>
<p>* Wir arbeiten nun seit drei Wochen am Leuchtturm, und die Arbeit
geht gut voran. Der Fels, auf dem wir bauen, scheint nicht so fest zu
sein, wie ich das gerne h&auml;tte. Ich mu&szlig;te meine Pl&auml;ne
etwas &auml;ndern, doch diese &Auml;nderungen stellen kein wirkliches
Problem dar.
</p>
<p>* Die Jungen sind ziemlich stark und haben mir enorm geholfen. Ich
sch&auml;tze, der Bau wird in zwei Tagen abgeschlossen sein.
</p>
<p>* Der Leuchtturm ist fertig, und wir sind alle stolz auf unser
Werk. Die Jungen staunen angesichts der Struktur, die sie mit ihren
eigenen H&auml;nden aus dem Felsen geschaffen haben. An jenem Abend
starteten wir den Generator - sehr zum Entsetzen der Jungen zuerst -
und viele Stunden lang schien ein gro&szlig;es Licht am Horizont. Ich
verbrachte die Nacht oben am Leuchtturm. Am Morgen erwachte ich und
beobachtete den Sonnenaufgang, ohne von der k&uuml;hlen Decke
Ozeantaus umh&uuml;llt zu werden, an die ich mich so gew&ouml;hnt
hatte.
</p>
<p>* Es war Will, der das M&auml;dchen zuerst sah. Sie schwamm unweit
des Boots, in dem Will Vorbereitungen zum Fischfang traf. Dann
bemerkte Will nicht weit von dem M&auml;dchen einen Mann. Emmit freute
sich sehr, die anderen Nachbarn kennenzulernen.
</p>
<p>Ich freue mich, diesem Zeitalter den R&uuml;cken zu kehren - ich
habe die Ereignisse in Bewegung gesetzt, die mit Schreiben und
&quot;Kunst&quot; zu tun haben, und die eine tiefere Wirkung auf diese
Welt haben werden, als ich sie jemals h&auml;tte schreiben
k&ouml;nnen. Ich sehe dieses Zeitalter als ein Geschenk an mich selbst
an, das ich einwickle und eines Tages in der Zukunft auspacke, nur um
zu entdecken, da&szlig; es sich so sehr ver&auml;ndert hat, da&szlig;
es tats&auml;chlich eine &Uuml;berraschung f&uuml;r mich ist.
Au&szlig;erdem gibt es da noch ein Zeitalter, das mich erwartet. Es
sieht so aus, als br&auml;uchte ich eine M&ouml;glichkeit, um unter
Wasser in dieses neue Zeitalter zu reisen. Gute Planung ist also
angesagt.
</p>
<p>* Zehn Jahre ist es nun her, seit ich dieses Zeitalter verlassen
habe, welches ich seither als das &quot;Steinschiffalter&quot;
bezeichnet habe. Bei meiner R&uuml;ckkehr kann ich die
&Auml;nderungen, die stattgefunden haben, kaum glauben. Die
urspr&uuml;nglichen drei &quot;Jungen&quot; sind zu M&auml;nnern
herangewachsen, und es gibt viele neue Gesichter, die ich nicht kenne.
Branch hat mir erz&auml;hlt, da&szlig; es sieben Jahre lang nicht
geregnet hat und die kalten Brisen wieder da sind. Sie sind alle sehr
zufrieden, haben mir neue Nahrung vorgesetzt und mir die neuen
Materialien, die sie entdeckt haben, gezeigt. Es scheint, sie haben
irgendwo Gold gefunden. Ich sehe es in vielerlei Gestalt auf der
ganzen Insel. Mein Leuchtturm war in perfektem Zustand und es sieht so
aus, als h&auml;tten sie ihr Bestes getan, in so zu erhalten. Doch ich
habe festgestellt, da&szlig; der ganze Fels, auf dem er gebaut ist, um
etwa 40 oder 50 Zentimeter gesunken ist.
</p>
<p>Nach einem wunderbaren Besuch bei meinen alten Freunden, frage ich
mich genau wie sie, wie wohl die Dinge hier nach weiteren zehn Jahren
aussehen werden.
</p>
<p>[ES FOLGT EINE DARSTELLUNG DER 8 STERNBILDER. DIESE SIND WICHTIG
UND SOLLTEN ABGEZEICHNET WERDEN!]
</p>
<p><b> Buch 3 </b>
</p>
<p>* Es ist eine Weile her, seit ich reine Stille geh&ouml;rt habe,
und ich genie&szlig;e es sehr, glaube ich. Aus irgendeinem Grund
f&uuml;hle ich mich hier in dieser Welt neuen Welt, die ich betreten
habe, nicht ganz willkommen. Aber wie k&ouml;nnte ich in einem
Zeitalter, in dem niemand lebt, unwillkommen sein? Das bilde ich mir
nat&uuml;rlich alles nur ein. Diese Welt ist sehr sch&ouml;n. (Doch
ich glaube, ich mu&szlig; erst noch in einem Tagebuch schreiben,
da&szlig; ein Zeitalter, in das ich gekommen bin, schrecklich ist.)
Von dem grasbewachsenen H&uuml;gel, auf dem ich stehe, kann ich unten
die gr&uuml;nen Felder sowie ein paar verstreute W&auml;lder sehen.
Ein recht gro&szlig;er See zeichnet sich von meinem Standpunkt aus in
der Ferne ab, doch das Blau des Wassers ist schon deutlich von hier
aus zu erkennen. Die Luft ist frisch und der Himmel mit wei&szlig;en
Wolken gesprenkelt. Absolut atemberaubend, und doch setzt wieder
dieses seltsame Gef&uuml;hl ein. Vielleicht ist es die hei&szlig;e
Brise, die anhaltend vom Norden bl&auml;st. Hei&szlig;er, als ich mir
das je vorgestellt h&auml;tte. Fast versengt sie mir die Haut, und ich
f&uuml;hle mich recht unbehaglich, wenn sie kommt. Ich werde
versuchen, sie zu ignorieren. Die Nacht ist schon beinahe da, und der
Sonnenuntergang ist spektakul&auml;r. Orange- und Rott&ouml;ne haben
sich um den westlichen Horizont angesiedelt. Obgleich die Nacht
angebrochen ist, gl&uuml;ht der Horizont noch lange nach
Sonnenuntergang rot auf. Dunkles Rot flie&szlig;t vom Horizont und
verschmilzt mit dem schwarzen Himmel. Wieder dieses Gef&uuml;hl, und
ich fange an zu glauben, da&szlig; ich es mir nicht nur einbilde. Ich
mu&szlig; jetzt schlafen. Ich werde meine Kraft brauchen, damit ich
morgen mehr erforschen kann.
</p>
<p>* Ich habe aufgrund unvorhersehbarer Naturereignisse, die
furchterregender waren, als ich es jemals erlebt hatte, nach Hause
zur&uuml;ckkehren m&uuml;ssen. Ich wurde von einem schrecklichen
R&uuml;tteln im Boden und Explosionen von allen Seiten aufgeweckt.
</p>
<p>Gigantische Feuerkugeln fielen vom Himmel und lie&szlig;en mich
sofort in Angst um mein Leben fliehen. Ich mu&szlig; daran denken, ein
Verbindungsbuch zu Myst mitzubringen, wenn ich zur&uuml;ckkomme,
f&uuml;r den Fall, da&szlig; das dortgelassene zerst&ouml;rt oder
besch&auml;digt worden ist.
</p>
<p>* Ich bin in eine andere Welt zur&uuml;ckgekehrt als die, die ich
vor drei Monaten verlassen habe. Sie ist in eine unfruchtbare
W&uuml;ste verwandelt worden und riesige Krater, verstreut &uuml;bers
Land, sind die einzige Abwechslung. Seltsamerweise ist der kleine
grasbewachsene H&uuml;gel, auf dem ich meine erste Nacht verbracht
habe, genau so geblieben, wie ich ihn gefunden hatte. Offensichtlich
sind die fallenden Meteore nicht in diesem Bereich eingeschlagen und
haben damit eine Oase inmitten dieser Trostlosigkeit hinterlassen. Der
hei&szlig;e Wind, an den ich mich erinnere, ist zu einer recht
angenehmen Brise geworden, was zumindest eine Verbesserung ist. Ich
f&uuml;rchte, es ist die einzige. Der prachtvolle See, den ich bei
meinem ersten Besuch sah, ist jetzt vollkommen ausgetrocknet. Es gibt
nun jedoch einen anderen See, der anscheinend ein ganzes St&uuml;ck
gr&ouml;&szlig;er ist. Ich nehme an, dieser See ist durch einen der
fallenden Meteore entstanden, denn er ist kreisrund und aus seiner
Mitte ragt ein Fels hervor. Der Rest dieser Welt wirkt wie eine
W&uuml;ste, doch diese Aussage werde ich bei n&auml;herer Inspektion
&uuml;berpr&uuml;fen. Obgleich der visuelle Reiz dieser Welt nur
gering ist, so hat sie doch dem Ohr einiges zu bieten. Kl&auml;nge
str&ouml;men fortw&auml;hrend durch mein Ohr, und ich habe
festgestellt, wo ein paar von ihnen ihren Ursprung haben. Es scheint,
als f&auml;nde ich tats&auml;chlich (genau wie Catherine sagt) an
allem etwas Sch&ouml;nes.
</p>
<p>* Vergangene Nacht wurde ich von einem f&uuml;rchterlichen Zischen
aufgeweckt. Ich schwitzte, und die Hitze war so stark, da&szlig; ich
meinen Kopf sofort zur Abk&uuml;hlung in einen nahegelegenen Bach
steckte. Die hei&szlig;en Brisen waren zusammen mit einem tiefen
Grollen aus dem Boden zur&uuml;ckgekehrt. Ich lief ein kurzes
St&uuml;ck und sah einige rote Flammen aus der Erde
emporschie&szlig;en. Pl&ouml;tzlich begann der Boden
aufzurei&szlig;en, und es tat sich ein riesiger Abgrund auf. Der
Abgrund wuchs solange weiter, bis er zum &Uuml;berqueren viel zu breit
war. Dann legte sich der Tumult wieder und es blieb nur ein dumpfes
Grollen. Ich habe jedoch entschieden, da&szlig; ich den Abgrund zu
meinem Vorteil einsetzen kann. Vielleicht l&auml;&szlig;t sich die
Hitze aus dem Abgrund irgendwie nutzen.
</p>
<p>* Obwohl der Abgrund die Oberfl&auml;che dieser Welt aufri&szlig;,
hat er eine neue Welt er&ouml;ffnet, die es zu erforschen gilt. Trotz
der unangenehmen Hitze war es mir m&ouml;glich, eine H&ouml;hle zu
erreichen, die im Abgrund entstanden war. Und ich bin nun tief in die
Kruste dieses Planeten vorgedrungen. Ich habe ein riesiges
unterirdisches H&ouml;hlensystem gefunden, dessen Vermessung und
Erforschung Jahre in Anspruch nehmen werden. Ich werde auch nach einem
sichereren Weg in den Untergrund, als durch die Abgrundwand suchen.
</p>
<p>* Dieses Zeitalter scheint sich von selbst zu &auml;ndern. Deshalb
habe ich das Gef&uuml;hl, ich sollte wieder weggehen und abwarten, ob
die Dinge anders sind, wenn ich wiederkomme. Es ist auch wichtig,
da&szlig; ich nachsehe, was Sirrus und Achenar tun, und mich darum
k&uuml;mmere, da&szlig; alles gutgeht. Wenn ich zur&uuml;ckkomme,
hoffe ich auch, einige Werkzeuge mitzubringen, die ich f&uuml;r meine
Pl&auml;ne zur Erforschung des Untergrunds ben&ouml;tige.
</p>
<p>* Der hiesige &Uuml;berflu&szlig; an Rohstoffen beginnt mich zu
erstaunen. Ich bin mit einigen der komplexen Werkzeuge
zur&uuml;ckgekommen, von denen ich wu&szlig;te, da&szlig; ich sie
brauchen w&uuml;rde. Ich nahm an, da&szlig; ich wegen einiger
einfacheren Materialien zur&uuml;ckkehren m&uuml;&szlig;te, doch es
sieht so aus, als ob ich alles, was ich brauche, hier finden
k&ouml;nnte. Eisen ist nat&uuml;rlich im &Uuml;berflu&szlig;
vorhanden, aber ich bin auch auf nat&uuml;rliche Titanvorkommen
gesto&szlig;en, und ich kann es jetzt noch weniger erwarten, mit der
Arbeit zu beginnen. Alles ist bereit, und ich freue mich auf morgen.
Meine Rohstoffe sind alle hier; ich glaube, ich werde mit den meisten
meiner Zus&auml;tze zu diesem Zeitalter in einem Jahr fertig sein. Ich
liebe die Arbeit mit den H&auml;nden so sehr - sei es nun schreiben
oder bauen.
</p>
<p>[DER FOLGENDE ABSCHNITT IST IM TAGEBUCH VERSCHMIERT UND NICHT MEHR
KOMPLETT LESBAR!]
</p>
<p>Ich habe heute mit den Br&uuml;cken begonnen und obwohl...
...funktionieren gut, und ich habe beschlossen... Drei Meter sind
nicht gen&uuml;gend Abst&uuml;tzung f&uuml;r die Balken, obwohl...
...mu&szlig; eine meiner wertvollsten Erfindungen sein. Ich bin
au&szlig;erordentlich... ...h&auml;tte mir niemals vorgestellt,
da&szlig; es klappt... ...es &uuml;berhaupt mit vierzehn anstatt acht
funktionieren k&ouml;nnte... ...Ich bin so froh, da&szlig;...
...morgen fertig wird...
</p>
<p>* Ich gehe heute, um Sirrus und Achenar zur&uuml;ckzubringen. Ich
habe sie in Channelwood alleine gelassen. Ich glaube, alles, was es
hier zu sehen gibt, wird ihnen gefallen. Das Zeitalter scheint sich
stabilisiert zu haben. Ich glaube, die Meteore haben durch das
Durchbrechen der d&uuml;nnen Kruste eine Periode vulkanischer
Aktivit&auml;t ausgel&ouml;st. Doch die Beben sind selten geworden.
</p>
<p>* Ich habe festgestellt, da&szlig; ein gro&szlig;er Teil dieser
Tagebucheintragungen auf seltsame Weise von den Seiten, auf denen ich
w&auml;hrend der letzten achtzehn Monate geschrieben habe,
verschwunden ist. Zum Gl&uuml;ck habe ich viele meiner Baunotizen in
ein anderes Tagebuch &uuml;bertragen. Ich verstehe die zahlreichen
Wunder dieser Welt nicht, doch ich glaube fest daran, da&szlig; ich
logische Antworten auf meine Fragen finden werde. Ich habe das
Gef&uuml;hl, viele meiner Fragen werden in einem anderen Zeitalter, in
das ich bald zu reisen hoffe, beantwortet werden. Einstweilen
mu&szlig; ich einfach die Geheimnisse dieser Welt akzeptieren und
stolz auf meine Errungenschaften sein.
</p>
<p>[ES FOLGT DIE ABBILDUNG EINER KLAVIERTASTATUR, DIE F&Uuml;R DIE
L&Ouml;SUNG SEHR WICHTIG IST]
</p>
<p><b> Buch 4 </b>
</p>
<p>* Bevor ich in dieses Zeitalter gekommen bin, war ich
&uuml;berzeugt, da&szlig; es eine Reise in eine Welt, die ganz anders
als meine bisherigen Abenteuer ist, sein w&uuml;rde. Und so war es
auch. Der Himmel hier ist dunkel und grau, und in der Ferne leuchten
unaufh&ouml;rlich Blitze. Ich traf einen sehr alten Mann mit langem
Bart und Haaren, die ihm bis zur Taille reichten. Er f&uuml;hlt sich
sehr schwach und kann sich nur mit M&uuml;he bewegen. Offensichtlich
hat dieser Mann in dieser seltsamen Welt schon sehr viel mitgemacht,
und ich habe vieles von ihm erfahren. Er hat mir eine interessante
Darstellung der <a href="0806.htm">Geschichte</a> dieser Welt gegeben. Vor Jahren,
erz&auml;hlte er mir, habe es eine wundersch&ouml;ne Stadt gegeben,
die aus dem Wasser ragte. Viele Leute lebten in ihren Mauern und
hatten alles, was sie sich w&uuml;nschen konnten. Die Stadt war von
drei hohen H&uuml;geln umgeben. Auf dem &ouml;stlichen H&uuml;gel der
Stadt befand sich ein gro&szlig;er Sp&auml;hposten. Die Bewohner der
Stadt hatten den Posten errichtet, da sie aus dem Osten ankommende
Besucher empfangen wollten. Die Leute hatten keine M&ouml;glichkeit,
&uuml;ber das Wasser zu reisen, und dies zwang sie, einfach auf Freund
oder Feind zu warten. Die Zeit verging, und freundlich gesinnte
Besucher brachten Ger&uuml;chte von einem Feind jenseits des Horizonts
mit sich. Die Leute begannen sich zu f&uuml;rchten, doch nichts
geschah. Eines Tages wurde der normalerweise sonnige Himmel dunkel wie
die Nacht, und schwarze Schiffe erschienen am Horizont. Der
Friedensversuch des Sp&auml;hposten wurde abgewiesen, und die Wachen
waren schnell &uuml;berw&auml;ltigt. Dann w&uuml;teten die Schiffe in
der Stadt und zerst&ouml;rten offensichtlich alles und jeden. Nachdem
die Fundamente der Stadt zerst&ouml;rt waren, sank die Stadt tief in
den Ozean, und nur der Sp&auml;hposten blieb. Die schwarzen Schiffe
segelten davon. Der Mann fuhr fort und sagte, acht Leute h&auml;tten
sich versteckt und den Angriff &uuml;berlebt. In den neun Jahren seit
dem Angriff seien zwei &Uuml;berlebende gestorben. Er sagte auch, es
kursiere das Ger&uuml;cht, da&szlig; der Feind zehn Jahre nach dem
Angriff zur&uuml;ckkommen w&uuml;rde, um die vor so langer Zeit
begonnene Zerst&ouml;rung zu vollenden.
</p>
<p>Seit ich die <a href="0806.htm">Geschichte</a> des Mannes geh&ouml;rt habe, habe ich mir
gedacht, da&szlig; es lobenswert w&auml;re, diese Zivilisation zu
retten un dem Zerst&ouml;rungsplan des Feindes Einhalt zu gebieten.
Ich finde dieses Abenteuer, das mich erwartet, aufregend, und ich
hatte einen Geistesblitz, was die Bereitstellung der n&ouml;tigen
Verteidigung f&uuml;r diese Leute betrifft.
</p>
<p>* Ich habe heute die restlichen &Uuml;berlebenden getroffen und
angefangen, an einem Plan zu ihrem Schutz zu arbeiten.
</p>
<p>* Nach kurzer Abwesenheit bin ich mit meinen beiden S&ouml;hnen in
dieses Zeitalter zur&uuml;ckgekehrt. Sie sind bisher nur selten mit
mir gereist und sind verst&auml;ndlicherweise begeistert dar&uuml;ber,
hier zu sein. Sie sind seit Everdunes gewaltig gewachsen, und es ist
mir bereits klar, da&szlig; sie dieses Mal eine gro&szlig;e Hilfe sein
werden und keine Plage wie sie es in der Vergangenheit waren. Wir drei
haben heute zusammen mit vier der &Uuml;berlebenden mit dem Bau
begonnen. Wir bauen auf den Ruinen der alten Stadt, die ein perfektes
Fundament f&uuml;r unsere Festung sein werden.
</p>
<p>* Meine S&ouml;hne haben viel Zeit auf der S&uuml;dinsel
verbracht, wo die meisten meiner Materialien gelagert werden. Ich bin
mit ihrer Intelligenz sehr zufrieden und ihre Kreativit&auml;t ist ein
erfrischender Anblick, da sie an einigen kleinen Projekten alleine
arbeiten.
</p>
<p>* Wir sind nun schon &uuml;ber vier Monate hier, und die
Bauarbeiten gehen gut vonstatten. Meine S&ouml;hne lieben diese Welt,
mit Ausnahme des grauen Himmels. Den verabscheuen sie, und h&auml;ufig
sagen sie mir, sie w&uuml;nschten, der Himmel hier w&auml;re so blau
wie der in Myst.
</p>
<p>* Der alte Mann, mit dem ich zuerst gesprochen habe, erz&auml;hlt
mir, da&szlig; der Feind in vier Monaten kommen soll. Ich f&uuml;hle,
da&szlig; wir bereit sein werden, wenn die Zeit kommt. Der Mann
erinnert mich in vielerlei Hinsicht an Emmit, und ich frage mich oft,
wie es wohl Emmit und seinen Leuten geht.
</p>
<p>* Sechs Monate haben wir gearbeitet, und nun ist die Festung
endlich fertig. Sie ruht zwischen den drei H&uuml;geln, die jetzt
aufgrund des steigenden Wasserspiegels, der nach dem Angriff
aufgetreten ist, nur noch Inseln sind. In der Festung habe ich ein
au&szlig;erordentlich interessantes Ger&auml;t konstruiert; es nutzt
eine Technik, die man Holographie nennt, und mit der ich bei meinen
Besuchen in Aspermere zu experimentieren begonnen habe. Es wird in ein
paar Tagen laufen, nachdem ich ein paar kleine Fehlkalkulationen
ausgeglichen habe. Mit diesem holographischen Ger&auml;t werden die
&Uuml;berlebenden lernen k&ouml;nnen, wie man die Festung benutzt.
</p>
<p>* Der Feind soll bald kommen, und ich glaube fest daran, da&szlig;
die Festung uns allen ausreichenden Schutz bieten wird.
</p>
<p>* Die schwarzen Schiffe sind gekommen. Ihr Angriff war
betr&auml;chtlich. Ihre Waffen wurden aufgehalten und es scheint, sie
haben sich geschlagen angewandt. Ich konnte nicht umhin, zu
l&auml;cheln, als ich den Booten beim Wegfahren zusah.
</p>
<p>* Vergangene Nacht hatten wir eine kleine Feier, bei der die alten
&Uuml;berlebenden die T&auml;nze der Alten tanzten. Meine S&ouml;hne
verstanden nicht, warum der Himmel nicht wieder sein
urspr&uuml;ngliches Blau angenommen hatte. Der alte Mann sagte ihnen,
die St&uuml;rme w&uuml;rden erst aufh&ouml;ren, wenn der Feind
zerst&ouml;rt sei. Ich versicherte meinen S&ouml;hnen, da&szlig; ein
blauer Himmel es nicht wert sei, da&szlig; man sein Leben daf&uuml;r
riskiert, und sie schienen mich zu verstehen. Ich habe ein spannendes
Abenteuer erlebt und mit der Arbeit an einem neuen Buch begonnen.
Wieder mu&szlig; ich ein vertrautes Zeitalter auf der Suche nach einem
neuen Universum, das ich geschaffen habe, verlassen. Doch zuerst werde
ich l&auml;ngere Zeit mit Catherine verbringen, die ich sehr vermisse.
Ich mu&szlig; auch zu den Leuten von der &quot;Flut&quot;
zur&uuml;ckkehren. Ich glaube, ich habe auf meinen Reisen eine
Substanz gefunden, die den Schmerz der Knochenleiden, den sie lange
ertragen mu&szlig;ten, lindert. Ich hoffe, eines Tages ins Mechanische
Zeitalter zur&uuml;ckzukehren und dort eine wachsende Bev&ouml;lkerung
und meine nach wie vor starke Festung vorzufinden. Der Himmel mag zwar
immer schwarz sein, doch ich bin &uuml;berzeugt, da&szlig; den Leuten
hier eine viel dunklere Last abgenommen worden ist.
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/borderli.gif" border=0 width="590" height="18"></p><br>
<p align=center><img src="image/jag.gif" border=0 width="130" height="108"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de">Robert Schaffner</a> (<a href="mailto:webmaster@doitarchive.de">webmaster@doitarchive.de</a>)<br>
Letzte Aktualisierung am 28. Juli 2001</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="profijag.htm"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="07.htm"><img src="udo_up.gif" alt="Jaguar CD-ROM Spiele" border=0 width="24" height="24"></a>
<a href="0701.htm"><img src="udo_lf.gif" alt="Primal Rage" border=0 width="24" height="24"></a>
<a href="0703.htm"><img src="udo_rg.gif" alt="Blue Lightning" border=0 width="24" height="24"></a>
</td></tr></table>
</td></tr>
</table>
</body></html>
