<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Atari ST
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari ST Series Hardware" border=0 width="24" height="24"></a>
<a href="0304.htm" target="UDOcon"><img src="udo_lf.gif" alt="Startprobleme" border=0 width="24" height="24"></a>
<a href="0306.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stacy" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Atari_20ST">3.5 Atari ST</a></h1>
<p><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Eine Pannenhilfe bei kleinen Pannen am ST </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Sollte sich der Atari ab und zu ohne erkennbaren Grund
verabschieden mit Bomben oder selbst&auml;ndigen Reset, so ist es
sinnvoll sich zuerst den Monitorstecker genau anzusehen. Der Monitor
legt den &quot;MonoDetect-Pin&quot; auf einen 0V Pegel(Masse) Ist
diese Steckverbindung nicht mehr optimal, reich oft schon ein wackeln
an dem Tischbein um den Rechner austeigen zu lassen. Meistens
gen&uuml;gt ein LEICHTES verbiegen der Stifte im <a href="0f0b.htm" target="UDOcon">Stecker</a> oder ein
eventuelles Nachl&ouml;ten der gesammten Monitorbuchse im Rechner.
Auch die meist schlechte Befestigung der internen Abschirmbleche (die
sowieso kein Mensch braucht) sind oft ein Grund f&uuml;r diese
bekannten selbstst&auml;ndigen Resets. Man mu&szlig; sie dann entweder
sehr gut befestigen oder einfach gleich ganz entfernen, was auch der
Luftzirkuation im Rechner keinen Abbruch tut, eher wohl das Gegenteil.
Bei den &auml;lteren Modellen 260/520+ kommt es mei&szlig;t nach
langem Dauerbetrieb zu einigen Bildst&ouml;rungen. Man kann diesen
Fehler mit K&auml;ltespray sehr leicht finden, zuerst wird der <a href="080106.htm" target="UDOcon">Shifter</a>
mal eingespr&uuml;ht, verbessern sich die Bildfehler ist der
Unruhestifter schon gefunden. Zur weiteren Abhilfe kann man den 47pF
Kondensator der zwischen Pin 39 des Shifters und Masse liegt,
entfernen und unter umst&auml;nden wieder zwischen Pin 11 und Masse
einl&ouml;ten...
<br>Dazu sind einige Versuche n&ouml;tig.
<br>Danach sollte dann auch bei warmem Rechner ein einwandfreies Bild
zu sehen sein.
<br>
</p>
<p>
<br>
</p>
<p><b> Jetzt mach ich es schneller </b>
<br>
</p>
<p>Da Atari keine eigenen Laufwerke baut, gibt es in den Rechnern
Laufwerke der verschiedensten Hersteller. Meist sind es bei den
&auml;lteren Modellen Epson Laufwerke. Danach gab es Laufwerke von
Chinon und Mitsubishi und &auml;hnlichen krempel,eines haben die
Laufwerke alle gemeinsam:
<br>
</p>
<p>Die Unterschiedliche Drehzahl des Antriebsmotors.
<br>
</p>
<p>Es gibt nat&uuml;rlich noch jede menge Laufwerke anderer
Hersteller die als sogenannte Fremdfloppys an den ST Rechnern
verwendung finden. NEC / TEAC / SONY / BASF usw. Die eigentliche
Drehzahl eines jeden Laufwerkes sollte sich zwischen 299 - 300 - 301
Upm bewegen, jede Abweichung dieser Drehzahl ist ein Griff in's Klo,
insbesondere im Zusammenspiel mit originalen SF314 oder SF345
Diskettenlaufwerken von Atari. Das bedeutet, es kommt dann meist zu
Lesefehlern, oder man kann die Disks von anderen Rechnern einfach
nicht lesen. Es gibt auf dem PD Sektor bereits seit einiger Zeit
Programme mit denen die M&ouml;glichkeit besteht die Drehzahl eines
Laufwerkes zu justieren. Allerdings mu&szlig; dann auf der Platine des
Floppies, das entsprechende Poti gesucht und auch gefunden werden.
Manche Floppys haben auch kein Poti, hier d&uuml;rfen dann
Kondensatoren und Widerst&auml;nde gewechselt werden. Auch das
Scheibenkleister Buch ist eine gro&szlig;e Hilfe. Von jedem Laufwerk
hier eine Beschreibung zu geben w&uuml;rde warscheinlich <a href="02.htm" target="UDOcon">DOIT_ST</a>
sprengen.
<br>
</p>
<p>Anmerkung:
<br>
</p>
<p>Dieses &quot;Justierpoti&quot; gibt es wirklich nicht in allen
Floppys, bei manchen mu&szlig; man ein Kondensatorchen ausl&ouml;ten
und durch einen anderen Wert ersetzten. Ausserdem ist das etwas, wo
man nicht unbedingt seine Finger reinstecken sollte !
<br>
</p>
<p>Ein anderes Problem sind die &quot;Singer&quot;, gemeint sind
einige Modelle des 1040 ST, besonders die &auml;lteren. Da gibt es auf
der Hauptplatine einen Schwingkreis (sch&ouml;nes Wort, gell ?) Das
Teil liegt in der N&auml;he des IC TL 497. Da gibt es einen Widerstand
R17 und die Spule L4 sowie den Kondensator C28. (Das ist der ganze
Krachmacher) R17 wird einfach durch einen 5Ohm - Widerstand ersetzt L4
wird auf 210uH (Microhenry) ge&auml;ndert und C28 wird auf 330 pF
erh&ouml;ht. Schon herrscht traumhafte stille in dem Kasten ! Zu
suchen sind auch nach sogenannten Resonazschwingern, das k&ouml;nnen
Blechteile und sonstwas sein (Netzger&auml;t) lose Dr&auml;hte, die
durch das Laufwerk im Rechner zum schwingen angeregt werden.
<br>
<br>
</p>
<p><b> Schwach auf der Brust ? </b>
<br>
</p>
<p>Manche Netzteile der ST Serie gehen bei der kleinsten
Hardwareerweiterung in die Knie, das ist ausgesprochen schlecht !
Meist &auml;ussert sich das dann mit irgenwelchen Zicken die der
Rechner vorher nicht gemacht hat. Zur Abhilfe k&ouml;nnte man
gen&uuml;gen gro&szlig;e Pufferelkos in das <a href="10.htm" target="UDOcon">Netzteil</a> einl&ouml;ten
(zus&auml;tzlich) da die Belastung des Netzteiles im einschaltmoment
doch ganz erheblich ist. Ein ST mit 4 MB Ram zieht bei +5 Volt ca. 3.2
Amp. Nat&uuml;rlich steht der Verwendung eines Schaltnetzteil nichts
im Wege, vorausgesetzt die Spannungen stimmen.
</p>
<p>Doch Vorsicht mit Basteleien an Netzteilen !!!!
<br>
</p>
<p>Auch das einl&ouml;ten von zus&auml;tzlichen Elkos sollten Leute
machen die die Materie beherrschen
<br>Ein verpolter Elko hat die Wirkung und Reichweite eines
Kanonenschlages!!
<br>Die Dimensionierung k&ouml;nnte bei 4700 uF und 40V liegen.
<br>
</p>
<p>Zu beachten w&auml;hre noch das bei prim&auml;rgetakteten
Netzteilen die Br&uuml;cke f&uuml;r 230V eingel&ouml;tet werden
mu&szlig;. Ansonsten raucht es.
<br>
<br>
</p>
<p><b> Fehler &uuml;ber Fehler </b>
<br>
</p>
<p>Das allerbeste in den ST's sind die IC Fassungen, hier h&auml;tten
ein paar gute Sockel den Preis dieses Rechners wohl kaum in die
H&ouml;he getrieben. Die h&auml;ufigste Fehlerquelle ist das
korridieren der Kontakte, dann mu&szlig; der entsprechende Chip
vorsichtig aus der Fassung gehebelt werden und die (Kontakte) mit
Spiritus, Radiergummi oder auch etwas Alkohol gereinigt werden. Den
Chip am besten im nassen Zustand wieder in die Fassung zur&uuml;ck
stecken, Kontaktspray und Reiniger sind hier weniger gefragt, da ich
feststellen mu&szlig;te das die Fassungen nach kurzer Zeit wieder
vergammelt waren. Alkohol ist nichtleitend, dem Chip macht das auch
nichts aus.
<br>
</p>
<p>Sollte es mal erforderlich sein einen eingel&ouml;teten Chip
wechseln zu m&uuml;ssen sollte man gleich Sockel mit gedrehten Pins
Einl&ouml;ten, die gibt es sogar als Chip-Carrier f&uuml;r die
quadratischen Flundern im Atari ST. Auch das nachtr&auml;gliche
Festdr&uuml;cken oder nachl&ouml;ten einiger Chips hat schon Wunder
bewirkt.
<br>
</p>
<p>Das Ausl&ouml;ten f&auml;ngt man am bestem mit dem Abzwicken aller
Beinchen an, da die Atari Platinen an manchen stellen Empfindlich
gegen Hitze sind, ist der Chip komplett raus saugt man die Beinchen
einfach mit einer L&ouml;tpumpe aus den l&ouml;chern und die Platine
bleibt heil. (Ganz im Gegensatz zu manchen gro&szlig;kotzerten
Hei&szlig;luftl&ouml;tern..)
<br>
</p>
<p>Nat&uuml;rlich ist der Chip dann im Eimer, aber das ist er
meistens sowieso.
<br>
<br>
</p>
<p><b> Black Point's ?? </b>
<br>
</p>
<p>Sie haben schwarze Punkte auf dem Bildschirm ? Das deutet auf
Ramfehler oder auch schon defekte Speicherchips hin. Oder die <a href="080105.htm" target="UDOcon">MMU</a>
spinnt, das sind Fehler die schwer zu lokalisieren sind. Meist ist
kein Bildaufbau mehr da, oder die obere h&auml;lfte Speicher wird
einfach abgeschaltet so das der ST nur noch mit 512 K l&auml;uft. Da
hift meist nur das Testkit, da werden die Testdaten dann seriell auf
einen zweiten Reichner &uuml;bertragen und eben hier dargestellt.
Meist auch mit der Adresse des defekten Chips.
<br>
<br>
</p>
<p><b> No Floppy ?? </b>
<br>
</p>
<p>Sagte das Testmodul, nachdem man verzeifelt alle m&ouml;glichen
Ursachen f&uuml;r das nicht funktionieren der <a href="0b.htm" target="UDOcon">Diskettenlaufwerke</a>
gesucht hatte. Das ist eine Reparatur die im ehemaligen Fachbetrieb so
ca. 300 DM kostete, im Prinzip aber einfach ist. Die erste
M&ouml;glichkeit:
<br>Die Floppys werden noch selektiert und laufen an, rattern aber
irgendwann an den mechanischen Anschlag. Das k&ouml;nnte bedeuten das
der Floppycontroller und der <a href="080109.htm" target="UDOcon">Soundchip</a> noch in Ordnung sind.
<br>
</p>
<p>Das <a href="0903.htm" target="UDOcon">Desktop</a> erscheint sofort, aber ohne Icons.
<br>Rechner einschalten (ohne Diskette) und warten bis die Icons
erscheinen, dann Testen ob die Laufwerke noch formatieren. Wenn das
Formatieren nicht klappt so ist mit Sicherheit ein neuer DMA-Chip
f&auml;llig, mit 100% Sicherheit wenn auch die Harddisk stumm bleibt.
Auch ist es m&ouml;glich das sich der Rechner nach dem Einschalten,
sich so mit 2-30 Bomben meldet.
<br>
</p>
<p>Die zweite M&ouml;glichkeit:
<br>
</p>
<p>Der WD1772 mu&szlig; nicht unbedingt defekt sein! Er hat einen
nachgeschalteten Treiber der TTL-Serie 74LS06. Write Data / Step /
Direction / Motor On / Write Gate / das sind so die Signale die
&uuml;ber diesen Treiberbaustein gejagt werden. Ist der Treiber nun
defekt, fehlen diese Signale ganz oder teilweise machen die
<a href="0b.htm" target="UDOcon">Diskettenlaufwerke</a> nur noch Unsinn. Mit einem Preis von DM 1 ist das
einer der billigsten Chips der durch eine Fehlbeschaltung von
au&szlig;en Zerst&ouml;rt werden kann. Man kann mit einem einfachem
Logiktester dessen Funktion &uuml;berpr&uuml;fen, besser und sicherer
ist allerdings ein Ozilloskop. Durch sch&ouml;ne Kurzschl&uuml;sse am
Floppyport sind meist der Treiber UND der WD1772 f&auml;llig. Das
passiert meistens wenn die Floppystecker der selbstgebauten
Diskettenstationen spiegelverkehrt gel&ouml;tet wurden.
<br>
</p>
<p>Hierzu finden Sie unter <a href="0f0b.htm" target="UDOcon">Stecker</a> die passenden Belegungen
<br>
<br>
</p>
<p>Sollte sich Heraustellen das die Laufwerke nicht richtig
selektiert werden ist eine &Uuml;berpr&uuml;fung des Soundchips YM
2149 unumg&auml;nglich. Die Signale Drive 1 Select / Drive 0 Select /
Side 0 Select werden direkt und ohne Treiber vom <a href="080109.htm" target="UDOcon">Soundchip</a> verwaltet.
Die Pin Read Data / Index / Write Protect / Track 00 / liegen ohne
Treiber wiederum direkt am WD1772. Ich wei&szlig; das das sehr seltsam
ist, aber das haben sich andere Leute ausgedacht.
<br>
</p>
<p>Man mu&szlig; dann schon mal genau messen, was wann wo passiert.
Meist ist es aber der DMA oder der WD und/oder dessen Treiber. Die
schnellste Methode ist einfach erst mal den Treiber ausl&ouml;ten,
einen Sockel drunter und mit einem frischen Chip testen. Wer oft die
Floppystecker wechselt (Ein oder Austeckt) kann zudem auch noch mit
diversen kalten L&ouml;tstellen an den Steckverbindern rechnen.
<br>
<br>
</p>
<p><b> Druck auf allen Schl&auml;uchen </b>
<br>
</p>
<p>Der Drucker macht keinerlei Anstalten zu Drucken? Japanischer
Schei&szlig;dreck :-&gt;
<br>
</p>
<p>Die komplette Centronics-Schnittstelle wird vom <a href="080109.htm" target="UDOcon">Soundchip</a> YM 2149
betrieben, so das eine &Uuml;berlastung an dieser durch alte Drucker
direkt zur Zerst&ouml;rung f&uuml;hren kann. Die meisten &auml;lteren
Drucker belasten diese Schnittstelle durch ihre internen Pullup
Widerst&auml;nde so, das ein erh&ouml;hter Strom flie&szlig;t der dann
den Port B des <a href="080109.htm" target="UDOcon">Soundchip</a>'s zerbr&ouml;seln l&auml;sst. Abhilfe kann
man durch eine extern aufzubauende Treiberstufe schaffen, die alle
Signale der Centronics-Schnittstelle entsprechend verst&auml;rkt.Oder
man l&ouml;tet die internen Pullup's des Druckers raus und Ersetzt
diese entsprechend gr&ouml;&szlig;ere Widerstandsarrays. Normal
w&auml;hre ein Wert so um die 3,3 KOhm, alles was kleiner ist Belastet
die Portleitungen!
<br>
</p>
<p>Da der <a href="080109.htm" target="UDOcon">Soundchip</a> meist nicht gesockelt ist, fallen auch hier
einige L&ouml;tarbeiten an.
<br>
<br>
</p>
<p><b> Verschiedene kleinere Hardwaredefekte der ST Serie </b>
<br>
</p>
<dl>
<dt><b>Verschiedene schwarze P&uuml;nktchen auf dem Bildschirm</b></dt><dd> Ursache:
<br>Eventuell Ramfehler
<br>Beseitigung:
<br>Mit dem Atari Testkit (ab V3.3) wird warscheinlich ein
<br>Ramfehler U19 Bit Nr.5 in der Bank 0 angezeigt
<br>Die Profis schreiben ein Basicprogramm mit dem sich die einzelnen
<br>Bit's direkt austesten lassen
<br>
<br>&nbsp;
<br>Abhilfe:
<br>U19 defekt, Baustein austauschen
<br>
<br>&nbsp;
<dt><b>Bild l&auml;uft durch und die Floppylaufwerke werden nicht mehr angesprochen</b></dt><dd> Meistens bei System 260/520
<br>Ursache:
<br>Zu 90% Baustein U35 defekt
<br>Beseitigung:
<br>Nur Komplett austauschen
<br>
<br>&nbsp;
<dt><b>Bildschirm ist komplett mit der Farbe rot,gr&uuml;n oder blau gef&uuml;llt</b></dt><dd> Beseitigung:
<br>J9 Anschlu&szlig;buchse &uuml;berpr&uuml;fen und eventuell
Kontakte nachl&ouml;ten
<br>Nicht 1040 u. Mega
<br>
<br>&nbsp;
<dt><b>Wei&szlig;e Punkte auf dem Bildschirm (Mono/Color) beim Mega ST</b></dt><dd> Ursache:
<br>Warscheinlich thermische fehler an den Bustreibern 74LS244
oder/und 74LS373
<br>Rambausteine nicht richtig in den Sockeln
<br>Abhilfe:
<br>Treiberbausteine mit K&auml;ltespray untersuchen
<br>Beseitigung:
<br>Bausteine auswechseln / Ram's in die Sockel dr&uuml;cken
<br>
<br>&nbsp;
<dt><b>Nach dem Einschalten des Computers sind auf dem Monitor R&uuml;cklaufstreifen zu sehen (SM124)</b></dt><dd> Ursache:
<br>Meistens ist der Widerstand R727 hochohmig geworden
<br>Beseitigung:
<br>R727 gegen einen Widerstand von 560Kohm austauschen.
<br>Kleine &Auml;nderung der Grundhelligkeit an Poti VR702 (Sub-Right)
<br>
<br>&nbsp;
<dt><b>Das Bild auf dem SM 124 ist nur noch halb so hoch wie normal,wirkt aber wesentlich breiter</b></dt><dd> Ursache:
<br>+12V Stromversorgung eventuell defekt / ungenau
<br>Beseitigung:
<br>IC 901 und Q 901 &uuml;berpr&uuml;fen und eventuell austauschen.
<br>+12V mit DMM &uuml;berpr&uuml;fen Toleranz +/- 15%
<br>
<br>&nbsp;
<dt><b>Helligkeit l&auml;&szlig;t sich nicht mehr aufregeln (SM124)</b></dt><dd> Beseitigung:
<br>Transistor Q303 im Videoteil &uuml;berpr&uuml;fen / austauschen
<br>An den Spannungsteilern sollten zu messen sein
<br>R310 = 8V R302 = 3.6V
<br>
<br>&nbsp;
<dt><b>Nach einiger Zeit bringt der Computer kein richtiges Bild</b></dt><dd> Ursache:
<br>Treiber in der V-Sync. leitung &uuml;berpr&uuml;fen (74LS04) und
<a href="080106.htm" target="UDOcon">Shifter</a> testen
<br>Beseitigung:
<br>Die Bausteine mit K&auml;ltespray &uuml;berpr&uuml;fen, zuvor aber
den Monitor!
<br>
<br>&nbsp;
<dt><b>Nach Anschlu&szlig; einer Harddisk oder eines Laserdruckers st&uuml;rzt das System ab</b></dt><dd> Ursache:
<br>Das Reset-Signal wird im ST mit hilfe eines NE 556 bzw. TL 7705
erzeugt und
<br>&uuml;ber Treiber an die Bausteine und die externen
Anschl&uuml;sse geleitet. (DMA-Port)
<br>Beseitigung:
<br>Einbau eines kleinen Leitungsfilter in Pin 12 des HD-Port
<br>Es k&ouml;nnen St&ouml;rspitzen &uuml;ber die Kabel zur&uuml;ck in
den Rechner
<br>gelangen, dadurch erzeugt die Hardware undefinierte Reset-Signale
<br>die zu den St&ouml;rungen f&uuml;hren. Tritt h&auml;ufig bei zu
langen DMA-Kabeln auf
<br>Bei SH 205 eventuell ein Ausfall des Reset-Eingangs (47LS123)
<br>
<br>&nbsp;
<dt><b>Bildschirm bleibt immer dunkel</b></dt><dd> Ursache:
<br>Treiberbaustein 74LS04 defekt. (7404 bei Mega ST) und
Midi-Benutzern
<br>Beseitigung:
<br>Mal an den Reset- und Halt- Eing&auml;ngen des Prozessors messen
<br>Normal sind hier 0 oder 5V. Liegen die Spannungen zwischen diesen
Werten
<br>so ist der Treiber 100% defekt. Dieser Treiberbaustein bedient
auch die
<br>Midi-Out Leitung.
<br>
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari ST Series Hardware" border=0 width="24" height="24"></a>
<a href="0304.htm" target="UDOcon"><img src="udo_lf.gif" alt="Startprobleme" border=0 width="24" height="24"></a>
<a href="0306.htm" target="UDOcon"><img src="udo_rg.gif" alt="Stacy" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
