<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Artifex TOS Karte
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari TOS" border=0 width="24" height="24"></a>
<a href="090a.htm" target="UDOcon"><img src="udo_lf.gif" alt="TOS Card 2.06" border=0 width="24" height="24"></a>
<a href="090c.htm" target="UDOcon"><img src="udo_rg.gif" alt="TOS 2.06 Hack" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Artifex_20TOS_20Karte">9.11 Artifex TOS Karte</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Artifex TOS 2.06 Karte f&uuml;r ST, MegaST </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Zum Lieferumfang der TOS Extension Card geh&ouml;ren folgende
Teile:
<br>
</p>
<p>* die TOS Extension Card inklusive TOS206 ROMs/EPROMs
<br>* eine Diskette mit Kontrollfeld Xcontrol
<br>- SetSeek, einem Programm zur Einstellung der Steprate des
Diskettenlaufwerks
<br>- GEMKey zum einfachen Editieren der Tastatursteuerung des <a href="0903.htm" target="UDOcon">Desktop</a>
<br>- DESKICON RSC-Datei mit neuen Icons
<br>- NoRoach (von Atari Corp), das die Wartezeit beim Booten des
Rechners verk&uuml;rzt
<br>
</p>
<p>
<br>
<br><b> Einbau-Vorbereitungen </b>
<br>
</p>
<p>Der weitere Einbau h&auml;ngt nun von dem verwendeten Typ der TOS
Extension Card CLASSIC, <a href="080108.htm" target="UDOcon">CPU</a> oder MEGA) ab und nat&uuml;rlich welchen
Rechner Sie besitzen. Beachten Sie bitte das der Einbau dieser Karte
je nach Rechnertyp erfolgt.
<br>
</p>
<p>
<br><b> TEC CLASSIC </b>
</p>
<p>Beim Einbau der TOS Extension Card CLASSIC bieten sich prinzipiell
vier Alternativen:
<br>
</p>
<p>Direktes Anl&ouml;ten der Leitungen an die <a href="080108.htm" target="UDOcon">CPU</a>. Dieser Einbau
sollte nur erfolgen, wenn keine der drei anderen M&ouml;glichleiten
verwendbar ist. In Mega STs (und nur dort) kann bei freiem Systembus
die TEC CLASSlC &uuml;ber einen Systembus-<a href="0f0b.htm" target="UDOcon">Stecker</a> oder &uuml;ber die
TECbridge BUS eingebaut werden. Den Weg &uuml;ber Die <a href="080108.htm" target="UDOcon">CPU</a> geht die
letzte Einbaum&ouml;glichkeit mit Hilfe der TECbriDge <a href="080108.htm" target="UDOcon">CPU</a>.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/260520.gif" border=0 width="559" height="397"></p><br>
<div align=center><tt> Abbildung 1 - ROM-Sockel im 260/520 ST </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br><b> Anl&ouml;ten an die <a href="080108.htm" target="UDOcon">CPU</a> </b>
<br>
</p>
<p>Der einfachste Einbau besteht im Anl&ouml;ten der bereits
abisolierten und verzinnten freien Enden des Flachbandkabels an die
entsprechenden Pins der 68000 <a href="080108.htm" target="UDOcon">CPU</a>. Sollte auf die <a href="080108.htm" target="UDOcon">CPU</a> bereits ein
Sockel aufgel&ouml;tet sein, so k&ouml;nnen Sie die entsprechenden
Leitungen selbstverst&auml;ndlich auch dort seitlich anl&ouml;ten. Die
<a href="080108.htm" target="UDOcon">CPU</a>-Pins, welche belegt werden, sollten Sie vorher verzinnen. Die
Zuordnung der Dr&auml;hte zu den <a href="080108.htm" target="UDOcon">CPU</a>-Pin-Nummern entnehmen Sie bitte
aus der Tabell von weiter unten
<br>
</p>
<p>
<br><b> MegaST Systembus-<a href="0f0b.htm" target="UDOcon">Stecker</a> </b>
<br>
</p>
<p>Im MegaST, mit einem nicht benutzten Systembus-<a href="0f0b.htm" target="UDOcon">Stecker</a>, kann hier
eine Federleiste, gem&auml;&szlig; DIN 41612, Bauform B 64-pol benutzt
werden um die Leitungen de TEC mit dem Bus zu verbinden. Sie erhalten
dann dabei eine voll steckbare Erweiterung.
</p>
<p>Die Pinnummern der Federleiste finden Sie in der Tabelle von
weiter unten.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/mste.gif" border=0 width="456" height="306"></p><br>
<div align=center><tt> Abbildung 2 - ROM-Sockel im Mega ST </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br><b> TECbridge <a href="080108.htm" target="UDOcon">CPU</a> </b>
<br>
</p>
<p>Die TECbridge <a href="080108.htm" target="UDOcon">CPU</a> ist ein speziell f&uuml;r die TOS Extension Card
hergestellter Adapter welcher einen l&ouml;tfreien Einbau der TOS
Extension Card in Rechnern erm&ouml;glicht, bei denen die <a href="080108.htm" target="UDOcon">CPU</a>
gesockelt oder bereits ein Sockel auf die <a href="080108.htm" target="UDOcon">CPU</a> aufgel&ouml;tet ist.
Weitere VoraUssetzung ist dabei nur, da&szlig; &uuml;ber der <a href="080108.htm" target="UDOcon">CPU</a> im
Geh&auml;use noch ausreichend PIatz ist.
<br>
</p>
<p>Bevor Sie die TOS Extension Card mit der TECbridge <a href="080108.htm" target="UDOcon">CPU</a> einbauen,
m&uuml;ssen Sie die beiden Teile vorher zusammenf&uuml;gen. Das
geschieht durch das Aufquetschen des freien Flachbandkabels auf die
Quetschleiste derTECbridge <a href="080108.htm" target="UDOcon">CPU</a>. Zuvor m&uuml;ssen Sie jedoch den
aufgetrennten, abisolierten und verzinnten Teil des freien
Flachbandkabels abtrennen. Benutzen Sie dazu eine gew&ouml;hnliche
Papierschere und achten Sie auf eine saubere und gerade Schnittstelle.
</p>
<p>Legen Sie dann die TECbridge so vor sich auf die
Arbeitsfl&auml;che' da&szlig; der Schriftzug TECbridge links unten
lesbar ist. Die TOS Extension Card legen Sie mit den Bauteilen nach
unten auf die Arbeitsfl&auml;che so da&szlig; der freie Teil des
Flachbandkabels auf der rechten Seite liegt. Legen Sie das freie
Flachbandkabel nun linksb&uuml;ndig an der Quetschleiste auf der
TECbridge an.
</p>
<p>Das wei&szlig;e Kabel liegt also in Richtung der Beschriftung
TECbridge. Auf der rechten Seite des Quetschverbinders bleiben bei
korrekter Befestigung vier Kontakte frei.
</p>
<p>Die Kombination aus TOS Extension Card und TECbridge <a href="080108.htm" target="UDOcon">CPU</a> kann nun
in den Rechner eingebaut werden. Dazu entfernen Sie die <a href="080108.htm" target="UDOcon">CPU</a> bzw.
entsprechende Aufs&auml;tze auf der <a href="080108.htm" target="UDOcon">CPU</a> vorsichtig und setzen Sie die
TECbridge <a href="080108.htm" target="UDOcon">CPU</a> in den freien Sockel ein. Die korrekte Ausrichtung
erkennen Sie dabei daran das bei links sitzender IC-Kerbe die Bridge
und damit auch das Flachbandkabel in ihre Richtung zeigt. Die <a href="080108.htm" target="UDOcon">CPU</a> bzw.
die zuvor aus dem Sockel entfernte Erweiterung setzen Sie nun auf den
freien <a href="080108.htm" target="UDOcon">CPU</a>-Sockel der TECbridge <a href="080108.htm" target="UDOcon">CPU</a>, wobei Sie auch wieder die
korrekte Ausrichtung ahhand der Kerbe bzw. der Ausrichtung der Bridge
beachten sollten.
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/1040st.gif" border=0 width="496" height="500"></p><br>
<div align=center><tt> Abbildung 3 - ROM-Sockel 1040 A </tt>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p align=center><img src="image/1040bst.gif" border=0 width="400" height="400"></p><br>
<div align=center><tt> Abbildung 4 - ROM-Sockel 1040 B </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p>
<br>
</p>
<div align=center><table border=1 frame=box>
<caption align=bottom>Tabelle 58: Alle Pinbelegungen zum Einbau der TEC</caption>
<tr>
  <td align=left valign=top>Kabel Nr.</td>
  <td align=left valign=top>Farbe</td>
  <td align=left valign=top>Funktion</td>
  <td align=left valign=top><a href="080108.htm" target="UDOcon">CPU</a> Pin-Nr.</td>
  <td align=left valign=top><a href="030b.htm" target="UDOcon">MegaST Bus</a> Pin-Nr.</td>
</tr>
<tr>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
  <td align=left valign=top></td>
</tr>
<tr>
  <td align=left valign=top>1</td>
  <td align=left valign=top>schwarz</td>
  <td align=left valign=top>A16</td>
  <td align=left valign=top>44</td>
  <td align=left valign=top>a21</td>
</tr>
<tr>
  <td align=left valign=top>2</td>
  <td align=left valign=top>wei&szlig;</td>
  <td align=left valign=top>GND</td>
  <td align=left valign=top>53</td>
  <td align=left valign=top>a12</td>
</tr>
<tr>
  <td align=left valign=top>3</td>
  <td align=left valign=top>grau</td>
  <td align=left valign=top>A18</td>
  <td align=left valign=top>46</td>
  <td align=left valign=top>a19</td>
</tr>
<tr>
  <td align=left valign=top>4</td>
  <td align=left valign=top>violett</td>
  <td align=left valign=top>A17</td>
  <td align=left valign=top>45</td>
  <td align=left valign=top>a20</td>
</tr>
<tr>
  <td align=left valign=top>5</td>
  <td align=left valign=top>blau</td>
  <td align=left valign=top>RW</td>
  <td align=left valign=top>9</td>
  <td align=left valign=top>b9</td>
</tr>
<tr>
  <td align=left valign=top>6</td>
  <td align=left valign=top>gr&uuml;n</td>
  <td align=left valign=top>A23</td>
  <td align=left valign=top>52</td>
  <td align=left valign=top>a13</td>
</tr>
<tr>
  <td align=left valign=top>7</td>
  <td align=left valign=top>gelb</td>
  <td align=left valign=top>UDS</td>
  <td align=left valign=top>7</td>
  <td align=left valign=top>b7</td>
</tr>
<tr>
  <td align=left valign=top>8</td>
  <td align=left valign=top>orange</td>
  <td align=left valign=top>AS</td>
  <td align=left valign=top>6</td>
  <td align=left valign=top>b6</td>
</tr>
<tr>
  <td align=left valign=top>9</td>
  <td align=left valign=top>rot</td>
  <td align=left valign=top>A22</td>
  <td align=left valign=top>51</td>
  <td align=left valign=top>a14</td>
</tr>
<tr>
  <td align=left valign=top>10</td>
  <td align=left valign=top>braun</td>
  <td align=left valign=top>LDS</td>
  <td align=left valign=top>8</td>
  <td align=left valign=top>b8</td>
</tr>
<tr>
  <td align=left valign=top>11</td>
  <td align=left valign=top>schwarz</td>
  <td align=left valign=top>A20</td>
  <td align=left valign=top>48</td>
  <td align=left valign=top>a17</td>
</tr>
<tr>
  <td align=left valign=top>12</td>
  <td align=left valign=top>wei&szlig;</td>
  <td align=left valign=top>A21</td>
  <td align=left valign=top>50</td>
  <td align=left valign=top>a15</td>
</tr>
<tr>
  <td align=left valign=top>13</td>
  <td align=left valign=top>grau</td>
  <td align=left valign=top>DTACK</td>
  <td align=left valign=top>10</td>
  <td align=left valign=top>b10</td>
</tr>
<tr>
  <td align=left valign=top>14</td>
  <td align=left valign=top>violett</td>
  <td align=left valign=top>A 19</td>
  <td align=left valign=top>47</td>
  <td align=left valign=top>a18</td>
</tr>
<tr>
  <td align=left valign=top>15</td>
  <td align=left valign=top>blau</td>
  <td align=left valign=top>D4</td>
  <td align=left valign=top>1</td>
  <td align=left valign=top>b1</td>
</tr>
<tr>
  <td align=left valign=top>16</td>
  <td align=left valign=top>gr&uuml;n</td>
  <td align=left valign=top>D3</td>
  <td align=left valign=top>2</td>
  <td align=left valign=top>b2</td>
</tr>
<tr>
  <td align=left valign=top>17</td>
  <td align=left valign=top>gelb</td>
  <td align=left valign=top>D6</td>
  <td align=left valign=top>63</td>
  <td align=left valign=top>a2</td>
</tr>
<tr>
  <td align=left valign=top>18</td>
  <td align=left valign=top>orange</td>
  <td align=left valign=top>D5</td>
  <td align=left valign=top>64</td>
  <td align=left valign=top>a1</td>
</tr>
<tr>
  <td align=left valign=top>19</td>
  <td align=left valign=top>rot</td>
  <td align=left valign=top>D0</td>
  <td align=left valign=top>5</td>
  <td align=left valign=top>b5</td>
</tr>
<tr>
  <td align=left valign=top>20</td>
  <td align=left valign=top>braun</td>
  <td align=left valign=top>D7</td>
  <td align=left valign=top>62</td>
  <td align=left valign=top>a3</td>
</tr>
<tr>
  <td align=left valign=top>21</td>
  <td align=left valign=top>schwarz</td>
  <td align=left valign=top>D2</td>
  <td align=left valign=top>3</td>
  <td align=left valign=top>b3</td>
</tr>
<tr>
  <td align=left valign=top>22</td>
  <td align=left valign=top>wei&szlig;</td>
  <td align=left valign=top>D1</td>
  <td align=left valign=top>4</td>
  <td align=left valign=top>b4</td>
</tr>
</table></div>

<p>
<br>
<br>
</p>
<p><b> Anmerkung:</b> Die Kabel Nr. 23 bis 50 gehen auf den
DIL-<a href="0f0b.htm" target="UDOcon">Stecker</a>, der - wie beschrieben - in den ROM-Sockel eingesteckt
wird (Kabel 23=grau=GND=Pin 14. Kabel 50=braun=Vcc=Pin 28).
</p>
<p>
<br><b> TECbridge BUS </b>
<br>&Auml;hnlich wie die TECbridge <a href="080108.htm" target="UDOcon">CPU</a> dient auch die TECbridge BUS
zum Einbau der TOS Extension Card ohne L&ouml;tarbeiten. Die TECbriDge
BUS greift dabei auf den Systembus des Mega ST zu welcher noch nicht
durch andere Erweiterungen belegt ist. Die TECbridge BUS mu&szlig; vor
dem Einbau mit der TOS Extension Card durch Anquetschen des freien
Flachbandkabels verbunden werden. Legen Sie dann die TECbridge so vor
sich auf die Arbeitsfl&auml;che' da&szlig; der Schriftzug TECbridge
links unten lesbar ist. Die TOS Extension Card legen Sie mit den
Bauteilen nach unten auf die Arbeitsfl&auml;che so da&szlig; der freie
Teil des Flachbandkabels auf der rechten Seite liegt. Legen Sie das
freie Flachbandkabel nun linksb&uuml;ndig an der Quetschleiste auf der
TECbridge an. Das wei&szlig;e Kabel liegt also in Richtung der
Beschriftung TECbridge. Auf der rechten Seite des Quetschverbinders
bleiben bei korrekter Befestigung vier Kontakte frei.
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tec.gif" border=0 width="500" height="500"></p><br>
<div align=center><tt> Abbildung 5 - TEC Karte </tt>
</div>
<p>
<br>
<br>
<br>
<br>
</p>
<p><b> Der Einbau allgemein </b>
<br>
</p>
<p>Nachdem Sie nun den Kontakt zur <a href="080108.htm" target="UDOcon">CPU</a> bzw. zum Systembus hergestellt
haben, stecken Sie den Flachbandkabel-<a href="0f0b.htm" target="UDOcon">Stecker</a> in den vorgesehenen
ROM-Sockel, der in der ihrem Rechnertyp entsprechenden Abbildung
markiert ist. Es handelt sich dabei bei allen Rechnermodellen um den
Sockel f&uuml;r das erste HIGH-Byte-ROM. Die Bezeichnung beim MegaST
f&uuml;r dieses IC ist ,U9&quot; bei den anderen Rechnern 'U4,. Die
Abgangsrichtung des Flachbandkabels entnehmen Sie bitte der zu ihrem
Rechnertyp geh&ouml;renden Abbildung. Achten Sie darauf, da&szlig; Sie
den <a href="0f0b.htm" target="UDOcon">Stecker</a> gleichm&auml;&szlig;ig und mit nicht zuviel Kraftaufwand
bis unten eindr&uuml;cken k&ouml;nnen. Es d&uuml;rfen sich dabei keine
Beinchen verbiegen! Kontrollieren Sie den <a href="0f0b.htm" target="UDOcon">Stecker</a> auf korrekten Sitz,
vor allem bei den Ausf&uuml;hrungen des 1040 ST, wo der Romsockel
unter dem <a href="10.htm" target="UDOcon">Netzteil</a> sitzt. W&auml;hlen Sie nun einen geeigneten Platz
in lhrem Rechner f&uuml;r die Platine und fixieren Sie diese dort mit
dem einem Klebestreifen. Die Flachbandkabel sollte man dabei flach
verlegen und falls n&ouml;tig auch im 45-Grad-Winkel knicken. Achten
Sie genau darauf, da&szlig; es nicht zu Kurzschl&uuml;ssen zwischen
der Platine und anderen Bausteinen kommt. Auch sollte von
Geh&auml;useteilen oder der Hauptplatine kein Druck auf die TOS
Extension Card ausge&uuml;bt werden.
</p>
<p>
<br>
<br><b> TOS 2.06 und 1.0x umschaltbar </b>
<br>
</p>
<p>Mit etwas Bastelaufwand k&ouml;nnen Sie die TOS Extension Card
CLASSIC auch so einbauen, da&szlig; Sie eine alte TOS-Version 1.00,
1.02 oder 1.04 umschaltbar benutzen k&ouml;nnen.
<br>Sie ben&ouml;tigen dazu folgendes Material:
<br>
</p>
<p>
<br>* 2 x 10 kOhm Widerst&auml;nde
<br>* 1 x 47 kOhm Widerstand
<br>* 1 x 28-poligen DIL-Sockel (Doppelfeder, nicht gedreht!)
<br>* 1 x Zweifach-Umschalter
<br>* ca. 60 cm Elektroniklitze.
<br>
<br>
</p>
<p>Den prinzipiellen Aufbau der Schaltung sehen sie in der Abbildung
unten. ln der Praxis gehen Sie wie folgt vor:
<br>
</p>
<p>Statt alle ROM-Bausteine zu entfernen, belassen Sie diese in ihren
Sockeln. Lediglich die beiden ROMs in den Sockeln U4 / U9 / HI0 und U7
/ U10 / LO0 entfernen Sie vor&uuml;bergehend aus ihren Sockeln.
L&ouml;ten oder stecken Sie nun in einen der beiden frei gewordenen
ROM-Sockel an Pin 20 ein Kabel. Das lang genug ist, um bis zur
sp&auml;teren Einbauposition des Schalters zu reichen. Biegen Sie dann
von den gerade entfernten ROM-Bausteinen jeweils Pin 20 auf
waagerechte Position nach oben und setzen Sie die ROMs wieder ein.
Auch bei dem 28-poligen DlL-Sockel biegen Sie nun Pin 20 waagerecht
nach oben. Nun setzen Sie den DIL-Sockel auf das in der
Einbauanleitung bezeichnete ROM auf und l&ouml;ten ihn fest. Im
Endergebnis sitzt nun im gekennzeichneten High-Byte-Sockel U9 / U4/
HI0 das ROM und darauf ein Sockel, wobei jeweils Pin 20 hochgebogen
ist. Beim Anl&ouml;ten der von der TOS Extension Card kommenden
Leitungen an die <a href="080108.htm" target="UDOcon">CPU</a> gehen Sie wie beschrieben vor. Lediglich jenes
Kabel (orange), das normalerweise an Pin 6 der <a href="080108.htm" target="UDOcon">CPU</a> gel&ouml;tet
w&uuml;rde, l&ouml;ten Sie nicht dort an. Die weitere Verdrahtung
entnehmen Sie bitte dem <a href="190d.htm" target="UDOcon">Schaltplan</a>. Zwei Tips noch zum Schlu&szlig;:
Die Widerst&auml;nde l&ouml;tet man am besten direkt an den Schalter
an. Die Versorgungsspannung von +5V greifen Sie am besten von Pin 28
des ROM-Sockel ab.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tec1.gif" border=0 width="656" height="447"></p><br>
<div align=center><tt> Abbildung 6 - ROM-Umschaltung mit der TEC </tt>
</div>
<p>
<br>
<br>
</p>
<p>
<br><b> TEC <a href="080108.htm" target="UDOcon">CPU</a> </b>
<br>
</p>
<p>Zum Einbau der TOS Extension Card <a href="080108.htm" target="UDOcon">CPU</a> ben&ouml;tigen Sie einen auf
die <a href="080108.htm" target="UDOcon">CPU</a> aufgel&ouml;teten Sockel bzw. eine gesockelte <a href="080108.htm" target="UDOcon">CPU</a>; sollte eine
derartige Modifikation in Ihrem Rechner noch nicht vorgenommen sein,
so I&ouml;ten Sie im ersten Arbeitsschritt einen 64-poligen, Sockel
mit gedrehten Pins auf die <a href="080108.htm" target="UDOcon">CPU</a>. Auf diesen Sockel (und ggf. unter
andere Erweiterungen) stecken Sie nun die TEC <a href="080108.htm" target="UDOcon">CPU</a>, wobei sich die
Ausrichtung anhand der Kerbe der <a href="080108.htm" target="UDOcon">CPU</a> ergibt:
<br>
</p>
<p>Die 'Kerbe, der TEC <a href="080108.htm" target="UDOcon">CPU</a> liegt auf der linken Seite, wenn Sie die
Karte so vor sich legen, da&szlig; die EPROMs zu ihnen hin zeigen. Das
von derTEC <a href="080108.htm" target="UDOcon">CPU</a> kommende Kabel wird in nun in Pin 20 des ROM-Sockels
gesteckt.
<br>
</p>
<p>
<br><b> TEC MEGA </b>
<br>
</p>
<p>Die TOS Extension Card MEGA wird in den freien Systembus eines
Mega ST eingesteckt, so da&szlig; die Karte nach hinten (also von der
<a href="080108.htm" target="UDOcon">CPU</a> weg) zeigt. Die wei&szlig;e, von der TEC MEGA kommende Leitung
wird in Pin 20 des ROM-Sockels gesteckt. Das rote Kabel, die
Versorungsspannung, wird in Pin 28 des genannten ROM-Sockel gesteckt.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="09.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari TOS" border=0 width="24" height="24"></a>
<a href="090a.htm" target="UDOcon"><img src="udo_lf.gif" alt="TOS Card 2.06" border=0 width="24" height="24"></a>
<a href="090c.htm" target="UDOcon"><img src="udo_rg.gif" alt="TOS 2.06 Hack" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
