<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Ein Diskettenlaufwerk
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b01.htm" target="UDOcon"><img src="udo_up.gif" alt="Diskettenlaufwerke am Atari ST" border=0 width="24" height="24"></a>
<a href="0b01.htm" target="UDOcon"><img src="udo_lf.gif" alt="Diskettenlaufwerke am Atari ST" border=0 width="24" height="24"></a>
<a href="0b0102.htm" target="UDOcon"><img src="udo_rg.gif" alt="Floppy Signals" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Ein_20Diskettenlaufwerk">11.1.1 Ein Diskettenlaufwerk</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Ein Diskettenlaufwerk am <a href="0305.htm" target="UDOcon">Atari ST</a> </tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Floppy-Disk-Laufwerke von ATARI waren relativ teuer, heute wohl
kaum noch Neuwertig zu beziehen. Dabei ist es relativ einfach,
Laufwerke anderer Hersteller an die ST Computer anzuschliessen,
solange sie einen SHUGART-Kompatiblen Anschluss aufweisen.
<br>
</p>
<p>Man braucht dazu lediglich ein passendes Kabel, ein <a href="10.htm" target="UDOcon">Netzteil</a> und
ein passendes Geh&auml;use. Das Geh&auml;use kann man sich noch meist
noch selber anfertigen, es fehlt dann noch das <a href="10.htm" target="UDOcon">Netzteil</a> und ein
Floppkabel.
<br>
</p>
<p>Deshalb greifen viele ST-Besitzer auf fertige, von Firmen
angebotene Laufwerke zur&uuml;ck. Daf&uuml;r mu&szlig; man jedoch
deutlich tiefer in die Tasche greifen, als bei einem selbstgebautem
Laufwerk.
<br>
</p>
<p>Deshalb soll hier eine L&ouml;sung gezeigt werden die eigentlich
jeden, der schon mal einen L&ouml;tkolben in der Hand gehabt hat, dazu
bringt sich f&uuml;r unter 100.- selbst ein 720Kbyte Zweitlaufwerk
anzuschlie&szlig;en.
<br>
<br>
</p>
<p>F&uuml;r einen Selbstbau sollte man sich folgende Teile besorgen:
<br>
</p>
<p>Ein NEC-FD 1037 A /1036 / 1035 Laufwerk
<br>Einen 34 pol. doppelreihigen Pfostenstecker (Schneidklemmtechnik)
<br>1 Meter 34 pol. Flachbahnkabel
<br>Einen 14 pol. DIN-<a href="0f0b.htm" target="UDOcon">Stecker</a> wie er bereits bei Conrad angeboten
wird.
<br>Ein kleines, geregeltes 5 Volt-<a href="10.htm" target="UDOcon">Netzteil</a>
<br>oder ein 7,5 Volt-Steckernetzteil (500 mA), sowie
<br>einen 7805-Spannungsregler und
<br>einen 470 mF-Kondensator (16 V)
<br>Einen 100 nF-Kondensator und
<br>eine Standard-Diode (z.B. 1N4001)
<br>Einen 4 pol. Pfostenstecker (einreihig) f&uuml;r den
<br>Spannungsanschluss am Laufwerk
<br>Evtl. Ein-/Aus-Schalter
<br>
<br>
</p>
<p>Wird ein NEC-FD 1037 A verwendet, das mit nur einer Spannung von
+5 Volt auskommt, entfallen die sonst &uuml;blichen +12 Volt. Die
Versorgungsspannung sollte schon recht stabil anliegen (max +- 0,25
Volt). Sie haben eine extrem niedrige Stromaufnahme haben
(Dauerlast/Read 300 mA). Ein kleines 5 Volt-<a href="10.htm" target="UDOcon">Netzteil</a> mit geregelter
Ausgangsspannung w&auml;hre ideal.
<br>
</p>
<p>Es bleibt auch noch die M&ouml;glichkeit, ein einfaches
Steckernetzteil von mindestens 7,5 Volt Gleichspannung zu benutzen und
eine kleine Regelungsschaltung (7805) in das Steckernetzteil
einzubauen. Zu hoch sollte die Ausgangsspannung des Steckernetzteiles
auch nicht sein, damit der Regler nicht zu hei&szlig; wird,eine
Spannung von +12 Volt (Regler mit Kuehlblech verwenden) stellt die
Obergrenze dar. Das <a href="10.htm" target="UDOcon">Netzteil</a> sollte mindestens einen Strom von 500mA
liefern k&ouml;nnen.
<br>
</p>
<p>Der Anschluss der Stromversorgung an das NEC-Laufwerk geschieht
&uuml;ber einen 4 pol. Pfostenstecker,den man sich, sollte er schwer
zu be- schaffen sein, auch aus einem alten Doppelpfostenstecker
mittels eines Seitenschneiders herausschneiden kann, wobei dann
allerdings die Gefahr besteht, den <a href="0f0b.htm" target="UDOcon">Stecker</a> falsch aufzustecken.
<br>
</p>
<p>Flexibel und handlich sind f&uuml;r den Anschluss an den Rechner
nat&uuml;rlich Abgeschirmte Rundkabel. Als Alternative gibt es dann
noch das Flachbandkabel, mit dem sich der Anschluss auch etwas
leichter gestaltet.Die Abschirmung wird hier erzeugt indem zwischen
jeder Signalleitung eine Masseleitung liegt und somit eine gewisse
Sicherheit bei der &Uuml;bertragung erreicht wird. Ausserdem gestaltet
sich der Anschluss eines Pfostensteckers hier besonders einfach. Man
quetscht ihn mittels einer grossen Kombizange oder eines Schraubstocks
langsam auf die Leitungen.
<br>
</p>
<p>Man sollte darauf achten,das die farblich markierte Leitung auf
der Seite an den Pfostenstecker kommt, an der auch eine kleine
dreieckige Markierung ist. Wenn man einen Pfostenstecker mit
seitlicher Nase benutzt, ist ein Verpolen praktisch ausgeschlossen.
Die kniffligste Aufgabe ist wohl das Verl&ouml;ten des
DIN-Rundsteckers. Da ein Flachbandkabel eigentlich nicht f&uuml;r
runde <a href="0f0b.htm" target="UDOcon">Stecker</a> gedacht ist, rollt man es am besten ein St&uuml;ck
l&auml;ngs auf, so das es durch die &Ouml;ffnung der Kunststof-
fumh&uuml;llung des Steckers passt und schiebt diese m&ouml;glichst
weit &uuml;ber das Kabel. Dann schneidet man die ersten 7 und die
letzten 2 sowie die 14. Leitung (jeweils von der makierten Leitung aus
gez&auml;hlt) soweit ab, dass sie nach dem Zusammenbau zwar noch in
den <a href="0f0b.htm" target="UDOcon">Stecker</a> hineinragen, dort aber nichts ber&uuml;hren
k&ouml;nnen.Als n&auml;chstes werden alle ungeraden Leitungen (also
9,11,13,14,..29,31) um zwei Zentimeter gek&uuml;rzt, m&ouml;glichst
kurz abisoliert und mit einem St&uuml;ck blanken Draht miteinander
verl&ouml;tet. An die beiden Enden l&ouml;tet man je ein St&uuml;ck
Leitung wieder an, so das diese zwei genauso lang wie die &uuml;brigen
Leitungen sind. Den blanken Draht sllte man sicherheitshalber gegen
Kurzschl&uuml;sse isolieren.
<br>
</p>
<p>Die Leitungen werden nach dem unten gezeigten Schema an den
<a href="0f0b.htm" target="UDOcon">Stecker</a> gel&ouml;tet, wobei die zwei verl&auml;ngerten Leitungen als
Masseleitungen an Pin 3+7 des Steckers kommen. Sind alle Kabel
angel&ouml;tet und keine Kurzschl&uuml;sse zu sehen, kann der <a href="0f0b.htm" target="UDOcon">Stecker</a>
geschlossen werden. Nach nochmaligem Durchpr&uuml;fen (Ohmmeter) aller
Leitungen, kann das Kabel auf das Laufwerk gesteckt werden.
<br>
</p>
<p>Bei dieser L&ouml;sung ist darauf zu achten,da&szlig; am
DriveSelectSchalter immer Drive 0 eingestellt werden mu&szlig;. Das
gilt auch, wenn das Laufwerk als Laufwerk B angesteuert werden soll,
da im (meist)davor geschalteten Original Atari Laufwerk die Drive
Select Leitung vertascht werden.
<br>
</p>
<p>Wenn zwei NEC-Laufwerke angeschlossen werden sollen,ist es etwas
schlimmer, da diese auf allen Eing&auml;ngen mit 1000
Ohm-Widerst&auml;nden nach +5 Volt abgeschlossen sind
(Pullup-Widerst&auml;nde). Werden nun zwei NEC-Laufwerke
angeschlossen,so liegen die Steuerleitungen mit nur 500 Ohm gegen 5
Volt.Das ist aber viel zu wenig f&uuml;r einen ungepufferten Ausgang.
Es sind beim ST sowohl die Side-Select-Leitung (Pin 32, Shugart), als
auch die beiden Drive-Select-Leitungen (Pin 10 und 12). Man kann jetzt
im 'A' Laufwerk diese Widerst&auml;nde einfach entfernen,das geschieht
entweder durch ausstecken,abzwicken oder ausl&ouml;ten,das 'wie'
h&auml;ngt vom verwendeten Laufwerk ab.
<br>
</p>
<p>Man kann aber auch f&uuml;r den Anschluss von zwei Laufwerken
einen Treiber Treiber (7407) in die drei Leitungen zu setzen. Die
Eing&auml;nge der Treiber sind auf den beiden Drive-Select-Leitungen
(Pin. 5 und 6 des ATARI-Floppysteckers) mit 2,7 k und der
Side-Select-Leitung (Pin 2) mit 5,6 k nach +5 Volt abzuschliessen. Die
Ausg&auml;nge der Treiber werden einfach direkt auf die entsprechenden
Laufwerkseing&auml;nge gelegt.
<br>
</p>
<p>Als Kabel zum Laufwerk wird wieder ein 34 pol. Flachbahnkabel
eingesetzt (1:1), auf das man fuer den Anschluss von zwei Laufwerken
einfach einen zweiten Pfostenstecker quetschen kann. Dabei ist
dasjenige Laufwerk, das als Laufwerk B fungieren soll,am
Drive-Select-Schalter auf Drive 1 einzustellen.
<br>
<br>Anschluss 34pol.Flachkabel an DIN-Rundstecker (Floppystecker):
<br>
</p>
<pre> 34 Pol.                  Rundsstecker          Bedeutung
 1-7,14,33,34             n.c.                  Unbenutzt
 9-31 ungerade            3,7                   GND
 8                        4                     Index
 10                       5                     <a href="0b0104.htm" target="UDOcon">Drive Select</a> 0
 12                       6                     <a href="0b0104.htm" target="UDOcon">Drive Select</a> 1
 16                       8                     Motor On
 18                       9                     Direction
 20                       10                    Step
 22                       11                    Write Data
 24                       12                    Write Gate
 26                       13                    Track 0
 28                       14                    Write-Protect
 30                       1                     Read Data
 32                       2                     Side Select
</pre>
<p>
<br>
<br><b> Beschreibung der Modifikation von NEC-Laufwerken </b>
</p>
<p>Eine Modifikation des Laufwerks zum Erkennen eines <a href="0b04.htm" target="UDOcon">Disketten</a>
wechsel.
<br>
</p>
<p>Hier am Beispiel des NEC 1036A-Laufwerk. Die Laufwerksplatine
mu&szlig; bei der Modifikation vom Laufwerk abgeschraubt werden, nur
so kommt man an die Umbaustelle heran. (Platinenbezeichnung NEC
G9XFN). Vorsicht mit den diversen Steckerchen, die sind sehr
empfindlich. Nach dem Abschrauben die Platine umdrehen. Neben der LED
befindet sich ein Sensor, die Aufschrift lautet UGN/3020U/538. Er hat
auf der L&ouml;tseite 3 Anschl&uuml;sse, 2 cm darunter liegt ein
8-Poliger <a href="0f0b.htm" target="UDOcon">Stecker</a>.
</p>
<p>
<br>
</p>
<pre>
 &gt;         LED   1  2  3   Sensor
 &gt;         o o   o  o  o   Anschl&uuml;sse
 &gt;
 &gt;
 &gt;
 &gt;            1  2  3  4   8-Pol-<a href="0f0b.htm" target="UDOcon">Stecker</a>
 &gt;            o  o  o  o
 &gt;            o  o  o  o
 &gt;            5  6  7  8   (Von der L&ouml;tseite aus gesehen!)
</pre>
<p>
<br>
</p>
<p>Jetzt kommt der eigentliche Umbau, der eigentlich nur mit einiger
L&ouml;terfahrung gemacht werden sollte. Die Leiterbahn zwischen Pin 1
Sensor und Pin 3 <a href="0f0b.htm" target="UDOcon">Stecker</a> mu&szlig; durchtrennt werden, dann wird ein
Kabelchen zwischen Pin 1 Sensor und Pin 7 <a href="0f0b.htm" target="UDOcon">Stecker</a> gel&ouml;tet. Die
Platine in umgekehrter Reihenfolge wieder vorsichtig auf das Laufwerk
schrauben. Das Laufwerk sollte jetzt dem Rechner einen einwandfreien
Diskettenwechsel anzeigen bzw. melden. An Pin 7 <a href="0f0b.htm" target="UDOcon">Stecker</a> liegen
&uuml;brigens +5V, an Pin 2 Sensor Masse, nur damit man auch was zum
Messen hat.
<br>
</p>
<p>1989 MRT
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b01.htm" target="UDOcon"><img src="udo_up.gif" alt="Diskettenlaufwerke am Atari ST" border=0 width="24" height="24"></a>
<a href="0b01.htm" target="UDOcon"><img src="udo_lf.gif" alt="Diskettenlaufwerke am Atari ST" border=0 width="24" height="24"></a>
<a href="0b0102.htm" target="UDOcon"><img src="udo_rg.gif" alt="Floppy Signals" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
