<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Diskettenlaufwerke am Atari ST
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_up.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_lf.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
<a href="0b0101.htm" target="UDOcon"><img src="udo_rg.gif" alt="Ein Diskettenlaufwerk" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Diskettenlaufwerke_20am_20Atari_20ST">11.1 Diskettenlaufwerke am Atari ST</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> verschiedene Laufwerke am <a href="0305.htm" target="UDOcon">Atari ST</a> </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<div align=center><b> Ein 5 1/4&quot; Drive und der <a href="0305.htm" target="UDOcon">Atari ST</a> </b>
</div>
<p>
<br>Als erstes sollte man genau Feststellen um welches Floppydrive es
sich handelt, bei neuen Diskdrives liegen meist Datenbl&auml;tter bei
aus denen hervorgeht wie das Laufwerk an welchen Computer
angeschlossen bzw. auch gejumpert wird. Da die meisten Leute aber ein
gebrauchtes Laufwerk irgendwo ausgegraben haben ist die Sache schon
wesentlich schwieriger. Als Beispiel f&uuml;r ein TEAC FD 55 FR 5
1/4&quot;mit 40/80 Track Umschaltung sieht das ganze in etwa so aus:
Die Anschlu&szlig;leitung des Laufwerkes ist in den meisten
f&auml;llen Shugart kompatibel d.h an dem vorhandenen Anschlu&szlig;
des Ataris passen meistens sowohl 3 1/2&quot; und 5 1/4&quot;
Laufwerke problemlos sofern eben der sog. Shugart-Bus verwendet wird.
Man sollte nur beachten das die meist Werksseitig eingesetzten Pullup-
widerst&auml;nde nur im letzten angeschlossenem Laufwerk vorhanden
sein sollten. In den Atari Drives ist zus&auml;tzlich noch die
Side-Select Leitung &uuml;ber einen Pullupwiderstand von meistens 1
Kohm mit +5V verbunden den man dann ebenfalls auch Entfernen sollte.
<br>
<br>
</p>
<pre>
 Ein L&ouml;sungsvorschlag:

 ------------------------------------------------------------------------
                        I                I
                        I      IC        I
                        I                I
     *                  ------------------
     * C7 Kondensator                         PLATINE DES TEAC FD 55
     *                                        **********************
     *            o L&ouml;tst&uuml;tzpunkte S7

       +++++      o       +++++
        R?                 R24 Widerstand


                       o  oooooo
                          I I      Jumpersteckplatz die &quot;I&quot;'s sind die
                       o  oooooo   zu steckenden Jumper !
                Jumper
                   f&uuml;r Select

--------------------------------------------------------------------------
                                     1 3 5 7 9 11.....
     O O O O                         O O O O O O O O O O....

                                     O O O O O O O O O O....
   12V GND 5V                        2 4 6 8 10 12 14 16 u.s.w

   Vierpolige Stromversorgung        Shugart-Floppystecker am Laufwerk

 Die ungeraden Nummern des Steckers liegen gemeinsam auf Masse.....

</pre>
<p>
<br>An die L&Ouml;TST&Uuml;TZPUNKTE S7 werden je eine Leitung
angel&ouml;tet und zu einem 1 poligen Schalter gef&uuml;hrt. Dieser
Schalter ist f&uuml;r die 40/80 Track Umschaltung zust&auml;ndig und
kann meistens noch in die Front des Diskettenlaufwerks eingebaut
werden.
<br>
</p>
<p>Offener Schalter = 80 Track
<br>Geschl. Schalter = 40 Track
<br>
</p>
<p>Eine eventuell eingel&ouml;tete br&uuml;cke verdammt das Laufwerk
mit nur 40 Track's zu arbeiten.(Br&uuml;cke entfernen). Bei vielen
anderen Modellen ist das ebenfalls als Jumper ausgebildet und
mu&szlig; gesucht werden. Nat&uuml;rlich ist auch die Beschriftung in
diesem Falle anders!
<br>
<br>
</p>
<p><b> Modifizierung der Pullupwiderst&auml;nde im Laufwerk. </b>
<br>
</p>
<p>Widerstand R29 von der Platine ausl&ouml;ten oder mit einem
Elektronik- Seitenschneider abkneifen.(Schluck) Widerstandsarray aus
dem IC Sockel entfernen. Widerstandsarray (SIL 8R + 1Common) in den
leeren IC Sockel stecken. Den Commonanschlu&szlig; (Ist mit einem
Punkt gezeichnet) auf den freien L&ouml;tpunkt L&ouml;ten. (Links von
der IC Fassung!!!!) Das letzte Anschlussbeinchen auf den freien
L&ouml;tpunkt von R29 anl&ouml;ten.
<br>
<br>
</p>
<pre>
--------------------------------------------------------------------------
                                                  IC Sockel f&uuml;r Pullup

                                                   O O O O O O O  *
                                                                  *
                                   freier L&ouml;tpunkt                * R29
                                                O  O O O O O O O  *
                                                I  I I I I I I I  I
                                                 -------------------
                                                  Widerstandsarray



--------------------------------------------------------------------------
                                            I I I I I I I I I

                                            2 4 6 8 . . . . .
                                            SHUGARTBUS - STECKER
--------------------------------------------------------------------------

</pre>
<p>
<br>Nat&uuml;rlich beziehen sich diese Ma&szlig;nahmen auf das damalig
aktuelle TEAC FD 55 Drive. Bei jedem anderen Drive kann oder ist das
in jedem Fall anders. Diese Anleitung dient als Beispiel, wer mit
einem Messger&auml;t umgehen kann wird die entsprechenden Stellen an
seinem Laufwerk selber finden. Ganz bestimmt werden &auml;ltere
Floppy's von Mitsubishi ohne Pufferung der Drive- Select Signale NICHT
laufen, d.h man muss die Steuersignale die vom Computer kommen
&uuml;ber geeignete Treiber verst&auml;rken soda&szlig; sie mit
Sicherheit von der Elektronik des Laufwerkes erkannt werden. Die
Pullupwiderst&auml;nde sind meist in der n&auml;he des
Shugartanschlusses auf der Platine zu finden. Generell sind diese
Widerstandsarrays eigentlich gesteckt. Manche Hersteller haben aber
neuerdings aus Sparmassnahmen auf die Stecksockel verzichtet und die
Dinger eingel&ouml;tet,in diesem Fall kommt man um die Benutzung eines
Entl&ouml;ters bzw. L&ouml;tkolbens leider nicht herum. Diese
Widerst&auml;nde ziehen die Signale auf der Floppyplatine auf einen
positiven Wert, sind jetzt aber zwei Laufwerke angeschlossen in denen
sich jeweils auch Pullupwiderst&auml;nde befinden, so halbiert sich
der Gesamtwiderstand und ist im Allgemeinen dann viel zu niedrig. Das
Bedeutet das die Controllersignale des Computers &uuml;berlastet
werden und eine Zerst&ouml;rung des Floppycontrollers die Folge
w&auml;hre, da die Signale in Atari-Computern eben leider &uuml;ber
keine besonderen Buffer gef&uuml;hrt werden. Es m&uuml;sste
Sichergestellt werden das die Signale schnell genug an dem Drive
ankommen bzw. auch die Signalflanken ausreichend hoch sind damit es so
nicht zu St&ouml;rungen kommen kann ! Zum Testen des entsprechenden
Floppys sollte man es an einem Atari anschlie&szlig;en der nur eben
einem Laufwerk arbeitet. Das vorhandene also erst mal Entfernen. (Nur
ST mit externem Laufwerk)
<br>
</p>
<p>Ein geeigneter Treiber f&uuml;r die Selektsignale ist z.B der TTL-
Baustein 74LS07. Er beinhaltet 4 Treiberstufen die zur Pufferung eines
5 1/4&quot; Laufwerkes gut ausreichen.
<br>
<br>
<br>
<br>
</p>
<div align=center><b> FREMDFLOPPYS AM ATARI ST </b>
</div>
<p>Die besten Erfahrungen habe ich bis jetzt mit den Laufwerken von
NEC gemacht. Verwendet wurden die Drives FD1035LP / FD1036 / FD1037A
alle Laufwerke sind jeweils 3,5&quot; Drives die sich nur in
Bauh&ouml;he und Stromaufnahme unterscheiden. An dieser Stelle sei
erw&auml;hnt das manche der NEC 1035LP Laufwerke sogar einwandfrei bis
Track 87 lesen und schreiben k&ouml;nnen. Neuere 1037er Arbeiten sogar
nur mit 5Volt, d.h die 12 Volt werden nicht mehr Ben&ouml;tigt, eine
Entlastung f&uuml;r die Netzteile falls die <a href="0b.htm" target="UDOcon">Diskettenlaufwerke</a> bei
einem Towerumbau von den Rechnernetzteilen mitversorgt werden sollen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/floppy.gif" border=0 width="390" height="276"></p><br>
<div align=center><tt> Abbildung 1 - 3.5&quot; Floppy extern, Eigenbau </tt>
</div>
<p>
<br>
<br>
</p>
<p>Ein solches Laufwerk kostete im Handel ca.140 DM dann kommen noch
ca.20 DM fuer ein externes <a href="10.htm" target="UDOcon">Netzteil</a> dazu. Heute gibt es &auml;hnliche
Drives f&uuml;r bereits 60DM Neupreis. Auch ein Geh&auml;use und ein
Datenkabel darf nicht vergessen werden, man bekommt es Stellenweise
fertig konvektioniert im Versandhandel. Womit sind wir immer noch
billiger als das billigste originale Atari Diskettenlaufwerk.
Originale <a href="0b.htm" target="UDOcon">Diskettenlaufwerke</a> d&uuml;rfte es meiner Meinung nach heute
nur noch unter dem Tisch geben. Das gr&ouml;&szlig;te Problem sind die
Datenkabel. Man mu&szlig; peinlich darauf achten das keine
Steuerleitungen untereinander oder mit der den Systemmasse vertauscht
oder verl&ouml;tet wird. Denn das ist mit t&ouml;tlicher Sicherheit
das Ende des Floppycontrollers WD1772 und/oder dem Yamaha <a href="080109.htm" target="UDOcon">Soundchip</a>
&uuml;ber den die Selektsignale an die Laufwerke geschickt werden.
Hier gibt es allerdings noch einen kleinen TTL-Chip im Rechner der
aber die Sache meistens nicht abfangen kann. Leute die einen
L&ouml;tkolben an der richtigen Seite anfassen k&ouml;nnen sind hier
jetzt nat&uuml;rlich klar im Vorteil. Da es alle <a href="0f0b.htm" target="UDOcon">Stecker</a> im
einschl&auml;gigen Fachhandel gibt k&ouml;nnen viele Ataribenutzer
dieses Kabel selber herstellen.
<br>
<br>
</p>
<pre>
 Gegen&uuml;berstellung der Steckerbelegung:

     ATARI FLOPPYSTECKER                 SHUGART BUS
     -----------------------------------------------
        1-read data                 2-head load
        2-head-select               4-nc
        3-masse                     6-drive sel 3
        4-index                     8-index
        5-drive sel 0              10-drive sel 0
        6-drive sel 1              12-drive sel 1
        7-masse                    14-drive sel 2
        8-motor on                 16-motor on
        9-dir select               18-direction sel
       10-step                     20-step
       11-write data               22-write data
       12-write gate               24-write gate
       13-track 0                  26-track 0
       14-write prot.              28-write prot.
                                   30-head select
                                   34-ready
                                   1-33-masse
 ----------------------------------------------------------------


     ATARI STROMVERSORGUNG ORIGINAL SF- LAUFWERKE
     (von au&szlig;en gesehen):

  GND o           o +5V
         o     o +12V
            o
           GND

</pre>
<p>
<br>
</p>
<div align=center><b> FLOPPY CONNECTING </b>
</div>
<p>
<br>
</p>
<pre>
Outer view:

        11       10

     9                8

   7     13     12     6

    5       14        4

       3          2
             1


External circular             Shugart
connector                     connector
--------------------------------------------------------------------
01.  Read Data-----------------30. RDT
02.  Side 0 Select-------------32. SSL
03.  GND----------------------- 1,3,5,7,9... (all odd wires are GND)
04.  Index Pulse--------------- 8. IDX
05.  Drive 0 Select------------10. DS0
06.  Drive 1 Select------------12. DS1
07.  High Density Detect------- 2. HDD
08.  Motor On------------------16. MON
09.  Direction In--------------18. DIR
10.  Step----------------------20. STP
11.  Write Data----------------22. WDT
12.  Write Gate----------------24. WGT
13.  Track 00------------------26. TR0
14.  Write Protect-------------28. WPT

</pre>
<p>
<br>
</p>
<p>The numbering is viewed as looking at the connector from the back
of the atari or the soldering side of the plug
<br>
<br>
</p>
<p>Zu Beachten ist das einige Leitungen NICHT Pingleich auf dem
Shugartbus aufgelegt werden k&ouml;nnen! Solltet Ihr euch solche Kabel
selbst machen bitte am Ende alles mit einem Ohmmeter auf seine
Richtigkeit pr&uuml;fen!! Auch die Jumper auf der Platine sollten
richtig gesteckt werden Drive A + B etc. sonst l&auml;uft bei zwei
externen Floppys nichts. Dazu sollte man wenigstens wissen wo die
entsprechenden Jumper auf der Floppyplatine zu finden sind, man kann
das meist aus den mitgelieferten Datenbl&auml;ttern entnehmen. Zu
beachten beim Anschlu&szlig; von zwei Laufwerken ist noch die
Best&uuml;ckung der Pullup-Widerst&auml;nde, die sollten aus bereits
genannten Gr&uuml;nden nur im letzten Laufwerk vorhanden sein.
Ansonsten reicht die Signalleistung des Rechners nicht aus.
<br>
</p>
<p>Ein neueres Laufwerk also auch direkt vom Rechnernetzteil versorgt
werden. (Z.b bei einem Umbau in ein PC-Geh&auml;use) Doch ist der
Anschlu&szlig; mit Vorsicht zu geniessen. Nicht alle Rechnernetzteile
besitzen gen&uuml;gend Reserve um noch zus&auml;tzliche 1.2 - 2 Watt
Leistung f&uuml;r ein Zweitlaufwerk aufzubringen! Z.B sin viele
&auml;ltere Netzteile in 1040 Computern solche Kandidaten.
<br>
</p>
<p>Schlie&szlig;lich noch ein Tip:
<br>Wenn man beim kauf einse Laufwerks darauf besteht ein &quot;Atari
modifiziertes&quot; Laufwerk zu bekommen entgeht man dem Problem das
manche NEC Floppys keinen Diskettenwechsel an den Rechner melden und
die Pullupwiderst&auml;nde schon entfernt oder eben vergr&ouml;ssert
wurden. Man braucht das Laufwerk dann eigentlich nur noch richtig
anzustecken. Logischeweise geht das nur wenn man ein solches
Diskettenlaufwerk &uuml;ber die einschl&auml;gigen Lieferranten
f&uuml;r den Atarisektor bezieht. Die Modifzierung des
Medichanche-Signals wird sp&auml;ter angesprochen.
<br>
</p>
<p>
<br>
<br>
<br>
</p>
<div align=center><b> NEC 1036 / 1037 Laufwerke </b>
</div>
<p>NEC-Laufwerke sind relativ einfach an die Rechner der ST-Serie
anzuschlie&szlig;en. Man braucht dazu lediglich ein passendes Kabel
sowie ein passendes Steckernetzteil.
<br>
</p>
<p>1. Ein NEC-FD 1037 A oder 1036 Laufwerk (5 Volt-Version)
<br>2. Einen 34 pol. Pfostenstecker (In Schneidklemmtechnik)
<br>3. 34 pol. Flachbahnkabel (l&auml;nge nach Bedarf, aber nicht
&uuml;ber 40cm)
<br>4. Einen 14 pol. Atari-Floppystecker
<br>5. Ein 5 Volt-Steckernetzteil ( min. 1 Amp. Leistung )
<br>6. Einen 4 pol. Stromversorgungsstecker f&uuml;r 3.5&quot; Floppy
<br>7. Einen Ein/Aus-Schalter.
<br>
<br>Das diese Laufwerke mit nur einer einzigen Versorgungsspannung
auskommem (+5 Volt) erleichtert das hier den Selbstbau ungemein. Das
verwendete <a href="10.htm" target="UDOcon">Netzteil</a> sollte allerdings mindestens einen Strom von 1 bis
ca. 1,5 Ampere liefern k&ouml;nnen, die Spannung sollte unter
Belastung durch das Laufwerk bis auf h&ouml;chstens 4,85 Volt
absinken. Bei gr&ouml;&szlig;erem absinken der Spannnung ist die
Betriebsicherheit des Laufwerkes nicht mehr zu 100% gegeben. Bei
neueren Laufwerken in SMD und CMos-Technik werden an die Netzteile
keine besonderen Anforderungen mehr gerichtet.
<br>
</p>
<p>Schreib- sowie Lesefehler w&auml;hren die direkte Folge von einer
unzureichenden Stromversorgung.
<br>
</p>
<p>Etwas schwierig ist das einl&ouml;ten von einem Flachbandkabel in
den runden Ataristecker, da das eingentlich so nicht gedacht ist. Wenn
man es allerdings vorher der L&auml;nge nach was aufrollt und es
gleich durch die Steckerh&uuml;lle steckt geht auch dieses. Das
Anl&ouml;ten oder anquetschen einer Rundleitung an eben den passenden
Floppy-Shugartstecker ist im Gegenzug dazu auch leider kein sonderlich
sch&ouml;nes Unterfangen, w&auml;hre aber mit der entsprechenden
Ausdauer auch so zu machen. Man kann diese Angelegenheit auch
v&ouml;llig umgehen, dazu ben&ouml;tigt man allerdings einen ca.39 DM
teueren ST-Shugartadapter den es mal eine Zeit lang bei diversen
H&auml;ndlern gab. (Hard&amp;Soft) Der Adapter wird in die
Floppybuchse des ST eingesteckt und stellt auf der anderen Seite die
Signale auf einer 34 poligen Pfostenleiste zur Verf&uuml;gung. In
diesem Fall k&ouml;nnte dann ein Flachbandkabel ohne jegliche
L&ouml;tung zwischen Rechner und Laufwerk zur Verwendung kommen.
Au&szlig;nahme bildet hier wieder der Anschlu&szlig; an die externe
ST-Buchse. Allerdings ein guter Tip f&uuml;r Ataris mit internem
Floppyanschlu&szlig;. (Z.b f&uuml;r einen Towerumbau)
<br>
</p>
<p>Atari-Shugart-Adapter von:
<br>Hard &amp; Softwaredesign
<br>Summererstr. 11
<br>8011 Zorneding 089/754453
<br>Adresse aus einem uralten ST-Magazin
<br>
<br>Die meisten Flachleitungen besitzen auf einer Seite eine farbig
markierte Leitung, diese Ader wird nun so in den Pfostenstecker
eingelegt das die markierte Ader auf dem Pin zu liegen kommt der mit
einem kleinen Punkt oder einem Dreieck auf der Steckeraussenseite
markiert ist. Das wird automatisch zu Pin 1. Der <a href="0f0b.htm" target="UDOcon">Stecker</a> selber wird
dann gleichm&auml;ssig an beiden Enden zur mitte hin zugepresst,
fertig, alle Adern der Flachleitung sind der Reihe nach mit den
richtigen Pins des Steckers verbunden.
<br>
</p>
<p>Aus der Liste unten kann man nun die ben&ouml;tigten Pinnummern
des Diskettenlaufwerkes entnehmen. Mit einem Durchgangspr&uuml;fer
(sicherste L&ouml;sung) werden nun die einzelnen Leitungen aus dem
Flachbandkabel herrausgesucht und mit dem Floppystecker verl&ouml;tet.
Die nicht ben&ouml;tigten Adern bitte b&uuml;ndig abschneiden, so
da&szlig; keine Kurzschl&uuml;sse entstehen k&ouml;nnen.
<br>
</p>
<p>Mit einem 14 poligen Rundkabel geht es prinzipiel genauso. Es
sieht halt etwas Professioneller aus und kann wegen dem Kabelschirm
auch ein klein wenig l&auml;nger sein. Das Abschirmgeflecht ist auf
der Rechnerseite mit der Masse (GND) zu verbinden. Leider ist es beim
Rundkabel etwas schwieriger den Pfostenverbinder (Shugart-Busstecker)
mit dem Kabel zu verbinden, da hier ja nicht einfach alles in einer
Reihe zum Einquetschen parat liegt. Hier sollte man ebenfalls mit
einem Durchgangspr&uuml;fer vom Floppystecker augehend die
ben&ouml;tigten Leitungen durchpiepen. Man kann sich auch die
Pinnummern sowie die Aderfarbe des Rundkabels aufschreiben und es dann
nach dieser Liste mit eben dem Pfostenverbinder verknoten. Bei dieser
L&ouml;sung ist es allerdings sehr ratsam die einzelnen Adern jeweils
direkt auf jede Schneidklemme einzeln aufzudr&uuml;cken und den
<a href="0f0b.htm" target="UDOcon">Stecker</a> zum erst zum Schlu&szlig; mit etwas Klebstoff zuzupressen. Nur
so bleibt der ganze Mist richtig an seinem Platz. Oder die einzelnen
Adern gleich mit den Schneidklemmen leicht verl&ouml;ten. Was am
allerbesten h&auml;lt! . Das ist allerdings etwas was sehr sehr Sauber
gemacht werden mu&szlig; da ansonsten das Steckeroberteil leider nicht
mehr genau auf das Steckerunterteil des Pfostenverbinder passt. Dumm
gelaufen. (Falls der <a href="0f0b.htm" target="UDOcon">Stecker</a> dann nicht mehr zuschnappt) Sehr wenig
L&ouml;tzinn dazu verwenden.
<br>
</p>
<p>Die Diveselect-Jumper auf der Laufwerksplatine m&uuml;ssen immer
auf Drive 0 gesteckt werden. Die Au&szlig;nahme ist wenn das Laufwerk
an einen Rechner angeschlossen werden soll der schon ein internes
Disklaufwerk besitzt. Hier ist das interne Laufwerk schon Drive 0.
<br>
</p>
<p>Wenn zwei NEC-Laufwerke angeschlossen werden sollen ist darauf zu
achten das diese Laufwerke auf allen Eing&auml;ngen mit
1KOhm-Widerst&auml;nden nach +5 Volt abgeschlossen sind. Werden jetzt
aber zwei NEC-Laufwerke angeschlossen so liegen die Leitungen mit nur
500 Ohm gegen 5 Volt! Leider w&uuml;rden dadurch die
Treiberausg&auml;nge im Rechner &uuml;berlastet, welches sich durch
nicht Funktionieren des z.b als Laufwerk B angeschlossenen Drives
ank&uuml;ndigt. In diesem Fall die Schaltung bitte sofort
Kontrollieren und nicht erst rumprobieren, die Bausteine im Rechner
wollen leben. Es betrifft sowohl die Sideselekt-Leitung (Pin 32,
Shugart), als auch die beiden Driveselekt-Leitungen (Pin 10 und 12).
(Drive 0/1-Selekt) Umgehen kann man dieses Problem auch mit einer
Treiberschaltung z.b die Floppyumschaltplatine aus dem &auml;lteren
ST-Magazin.
<br>
</p>
<p>Gemeint ist die Bauanleitung &quot;Auf die dauer hilft nur
Power&quot;
<br>
</p>
<p>Die Ausg&auml;nge der Treiber werden einfach direkt auf die
entsprechenden Laufwerkseing&auml;nge gelegt. Wie und wo diese
Minischaltung eingebaut wird kann sich jeder selber &uuml;berlegen.
Also im Floppystecker ist es doch recht Eng :) Eine winzige Platine
direkt hinter dem Laufwerk, auf den Shugartstecker aufsteckbar ist
sicher eine gute Idee. Zumal das auch noch im Floppygeh&auml;use
veschwindet.
<br>
</p>
<p>Einfach ist es sicherlich in dem letzten Laufwerk welches am
<a href="11.htm" target="UDOcon">Verbindungskabel</a> h&auml;ngt (meist Drive B) diese Widerst&auml;nde
einfach zu entfernen (Abkneifen oder Ausl&ouml;ten). Wenn man bei der
Bestellung dieser Laufwerke den Verwendungszweck bekannt gibt sind
diese Widerst&auml;nde (Pullup-Widerst&auml;nde) meist schon vom
Lieferranten entfernt worden.
<br>
<br>
</p>
<pre>
 34 pol. oder 24 pol. Flachbandkabel an Floppystecker:

 34 Pol.           24 Pol.           Rundsstecker          Bedeutung
 ........................................................................
 1-7,14,33,34                         -                    Unbenutzt
 9-31              1-23              3,7                   GND
 8                 2                 4                     Index
 10                4                 5                     <a href="0b0104.htm" target="UDOcon">Drive Select</a> 0
 12                6                 6                     <a href="0b0104.htm" target="UDOcon">Drive Select</a> 1
 16                8                 8                     Motor On
 18                10                9                     Direction
 20                12                10                    Step
 22                14                11                    Write Data
 24                16                12                    Write Gate
 26                18                13                    Track 0
 28                20                14                    Write-Protect
 30                22                1                     Read Data
 32                24                2                     Side Select
 ........................................................................

</pre>
<p>
<br>
</p>
<p>Es folgt noch ein Tip zur Nachr&uuml;stung der
Mediachange-Erkennung. (Falls der Diskettenwechsel nicht erkannt wird)
Was aber mittlerweile bei allen Floppys nicht mehr der Fall sein
d&uuml;rfte ! Z.b NEC FD 1036 A-Laufwerk.
<br>
</p>
<p>Die Laufwerksplatine mu&szlig; bei dem Umbau vom Laufwerk getrennt
werden damit man zum Arbeiten an die wichtigen Stellen kommen kann.
<br>
</p>
<p>NEC G9FN sollte irgendwo auf der Platine stehen. (Nur NEC
FD1036)!!! Nach dem Abschrauben die Platine umdrehen. Neben der LED
befindet sich ein Sensor (UGN/3020U) Er hat auf der L&ouml;tseite 3
Anschl&uuml;sse, ca.20 mm darunter liegt ein 8-Poliger <a href="0f0b.htm" target="UDOcon">Stecker</a>.
<br>
</p>
<p>
<br>
</p>
<pre>
            LED   1  2  3   Sensor
            o o   o  o  o

            1  2  3  4   8_Pol <a href="0f0b.htm" target="UDOcon">Stecker</a>
            o  o  o  o
            o  o  o  o
            5  6  7  8               L &Ouml; T S E I T E  !

</pre>
<p>
<br>
</p>
<p>Die Leiterbahn zwischen Pin 1 Sensor und Pin 3 <a href="0f0b.htm" target="UDOcon">Stecker</a> mu&szlig;
durchtrennt werden, danach wird ein Kabel zwischen Pin 1 Sensor und
Pin 7 <a href="0f0b.htm" target="UDOcon">Stecker</a> eingel&ouml;tet.
<br>Die ganze Sache genauestens &Uuml;berpr&uuml;fen und die Platine
wieder einbauen. Das Laufwerk sollte jetzt dem Rechner einen
Diskettenwechsel einwandfrei Anzeigen bzw. melden. Bei anderen
NEC-Laufwerken m&uuml;sste das &auml;hnlich oder zumindestens in einer
&auml;hnlichen Art zu machen sein. (!nl
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li>11.1.1 <a href="0b0101.htm" target="UDOcon">Ein Diskettenlaufwerk</a></li>
<li>11.1.2 <a href="0b0102.htm" target="UDOcon">Floppy Signals</a></li>
<li>11.1.3 <a href="0b0103.htm" target="UDOcon">Floppy Jumper</a></li>
<li>11.1.4 <a href="0b0104.htm" target="UDOcon">Drive Select</a></li>
<li>11.1.5 <a href="0b0105.htm" target="UDOcon">HD-Floppy Mitsubishi MF355</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_up.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_lf.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
<a href="0b0101.htm" target="UDOcon"><img src="udo_rg.gif" alt="Ein Diskettenlaufwerk" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
