<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Floppyumschaltung
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_up.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
<a href="0b0105.htm" target="UDOcon"><img src="udo_lf.gif" alt="HD-Floppy Mitsubishi MF355" border=0 width="24" height="24"></a>
<a href="0b0201.htm" target="UDOcon"><img src="udo_rg.gif" alt="DD-HD Switch" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Floppyumschaltung">11.2 Floppyumschaltung</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Die Floppyumschaltung aus dem ST-Magazin </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<div align=center><b> Die Floppyumschaltung aus dem ST-Magazin </b>
</div>
<p>F&uuml;r zwei 'B'- Laufwerke zb. 3 1/2&quot; und 5 1/4&quot;?
<br>
</p>
<p>&Uuml;ber den Sinn und Zweck einer Floppyumschaltung k&ouml;nnte
man eine ganze weile Diskutieren ohne auf einen gr&uuml;nen Zweig zu
kommen. Es eignet sich auch nur f&uuml;r Benutzer die Entweder schon
zwei <a href="0b04.htm" target="UDOcon">Disketten</a>- laufwerke an ihrem Rechner benutzen oder noch ein
zus&auml;tzliches 5 1/4&quot; Laufwerk extra anschlie&szlig;en wollen.
Oder ein externes 1,44 Mb Drive verwenden m&ouml;chten und auf die
l&auml;stige Umsteckerei verzichten wollen.
<br>
</p>
<p>Das ST-Magazin bietet zu diesem Zweck eine doppelseitige
Leiterplatte &uuml;ber die Firma Bardehle Datentechnik an, die Platine
kostet DM 36.-
<br>
</p>
<p>Selbstverst&auml;ndlich l&auml;sst sich die sache auch auf einer
Lochrasterplatine aufbauen, was aber sicher mit einem h&ouml;heren
Arbeitsaufwand belohnt wird. Die Schaltung an sich ist sehr einfach
und ist bis in's Detail in der entsprechenden Ausgabe des ST-Magazin
erl&auml;utert.
<br>
</p>
<p>Sehr von Vorteil ist, das diese Schaltung eine Pufferung der
Empfindlichen Sideselect sowie der Driveselectleitungen des STs
vornimmt. Was auch den Anschlu&szlig; von 5 1/4&quot; Laufwerken
wesentlich vereinfacht bzw. man nicht mehr unbedingt auf die im
Laufwerk eingebauten Pullupwiderst&auml;nde zu achten braucht. Die
Leistung des Treiberbausteines 74LS07 auf der Platine reicht auf alle
F&auml;lle aus, selbst bei 3 verwendeten Diskettenlaufwerken.
<br>
</p>
<p>Beide IC's auf der Platine sollten zwecks einer besseren Reparatur
m&ouml;glichkeit gleich gesockelt werden, sollte sp&auml;ter einmal
ein Defekt auftreten ist man schnell in der Lage durch das einfache
austauschen eines Chip's die Fehlerquelle zu beseitigen. Auf der
Platine werden mit Steckbuchsen oder mit Pfostenleisten die Signale
bereitgestellt, die nur mit einem 1:1 Flachbandkabel an die Laufwerke
gef&uuml;hrt werden m&uuml;sste. (Siehe Flachband weiter oben) Diese
Kabel kann man sich selbst Konfigurieren. Jeweils nach der
ben&ouml;tigten l&auml;nge. Fertige Kabel gibt es nat&uuml;rlich im
einschl&auml;gigen Fachhandel. Das <a href="11.htm" target="UDOcon">Verbindungskabel</a> zwischen der
Umschaltplatine und dem ST Rechner kann in der gleichen Art und Weise
Hergestellt werden, wenn man einen sog. Shugartadapter verwendet.
Dieser Adapter wird in die 14polige Floppybuchse des Rechners gesteckt
und stellt die Laufwerkssignale auf einer 34 poligen Stiftleiste zur
Verf&uuml;gung, auch hier w&uuml;rde dann ein 1:1 Flachbandkabel
gen&uuml;gen. (Siehe Floppyanschlu&szlig;leiste / Shugartbus)
<br>
</p>
<p>Leider sind auch einige Nachteile mit diesem Umbau verbunden, die
neuen Datenleiungen zu den Diskettenlaufwerken d&uuml;rfen nicht mehr
zu lang sein, St&ouml;rungen von Netzteilen oder Monitoren sind dann
die Folge. Die Flachbandkabel besitzen keinerlei Abschirmung. Eine
L&auml;nge von bis zu 40 cm ist allerdings schon realisierbar.
<br>
</p>
<p>Und wenn man seinen Rechner noch nicht in ein PC-Geh&auml;use
Umgebaut hat liegt das ganze Zeug erst mal Schutzlos hinter dem
Rechner. Die Umschaltplatine passt auch beim besten Willen nicht in
ein vorhandenes Floppygeh&auml;use, genauso wenig wie in das originale
Rechnergeh&auml;use. Dann wird auch noch ein zus&auml;tzliches 5V
<a href="10.htm" target="UDOcon">Netzteil</a> f&uuml;r die Stromversorgung f&auml;llig, der Kabelsalat ist
also doch wohl Vorprogrammiert !
</p>
<p>Man sollte also am besten schon ein Tower oder einen PC Umbau
besitzen um die Platine g&uuml;nstig zu verstauen. Nat&uuml;rlich tut
es auch ein gr&ouml;&szlig;eres Geh&auml;use f&uuml;r die Floppys, das
<a href="10.htm" target="UDOcon">Netzteil</a> und die Umschaltplatine.
<br>
</p>
<p>Wenn man die Angaben im ST-Magazin beachtet funktioniert die
Schaltung auf Anhieb. Mittels eines einpoligen Umschalters und der
beiden LED's kann man nun zwischen zwei 'B'-Laufwerken ausw&auml;hlen.
Das z.B externe 2.te 'B' Laufwerk w&uuml;rde sich dann sehr gut als
1,44 Mbyte Drive machen, vorausgesetzt man hat sich bereits die
Hardwareerweiterung zur erh&ouml;hung der Floppycontroller Taktrate
eingebaut und sich ein solches Laufwerk besorgt. Aber auch hier gibt
es z.B Laufwerke bei M&amp;W die eine solche 'HD-Platine' direkt
hinten auf dem Laufwerksanschlu&szlig; tr&auml;gt! Hier w&auml;re also
kein Eingriff in den Rechner n&ouml;tig. Neuerdings bewirbt eine Fa.
in der Atari INSIDE und in der <a href="1604.htm" target="UDOcon">ST-Computer</a> ein HD-Diskettenlaufwerk
bei dem *kein* Eingriff im Rechner stattfindet. D.h das Drive ist
durch einfaches Anstecken an den Rechner bereits HD-F&auml;hig.
<br>
</p>
<p>Auch als Anschlu&szlig; f&uuml;r die 'Blitz' Kopierstation ist
diese oben besprochene Umschaltung nat&uuml;rlich bestens geeignet.
Man mu&szlig; sich dann nur ein geeignetes Anschlu&szlig;kabel
herstellen. Man kann dann so seine Hardware-Kopierstation direkt an
eine Floppyschnittstelle sowie an die <a href="0f07.htm" target="UDOcon">Druckerschnittstelle</a> anstecken.
<br>
</p>
<p>Selbstverst&auml;ndlich ist bei allen Beschreibungen zu beachten
das die Floppylaufwerke nur bei ausgeschaltetem Rechner Ein bzw.
Ausgesteckt werden sollten. Der Treiberbaustein f&auml;ngt zwar
einiges direkt ab, man sollte es aber nie Herrausfordern. Das
Auswechseln eines DMA-Chip's auf der Rechnerplatine kommt etwas
&uuml;ber DM 100.- pro St&uuml;ck, ein <a href="080109.htm" target="UDOcon">Soundchip</a> DM 45.- und der
kleine Floppycontroller schl&auml;gt in etwa mit DM 40.- beim
<a href="1907.htm" target="UDOcon">H&auml;ndler</a> zu Buche. Falls &uuml;berhaupt noch als Erstzteil
vorhanden, Sparen w&auml;hre hier angesagt.
<br>
</p>
<p>Da die <a href="11.htm" target="UDOcon">Verbindungskabel</a> bei der Erweiterungsplatine eigentlich
alle 1:1 Durchverdrahtet werden kann eine gro&szlig;z&uuml;gig
angelegte &Uuml;berpr&uuml;fung der Kabel eigentlich entfallen, da man
hier bei eigentlich nur noch auf die Steckrichtung zu achten braucht.
Der uneingeschr&auml;nkte Vorteil von Flachbandkabel und Steckern zum
Quetschen ! Leider ist es je nach verwendetem <a href="0f0b.htm" target="UDOcon">Stecker</a> auf der
Floppyseite (Shugarbus) m&ouml;glich das der <a href="0f0b.htm" target="UDOcon">Stecker</a> falsch
aufgesteckt werden kann. Es gibt hier leider Exemplare die keine
Arretierungsnase haben! Normalerweise passiert duch das falsche
Aufstecken kaum was. (Selbst schon erlebt) Von der anderen Seite her
ist das Vorpr&uuml;fen bzw. das Markieren der <a href="0f0b.htm" target="UDOcon">Stecker</a> und der
Steckrichtung viel einfacher und sicherer.
<br>
</p>
<p>Die Einbaulage der Platine in ein eventuell vorhandenes Tower oder
PC-Geh&auml;use ist eigentlich egal, die Platine besitzt vier
Befestigungsl&ouml;cher mit der man sie irgendwo bequem anschrauben
kann. Die L&ouml;cher sind allerdings sehr klein geraten so das man
sie vor der Best&uuml;ckung der Platine etwas aufbohren sollte.
Mittels ein paar Schrauben und ein paar Abstandstbolzen ist das
Platinchen sicher befestigt. Naturgem&auml;&szlig; sollte man darauf
achten das die Floppyleitungen nicht stramm verlegt werden, d.h wenn
die Platine in der N&auml;he der Laufwerke angebracht wird ist es
nicht erforderlich 40 cm langes Flachbandkabel zu verwenden, sondern
genau so lange das die Leitungen eben kurz sind und man aber die
Laufwerke eventuell noch leicht aus der Halterung nehmen kann.
<br>
</p>
<p>Besonderes Augenmerk sollte man auf den Anschlu&szlig; der
Spannungsversorgung an der Platine richten, hier kann das Vertauschen
der +5V Spannung mit der Systemmasse gravierende folgen haben,
insbesondere wenn Rechner, Laufwerke und die Platine aus einem
Schaltnetzteil versorgt werden. Der Anschluss f&uuml;r die +5 Volt ist
auf der Platinenl&ouml;tseite mit zwei ' + + ' Symbolen
gekennzeichnet. Ein falscher Anschlu&szlig; an die Stromversorung
(Schaltnetzteil) erzeugt bei dem einen oder anderen Laufwerk schon mal
deftigen Brandgeruch. Das Laufwerk ist meist irreparabel
Besch&auml;digt!
<br>
</p>
<p>Wenn alle Arbeiten abgeschlossen sind kann man dann beginnen die
Sache auszutesten, Sicherheitshalber sollte man dazu keine <a href="0b04.htm" target="UDOcon">Disketten</a>
verwenden die noch 'brauchbare' Daten enthalten. Ein oder zwei leere
<a href="0b04.htm" target="UDOcon">Disketten</a> sollten schon dazu benutzt werden. es sollte dann auch alles
probiert werden. Formatieren, Beschreiben Lesen und das kopieren
zwischen den einzelnen Laufwerken. Sollte sich ein Laufwerk durch den
Umbau nicht mehr Angesprochen f&uuml;hlen sollte man den Rechner
sofort abschalten und seine Arbeiten noch mal genauestens
Kontrollieren. Meistens ist dann eine Verbindungsleitung falsch oder
nicht richtig Aufgesteckt. Dazu geh&ouml;rt auch das nachsehen der
aufgequetschten Verbindungsstecker. Normalerweise l&auml;uft die Sache
aber auf Anhieb. Selbstverst&auml;ndlich ist das Umschalten zwischen
beiden 'B' Laufwerken nur m&ouml;glich wenn gerade *kein* Zugriff auf
eines der Laufwerke gemacht wird. Sollte trozdem w&auml;hrend eines
schreibvorganges Umgeschaltet werden ist mit versch&auml;rftem
Datenschrott zu rechnen.
<br>
</p>
<p>
<br>
<br>
</p>
<p>(c) 7/90 MRT
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li>11.2.1 <a href="0b0201.htm" target="UDOcon">DD-HD Switch</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b.htm" target="UDOcon"><img src="udo_up.gif" alt="Diskettenlaufwerke" border=0 width="24" height="24"></a>
<a href="0b0105.htm" target="UDOcon"><img src="udo_lf.gif" alt="HD-Floppy Mitsubishi MF355" border=0 width="24" height="24"></a>
<a href="0b0201.htm" target="UDOcon"><img src="udo_rg.gif" alt="DD-HD Switch" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
