<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: ED Modul
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_up.gif" alt="HD Disk ST" border=0 width="24" height="24"></a>
<a href="0b0305.htm" target="UDOcon"><img src="udo_lf.gif" alt="HD Modul" border=0 width="24" height="24"></a>
<a href="0b04.htm" target="UDOcon"><img src="udo_rg.gif" alt="Disketten" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="ED_20Modul">11.3.6 ED Modul</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Das Atari ED-Kit3 + von MW </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Es geht nicht ohne zu l&ouml;ten!
<br>
</p>
<p>An Werkzeug brauchen sie am besten einen geregelten feinen
L&ouml;tkolben, einen feinen Elektronik-Seitenschneider, eine Pinzette
und eine feine Flachzange und ebenso ein Multimeter um Fehler
aufzusp&uuml;ren.
<br>
</p>
<p>
<br>
<br><b> Ein ED-Floppylaufwerk am Atari </b>
<br>
</p>
<p>Jaja, sie lesen schon richtig. Auch der ED-Betrieb ist an einigen
Atari-Computern m&ouml;glich. Im folgenden Bild sehen sie eine
kommerzielle L&ouml;sung die bis heute perfekt ihren Dienst
verrichtet.
<br>
</p>
<p>Bild: (c) Bernd Maedicke
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/edkit.gif" border=0 width="494" height="293"></p><br>
<div align=center><tt> Abbildung 1 - Kommerzielles HD/ED-Modul </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Das verwendete HD-Laufwerk mu&szlig; eine <i>automatische</i>
Diskettenerkennung besitzen und am Pin 2 des Shugartbus ein HD-OUT
Signal abgeben k&ouml;nnen. Ist das nicht der Fall funktioniert diese
Umr&uuml;stung nicht korrekt. Oder das Diskettenlaufwerk m&uuml;sste
umgebaut werden, was nicht bei allen Modellen klappt.
<br>
</p>
<p>Von den TEAC Laufwerken FD 235HF, FD 235J und dem EPSON SMD340
finden Sie die notwendigen Einstellungen weiter hinten in diesem
Artikel. Bei anderen Laufwerken m&uuml;ssen sie sich die
Jumperbelegung irgend woher besorgen.
<br>
</p>
<p>Am ED-Kit3+ k&ouml;nnen Sie schon mal das Taktkabel anl&ouml;ten.
Die Abschirmung geh&ouml;rt an Pin 13 und die Seele an Pin 12 der
einreihigen Stiftleiste. Des weiterenm&uuml;ssen Sie noch einen Jumper
von Pin 5 nach Pin 6 der 13-poligen Stiftleiste ST1 setzen, damit das
<a href="0b0104.htm" target="UDOcon">Drive Select</a> 0 Signal f&uuml;r Laufwerk A angeschlossen wird. Stecken
Sie das ED-Kit3+ nun auf den Shugartbus des HD- oder ED-Laufwerkes und
schlie&szlig;en Sie die Stromversorgung an. Diese greift man am besten
mit den beiden mitgelieferten Kabeln direkt von der R&uuml;ckseite der
Laufwerksplatine ab.
</p>
<p>Das rote Kabel l&ouml;tet man an + 5 Volt, welche am
Stromversorgungsanschlu&szlig; des EDKit3+ durch das + gekennzeichnet
ist und das schwarze Kabel an Masse. Die Pinbelegung des
Stromversorgungsanschlusses der TEAC Laufwerke k&ouml;nnen Sie der
nachfolgenden Abbildung entnehmen.
</p>
<p>Pin 1: + 5 Volt
<br>Pin 2: Masse
<br>Pin 3: Masse
<br>Pin 4: nicht angeschlossen
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/edkit1.gif" border=0 width="414" height="55"></p><br>
<div align=center><tt> Abbildung 2 - Stromversorgung </tt>
</div>
<p>
<br>
<br>
</p>
<p>Die Platine ordnen sie so im Rechner an das sie kein Unheil
anrichtet und keine anderen blanken Teile im Rechner ber&uuml;hrt.
Achten sie auf mechanische Stabilit&auml;t, sie wollen ja auch noch
Flachbandkabel anstecken.
<br>
</p>
<p>
<br>
<br><b> Die Jumper des Moduls </b>
<br>
</p>
<p>J1: Verbindet HD-IN mit HD-OUT f&uuml;r Laufwerk 0
<br>J2: Verbindet ED-IN mit ED-OUT f&uuml;r Laufwerk 0
<br>J3: Verbindet HD-IN mit HD-OUT f&uuml;r Laufwerk 1
<br>J4: Verbindet ED-IN mit ED-OUT f&uuml;r Laufwerk 1
<br>J5: HD-Signal von Laufwerk 0 ist low-aktiv (HD-Diskette = 0 Volt)
<br>J6: HD-Signal von Laufwerk 1 ist low-aktiv (HD-Diskette = 0 Volt)
<br>J7: automatische Stepratenanpassung die Steprate wird
hardwarem&szlig;ig auf 3 ms gesetzt
<br>J8: nur f&uuml;r unsere Testzwecke, also offen lassen
<br>
</p>
<p><b> ACHTUNG </b>
<br>
</p>
<p>J1 bis J4 d&uuml;rfen nur beim Anschlu&szlig; des TEAC FD235J
gesetzt werden. Das Laufwerk selber mu&szlig; dabei nach der
M&ouml;glichkeit 1 (siehe Jumperbelegung TEAC FD235J) gejumpert
werden.
<br>
</p>
<p>F&uuml;r das Laufwerk TEAC FD235J gibt es eine Unterteilung des
HD- und ED- Signal. Die Aufteilung in -IN und -OUT Signalen. HD-OUT
und ED-OUT kommen vom Diskettenlaufwerk und geben an, welche
Diskettenart eingelegt ist. Wenn keines der beiden Signale aktiv ist,
so handelt es sich um eine DD-Diskette. HD-IN und ED-IN bestimmen, in
welchem Modus das Laufwerk die Diskette bearbeitet. Somit kann man
also eine HD-Diskette auch im ED-Modus formatieren, indem man das
ED-IN Signal aktiviert.
<br>
</p>
<p>M&ouml;chte man die automatische HD- und ED-Diskettenerkennung des
TEAC FD235J verwenden, so werden J1 und J2 (bzw. J3 und J4 f&uuml;r
das zweite Laufwerk) gesetzt. Dadurch erreicht man, da&szlig; sich das
Laufwerk und das ED-Kit3 + automatisch in den richtigen Modus
versetzen. M&ouml;chte man aber auch HD-<a href="0b04.htm" target="UDOcon">Disketten</a> im ED-Modus
verwenden k&ouml;nnen, so l&auml;sst man J2 (bzw. J4) offen und
bestimmt mit dem ED-IN Signal die Betriebsart.
<br>
</p>
<p>Bei HD-Laufwerken gibt es nur das HD-IN oder das HD-OUT Signal,
aber niemals beide. Normalerweise kommt immer das HD-OUT Signal der
automatischen Diskettenerkennung zur Verwendung. Mit J5 und J6
k&ouml;nnen Sie bestimmen, ob das HD-Signal high-aktiv (HD-Diskette 5
Volt) oder low-aktiv (HD-Diskette = 0 Volt) ist. Falls kein Jumper
gesetzt ist, so erwartet das ED-Kit3+ ein high-aktives HD-Signal.
<br>
</p>
<p>
<br><b>Pinbelegung von ST1: </b>
<br>
</p>
<blockquote>
<p>Pin 1 : HDO-IN
<br>Pin 2 : EDO-IN
<br>Pin 3 : HD1-IN
<br>Pin 4 : ED1-IN
<br>Pin 5 : DSO-A
<br>Pin 6 : DSO-OUT
<br>Pin 7 : DSO-B
<br>Pin 8 : DSO-IN
<br>Pin 9 : DS1-IN
<br>Pin 10: HDOUT
<br>Pin 11: EDOUT
<br>Pin 12: Takt
<br>Pin 13: Abschirmung
<br>
</p>
</blockquote>
<p>
<br>
<br>
</p>
<p align=center><img src="image/edkit2.gif" border=0 width="425" height="184"></p><br>
<div align=center><tt> Abbildung 3 - Laufwerkanschl&uuml;sse und Jumper </tt>
</div>
<p>
<br>
<br>
</p>
<p>&Uuml;ber die linke flache 34-polige Buchse wird das ED-Kit direkt
auf den Shugartbus des HD- oder ED-Laufwerkes &quot;A&quot; gesteckt.
Die hierzu geh&ouml;rigen HD/ED-Signale bezeichnen wir in Zukunft mit
dem Index 0. Die mit AUS gekennzeichnete Steckerleistenwanne nimmt das
Flachbandkabel f&uuml;r den Anschlu&szlig; weiterer Laufwerke auf.
Weiters zum Anschlu&szlig; weiterer Laufwerke erfolgt am Ende dieses
Artikels.
<br>
</p>
<p>Die entsprechenden HD/ED-Signale dieser zus&auml;tzlichen
Laufwerke werden durch den Index 1 gekennzeichnet. Damit wird schon
deutlich, da&szlig; das ED-Kit3+ auch zwei unterschiedliche Laufwerke
gleichzeitig verwalten kann. Das vom Rechner kommende Floppykabel
kommt in die rechte Steckerleistenwanne, die die Bezeichnung EIN
tr&auml;gt.
<br>
<br>Achten sie auf den richtigen Anschlu&szlig; des Kabels.
<br>
<br>Pin 1 - rot markiert - geh&ouml;rt immer nach unten in Richtung
der Beschriftung EIN.
<br>
</p>
<p>Die links neben dem Quarzoszillator liegende zweireihige
Stiftleiste bildet das Jumperfeld. Es gibt acht verschiedene Jumper,
die jeweils senkrecht gesteckt werden. Zur eindeutigen Kennzeichnung
ist &uuml;ber jedem zweiten Jumper die entsprechende Nummer auf die
Platine gedruckt. Die Durchnumerierung beginnt links mit Nr. 1 und
endet rechts mit Nr. 8
<br>
</p>
<p>A Block:
<br>14 - 15 DSO <a href="0b0104.htm" target="UDOcon">Drive Select</a> 0
<br>15 - 16 DS1 <a href="0b0104.htm" target="UDOcon">Drive Select</a> 1
<br>
<br>B Block:
<br>6 - 7 DS2 <a href="0b0104.htm" target="UDOcon">Drive Select</a> 2 7 - 8 DS3 <a href="0b0104.htm" target="UDOcon">Drive Select</a> 3
<br>C-Block:
<br>4 - 5 HDO automatische Diskettenerkennung
<br>5 - 13 HDI HD-Modus durch HD-IN Eingang
<br>
<br>D-Block:
<br>1 - 2 HHI HD-IN Eingang ist high-aktiv (HD - Modus = + 5 Volt)
<br>2 - 3 LHI HD-IN Eingang ist low-aktiv (HD - Modus = O Volt)
<br>
</p>
<p>E-Block nur f&uuml;r Testzwecke und Kalibrierung
<br>
</p>
<p>F&uuml;r den Betrieb am ED-Kit3+ m&uuml;ssen folgende Jumper
gesteckt werden:
<br>HDO undDSO oder DS1 oder DS2.
<br>
</p>
<p>
<br>
<br><b> Verwendbare <a href="0b.htm" target="UDOcon">Diskettenlaufwerke</a> </b>
<br>
</p>
<p>Bei Diskettenlaufwerken gibt es eine gro&szlig;e Anzahl von
verschiedenen Herstellern und Modellen. Folgende HD-Laufwerke
k&Uuml;nnen problemlos am ED-Kit3+ betrieben werden:
<br>
</p>
<blockquote>
<p>TEAC FD 235HF
<br>EPSON SMD340
<br>TEAC FD 155 GFR (5 1/4 Zoll)
<br>
</p>
</blockquote>
<p>Bei vielen anderen Modellen ist der Anschlu&szlig; ebenfalls
m&ouml;glich, jedoch m&uuml;ssen sie hier die Jumpereinstellungen der
Laufwerks selbst herausfinden. Ganz anders sieht es bei den
ED-Laufwerken aus. Hier ist bisher nur der Anschlu&szlig; des TEAC FD
235J m&ouml;glich.
<br>
</p>
<p>F&uuml;r den ED-Betrieb sind zwei neue zus&auml;tzliche Signale am
Shugartbus eingef&uuml;hrt worden, wobei sich jedoch noch keine
eindeutige Norm bei der Pinbelegung herausgestellt hat. Die TEAC-FD
235J Laufwerke haben den Vorteil, da&szlig; sie die mit Abstand
flexibelste Anschlu&szlig;belegung haben, die kompatibel zu der
Belegung der HD-Laufwerke ist. Somit kann man zwei Laufwerke an einem
einzigen Flachbandkabel betreiben. Bei anderen ED-Laufwerken
m&uuml;ssen sie auf die Pinbelegung achten und Notfalls dann auch das
Flachbandkabel modifizieren.
<br>
</p>
<p>
<br><b> Jumperbelegung TEAC FD235J </b>
</p>
<p>Auch hier &uuml;berlappen wieder einige Jumperpositionen. Dennoch
sind alle sinvollen Kombinationen m&ouml;glich. F&uuml;r den Betrieb
am ED-Kit3+ m&uuml;ssen folgende Jumper gesteckt werden:
<br>
</p>
<p>M&ouml;glichkeit 1:
<br>HD/ED-IN und HD/ED-OUT: H12, EI6, H033, E029, MSC
<br>
</p>
<p>M&ouml;glichkeit 2: nur automatische Diskettenerkennung : H02,
E06, HIS, EIS und zus&auml;tzlich:
<br>DSO oder DS1 oder DS2 und beim TT auch DC34.
<br>
<br><b> Jumperbelegung TEAC FD235HF </b>
<br>
</p>
<p>Die meisten Jumperstellungen &uuml;berlappen sich gegenseitig. Man
mu&szlig; also Priorit&auml;ten setzen. HF mu&szlig; immer gesteckt
werden. Bei den Jumpern HF, LHI und LHO gibt es zwei
Steckm&ouml;glichkeiten. F&uuml;r den Betrieb am ED-Kit3+ m&uuml;ssen
folgende Jumper gesteckt werden:
<br>HF, HA, H02, und DSO oder DS1 oder DS2. Beim TT zus&egrave;tzlich
auch DC34. Die &auml;ltere Version des TEAC FD235HF hat nur 5 Jumper.
Hier m&uuml;ssen Sie HHO, OP und DO oder D1 stecken.
<br>
</p>
<p>
<br>
<br><b> Wichtig </b>
<br>
</p>
<p>Die 34 polige Buchse zum Anschlu&szlig; des Flachbandkabels auf
der R&uuml;ckseite ist bei HD- und ED-Laufwerken um 180 Grad
gegen&uuml;ber der Einbaurichtung bei den DD-Laufwerken gedreht
worden! Das m&uuml;ssen sie dringend beachten!
<br>
</p>
<p>Richten sie sich daher immer nach Pin 1 der Buchsenleisten und der
Arretierungsnasen! Pin 1 ist bei vielen Laufwerken auch auf der
Platine aufgedruckt und befindet sich zumeist auch immer direkt neben
dem Stromanschlu&szlig;
<br>
</p>
<p>Beim einem falschen Anschlu&szlig; leuchtet auch bei
eingeschaltetem Computer die Floppy-LED dauernd und der Motor dreht
sich st&auml;ndig. Mehr passiert der Regel nach nicht. Legen sie es
aber nicht unbedingt darauf an.
<br>
</p>
<p>Die Fa. Atari verwendet f&uuml;r interne Laufwerke generell eine
eigenwillig geformte Frontblende. Sie werden hier beim austausch des
Diskettenlaufwerks immer mechanische Arbeiten haben. Es gibt keine
passende Blenden. Als Alternative bleibt sonst nur das EPSON SMD340
HD-Laufwerk, welches auch mit Original Atari-Frontblende lieferbar
war. Ob man das heute noch irgend wo beziehen kann ist mir leider
unbekannt.
<br>
</p>
<p>
<br>
<br><b> ED-Betrieb mit HD-<a href="0b04.htm" target="UDOcon">Disketten</a> </b>
<br>
</p>
<p>Nat&uuml;rlich k&ouml;nnen noch keine konkreten Aussagen
bez&uuml;glich der Datensicherheit gemacht werden, aber bisher sind
noch keine Fehler aufgetreten. Es zeigt sich direkt bei der
Formatierung, ob eine HD-Diskette f&uuml;r den ED-Betrieb geeignet ist
oder nicht. Gute Erfahrungen gibt es mit HD-<a href="0b04.htm" target="UDOcon">Disketten</a> von BASF,
Maxell, Sony und TDK.
<br>
</p>
<p>Das ED-Kit3 + mu&szlig; sich immer in den selben Modus wie das
Laufwerk einstellen. Dazu wird das HD-Signal von Pin 2 bzw. das
ED-Signal von Pin 6 des Shugartbus abgefragt und dann der
entsprechende Takt f&uuml;r den FDC ausgew&auml;hlt.
<br>
</p>
<p>Sehr wichtig ist auch noch die Steprate. Um von einer Spur zur
n&auml;chsten zu fahren, braucht der Schreib/Lesekopf des Laufwerkes
eine bestimmte Zeitspanne, die normalerweise 3 mS (1 mS entspricht
einer tausendstel Sekunde) betr&auml;gt.
<br>
</p>
<p>Wird nun der (FDC) Floppy Disk Controller mit dem doppelten oder
gar vierfachen Takt betrieben, so vergeht f&uuml;r ihn die Zeit
deutlich schneller. Das bedeutet, da&szlig; im HD-Betrieb aus der
urspr&uuml;nglichen Steprate von 3 mS nun 1,5 mS und im ED-Betrieb
sogar nur noch 0,75 mS werden. Das ist nat&uuml;rlich f&uuml;r die
Mechanik des Laufwerks viel zu wenig, es wird daher direkt die
Fehlermeldung &quot;Laufwerk A antwortet nicht..&quot; erzeugt.
<br>
</p>
<p>Um die Steprate trotzdem auf 3 mS zu erhalten gibt es zwei
M&ouml;glichkeiten. Bei der automatischen Stepratenanpassung wird der
FDC-Takt hardwarem&auml;ssig f&uuml;r die Stepzeit wieder auf 8 MHz
zur&uuml;ckgeschaltet, so da&szlig; sich der gew&uuml;nschte Wert auch
wirklich ergibt. Die zweite M&ouml;glichkeit besteht in der
softwarem&auml;ssigen Erh&ouml;hung auf 6 mS im HD-Betrieb, bzw. auf
12 mS im ED-Betrieb. Das ED-Kit3+ unterst&uuml;tzt diese beide
Methoden.
<br>
</p>
<p>Es besitzt eine hardwarem&auml;ssige automatische
Stepratenanpassung, die auf Wunsch abschaltbar ist.
<br>
<br>
</p>
<p><i> Der normale Atari FDC ist daf&uuml;r nicht geeignet!
</i>(!nl)
<br>
</p>
<p>F&uuml;r den ED-Betrieb ist also unbedingt der Original 'Ajax'
Chip notwendig. Auf diesen Namen wurde der Spezialchip von Atari
selbst getauft. Dieser Chip wurde extra f&uuml;r den erh&ouml;hten
Takt in Atari Computern mit HD-Diskettenlaufwerken entwickelt und er
ist ab Werk auch nur in diesen Ger&auml;ten eingebaut.
<br>
</p>
<p>Ansonsten ist er vollkommen kompatibel zum normalerweise
verwendeten FDC vom Typ WD-1 772.
<br>
</p>
<p>Die Pinbelegung finden sie hier im Archiv.
<br>Der &quot;Ajax&quot; tr&auml;gt die Bezeichnung &quot;0 1990
ATARI, C302096-001 A&quot;.
<br>
</p>
<p>Des weiteren gibt es noch einen weiteren mit der Typennummer
C302434-001, der ausschliesslich im Atari TT eingesetzt wird. Auch
dieser Chip ist nicht f&uuml;r den hier verwendeten ED-Modus geeignet!
<br>
</p>
<p>
<br>
<br><b> Funktion und Prinzip </b>
<br>
</p>
<p>Das Grundprinzip aller HD/ED-Module liegt in der Anpassung des
Taktes des Floppydiskcontrollers (in Zukunft der K&uuml;rze wegen
immer nur FDC genannt) an die gew&uuml;nschte Betriebsart des
Diskettenlaufwerkes. Dabei ist der 8 MHz Takt gleichbedeutend mit dem
DD-Modus. DD steht f&uuml;r Double Density, zu deutsch 'doppelte
Dichte' und war bei der Einf&uuml;hrung des STs die &uuml;bliche
Betriebsart.
</p>
<p>Auf eine 3 1/2 Zoll DD-Diskette passen 720 KByte bei der
Standardformartierung. Um mehr Speicherplatz auf der Diskette zu
erhalten, wurde das HD-Format eingef&uuml;hrt. Dies wird durch die
Taktverdopplung des FDCs erreicht, der im HD-Modus mit 16 MHz
betrieben wird. HD kommt &uuml;brigens von High Density, zu deutsch
'hohe Dichte'. Die Taktverdopplung hat gleich zwei Vorteile: es wird
sowohl die Speicherkapazit&auml;t als auch die Schreib- und
Lesegeschwindigkeit verdoppelt.
</p>
<p>Auf eine 3 1/2 Zoll HD-Diskette passen 1.44 MByte. Die 5 1/4 Zoll
Laufwerke arbeiten beim HD-Betrieb normalerweise mit einer
h&Uuml;heren Drehgeschwindigkeit, weshalb sie &quot;nur&quot; 1,2
MByte auf eine Diskette bekommen. Seit neuestem gibt es nun
ED-Laufwerke, die 2.88 MByte pro Diskette speichern k&ouml;nnen. Da
auch hier wieder das selbe Prinzip der Taktverdopplung angewendet
wird, mu&szlig; der FDC im ED-Betrieb mit 32 MHz getaktet werden. ED
steht f&uuml;r Extra High Density, welches man mit 'besonders hohe
Speicherkapazit&auml;t' &uuml;bersetzen kann. Diese <a href="0b04.htm" target="UDOcon">Disketten</a> werden
viermal so schnell gelesen, wie die normalen DD-<a href="0b04.htm" target="UDOcon">Disketten</a>. Das
ED-Laufwerk kann nat&uuml;rlich auch die DD- und HD-<a href="0b04.htm" target="UDOcon">Disketten</a> lesen
und beschreiben.
</p>
<p>Alle oben gemachten Angaben bez&uuml;glich der
Speicherkapazit&auml;t und der Lesegeschwindigkeit beziehen sich auf
die Standardformatierung. Da die ATARI-Rechner sehr flexibel in der
Diskettenformatierung sind, kann man diese Werte durch geeignete
Formatierung noch wesentlich erh&ouml;hen. So erreicht z.B. E-Copy
eine Daten&uuml;bertragungsrate von mehr als 80 KByte/s bei
ED-<a href="0b04.htm" target="UDOcon">Disketten</a>. Au&szlig;erdem lassen sich so bis zu 3.3 MByte auf einer
einzigen Diskette speichern. Deshalb sind ED-<a href="0b04.htm" target="UDOcon">Disketten</a> auch sehr gut
f&uuml;r ein Backup geeignet. Nat&uuml;rlich gibt es bei der
Taktverdopplung einiges zu beachten. Es mu&szlig; sichergestellt sein,
da&szlig; Laufwerk und FDC im selben Modus betrieben werden. Es hat
keinen Zweck, mit einem HD-Laufwerk ED-<a href="0b04.htm" target="UDOcon">Disketten</a> zu formatieren.
Desweiteren stellen der HD- und ED-Betrieb nat&uuml;rlich auch
h&Uuml;here Anspr&uuml;che an die <a href="0b04.htm" target="UDOcon">Disketten</a>. Dementsprechend gibt es
f&uuml;r jede Betriebsart eine eigene Diskettensorte. Diese sind bei
den 3 1/2 Zoll <a href="0b04.htm" target="UDOcon">Disketten</a> an einer zus&auml;tzlichen Markierung zu
erkennen. Bei den HD-<a href="0b04.htm" target="UDOcon">Disketten</a> gibt es gegen&uuml;ber der
Schreibschutzkerbe, auf gleicher H&ouml;he, das sogenannte HD-Loch.
Bei ED-<a href="0b04.htm" target="UDOcon">Disketten</a> liegt die entsprechende Markierung etwas zur
Diskettenmitte hin versetzt gegen&uuml;ber der Schreibschutzkerbe.
</p>
<p>Mit Hilfe eines mechanischen Tasters kann das Laufwerk die
eingelegte Diskettenart anhand dieser Markierungen erkennen und sich
auf den entsprechenden Modus einstellen. Man spricht hierbei von der
automatischen Diskettenerkennung. Bei 5 1/4 Zoll Laufwerken gibt es
keine Diskettenerkennung.
</p>
<p>
<br>
<br><b> Formatieren.. </b>
<br>
</p>
<p>Zum Formatieren von HD-<a href="0b04.htm" target="UDOcon">Disketten</a> eigent sich E-Copy oder das
PD-Programm PUMPUP von Claus Brod. Beide verwenden nur
Betriebssystemfunktionen zum Formatieren. Dadurch werden Probleme beim
HD-Betrieb direkt beim Formatieren aufgedeckt und nicht erst
sp&auml;ter beim Lesen oder Schreiben vom <a href="0903.htm" target="UDOcon">Desktop</a> heraus.
<br>
</p>
<p>Zum ED-Betrieb ben&ouml;tigen Sie unbedingt E-Copy.
<br>
<br>
</p>
<p>Weitere Laufwerke, egal ob intern oder extern, werden &uuml;ber
ein Flachbandkabel an der mit AUS gekennzeichneten Steckerleistenwanne
angeschlossen. Davon gibt es nur eine Ausnahme:
<br>
</p>
<p>Bei Verwendung von insgesamt 2 Laufwerken kann man die externe ST-
Floppybuchse f&uuml;r den Anschlu&szlig; des alten DD-Laufwerkes
benutzen. Dabei m&uuml;ssen Sie dann aber das externe Laufwerk auf
<a href="0b0104.htm" target="UDOcon">Drive Select</a> 0 jumpern, da bei den Rechnern mit internen Laufwerk das
<a href="0b0104.htm" target="UDOcon">Drive Select</a> 1 Signal f&uuml;r Floppy B am Pin f&uuml;r <a href="0b0104.htm" target="UDOcon">Drive Select</a> 0
der externen Floppybuchse anliegt.
<br>
</p>
<p>Das ED-Kit3 + spricht alle Laufwerke mit unterschiedlichen Drive
Select Signalen an:
<br>
</p>
<p><a href="0b0104.htm" target="UDOcon">Drive Select</a> 0 f&uuml;r Lauferk A, <a href="0b0104.htm" target="UDOcon">Drive Select</a> 1 f&uuml;r
Laufwerk B und <a href="0b0104.htm" target="UDOcon">Drive Select</a> 2 f&uuml;r das dritte Laufwerk. Bei 5 1/4
Zoll Laufwerken gibt es keine automatische Diskettenerkennung.
M&ouml;chte man trotzdem HD- und DD-<a href="0b04.htm" target="UDOcon">Disketten</a> verwenden, so mu&szlig;
man ein k&uuml;nstliches HDSignal erzeugen und an Pin 3 von ST1
anschlie&#186;en. Einfacher ist es jedoch, das 5 1/4 Zoll Laufwerk nur
im HD-Betrieb zu verwenden und mit J6 die erforderliche Polarit&auml;t
des HD-Signals einzustellen.
<br>
</p>
<p>Leider sind die 5 1 /4 Zoll Laufwerke mit zu kleineren
Pullup-Widerst&auml;nden ausgestattet als die 3 1/2 Zoll
Ausf&uuml;hrungen und fordern daher eine h&ouml;here Treiberleistung.
Dies macht bei einigen Rechnermodellen Schwierigkeiten. Sie finden
hier im Archiv passende L&ouml;sungen.
<br>
</p>
<p>Beim Anschlu&szlig; von drei Laufwerken sind auf jeden Fall genaue
Kenntnisse &uuml;ber die verschiedenen Pinbelegungen der Laufwerke
notwendig. Deshalb sollten wirklich nur Fachleute diesen Einbau
vornehmen.
</p>
<p>F&uuml;r den Anschlu&szlig; von drei Laufwerken wird
zus&auml;tzlich ein einpoliger Umschalter ben&ouml;tigt, der an ST1
des ED-Kit3 + angeschlossen wird. Es wird das <a href="0b0104.htm" target="UDOcon">Drive Select</a> 0 wahlweise
von Pin 6 nach Pin 5 durchgeschaltet - Laufwerk A wird angesprochen -
oder von Pin 6 nach Pin 7 f&uuml;r das dritte Laufwerk. Dadurch kann
man auch vom dritten Laufwerk booten.
<br>
</p>
<p>Nur Laufwerke mit der <b> gleichen </b> Pinbelegung des
Shugartbus lassen sich an einem gemeinsamen Flachbandkabel
durchschleifen. Dies bedeutet, da&szlig; entweder beide Laufwerke oder
aber keines von beiden eine automatische Diskettenerkennung verwenden
darf.
<br>
</p>
<p>Der Grund hierf&uuml;r liegt darin, da&szlig; die HD-OUT und
ED-OUT Signale auch immer aktiv sind, wenn das Laufwerk nicht
angesprochen wird. Ein konkretes Beispiel: das zweite Laufwerk ist ein
HD-Laufwerk und das dritte nur ein DD-Laufwerk. Spricht man nun das
dritte Laufwerk an, so aktiviert das zweite das HD-OUT Signal und
folglich schaltet das ED-Kit3+ auf HD-Betrieb um. Dies f&uuml;hrt
nat&uuml;rlich zu einer Fehlermeldung.
<br>
</p>
<p>Das gleiche gilt auch f&uuml;r den Betrieb von ED- und
HD-Laufwerken an einem gemeinsamen Kabel. Hierbei wird sogar das
HD-OUT (Pin 33) und ED-OUT Signal (Pin 29) des ED- Laufwerkes vom
anderen Laufwerk auf Masse gezogen, da bei den DD- und HD-Laufwerken
alle ungeraden Pins des Shugartbus auf Masse liegen.
<br>
</p>
<p>
<br>Das Kit wurde Vertrieben von:
<br>
</p>
<p>MW Electronic
<br>Postfach 2168
<br>5330 K&Uuml;nigswinter 1
<br>
</p>
<p>Tel. und Fax: 02223 1 1567
<br>
</p>
<p>
<br><b> Drive Selekt nachr&uuml;sten </b>
<br>
</p>
<p>Die Anschl&uuml;sse an der 13 poligen Steckerleiste ST1 werden
hierzu benutzt.
<br>
</p>
<p>Leider ist bei &auml;lteren Atari-Modellen das Drive-Select 1
Signal (DS1) f&uuml;r das zweite Laufwerk nicht am internen Shugartbus
angeschlossen. Sollten Sie im Besitz eines 1040 ST, MEGA ST (ohne e)
oder TT sein und zwei Laufwerke anschlie&szlig;en wollen, so
m&uuml;ssen Sie dieses Signal im Computer nachr&uuml;sten.
<br>
</p>
<p>Am einfachsten geht dies, indem Sie vom Pin 19 des <a href="080109.htm" target="UDOcon">Soundchip</a>
(Bezeichnung YM 2149 oderAY-3-891 0) ein d&uuml;nnes Kabel zum Pin 9
von ST1 des ED-Kit3+ verlegen und verl&ouml;ten. Die Pinbelegung des
40 poligen <a href="080109.htm" target="UDOcon">Soundchip</a> finden sie hier im Archiv unter Pin.
<br>
</p>
<p>M&ouml;chten Sie auch HD-<a href="0b04.htm" target="UDOcon">Disketten</a> im ED-Modus formatieren, so
lassen Sie J2 (bzw. J4 f&uuml;r das zweite Laufwerk) offen. Daf&uuml;r
schlie&szlig;en an Pin 2 (bzw. Pin 4) von ST1 einen Schalter an, mit
dem Sie wahlweise zwischen + 5 Volt und GND umschalten.
<br>
</p>
<p>+5 Volt bedeuten ED-Modus und die 0 Volt (GND) den HD-Modus.
<br>
</p>
<p>Alternativ k&ouml;nnen Sie auch den ED-IN Eingang - dies ist
besagter Pin 2 bzw. Pin 4 von ST1 - auch an Pin 14 oder Pin 15 des
<a href="080109.htm" target="UDOcon">Soundchip</a> anl&ouml;ten. So kann man durch Setzen des Bit 6 des
Soundchips f&uuml;r Pin 15 und des Bit 7 f&uuml;r Pin 14 den ED-Modus
aktivieren.
<br>
</p>
<p>Ben&ouml;tigt wird hierzu aber SOUNDSEL.PRG, das ausschliesslich
mit dem EDKit ausgeliefert wurde.
<br>
</p>
<p>Die Umschaltung mittels <a href="080109.htm" target="UDOcon">Soundchip</a> ist beim MEGA STE und TT sollten
sie nur machen wenn sie in der Lage sind die Leitung an der
PLCC-Version des Soundchips anzul&ouml;ten. Dessen Pinbelegung finden
sie ebenfalls unter Pin in diesem Archiv.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Einbau in den Rechner </b>
<br>
</p>
<p>Generell schalten Sie ihren Computer aus und enfernen alle von
au&szlig;en eingesteckte Kabel.
<br>
</p>
<p>Bei diversen Rechermodellen d&uuml;rfen sie das <a href="10.htm" target="UDOcon">Netzteil</a> und die
interne Floppy entfernen. Beim Mega STe und TT ist die interne
Festplatte nur durch eine gro&szlig;e Schraube im Geh&auml;usedeckel
gesichert und sollte komplett entfernt werden.
<br>
</p>
<p>Aller Regel nach braucht nur das Flachbandkabel vom alten Laufwerk
abgezogen werden und auf die mit EIN beschriftete Steckerleistenwanne
des EDKit gesteckt zu werden.
</p>
<p>Falls Sie bisher ein DD-Laufwerk verwendeten, so m&uuml;ssen Sie
dazu das Kabel um 180 Grad drehen. Dies bereitet bei einigen 1040er
und Mega STs Probleme da die Kabel recht kurz sind. Verwenden sie dann
das beigelegte spezielle Flachbandkabel mit dem Steckadapter f&uuml;r
die Verl&auml;ngerung. Achten Sie darauf, da&szlig; die rote
Markierung f&uuml;r Pin 1 bei beiden Kabeln auf der gleichen Seite
liegt. Nur so ist der Anschlu&szlig; automatisch richtig.
<br>
</p>
<p>Am Laufwerk mu&szlig; die rote Markierung zur Laufwerksmitte
zeigen.
<br>
</p>
<p>Jetzt mu&szlig; noch die Taktzuf&uuml;hrung am FDC angeschlossen
werden.
<br>
</p>
<p>Der FDC befindet sich bei fast allen Atari Modellen in der
N&auml;he der Floppybuchse. Beim Mega STe m&uuml;ssen Sie den
Festplattenadapter entfernen, um an den FDC zu gelangen.
<br>
</p>
<p>Falls der FDC kein Ajax ist und auch noch nicht gesockelt ist, so
m&uuml;ssen Sie dazu die gesamte Hauptplatine herausnehmen und den
alten Chip sauber entfernen. Zum entl&ouml;ten eines Chips finden sich
in diesem Archiv zahlreiche Tips.
</p>
<p>Siehe <a href="190a.htm" target="UDOcon">Elektronische Arbeiten</a>.
<br>
</p>
<p>Der neue Takt wird an Pin 18 des FDC angel&ouml;tet. Dieser Pin
mu&szlig; vorher mit einem kleinen und guten Seitenschneider von der
Platine getrennt werden. Biegen sie das Beinchen danach leicht nach
oben, es darf keinen Kontakt zum L&ouml;tauge der Platine herstellen,
achten sie darauf das dieses Beinchen nicht abbricht!
<br>
</p>
<p>Ist der FDC jedoch schon gesockelt, so gen&uuml;gt es, den Pin 18
vorsichtig hochzubiegen. L&ouml;ten sie in beiden F&auml;llen den Takt
am hochgebogenen Pin 18 an.
</p>
<p>Der schnellste Weg diesen Chip sauber zu entfernen ist ein sehr
feiner Seitenschneider und eine ruhige Hand. Merken Sie sich unbedingt
die richtige Einbaurichtung anhand der Kerbe. Schneiden Sie vorsichtig
die einzelnen Beine des Chips durch und entfernen Sie die Pinreste
anschlie&szlig;end einzeln mit L&ouml;tkolben, Pinzette und ev. einer
Saugpumpe. (Entl&ouml;tpumpe)
</p>
<p>Dem neuen FDC sollten Sie auf jeden Fall einen guten Sockel
spendieren!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_up.gif" alt="HD Disk ST" border=0 width="24" height="24"></a>
<a href="0b0305.htm" target="UDOcon"><img src="udo_lf.gif" alt="HD Modul" border=0 width="24" height="24"></a>
<a href="0b04.htm" target="UDOcon"><img src="udo_rg.gif" alt="Disketten" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
