<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: HD Floppy / MegaST
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_up.gif" alt="HD Disk ST" border=0 width="24" height="24"></a>
<a href="0b0301.htm" target="UDOcon"><img src="udo_lf.gif" alt="HD Disk STe" border=0 width="24" height="24"></a>
<a href="0b0303.htm" target="UDOcon"><img src="udo_rg.gif" alt="HD Switch" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="HD_20Floppy_20_2F_20MegaST">11.3.2 HD Floppy / MegaST</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Einbau eines HD-Laufwerk in einen MegaST </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Text von Albin Lass @HB2
<br>
<br>
</p>
<p>Ob sich ein heute &uuml;bliches HD-Floppy in einen MegaST einbauen
l&auml;sst?
<br>
</p>
<p>Eigentlich schon, aber nicht so ohne weiteres und nicht ohne Lust
dran zu werkeln. Das liegt daran, da&szlig; jeder Laufwerkshersteller
zwar die Aussenma&szlig;e so ziemlich gleich gestaltet hat (eigentlich
ist nur die Breite genormt, die L&auml;nge und H&ouml;he k&ouml;nnen
etwas variieren), aber die Befestigung der Frontblende und
Auswurfknopf zumeist verschieden sind. Und weil diese beiden nicht mit
ins Geh&auml;use passen, bzw. darin nicht kompatibel zur
Floppy-Aussparung sind, m&uuml;ssen diese von der HD-Floppy abmontiert
und mit der Blende und Knopf vom ATARI 'angefreundet' werden. Das
bedeutet saubere mechanische Arbeiten, wenn es hinterher auch noch
sch&ouml;n aussehen soll.
<br>
</p>
<p>Also ehrlich gesagt: Die selbe Problematik hatte ich selbst beim
Einbau einer HD-Floppy in meinem MegaST. Ich bin damals so
vorgegangen:
<br>
<br>
</p>
<p>- Erstmal Rechner auf und alte Floppy raus.
<br>- Die Neue (ohne Blende und Knopf) am alten Platz montiert und das
Geh&auml;use wieder raufgelegt, um zu sehen ob die Floppy
&uuml;berhaupt darin Platz hat.
<br>
<br>
</p>
<p>- Nun wollte ich zuerst den Auswurfknopf vom ATARI anpassen. Dazu
mu&szlig;te das Geh&auml;use mit eingesetzter Blende und Knopf
aufgesetzt und die Lage des Knopfes ausgemessen werden (relativ zum
Geh&auml;userand).
<br>
<br>
</p>
<p>- Dann wurde der Knopf (ohne Geh&auml;use!) der entsprechend
gemessenen Position an der Floppy gehalten. Der hintere Teil, der
nicht mehr in die Floppy pa&szlig;t, wurde markiert und abgeschnitten.
<br>
<br>- An der Stelle, wo sich die Befestigungslasche der
Auswurf-Mechanik befindet, hatte ich einen Schlitz mit einem
Kleinbohrer in den Knopf gemacht. Dieser wurde dann darin reingelegt
und mit einem St&uuml;ck Streichholz (geht aber auch mit was Anderen
oder Klebstoff) fixiert.
<br>
<br>- Danach kam die Blende dran. Hier mu&szlig;ten &uuml;berstehende
Befestigungshaken und einige Plastiknoppen im Innenteil abgeschnitten
werden, damit die Blende am Floppyrahmen b&uuml;ndig sa&szlig;.
<br>
<br>- Au&szlig;erdem mu&szlig;ten einige Metallst&uuml;cke vom
Floppyrahmen dran glauben, weil die Klappe nicht ganz auf ging. Das
hatte ich mit einem kleinen Trenn- schleifer ges&auml;gt (Vorsicht mit
den Metallsp&auml;nen!).
<br>
<br>- Das handwerkliche war nun geschafft. Jetzt mu&szlig;te nur noch
das Flachband- kabel mit der Floppy verbunden werden. Achtung: bei
einigen Floppies ist die Pfostenleiste gedreht! Also auf die
Markierungen achten und g.g.f. das Kabel drehen. Ich mu&szlig;te
drehen und es war gerade noch so kurz, da&szlig; es in die Leiste
pa&szlig;te. Wenn's nicht pa&szlig;t: f&uuml;r 'ne Mark ein Neues
kaufen.
<br>
</p>
<p>
<br>Hoffentlich hast Du dich nicht von dieser Prozedur abschrecken
lassen. Es mu&szlig; auch nicht genauso bei Dir ablaufen. Das
h&auml;ngt, wie oben schon gesagt, von der Bauform der neuen Floppy
ab. Aber was tut man schlie&szlig;lich nicht alles um seine M&ouml;hre
aufzumotzen. Nur Mut!
<br>
</p>
<p>
<br><b> Anmerkung </b>
</p>
<p>Die Fa. Atari verwendet f&uuml;r interne Laufwerke generell eine
eigenwillig geformte Frontblende. Sie werden hier beim austausch des
Diskettenlaufwerks immer mechanische Arbeiten haben. Es gibt keine
passenden Blenden. Als Alternative bleibt sonst nur das EPSON SMD340
HD-Laufwerk, welches auch mit Original Atari-Frontblende lieferbar
war. Ob man das heute noch irgend wo beziehen kann ist mir leider
unbekannt.
<br>
</p>
<p>
<br>
<br><b> Der ST hat noch ein TOS 1.0? </b>
<br>Soviel ich weiss, kann das nicht mit HD <a href="0b04.htm" target="UDOcon">Disketten</a> umgehen.
<br>
</p>
<p>Das h&auml;ngt nicht so sehr von TOS ab (obwohl ich Dir da
empfehlen w&uuml;rde, eine neuere Version zu besorgen, weil die
Version 1.0 doch sehr fehlertr&auml;chtig ist, sondern zuerst an dem
verwendeten Floppycontroller (FDC) in deinem 1040STF.
<br>
</p>
<p>Mir sind folgende Typen bekannt: WD 1772-PH-00-00, -00-02 und
-02-02. In dieser Reihenfolge werden sie immer besser. Bei den
&auml;lteren Typen k&ouml;nnen thermische Probleme auftreten, da diese
im HD-Betrieb mit 16 MHz-Taktrate (statt normal 8 MHz) betrieben
werden m&uuml;ssen und somit hei&szlig; laufen und damit nicht richtig
funktionieren (z.B. keine STEP-Impulse mehr zur Floppy). Dies
l&auml;&szlig;t sich aber zumeist mit ein wenig W&auml;rmeleitpaste
und einem K&uuml;hlk&ouml;rper (mit m&ouml;glichst gr&ouml;&szlig;er
K&uuml;hloberfl&auml;che) auf dem FDC beheben (auch wenn dies wo-
anders bestritten wird).
<br>
</p>
<p>Au&szlig;erdem wird nat&uuml;rlich noch ein HD-Modul
ben&ouml;tigt, das man aber selbst f&uuml;r ca. 10-15,- DM nachbauen
kann. Ich hab' min. ein Dutzend Bauanleitungen und Schaltpl&auml;ne
daf&uuml;r bei mir rumliegen. Sogar eine mit automatischer Stepraten-,
Density-Erkennung, optionalen HYPER-DENSITY (ca. 1.1 MByte auf DD) und
somit keinen Treiber ben&ouml;tigt.
<br>
<br>Kann ich aber wenigstens ein HD Drive als DD nutzen?
<br>
</p>
<p>Aber nat&uuml;rlich! DD geht immer (auch mit ED-Floppies). Nur
HD-Disks laufen ohne Modifikation (siehe oben) nicht.
<br>
</p>
<p>
<br>
<br><b> HD Modus am MegaSTe </b>
<br>
</p>
<p>Bevor sich sich mit dem MegaSTe abm&uuml;hen sollten sie
nachschauen ob der Chip UA02 die Bezeichnung C301901-002 tr&auml;gt.
Nur mit diesem PAL ist der Betrieb von HD-Diskettenlaufwerken
&uuml;berhaupt erst m&ouml;glich.Ist das nicht der Fall sollten sie
sich bei der Fa. Best-Electronics den passenden Chip besorgen.
<br>
</p>
<p>Von Chip U7, dessen Pin 32 mu&szlig; eine Verbindung zu UA02,
PAL20L8 und dessen Pin 19 bestehen. Ist das beides nicht vorhanden
istder Betrieb eines HD-Diskettenlaufwerks nicht m&ouml;glich. Fehlt
diese Verbindung mu&szlig; diese Hergestellt werden. Dazu reicht eine
d&uuml;nne Leitung.
</p>
<p>Das HD-Upgrade Kit mit TOS 2.06, <a href="040a.htm" target="UDOcon">AJAX</a> Chip und EPSON SMD340 Floppy
von Atari hatte auch das PAL C301901-002 mit im Lieferumfang.
</p>
<p>Ohne das richtige PAL k&ouml;nnen HD-<a href="0b04.htm" target="UDOcon">Disketten</a> u.U zwar gelesen
werden, aber sonst passiert nicht viel. Das Formatieren einer
HD-Diskette schl&auml;gt fehl.
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0b03.htm" target="UDOcon"><img src="udo_up.gif" alt="HD Disk ST" border=0 width="24" height="24"></a>
<a href="0b0301.htm" target="UDOcon"><img src="udo_lf.gif" alt="HD Disk STe" border=0 width="24" height="24"></a>
<a href="0b0303.htm" target="UDOcon"><img src="udo_rg.gif" alt="HD Switch" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
