<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: CD-ROM
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c.htm" target="UDOcon"><img src="udo_up.gif" alt="CD-Laufwerke" border=0 width="24" height="24"></a>
<a href="0c01.htm" target="UDOcon"><img src="udo_lf.gif" alt="CD-Treiber" border=0 width="24" height="24"></a>
<a href="0c03.htm" target="UDOcon"><img src="udo_rg.gif" alt="CD Access" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="CD-ROM">12.2 CD-ROM</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> CD-ROM am ATARI ST f&uuml;r Einsteiger und Selbstbauer</tt>
</p>
<p>Dieser Text beschreibt den Anschlu&szlig; von einem SCSI-Drive!
</p>
<p>Als kleine Einf&uuml;hrung am Anfang sei gesagt das dieser Artikel
ein gewisses Verst&auml;ndniss f&uuml;r technische Begriffe und ein
gesundes Ma&szlig; an handwerklichen F&auml;higkeiten vorrausetzt.
</p>
<p>CD-ROM-Laufwerke gibt es heute bereits weit unter DM 400,- und
sind so eigentlich f&uuml;r den heimischen Computer in greifbare
N&auml;he ger&uuml;ckt. Angeboten werden f&uuml;r PCs sog. 'Kit's' die
aus einem solchen CD-ROM, einem SCSI-Controller und einen Treiberpaket
bestehen. Wobei hier meistens spezifische Laufwerke zu Einsatz kommen.
Auch die neuen ATAPI-Laufwerke sind einzeln, oder auch als Kit zu
beziehen. G&uuml;nstiger bleibt es f&uuml;r die Atari-Computer da hier
i.d.R nur das eigentliche Drive und die passenden Softwaretreiber
ben&ouml;tigt werden. Nat&uuml;rlich gibt es f&uuml;r Atari-Computer
bei verschiedenen H&auml;ndlern ebenfalls anschlu&szlig;fertige
CD-ROM-Kits zu verschiedenen Preisen. Meiner Meinung nach f&auml;hrt
man am sichersten wenn man eine SCSI-L&ouml;sung w&auml;hlt, fertige
Laufwerke zum anstecken kosten in der Regel ab DM 500,- aufw&auml;rts.
Mittlerweile z&auml;hlt man hier jetzt schon die Quad-Speed Laufwerke
zum eigentlichen Standard. (4,4 fache Geschwindigkeit) Solche
CD-Drives sind i.d.R nat&uuml;rlich noch etwas teuerer.
</p>
<p>F&uuml;r den hartgesottenen Selbstbauer eigentlich viel zu teuer,
obwohl diese Preise durchaus schon ihre Berechtigung haben.
</p>
<p>Einzelne Laufwerke, hier z.B das XM4101 der Firma Toshiba, kosten
so ca. 340.- bis DM 400,-, je nach Bezugsquelle. Einige Modelle sind
allerdings nicht immer Lieferbar oder wurden schon wieder Eingestellt.
Beachten Sie bitte das Sie zum Anschlu&szlig; eines externen
SCSI-Ger&auml;tes gut beraten sind sich vorher zu versichern das ihr
ASCI-SCSI Adapter, der DMA-<a href="0d02.htm" target="UDOcon">Hostadapter</a> das Paritysignal generieren
kann. Viele Ger&auml;te be&ouml;tigen dieses Signal dringend. Nicht
alle &auml;lteren Adapter k&ouml;nnen es aber liefern! Der LINK'96 z.B
kann es!
</p>
<p>Kauft man die Einzelteile selber be&ouml;tigt man ein sauberes
Geh&auml;use, vorgefertigt kostet das so ca. DM 170,- inkl. einem
passenden <a href="10.htm" target="UDOcon">Netzteil</a>. SCSI-Anschlusskabel liegen zwischen DM 25,- und DM
89,- SCSI-Anschlu&szlig;kabel, f&uuml;r den externen Anschlu&szlig; an
den <a href="0d02.htm" target="UDOcon">Hostadapter</a>, bewegen sich eher in Richtung der 70.-DM, je nach dem
wo man das kauft. In der Zwischenzeit d&uuml;rften diese Kabel
allerdings auch schon billiger zu bekommen sein. Ein passendes
Schaltnetzteil, sofern man alles einzeln kauft, kostet so ca. 50,- bis
80,- DM. Es sollte +5Volt bei ca. 2AMP liefern k&ouml;nnen. Toshiba
CD-Drives ben&ouml;tigen keine +12V.
</p>
<p>Bereits jetzt gibt es neuere und noch modernere CDROMs.
Preisangaben k&ouml;nnten also bereits &Uuml;berholt sein. An der
Tagesordnung liegen nun eigentlich Laufwerke mit der vierfachen, sech-
und sogar 12-facher Geschwindigkeit. Langsamere Drives nimmt man nur
noch wenn der Preis sehr g&uuml;nstig ist. Viele Bastler haben eben
das eine oder andere schon Zuhause liegen oder kommen eben sehr
g&uuml;nstig an solche 'Teile' heran. Ein Selbstbau ist hier um so
einfacher. Abzuraten ist vom selbstanfertigen des SCSI-Kabels zum
Anschlu&szlig; an die externe SCSI-Schnittstelle Ihres Ataris.
Ausdr&uuml;cklich kann auch nur noch von 'Billigkabeln' die meistens
aus Flachbandkabel bestehen, gewarnt werden. Bei diesen SCSI-Kabeln
sind meistens nicht alle Adern belegt! Und es fehlen viele
Verbindungen die zum Zweck der Abschirmung und Entst&ouml;rung bei
teueren Kabel auf Masse liegen. Flachbandkabel eignet sich nur bei
kurzen Verbindungen und auch nur wenn alle Adern des Kabels belegt
sind und auch Benutzt werden!
</p>
<p>Ich gehe mal davon aus, da&szlig; ein CD-ROM mit einem Atari
betrieben wird, der bereits &uuml;ber einen SCSI-Adapter/Controller
verf&uuml;gt. Ein TT z.B besitzt eine komplette SCSI-Schnittstelle ab
Werk. Die meisten Leute werden wohl schon SCSI-Festplatten betreiben
und somit also in jedem Fall schon einen passenden SCSI-Adapter
besitzen. Festzuhalten an dieser Stelle ist das es z.Zt. keine
L&ouml;sung gibt die direkt, also ohne SCSI-Adapter, an den DMA-Port
eines STs angeschlossen werden kann. Eine Ausnahme bildete hier das
CDAR von Atari, da&szlig; aber sicher nicht mehr lieferbar sein
d&uuml;rfte.
</p>
<p>Ein XM4101 von Toshiba stellt also die Basis f&uuml;r mein
Hardwareprojekt dar. Durch neuerliche &Auml;nderungen in den
Zollbestimmungen werden CD-ROM Laufwerke in naher Zukunft leider in
etwa 10-15% teuerer. Der Einzelhandel wird diesen Aufschlag leider
voll an die Kundschaft weitergeben m&uuml;ssen.
</p>
<p>F&uuml;r ein einzelnes Laufwerk, also nur das CD-ROM,
ben&ouml;tigt man ein externes Geh&auml;use in dem mindestens das
eigentliche CD-ROM (5 1/4&quot;-Drive) und ein passendes <a href="10.htm" target="UDOcon">Netzteil</a>
Platz findet. Bei Selbstanschlu&szlig; an das Stromnetz wird vor der
t&ouml;dlichen Netzspannung gewarnt, dieser Anschlu&szlig; sollte und
darf nur einem Fachmann vorbehalten bleiben. Dieser Punkt
entf&auml;llt logischerweise wenn man sich ein fertiges gekapseltes
Schaltnetzteil f&uuml;r diesen Zweck kauft.
</p>
<p>Der n&auml;chste Punkt ist eine in etwa DM 10,- teure 50 polige
SCSI-Anschlu&szlig;buchse die eigentlich jeder bessere
Elektronikh&auml;ndler im Sortiment hat. Hierzu kommt noch ein wenig
50 poliges Flachbandkabel und dann ein SCSI-Anschlu&szlig;kabel das
sp&auml;ter die SCSI-Schnittstelle des Rechners / ihres Hostadapters
mit der Buchse des CD-Roms verbindet. Die 50 polige Buchse sollte
schon eine in &quot;Schneidklemm-Technik&quot; sein, nur so kann man
einigermassen vern&uuml;nftig 50 Pins in einem Arbeitsgang mit der
Buchse verbinden. Von L&ouml;tsteckern m&ouml;chte ich hier
dringlichst abraten! Das hier anzufertigende Kabel dient dazu den sich
am CD-Laufwerk befindlichen 50poligen Pfostenfeldstecker der
Aussenwelt zug&auml;nglich zu machen. Hier liegen alle Signale bereit,
die ben&ouml;tigt werden mit dem CD-ROM zu kommunizieren und eben die
Daten in den Rechner zu holen.
</p>
<p>An der Seite wo sp&auml;ter das CD-ROM angesteckt wird, sollte
sich ebenfalls ein 50 poliger Pfosten-Buchsenstecker befinden, auch
diese sog. Pfostenfeldstecker gibt es im gut sortierten
Elektronikhandel und sie d&uuml;rften so um DM 3,50 kosten.
<br>
</p>
<p>Das Flachbandkabel besitzt auf der einen Seite eine einzelne
farbige Ader die uns als Markierung des Pin 1 eines jeden
Steckers/Buchse dient. Das Kabel selber wird nun so in die Buchsen
gelegt da&szlig; jeweils die farbige Ader auf Pin 1 zu liegen kommt.
Ist das geschehen kann man damit beginnen das jeweilige
Buchsenoberteil auf das Unterteil zu quetschen. Vorteilhaft geschieht
das in einem Schraubstock bei dem die Backen vorher mit weichem Plasik
ect. abgedeckt wurden. Steht ein Schraubstock nicht zur Verf&uuml;gung
tut es zur Not auch eine Kombizange. Hier ist Vorsicht geboten, da man
mit der Zange sehr leicht die Buchsen/<a href="0f0b.htm" target="UDOcon">Stecker</a> zerbrechen kann. Sind
die Verrieglungsstifte mal abgebrochen ist der <a href="0f0b.htm" target="UDOcon">Stecker</a> unbrauchbar da
er von selber nicht mehr zubleibt. Alte Pfuscher benutzen dann
Klebstoff um das Oberteil mit dem Unterteil dauerhaft zu verbinden,
leider kann hier nicht garantiert werden, da&szlig; alle Adern des
Kabels auch wirklich mit den Schneidstiften der Buchsenleiste in
Verbindung stehen. Der gleiche Fall tritt ein wenn man glaubt die
Adern einzeln an die Pfostenfeldbuchse anl&ouml;ten zu m&uuml;ssen.
&Uuml;bertragungsfehler und Funktionsst&ouml;rungen ect. pp. sind hier
somit schon vorprogrammiert.
<br>
</p>
<p>Passende Geh&auml;use f&uuml;r externe 5 1/4&quot; Laufwerke kann
man ebenfalls beim Elektronikh&auml;nder erstehen oder eben bei den
einschl&auml;gigen Lieferranten. Auch konnte man hier z.B bei
Hard+Soft fertige Kabel + Geh&auml;use beziehen.
<br>
</p>
<p>Das CD-Rom-Laufwerk legen wir erst mal auf die Seite, es wird
jetzt nur ben&ouml;tigt um die genauen Ma&szlig;e der
Geh&auml;use&ouml;ffnung und g.g der Befestigungsl&ouml;cher
festzulegen bzw. auszumessen. Nat&uuml;rlich k&ouml;nnen alle diese
Ma&szlig;e auch aus dem Toshiba-Manual entnommen werden, die
Gewohnheit l&auml;sst uns aber halt nachmessen. Fertige Geh&auml;use
besitzen in vielen F&auml;llen passende Bohrungen f&uuml;r 5 1/4&quot;
Laufwerke, hier kann man sich also Arbeit sparen.
<br>
</p>
<p>Nachdem alle Ausbr&uuml;che und Befestigungsl&ouml;cher, auch die
f&uuml;r das <a href="10.htm" target="UDOcon">Netzteil</a>, gebohrt sind und alle Bohrsp&auml;ne beseitigt
wurden, wird das CD-ROM in die entstandene &Ouml;ffnung eingepasst. Zu
Beachten ist auf jeden Fall zu jeder Gelegenheit da&szlig; das
Anfassen oder Beschmutzen der internen Linsen-Optik des CD-ROMS die
Betriebssicherheit stark beeintr&auml;chtigt! Die Hersteller warnen in
ihren Manuals ausdr&uuml;cklich davor, und am besten l&auml;sst man
die CD-Schublade zu! Bei einem bereits vorhandenen Towergeh&auml;use
l&auml;sst sich das CD-ROM wesentlich einfacher einbauen, alle
Bohrarbeiten ect. entfallen hier, das CD-ROM wird einfach in einen
freien Laufwerkschacht geschraubt und eventuell die Frontblende
entsprechend angepasst. F&uuml;r Leute ohne Tower k&ouml;nnten hier
z.B auch Wechsel-Plattengeh&auml;use gute Dienste leisten. Dorf
befinden sich z.B schon Befestigungsm&ouml;glichkeiten f&uuml;r 5
1/4&quot; Laufwerke einschliesslich dem Geh&auml;useausbruch f&uuml;r
die Schublade.
<br>
</p>
<p>Stichwort Schublade, beim XM4101, und anderen CD-Drives ist
endlich kein 'Caddy' mehr n&ouml;tig um die CD in das Laufwerk zu
bef&ouml;rdern. Ein unendlicher guter Fortschritt ! Bet&auml;tigt man
den Auswurfknopf in einem Programm, oder den Auswurfbutton an der
Vorderseite des XM4101, f&auml;hrt die Schublade z.B beim XM4101 ca.
2cm aus dem Geh&auml;use herraus. Das ist v&ouml;llig normal, die
Schublade darf mit der Hand ganz herrausgezogen werden. Nach dem
Einlegen einer CD schiebt man die Schublade leicht mit der Hand bis in
der Laufwerk hinein. Das kleine Loch daneben dient als
Notentriegelung, zum Entnehmen der CD.
<br>Hier darf mit einer aufgebogenen B&uuml;roklammer gearbeitet
werden! :-)
<br>
</p>
<p>Im &uuml;brigen l&auml;sst sich eine &auml;ltere Atari-Festplatte
die vorher &uuml;ber den DMA-Port an einem &auml;lteren ST betrieben
wurde mit dem vorher beschriebenen SCSI-Flachbandkabel hervorragend
zum Betrieb an einem LINK '96 umbauen. Es entf&auml;llt lediglich der
eingebaute Atari-Controller und die damit verbundene ASCI
IN/OUT-Buchse. Selbstverst&auml;ndlich w&uuml;rden Sie hier auch eine
nackte SCSI-Platte ben&ouml;tigen. Da diese Geh&auml;use meist
gr&ouml;sser sind sollte sich so also auch noch einen Platz f&uuml;r
das CD-ROM-Lauferk finden.
<br>
</p>
<p>Zwei Fliegen mit einer Klappe!
<br>
</p>
<p>Gegen Entgeld bin ich bereit ihnen diesen Umbau vorzunehmen. Es
fallen Kosten f&uuml;r Kabel, Steckverbindungen, f&uuml;r eine
SCSI-Platte und eben ein wenig f&uuml;r die Arbeitszeit an.
</p>
<p>Die Verbindung der Versorgungsspannung zum XM4101 ist sehr
einfach, da dieses Laufwerk werkseitig nur +5 Volt und Masse(Minus)
ben&ouml;tigt. Nur sollte man bei einem 'Selbstanschlu&szlig;'
verst&auml;rkt darauf achten das die Versorgungsspannung richtig
angelegt wird.
<br>
</p>
<p>Das folgende Steckerschema stammt original aus dem Manual eines
Toshiba XM4101 und ist bis auf den +12V Pin gleich mit jedem
PC-Netzeil und dessen Anschlussteckern.
</p>
<p align=center><img src="image/cdromsup.gif" border=0 width="260" height="100"></p><br>
<div align=center><tt> Abbildung 1 - Stromversorgung</tt>
<br>
</div>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p>Der linke Pin, welcher normalerweise bei Festplatten und
&auml;lteren Diskettenlaufwerken die +12 Volt Versorgungsspannung
beherbergt, bleibt hier unbenutzt da das XM4101 mit nur +5 Volt
zufrieden ist. Um ein Vertauschen zu verhindern kann man den +12V Pin
also auch Entfernen.
<br>
</p>
<p>Zu Bemerken sei noch da&szlig; das XM4101 an der
Anschlu&szlig;seite einen 4 poligen Pfostenverbinder hat, an diesem
k&ouml;nnen die <a href="1301.htm" target="UDOcon">Audio</a>-Signale noch einmal extra abgegriffen werden. So
z.B f&uuml;r den Fall das vieleicht jemand auf die Idee kommen
k&ouml;nnte noch zwei Chinchbuchsen zum Anschlu&szlig; an die
heimische Stereoanlange einzuplanen. Dem steht n&auml;mlich nichts im
Weg, das passende Steckerchen bekommt man im gut sortierten
Computerladen, oder eben aus der Bastelkiste. Falls er nicht schon
sowieso dem CD-ROM beigelegt wurde.
<br>
</p>
<p>Die Klinkenbuchse an der Frontplatte ben&ouml;tigt einen 3.5mm
Klinkenstecker wie er sich z.B an Kopfh&ouml;rern befindet die man bei
einer Bahnfahrt kaufen kann oder aber auch bei einigen
Fluggesellschaften umsonst bekommt. Neben der Buchse befindet sich
auch der Lautst&auml;rkeregler. Nat&uuml;rlich l&auml;sst sich hier
jeder gute Stereokopfh&ouml;rer verwenden, sofern man die
M&ouml;glichkeit hat einen Adapter vorzustecken. Der feste
Stereoanschlu&szlig; erfolgt nach diesem Schema. Die Signale
m&uuml;ssen hier mit einem vierpoleigen Flachstecker abgegriffen
werden der sich leider nicht im Lieferumfang eines CD-ROMs befindet.
Solche Steckerchen kann man wirklich nur in einschl&auml;gigen
Elektonikgesch&auml;ften erhalten.
<br>
</p>
<p align=center><img src="image/cdromdrv.gif" border=0 width="570" height="400"></p><br>
<div align=center><tt> Abbildung 2 - Ansicht von der Vorder- u. R&uuml;ckseite des
XM4101</tt>
<br>
</div>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<div align=center>Hier wird wird vor Kurzschl&uuml;ssen gewarnt!
<br>Niemals die Stereoausg&auml;nge direkt mit Masse verbinden!
</div>
<p align=center><img src="image/line1.gif" border=0 width="641" height="3"></p><br>
<p>Sehr wichtige ist die Art der Terminierung des CD-ROMs.
Normalerweise befinden sich in jedem SCSI-Drive ab Werk
Abschlu&szlig;widerst&auml;nde die den SCSI-Bus terminieren.
(Abschlie&szlig;en) Sollte das CD-ROM einziges oder letztes Laufwerk
am SCSI-Bus sein sind die Widerst&auml;nde so zu belassen, im anderen
Fall, wenn das Laufwerk also an einem Bus eingef&uuml;gt wird an dem
sich schon ein 'letztes' SCSI-Device befindet, sind die Terminatoren
in jedem Fall zu entfernen. Ansonsten kommt es zu einer
&Uuml;berlastung der BUS-Treiber, und KEIN angeschlossenes Laufwerk
arbeitet mehr korrekt. Eventuell nimmt der Computer bzw. dessen
SCSI-Interface, der Hostadpater schaden.
<br>
</p>
<p align=center><img src="image/cdterm.gif" border=0 width="480" height="100"></p><br>
<div align=center><tt>Abbildung 3 - Beispiele f&uuml;r eine korrekte
Bus-Terminierung:</tt>
<br>
</div>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<p>Deutlich also zu sehen das wirklich immer nur das pysikalisch
letzte Laufwerk an einem SCSI-Bus einen Terminator tragen darf. Der
Computer als Host ist ebenfalls immer Terminiert. Beim Falcon z.B sind
diese Terminatoren fest eingel&ouml;tet, eingebaut.
<br>Bei diesem Bild w&uuml;rde der Falcon ihren DMA-<a href="0d02.htm" target="UDOcon">Hostadapter</a>
darstellen. Der restliche SCSI-Bus ist bei allen Computern mit SCSI
gleich!
</p>
<p>Ein zweiter sehr wichtiger Punkt ist die SCSI-Adresse auf der die
Treiber- Software, der AUDIO-CD-Player (Software) das CD-ROM Laufwerk
sp&auml;ter finden soll, es stehen insgesamt 3 Jumper zur
Verf&uuml;gung, die je nach dem wie die Jumper gesteckt werden eine
SCSI-Adresse zwischen 0 und 6 Erzeugen. Das 'wie' entnimmt man am
sichersten dem Datenblatt des jeweiligen Toshiba-Laufwerks.
<br>Die Adresse 0 und 1 ist in den meisten F&auml;llen durch eine oder
zwei bereits extern angeschlossene SCSI-Ger&auml;te belegt. 0+1 z.B
bei zwei Platten. Die SCSI-Tools besitzen ein komfortables Programm
mit dem man die bereits belegten Adressen sehr schnell herausfinden
kann. Adress&uuml;berschneidungen sollte man hier tunlichst vermeiden,
es kommt hier schnell zu Datenschrott oder die Laufwerke arbeiten dann
&uuml;berhaupt nicht.
<br>
</p>
<p>Festzuhalten ist noch, das die Adresse auf die das CD-ROM gelegt
wird am besten in dem bereits installierten Harddisktreiber
ausgeschaltet wird, und zwar so, das diese Adresse des CD-ROMs
f&uuml;r den Plattentreiber 'Unsichtbar' wird. Nur so kann ein
reibungsloser Datentransfer gew&auml;hrleistet werden,
unabh&auml;nging vom verwendeten Festplattetreiber.
<br>
</p>
<p>Sind diese Punkte alle in Erw&auml;gung gezogen worden kann man
eigentlich langsam damit beginnen die Treibersoftware installieren.
<br>
</p>
<p>Vorher aber sollte man nochmal einen Blick auf die Jumper werfen.
<br>
</p>
<p><tt>Beschreibung derJumper im Toshiba XM4101.</tt>
<br>(Das trifft idR auch auf andere Laufwerke von Toshiba zu)
<br>
</p>
<dl>
<dt><b>SCSI-ID Jumper 1-3</b></dt><dd> SCSI-ID...JP1...JP2...JP3
<br>-----
<br>ID0.......o.....o.....o
<br>ID1.......#.....o.....o
<br>ID2.......o.....#.....o
<br>ID3.......#.....#.....o
<br>ID4.......o.....o.....#
<br>ID5.......#.....o.....#
<br>ID6.......o.....#.....#
<br>ID7.......#.....#.....#
<br>
<br>&nbsp;
<br>Jumper-#-close Jumper-o-open
<br>&nbsp;
<dt><b>Parity Jumper 4</b></dt><dd> Jumper OPEN : Das Laufwerk f&uuml;hrt keinen Paritycheck durch.
<br>Jumper CLOSE: Paritycheck eingeschaltet. Spielt beim Falcon keine
Rolle da hier ein richtiger SCSI-Host vorhanden ist.
<br>Das Paritybit wird vom SCSI-Chip im F030 generiert.
<br>(Manche <a href="0d02.htm" target="UDOcon">Hostadapter</a> vom ST her tun das nicht!)
<br>
<br>&nbsp;
<dt><b>PPV/ALV Jumper 5</b></dt><dd> Jumper CLOSE: Das Laufwerk ignoriert Befehle zum &ouml;ffen der
Schublade.
<br>Mechanischer Auswurfknopf wird ebenfalls ignoriert.
<br>(Gilt nicht f&uuml;r Notentriegelung!)
<br>OPEN : Laufwerk akzepiert alle diese Kommandos auch per Software.
<br>
<br>&nbsp;
<dt><b>TEST Jumper 6</b></dt><dd> Jumper CLOSE: Nur Audiodisks werden abgespielt.
<br>Eine Audiodisk wird vom Start bis zum Ende abgespielt,
<br>Wird der EJECT-Button f&uuml;r 1 Sec. gedr&uuml;ckt wird der
n&auml;chste Audiotrack gespielt.
<br>Wird der EJECT-Button l&auml;nger als 2 Sec. bet&auml;tigt wird
die Wiedergabe gestoppt und die Schublade &ouml;ffnet sich.
<br>OPEN : Normaler Laufwerksmodus zum Betrieb am Computer. Alle
Audiobefehle werden akzeptiert.
<br>&nbsp;
<dt><b>TERM Jumper 7</b></dt><dd> Jumper CLOSE: Termpower ist eingeschaltet. (Default ab Werk!)
<br>OPEN : Termpower ist deaktiviert.
<br>Die +5 Volt werden &uuml;ber einen Widerstand und eine Schutzdiode
auf die TRMPWR-Leitung des SCSI-Bus gelegt.
<br>
<br>&nbsp;
</dl>
<p>Das SCSI-Kabel (Flachbandkabel) wird so auf die Buchse des CD-ROMs
gesteckt das die farbige Ader auf Pin 1 zu liegen kommt. Pin 1
befindet sich im &uuml;brigen bei allen mir bekannten SCSI-Laufwerken
immer in der N&auml;he des Stromsteckers.
<br>
</p>
<p><tt>Belegung einer 50poligen SCSI-Buchse:</tt>
</p>
<dl>
<dt><b>Pin 50 = </b></dt><dd> IO - Signal
<br>&nbsp;
<dt><b>Pin 49 = </b></dt><dd> REQ - Request
<br>&nbsp;
<dt><b>Pin 48 = </b></dt><dd> Code/Data Signal
<br>&nbsp;
<dt><b>Pin 47 = </b></dt><dd> SEL - Select
<br>&nbsp;
<dt><b>Pin 46 = </b></dt><dd> MSG - Message
<br>&nbsp;
<dt><b>Pin 45 = </b></dt><dd> RST - Reset
<br>&nbsp;
<dt><b>Pin 44 = </b></dt><dd> SACK - Acknowledge
<br>&nbsp;
<dt><b>Pin 43 = </b></dt><dd> BSY - Busy
<br>&nbsp;
<dt><b>Pin 42 = </b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 41 = </b></dt><dd> ATN
<br>&nbsp;
<dt><b>Pin 40 = </b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 39 = </b></dt><dd> NC
<br>&nbsp;
<dt><b>Pin 38 = </b></dt><dd> Vcc +5 Volt (1Amp Fuse) (TermPwr)
<br>&nbsp;
<dt><b>Pin 37 = </b></dt><dd> NC
<br>&nbsp;
<dt><b>Pin 36-35=</b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 34 = </b></dt><dd> PARITY Signal
<br>&nbsp;
<dt><b>Pin 33 = </b></dt><dd> SCSI 7 - Signal
<br>&nbsp;
<dt><b>Pin 32 = </b></dt><dd> SCSI 6 - Signal
<br>&nbsp;
<dt><b>Pin 31 = </b></dt><dd> SCSI 5 - Signal
<br>&nbsp;
<dt><b>Pin 30 = </b></dt><dd> SCSI 4 - Signal
<br>&nbsp;
<dt><b>Pin 29 = </b></dt><dd> SCSI 3 - Signal
<br>&nbsp;
<dt><b>Pin 28 = </b></dt><dd> SCSI 2 - Signal
<br>&nbsp;
<dt><b>Pin 27 = </b></dt><dd> SCSI 1 - Signal
<br>&nbsp;
<dt><b>Pin 26 = </b></dt><dd> SCSI 0 - Signal
<br>&nbsp;
<dt><b>Pin 25-15=</b></dt><dd> GND
<br>&nbsp;
<dt><b>Pin 14-12=</b></dt><dd> NC - Not used
<br>&nbsp;
<dt><b>Pin 11 = </b></dt><dd> Vcc - Resistor R65 with 10KOhm
<br>&nbsp;
<dt><b>Pin 10-1= </b></dt><dd> GND - Signal Ground
<br>&nbsp;
</dl>
<p>Viele Pfostenfeldstecker haben an der einen Seite eine Kerbe so,
da&szlig; man den <a href="0f0b.htm" target="UDOcon">Stecker</a> nur in einer Richtung einstecken kann. Bei
diesem <a href="0f0b.htm" target="UDOcon">Stecker</a> sollte man vorher, bevor das Flachbandkabel gequetscht
wird, aufpassen wie rum der <a href="0f0b.htm" target="UDOcon">Stecker</a> dann sp&auml;ter auf das CD-ROM
passt. (Farbige Ader beachten!)
<br>
</p>
<p>Bevor nun das CD-ROM mit dem <a href="10.htm" target="UDOcon">Netzteil</a> verbunden wird sollte man
nochmals abchecken, da&szlig; die Stromversorgung auch richtig
verdrahtet ist. Eine Verpolung kostet in jedem Fall ein Laufwerk!
</p>
<p>Achtung, &auml;ltere PC-Netzteile k&ouml;nnen unterschiedliche
Steckerbelegungen bei den Stromanschl&uuml;ssen haben!
<br>In jedem Fall bei einem unbekannten <a href="10.htm" target="UDOcon">Netzteil</a> vorher Kontrollieren!
<br>
</p>
<p>Die Stromversorung sollte beim Anschlu&szlig; abgeschaltet sein.
<br>Also Netzstecker vorher ziehen!
<br>
</p>
<p>Nachdem das Laufwerk nun mit dem SCSI-BUS, und/oder &uuml;ber das
SCSI-Kabel (extern) mit dem Falcon verbunden ist wird das Kabel nun
mit dem Hostadpater verbunden (SCSI extern). Der Atari ist hierbei
nat&uuml;rlich ausgeschaltet! (Wie eigentlich bei allen
Anschlu&szlig;arbeiten)
<br>
</p>
<p>Das <a href="10.htm" target="UDOcon">Netzteil</a> sollte Ordnungsgem&auml;&szlig; angeschlossen worden
sein, (Netzsteckdose, VDE-Verschriften, Schutzleiter ect.pp) man kann
es leider nur Im Tower ist das einfacher da hier ein gekapseltes
PC-<a href="10.htm" target="UDOcon">Netzteil</a> zum Einsatz kommen wird, der Selbstbauer kommt hier erst
gar nicht mit der gef&auml;hrlichen Netzspannung in Ber&uuml;hrung.
Hier ist einfach wie schon oben beschrieben einer der
Stromversorungsstecker aufzustecken, wer sich nicht traut sollte
vorher das +12V Kabel am <a href="0f0b.htm" target="UDOcon">Stecker</a> entfernen und isoliert aufrollen.
(Oder Abzwicken und Isolieren)
<br>
</p>
<p>Die SCSI-Adresse ist korrekt eingestellt, der SCSI-Bus angesteckt,
die Stromversorgung ist angeschlossen? Dann kann man jetzt endlich zu
einem ersten Test schreiten: Nach dem Einschalten sollte der Rechner
(z.B Falcon) wie gewohnt von der/den Platte(n) booten. HuSHI ab 5.x /
6.53 z.B wird bemerken das ein SCSI-Device vorhanden ist welches sich
aber nicht wie eine Festplatte verh&auml;lt und auch keine
Festplatten-ID hat, das w&auml;re dann relativ normal.
<br>
</p>
<p>Als Treiber k&ouml;nnen zum einen der von Atari selber
erh&auml;ltliche CDROM.XFS Treiber f&uuml;r MultiTos, zum anderen das
Treiberpaket von Peter Hilbring, oder eben die CD-TOOLs von der Fa.
Hard &amp; Soft zum Einsatz kommen. Der.XFS-Treiber von Atari
funktioniert z.Z nur korrekt unter MultiTos 1.04. Ob der Treiber unter
neuern MiNT-Versionen, z.b MiNT 1.10, l&auml;uft habe ich selber nicht
getestet und kann dazu auch nichts sagen. In der Maus @S3 kann man
einen CDROM.XFS-Treiber in der Version 0.7 beziehen, auch hier wieder
ein Privatmann der sich selber mit 'Anpassungen' besch&auml;ftigt hat.
<br>
</p>
<p>Er wird in den C:/MULTITOS Ordner auf der Bootpartition kopiert.
W&auml;hrend MultiTOS geladen wird, wird auch dieser Treiber gefunden
und so automatisch mitgeladen.
<br>
</p>
<p>Verwenden Sie die CD-Tools! Easy to Use!
<br>
</p>
<p>Der Treibername des .XFS-Treibers sollte (mu&szlig;) wie folgt
aussehen:
<br>
</p>
<p><tt>Beispiel:</tt>
</p>
<pre>         CDROMK6.XFS
              ^^
              ||
              |`- SCSI-Adresse auf der das CD-ROM zu finden ist, hier SCSI 6.
              `-- Laufwerksbuchstabe unter dem das Laufwerk auf dem <a href="0903.htm" target="UDOcon">Desktop</a> angemeldet ist.

</pre>
<p>Nat&uuml;rlich kann hier jeder andere freie Laufwerksbuchstabe,
und auch jede andere SCSI-Adresse zum Einsatz kommen. Zu bemerken
w&auml;re noch das viele &auml;ltere Programme mit Laufwerksbuchstaben
h&ouml;her als 'P' nichts anfangen k&ouml;nnen und sich eventuell
kommentarlos Abmelden bzw. auch schon mal einen schnellen Absturz
erm&ouml;glichen.(!nl)
</p>
<p>Der Programmname des .XFS-Treibers ist also entsprechend
Anzupassen.
<br>
</p>
<p>Nach erneutem Booten sollte nun unter 'K' auf dem <a href="0903.htm" target="UDOcon">Desktop</a> ein
CD-ROM zu finden sein, andere Einstellungen sind nicht erforderlich.
Sollte eine AUDIO-CD eingelegt sein braucht sich niemand zu wundern,
da&szlig; kein 'Verzeichniss' erscheint wenn man das Drive anklickt.
<a href="1301.htm" target="UDOcon">Audio</a>-CDs haben sowas nicht in der vom Treiber erwarteten Art. Es ist
jeoch m&ouml;glich das die <a href="1301.htm" target="UDOcon">Audio</a>-Titel in der Form &quot;Titel1.PRG,
Titel2.PRG &quot; usw. angezeigt werden k&ouml;nnen.
<br>
</p>
<p>Die Einstellungen werden erst nach einen erneuen Booten
&uuml;bernommen!
<br>
</p>
<p>Hier eine Beispieldatei wie sie von den CD-TOOLs der Fa.
Hard&amp;Soft angelegt wird. Auch hier ist logischerweise MetaDOS
erforderlich. MetaDOS leigt in vielen Mausboxen in der aktuellen
Version 2.6 Die CD-TOOLs beinhalten auch MetaDOS, hier mu&szlig; es
also nicht extra besorgt werden. Bei anderen Treibern ist das meines
Wissens nach anders. Die neueste Version der Tools installiert MetaDOS
2.55 auf Ihrem Rechner im Autoordner. MetaDOS.PRG kann jederzeit durch
eine neuere Version ersetzt werden.
<br>
</p>
<dl>
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
<tt>Beispiel einer CONFIG.SYS wie sie von z.B den CD-Tools erstellt
wird.</tt>
<br>MetaDOS ist in der Maus @MS2 jeweils in der neuesten Version zu
beziehen.
<br>Julian Reschke@MS2 ist hier der Ansprechpartner.
<br>
<br>&nbsp;
<br>+++++++++++++++++++++ digitale Scheidkante +++++++++++++++++++++
<br>
<br>&nbsp;
<br>; CD-Tool BEGIN
<br>; Note that everything up to `; CD-Tool END' will be erased by
<br>; CD-Tool's configuration tool!
<br>; Achtung: alles bis zur Zeile `; CD-Tool END' wird von CD-Tool
<br>; beim Konfigurieren gel&ouml;scht!
<br>;
<br>; created by CD-Tool 1.20, Fri Jul 08 15:41:44 1994
<br>;
<br>; Ger&auml;te/devices
<br>;
<br>; SCSI 6: `TOSHIBA CD-ROM XM-4101TA' -&gt; K
<br>;
<br>; BOS-Treiber/BOS drivers
<br>;
<br>*BOS, c:\auto\cd_boot\hs-cdrom.bos, K:14
<br>;
<br>; DOS-Treiber/DOS drivers
<br>;
<br>*DOS, c:\auto\cd_boot\hs-iso.dos, K:K
<br>;
<br>; CD-Tool END
<br>;
<br>; Config.sys An ascii file that describes the system
configuration.
<br>;
<br>
<br>; Physical Basic operating system format
<br>;*BOS, [Physical Bos driver][Arguments], [Physical id]:[DMA
channel], ...
<br>; Device # meaning
<br>; 0 - 7 ACSI device 0 - 7
<br>; 8 - 15 SCSI device 0 - 7
<br>;
<br>;The next line installs FALCON.BOS for SCSI device 6 (14 = 8 + 6).
<br>
<br>; Logical DOS format.
<br>;*DOS [Logical DOS] [Arguments], [Logical id]:[physical id],...
<br>;
<br>;The High Sierra driver won't be needed in most cases
<br>;*DOS, C:\AUTO\HSMAY86.DOS, Q:Y
<br>;
<br>;The next line installs ISO9660F.DOS for MetaDOS drive letter Y
<br>;(which has been assigned to SCSI 5 above) as GEMDOS drive R:.
Note
<br>;that a lot of applications can't access drive letters beyond P:,
so
<br>;you might have to change the drive letter.
<br>;
<br>; You can use statements as below to launch other applications.
<br>;
<br>;c:\auto\boot\ram512.prg ; Load in 512 byte ramdisk.
<br>;c:\auto\boot\gdos.prg ; Load in gdos.
<br>;c:\auto\boot\diab630.prg ; Load in diablo 630 emulator.
<br>;c:\auto\boot\sdump.prg ; Load in Screen dump to laser.
<br>
<br>+++++++++++++++++++++ digitale Schneidkante +++++++++++++++++++++
<br>
<br>&nbsp;
<p align=center><img src="image/line.gif" border=0 width="637" height="6"></p><br>
</dl>
<p><tt>Beispiel einer CONFIG.SYS wie sie z.B von EXTenDOS erstellt
wird.</tt>
<br>EXTenDOS ist bisher hier nicht einfach zu beziehen.
<br>
</p>
<pre>
************* ExtenDos CNF file as used under TOS and Magic **************
;
; EXTENDOS.CNF: configuration file for <a href="1504.htm" target="UDOcon">ExtenDOS</a> Pro
; created by INSTALL.APP Version 2.4 on Tue Sep 29 08:58:04 1998
;
*BOS, C:/EXTENDOS/CD.BOS, Z:10
*DOS, C:/EXTENDOS/UNIDRIVE.DOS P=12 B=4, K:Z

************* Magic 5 INF file unaltered from installation ****************

#_MAG MAGX V5.10
#[vfat] drives
#[aes]
#_DEV 1 0
#_FLG 16
#_SCP C:/SYS/CLIPBRD/
#_TRM C:/GEMSYS/GEMDESK/VT52.PRG
#_ACC C:/
#_APP C:/GEMSYS/MAGIC/START/
#_WIN 16
#_ENV PATH=C:/,C:/EXTENDOS/
#_CTR
#a000000
#b000000
#c7770007000600070055200505552220770557075055507703111103
#d                                            ;
#_DSK MAGXDESK V3.20 1
#_DSW 640 461 0 0 0 10 0111 0102111010100
#_DS2 1101 2 2 1 1 3 3 7 0 1 10
#_DEX BAT BTP
#_DWN 128 97 380 260 0
#_DWN 180 20 300 160 0
#_DWN 200 30 300 160 0
#_DWN 220 40 300 160 0
#_DWN 240 50 300 160 0
#_DWN 260 60 300 160 0
#_DIC 1 A 26 0
#_DIC 1 C 182 0
#_DIC 1 D 238 0
#_DIC 1 E 299 0
#_DIC 1 F 359 0
#_DIC 1 G 416 0
#_DIC 1 H 482 0
#_DIC 1 I 539 0
#_DIC 1 J 593 0
#_DIC 1 U 589 370
#_DIC 5 @ 17 415
#_DIC 4 @ 592 416
#_DPG C:/GEMSYS/GEMDESK/MCMD.TOS
#_DPG C:/GEMSYS/GEMDESK/MGVIEW.APP
#_DPG C:/GEMSYS/GEMDESK/PRINT.TTP
#_DPG
#_DPG
#_DPG
#_DPP

***************************************************************************
</pre>
<p>Diese Datei d&uuml;rfte sich von selber Erkl&auml;ren. Sehr
wichtig bleibt hier das die .BOS-Treiber immer an der richtigen Stelle
liegen und auch nicht etwa Auskommentiert wurden. Mit dieser
Kombination war es bisher m&ouml;glich alle CD-ROMs auf einem Atari
auszulesen. Ausnahme: CD-ROMs f&uuml;r Mac-Computer.
<br>
</p>
<p>Es gibt bereits mehrere spezielle Sharware-Daten CDs f&uuml;r
Atari-Computer! Selbstverst&auml;ndlich k&ouml;nnen auch reine DOS-CDs
gelesen werden, interessant sind hier z.B auch .GIF (Grafik) und
.WAV-Files auf diesen CDs. Kopiern von DOS-Programmen ist
nat&uuml;rlich auch m&ouml;glich. Daten CDs kann man sehr g&uuml;nstig
&uuml;ber das MausNetz beziehen. Hier finden sich einige Anbieter wie
z.B Whitline/ delta labs media. Hier kann man sich auch an Bernd
Lohrum @ ZW, Tom Kohl @W oder auch an hier sogenannte Shareware-CDs.
<br>Von WalNut Creek gibt es die GEMINI CD die mit 600MB
Atari-Software randvoll gef&uuml;llt ist, hier findet sich wirklich
f&uuml;r jeden Geschmack etwas brauchbares. Weitere CDs kann man z.B
auch bei der Fa. Wohlfartst&auml;tter beziehen. Maxon ist ein weiterer
Anbieter recht brauchbarer CDs. Brandaktuell ist die
&quot;Transmission&quot; CD auf der sich viele Scene-Demos und Demos
von allen m&ouml;glichen Atari-Programmen befindet. Zu einem Preis von
DM 49.- sicherlich ein guter Tip. Erh&auml;ltlich bei delta labs
media. Ein schlechter Griff sind CDs bei denen sich der gesammte
Inhalt in leider cryptischen File- oder Unterverzeichissen wie z.B:
0001.000 0002.000 befindet. Hier wird man sich sp&auml;ter leicht
d&auml;mlich suchen wenn man etwas ganz bestimmtes sucht.
<br>
</p>
<p>F&uuml;r PhotoCD (XA) sollte eine spezielle
Bildbearbeitungssoftware vorhanden sein. Die Firmen COMPO und COLOR
CONCEPT haben da schon l&auml;nger etwas auf dem Markt. Man kann das
aus fast jeder <a href="1604.htm" target="UDOcon">ST-Computer</a> entnehmen. (STC) Nat&uuml;rlich ist man
schon mit z.B GEM-View in der Lage sich seine eigenen PhotoCDs auf dem
Rechner anzusehen. Eine Nachbearbeitung ist hier nat&uuml;rlich nicht
m&ouml;glich, nur eine Konvertierung nach .GIF oder z.B .JPG kann hier
vorgenommen werden.
<br>
</p>
<p>Als CD-ROM-Treiber sind die CD-TOOLs eigentlich fast
Selbsterkl&auml;rend und auch relativ einfach zu installieren. Wer
HuSHI kennt wird sich hier schnell zurecht finden. Auch hier wird ein
<a href="0c01.htm" target="UDOcon">CD-Treiber</a> von Julian Reschke im Autoordner der Festplatte versenkt.
Der Autoordner mu&szlig; sich logischerweise im Rootverzeichniss des
Bootlaufwerks befinden, in den meisten F&auml;llen wohl also C:\AUTO.
<br>Hier erh&auml;lt man immer die aktuelle Version von MetaDOS
welches einen wichtigen Bestandteil des CD-Treibers darstellt.
METADOS.PRG selber kann eigentlich immer gegen eine neue Version
ausgetauscht werden sofern keine gr&ouml;&szlig;eren &Auml;nderungen
daran vorgenommen wurden.
<br>Der Treiber wird bei jedem Bootvorgang genau wie ein
Festplattentreiber mit in das System eingebunden, das CD-ROM wird
somit ein 'Device' das wie eine Festplatte in jeder Situation zur
Verf&uuml;gung steht.
<br>Hier sollte mindestens die Version 2.8 der CD-TOOLs zum Einsatz
kommen. Fr&uuml;here Versionen beinhalten noch einige Fehler.
<br>
</p>
<p>Erw&auml;hnenswert erscheint mir hier noch der mitgelieferte
GDPS-Treiber der die PhotoCD-Daten jedem Programm zug&auml;nglich
macht das dieses Treiberkonzept unterst&uuml;tzt. Man ist hier in der
Lage PhotoCD-Bilder von der CD zu 'scannen' und direkt im
entsprechenden Programm zu verwenden.
<br>Bei mir l&auml;uft das ganze auf einem Falcon unter TOS 4.04 sowie
auch unter MultiTos 1.04 / 1.08 bis heute korrekt, genau wie z.B der
Treiber von Peter Hillbring. Zu EGON! kann ich leider nicht viel sagen
da mir hierzu das EGONPaket fehlt. Ein Treiber sollte zu dem
Aussreichend sein. Welchen Treiber man hier verwendet sollte jedem
selbst &uuml;berlassen bleiben.
<br>
</p>
<p>Ein sehr guter Tip scheint mir noch der <a href="1301.htm" target="UDOcon">Audio</a> CD-Player zu sein
welcher bei den CD-TOOLs mitgeliefert wird.
<br>Als .ACC installiert erlaubt dieser Player in jeder Applikation
gleichzeitig vollen CD-Genuss &uuml;ber die Klinkenbuchse an der Front
des XM4101. Sogar die Auswurftaste funktioniert, was man leider von
nicht allen CD-Playern behaupten kann. Die Shareware CD-Player tanzen
hier leider noch ein wenig aus der Reihe. Mit steigenden
Versionsnummern wird sich aber bei allen Playern im Lauf der Zeit noch
etwas &auml;ndern, die eine oder andere Funktion wird hinzukommen und
auch die Auswurftasten werden dann sicher funktionieren. Mittlerweile
gibt es noch CDPLAY 1.3 welches sehr komfortabel ist und bei mir den
Player aus den CD-Tools ersetzt hat. CDPLAY 1.3f ist im Mausnetz zu
bekommen.
<br>
</p>
<p>Die Player erkennen das installierte CD-ROM automatisch und
arbeiten auch 'versteckt' weiter. Die Programme laufen als .ACC im
Hintergrund aber auch als Hauptapplikation. Vorz&uuml;glich bei einer
Multitasking-Umgebung.
<br>
</p>
<p>Die Shareware/Fairware-Treiber ben&ouml;tigen alle MetaDOS das man
aus jeder gut sortierten MausBox beziehen kann.
<br>
</p>
<p>Die MetaDOS und Shareware/Fairware-Treiber installation mu&szlig;
von Hand vorgenommen werden, und es sei hier auch gleich an die
Dokumentation zu MetaDOS verwiesen. Es gibt nat&uuml;rlich zu dem
Treiber von Peter Hillbring auch eine Dokumentation die man vorher
wenigstens einmal gelesen haben sollte.
<br>Die Hauptarbeit besteht immer darin eine passende CONFIG.SYS Datei
zu erzeugen die dann zu MetaDOS in den Autoordner geh&ouml;rt. Die
genauen Angaben werden immer mit Beispielen erkl&auml;rt. Eine
Anpassung sollte also hier von jedem selber gemacht werden
k&ouml;nnen.
<br>
</p>
<p>Alles in allem bin ich hier eigentlich am Ende, und ich denke das
ich die besten bzw. einfachsten M&ouml;glichkeiten zusammengefasst
habe. Alles andere ergibt sich im Betrieb und sollte eigentlich von
jedem selber ausprobiert werden. Das wichtigste ist eigentlich eben
nur der richtige Anschluss, und bei MetaDOS eben die CONFIG.SYS-Datei.
Nur so k&ouml;nnen sich die gew&uuml;nschten Erfolge einstellen. Es
bleibt noch zu sagen das sich viele Programme nicht direkt von der CD
starten lassen, in der Hauptsache liegt es daran das einige Programme
sofort versuchen einen Schreibzugriff zu machen. Das geht bei einem
CD-Rom nat&uuml;rlich nicht. Solche Programm laufen nur korrekt wenn
sie von der CD auf eine Festplattenpartition kopiert werden. Sehr
schnell l&auml;sst sich das z.B mit dem KOBOLD erledigen.
<br>
</p>
<p>Auf der letzten ProTos war hier an einigen St&auml;nden auch schon
ein neuerer Treiber f&uuml;r CD-ROM Laufwerke zu sehen, aus Zeitmangel
konnte ich mich leider nicht n&auml;her mit dem Hersteller unterhalten
so das ich hier leider noch nichts zur <a href="0204.htm" target="UDOcon">Installation</a> und dem
Betriebsverhalten sagen kann.
<br>Der Hersteller ist eine kanadische Firma.
<br>Hierzulande sollte es auch bereits einen neueren .XFS-Treiber
geben.
<br>
</p>
<p><tt>CD-ROM benchmarks (last change: Okt 03, 1996)</tt>
</p>
<p>These benchmarks were done using `CD-Tool' and a normal data CD
(no XA
<br>format). Each benchmark was repeated three times and the best
results were
<br>used.
<br>
</p>
<p>Transfer rate: read blocks of 32K for 20 seconds; using MetaDOS
XBIOS
<br>function Metaread().
<br>
</p>
<p>Mean read time: read random blocks of 2048 bytes from the range
0..1023. This
<br>is NOT the mean access time, but comes close.
<br>
</p>
<p>Points: Transfer rate * 100 / mean read time
<br>
</p>
<p>Diese Me&szlig;werte wurden mit `CD-Tool' und einer normalen
Daten-CD ermittelt
<br>(keine XA-CD!). Alle Messungen wurden dreimal wiederholt und dann
das beste
<br>Ergebnis verwendet.
<br>
</p>
<p>Transferrrate: es werden 20 Sekunden lang Bl&ouml;cke zu 32 KByte
&uuml;ber die
<br>MetaDOS-XBIOS-Funktion Metaread() gelesen.
<br>
</p>
<p>Mittlere Lesezeit: es werden 20 Sekunden lang Bl&ouml;cke zu 2048
Bytes von zuf&auml;llig ausgew&auml;hlten Blocknummern aus dem Bereich
0..1023 gelesen. Diese ist NICHT die mittlere Zugriffszeit, allerdings
hat die mittlere Zurgriffszeit f&uuml;r diesen Test ausschlaggebenden
Charakter.
<br>
</p>
<p>Punktzahl: Transferrate * 100 / mittlere Lesezeit
<br>
</p>
<pre>
---------------------
<a href="0305.htm" target="UDOcon">Atari ST</a>, 8 MHz, ACSI
---------------------
                                                mean
Device             points  transfer rate   read time  driver

Toshiba XM 3601       780   546 KB/s (3,64)    70 ms  HS-CDROM 2.02
Toshiba XM 3401       327   337 KB/s (2,24)   103 ms  HS-CDROM 2.02
Sony CDU-8003A        273   336 KB/s (2,24)   123 ms  HS-CDROM 2.02


--------------------------------------------
<a href="0305.htm" target="UDOcon">Atari ST</a>, 8 MHz, IDE (Hard&amp;Soft-IDE-Adapter)
--------------------------------------------
                                                mean
Device             points  transfer rate   read time  driver

Mitsumi FX 300        342   387 KB/s (2,58)   113 ms  HS-CDROM 2.02
Mitsumi FX 300        319   360 KB/s (2,40)   113 ms  ATAPI-IDE 1.04


-----------------------------------------------------
<a href="0305.htm" target="UDOcon">Atari ST</a>, 8 MHz, IDE (Adapter von Gellerman&amp;Fellmuth)
-----------------------------------------------------
                                                mean
Device             points  transfer rate   read time  driver

Sony CDU55E           367   305 KB/s (2,03)    83 ms  ATAPI-CD 1.00
Mitsumi FX 300        355   401 KB/s (2,67)   113 ms  ATAPI-CD 1.00


------------------------------------------------------
<a href="0305.htm" target="UDOcon">Atari ST</a>, 8 MHz, IDE+ (Adapter von Gellerman&amp;Fellmuth)
------------------------------------------------------
                                                mean
Device             points  transfer rate   read time  driver

Mitsumi FX 300        409   458 KB/s (3,05)   112 ms  ATAPI-CD+ 1.01


---------------------------------
<a href="0305.htm" target="UDOcon">Atari ST</a>, 8 MHz, CD-ROM-CARTRIDGE
---------------------------------
                                                mean
Device             points  transfer rate   read time  driver

SONY CDU33A           169   305 KB/s (2,03)   180 ms  CD-ROM-CARTRIDGE 1.06


---------------------------------------------------------------
<a href="0305.htm" target="UDOcon">Atari ST</a>, 8 MHz, CD-ROM CARTRIDGE II (mit ATAPI-IDE Laufwerken)
---------------------------------------------------------------
                                                mean
Device             points  transfer rate   read time  driver

PIONEER CR-124X      1086   619 KB/s (4,12)    57 ms  CD-ROM CARTRIDGE 2.07
Mitsumi FX 400        916   614 KB/s (4,09)    67 ms  CD-ROM CARTRIDGE 1.06
Stingray 8222IDE      607   631 KB/s (4,20)   104 ms  CD-ROM CARTRIDGE 1.06
Mitsumi FX 300        409   458 KB/s (3,05)   112 ms  CD-ROM CARTRIDGE 1.06
SONY CDU55E           367   305 KB/s (2,03)    83 ms  CD-ROM CARTRIDGE 1.06


---------------------------
Atari MegaSTE, 16 MHz, ACSI
---------------------------
                                                mean
Device             points  transfer rate   read time  driver

Toshiba XM 3401       344   337 KB/s (2,24)    98 ms  HS-CDROM 2.00


-------------------------
Atari TT030, 32 MHz, ACSI
-------------------------
                                               mean
Device             points transfer rate   read time  driver

Toshiba XM 5201       681  524 KB/s (3,49)    77 ms  HS-CDROM 2.02
Atari CDAR-504          8   57 KB/s (0,38)   745 ms  HS-CDROM 2.02


-------------------------
Atari TT030, 32 MHz, SCSI
-------------------------
                                                mean
Device             points  transfer rate   read time  driver

Toshiba XM 3701      2695  1019 KB/s (6,79)    37 ms  HS-CDROM 2.08
Toshiba XM 5201       970   524 KB/s (3,49)    54 ms  HS-CDROM 2.02
Matsus. PD-1 LF-1000  590   614 KB/s (4,09)   104 ms  HS-CDROM 2.12
Toshiba XM 3401       438   337 KB/s (2,24)    77 ms  HS-CDROM 2.02
Nec Multispin 3x      430   460 KB/s (3,06)   107 ms  HS-CDROM 2.04
Toshiba XM 4101       384   307 KB/s (2,04)    80 ms  HS-CDROM 1.24
Sony CDU-8003A        314   336 KB/s (2,24)   107 ms  HS-CDROM 2.08


----------------------
Falcon030, 16 MHz, IDE
----------------------
                                                mean
Device             points  transfer rate   read time  driver

Mitsumi FX 300        326   401 KB/s (2,67)   123 ms  HS-CDROM 2.02


-----------------------
Falcon030, 16 MHz, SCSI
-----------------------
                                                mean
Device             points  transfer rate   read time  driver

Toshiba XM 3601      1292   672 KB/s (4,48)    52 ms  HS-CDROM 2.02
Toshiba XM 5301      1055   612 KB/s (4,08)    58 ms  HS-CDROM 2.02
SONY CDU-55S          476   362 KB/s (2,41)    76 ms  HS-CDROM 2.02
Toshiba XM 4101       334   307 KB/s (2,04)    92 ms  HS-CDROM 1.24
Goldstar GCD-R320     283   306 KB/s (2,04)   108 ms  HS-CDROM 2.02
SANYO CRD-250S        249   306 KB/s (2,04)   123 ms  HS-CDROM 2.02

</pre>
<p>Die Benchmarks in dieser Auflistung stammen von Julian Reschke@MS
<br>
</p>
<p>Eine gewerbliche Nutzung ist Untersagt!
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0c.htm" target="UDOcon"><img src="udo_up.gif" alt="CD-Laufwerke" border=0 width="24" height="24"></a>
<a href="0c01.htm" target="UDOcon"><img src="udo_lf.gif" alt="CD-Treiber" border=0 width="24" height="24"></a>
<a href="0c03.htm" target="UDOcon"><img src="udo_rg.gif" alt="CD Access" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
