<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: YAMI - Yet Another Mouse Interface
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f02.htm" target="UDOcon"><img src="udo_up.gif" alt="M&auml;use &amp; Adapter" border=0 width="24" height="24"></a>
<a href="0f0202.htm" target="UDOcon"><img src="udo_lf.gif" alt="Logitech Maus anschliessen" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_rg.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="YAMI_20-_20Yet_20Another_20Mouse_20Interface">15.2.3 YAMI - Yet Another Mouse Interface</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> YAMI - Ein Mausinterface f&uuml;r den Atari </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>YAMI steht f&uuml;r Yet Another Mouse Interface und wurde von
Richard K&ouml;rber, der f&uuml;r die Software und Entwurf
zust&auml;ndig ist und von mir (Hardware, Platine) enwickelt.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Wozu ein Mausinterface? </b>
<br>
</p>
<p>Da es immer schwieriger wird neue M&auml;use f&uuml;r Atari und
Amiga Computer zu finden und die Alten auch nicht ewig halten, wurde
es Zeit nach einer Alternative zu suchen. Es bot sich an die
gro&szlig;e Vielfalt der PC-M&auml;use zu nutzen.
<br>
</p>
<p>Auch f&uuml;r Atari-Computer gibt es L&ouml;sungen bei denen man
die PC-Maus an die serielle Schnittstelle anschlie&szlig;t. Diese
L&ouml;sung hat aber mehrere Nachteile. Zum einen mu&szlig; man
daf&uuml;r eine serielle Schnittstell entbehren und von dieser haben
viele Atari-Rechner eben nur eine. Zum anderen braucht man eine
Treiber-Software. Diese bringt aber so manche Probleme mit sich und
kann bei nicht systemkonform programmierter Software g&auml;nzlich
versagen.
<br>
</p>
<p>Hier sind Hardware-Interfaces von Vorteil. Sie werden in den
Mausport des Amiga oder Atari gesteckt und setzen die Signale der
PC-Maus in &uuml;bliche Signale um. Die serielle Schnittstelle wird
nicht belegt, und Rechnerseitig gibt es auch keinen Unterschied
zwischen einer original Maus und den Maussignalen vom Interface.
Dadurch funktionieren auch Hacks, Spiele und andere Betriebssysteme
immer noch.
<br>
</p>
<p>YAMI ist so eine reine Hardwarel&ouml;sung, deshalb gibt es auch
keine Probleme mit Programmen die das <a href="0901.htm" target="UDOcon">Betriebssystem</a> umgehen oder
sonst was machen.
<br>
<br>
<br>
</p>
<p align=center><img src="image/yami1.gif" border=0 width="179" height="90"></p><br>
<div align=center><tt> Abbildung 1 - YAMI-Interface </tt>
<br>
<br>
<br>
</div>
<p align=center><img src="image/yami2.gif" border=0 width="123" height="92"></p><br>
<div align=center><tt> Abbildung 2 - Das fertige Interface steckt am Atari </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p><b> Warum YAMI? </b>
<br>
</p>
<p>Jetzt gibt es bereits einige andere Hardwarel&ouml;sungen f&uuml;r
Atari und Amiga und wie der Name schon sagt ist YAMI ein weiteres.
YAMI bietet aber einige Vorteile. So unterst&uuml;tzt YAMI alle
g&auml;ngigen seriellen PC-M&auml;use mit dem Datenprotokoll von M$,
Logitech oder Mouse System. Ein Jumper ist nicht erforderlich, die
Formate werden automatisch erkannt. Andere Mausinterfaces steuern die
neue Mausposition in einer Treppenform an. Dies sieht ziemlich unruhig
aus und macht die Maus in Zeichenprogrammen v&ouml;llig unbrauchbar.
YAMI besitzt eine Kantengl&auml;ttung, die daf&uuml;r sorgt, das
selbst schnelle Mausbewegungen ordntlich umgesetzt werden. Auch ist es
kein Problem parallel zur Maus einen Joystick zu schalten. YAMI
erkennt, wenn auf einem parallel geschalteten Joystick der Feuerknopf
gedr&uuml;ckt wird und schaltet die Maus ab. So entfallen l&auml;stige
St&ouml;pselaktionen, wenn man auf dem Rechner spielen m&ouml;chte.
<br>
</p>
<p>YAMI ist st&ouml;rungssicher. So erkennt es automatisch ein 7-
oder 8-Bit-Protokoll, und synchronisiert sich permanent neu auf die
seriellen Daten ein. Kurze Unterbrechungen k&ouml;nnen YAMI
ebensowenig anhaben wie ein Umst&ouml;pseln der Maus im Betrieb
(obwohl wir generell davon abraten, im Betrieb irgendwelche <a href="0f0b.htm" target="UDOcon">Stecker</a>
vom Rechner zu ziehen! Dies kann zur Besch&auml;digung des Rechner
oder YAMI f&uuml;hren). Ein eingebauter Watchdog-Timer sorgt
daf&uuml;r, dass YAMI nicht einfach h&auml;ngenbleibt, sollte die
Firmware einmal abst&uuml;rzen.
<br>
</p>
<p>Zu guter Letzt ist YAMI In-Circuit Updatef&auml;hig. Die Firmware
im Interface kann aktualisiert werden, ohne das ein neuer Baustein
gekauft oder am Interface herumgel&ouml;tet werden mu&szlig;. So kann
YAMI jederzeit auf den neuesten Stand gebracht werden, und du
tr&auml;gst daf&uuml;r nur die Portokosten.
<br>
</p>
<p>
<br>
<br>Hier nochmal die Features auf einen Blick:
<br>
</p>
<p>L&auml;uft auf allen Amiga- und Atari-Modellen.
<br>Unterst&uuml;tzt alle g&auml;ngigen seriellen PC-M&auml;use mit
dem Datenprotokoll von M$, Logitech oder Mouse System. Reine PS/2-
oder USB-M&auml;use werden nicht unterst&uuml;tzt.
<br>Die YAMI-Firmware ist in der Schaltung updatef&auml;hig.
<br>Kostenloses Update, d.h. nur das Porto mu&szlig; bezahlt werden,
im Falle eines notwendigen Softwareupdates.
<br>Automatische Mausformaterkennung, keine Jumper.
<br>Parallelschalten eines Joysticks wird voll unterst&uuml;tzt.
<br>Kantengl&auml;ttung: keine &quot;Treppchen&quot; und
&quot;Wellen&quot; bei schnellen Bewegungen.
<br>Kein Umbau der PC-Maus oder des Computers notwendig, kein
Garantieverlust.
<br>Einfach anstecken und fertig.
<br>Kompatibel zu allen Programmen.
<br>
</p>
<p>
<br>
<br><b> <a href="0204.htm" target="UDOcon">Installation</a> </b>
<br>
</p>
<p>Schalte deinen Rechner erst einmal aus!
<br>
</p>
<p>YAMI kann nun in den Mausport des Rechners gesteckt werden.
<br>
</p>
<p>Die PC-Maus wird anschlie&szlig;end an YAMI angeschlossen. Wenn es
sich um eine kombinierte serielle- und PS/2-Maus handelt, ist ein
Adapter notwendig. Dieser liegt jedoch meistens der Maus bei. An
dieser Stelle noch einmal der Hinweis: reine PS/2- oder USB-M&auml;use
k&ouml;nnen an YAMI nicht betrieben werden!
<br>
</p>
<p>Nun kann der Rechner wieder eingeschaltet werden. Die PC-Maus
sollte direkt zur Verf&uuml;gung stehen.
<br>
</p>
<p>Wichtig: Am Eingang von YAMI d&uuml;rfen keine
Amiga/Atari-M&auml;use, Joysticks oder andere Ger&auml;te
angeschlossen werden. Sie k&ouml;nnten das Interface besch&auml;digen!
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Bedienung </b>
<br>
</p>
<p>Die an YAMI angeschlossene Maus l&auml;sst sich benutzen wie eine
normale Amiga- bzw. Atari-Maus. Einstellarbeiten fallen nicht an.
<br>
</p>
<p>Hinweis: das Wheel oder die mittlere Maustaste kann auf Ataris
leider nicht verwendet werden.
<br>
<br>
<br><b> Joysticks </b>
</p>
<p>Durch einen handels&uuml;blichen Verteilerstecker kann parallel zu
dem YAMI-Mausport ein Joystick betrieben werden.
<br>
</p>
<p>Der Verteiler wird hierzu in den Joystick- bzw. Mausport vom Atari
gesteckt. YAMI wird in einen der beiden Ports vom Verteiler gesteckt,
an den anderen Anschlu&szlig; der Joystick.
<br>
</p>
<p>YAMI &uuml;berwacht permanent den Mausport. Sobald auf den
Feuerknopf des Joysticks gedr&uuml;ckt wird, geht YAMI in einen
Passiv-Modus &uuml;ber, so da&szlig; der Joystick nicht gest&ouml;rt
wird. Durch eine Bewegung an der Maus wird YAMI dann wieder aktiviert.
<br>
</p>
<p>Bitte beachte folgenden Hinweis: der Parallelbetrieb ist
ausschlie&szlig;lich f&uuml;r herk&ouml;mmliche Joysticks gedacht.
Andere Mausinterfaces, Joystickinterfaces, Paddles (analoge
Joysticks), Lightpens, Dongles und sonstige Interfaces d&uuml;rfen
nicht parallel betrieben werden, da ansonsten der Rechner, das
parallel geschaltete Ger&auml;t oder YAMI dauerhaft besch&auml;digt
werden kann. Lediglich der Betrieb eines zweiten YAMI-Interface ist
m&ouml;glich.
<br>
<br>
<br><b> Zuk&uuml;nftige Updates </b>
<br>
</p>
<p>Reine Softwareupdates werden auch zuk&uuml;nftig zum reinen
Selbstkostenpreis ausgef&uuml;hrt. Dies bedeutet, da&szlig; das
Interface sicher verpackt und ausreichend frankiert an Richard
K&ouml;rber gesendet werden mu&szlig;, der sich um das Updaten
k&uuml;mmert und ihm durch das Update keinerlei Kosten f&uuml;r Porto
und Verpackung entstehen d&uuml;rfen.
<br>
</p>
<p>Auch das R&uuml;cksenden mu&szlig; uns so einfach wie m&ouml;glich
gemacht werden. Idealerweise kann man die Verpackung f&uuml;r die
R&uuml;cksendung wiederverwenden, oder es liegt eine Verpackung
f&uuml;r die R&uuml;cksendung anbei. Au&szlig;erdem mu&szlig; in der
Sendung ausreichend Porto f&uuml;r die R&uuml;cksendung vorhanden
sein, sonst schicke wir das Paket unfrankiert zur&uuml;ck.
<br>
</p>
<p>Wenn du alles richtig gemacht hast, ist das Paket in der Regel
bereits nach drei Werktagen wieder auf dem Weg zur&uuml;ck zu dir.
Einschreibesendungen sind auch m&ouml;glich, verz&ouml;gern das Update
aber schlimmstenfalls um etwa zwei Wochen. Sollte es mal etwas
l&auml;nger dauern, bitte wir um Verst&auml;ndnis. Jeder Mensch
braucht mal Urlaub. ;-)
<br>
</p>
<p>Hardwareupdates sind nicht kostenlos, da hier f&uuml;r uns
Material- und Arbeitsaufwand anf&auml;llt. Wir versuchen jedoch, den
Preis m&ouml;glichst niedrig zu halten. Au&szlig;erdem stellen
Hardwareupdates eine Ausnahme dar.
<br>
<br>
<br><b> Ein Hinweis noch... </b>
<br>
</p>
<p>Wir sind keine kommerziellen Entwickler, die von dem Verkauf von
YAMI leben (was auch nicht m&ouml;glich w&auml;re). Das Projekt ist
viel mehr ein Teil unseres Hobbys.
<br>
</p>
<p>Bei den geringen St&uuml;ckzahlen von YAMI ist die Gewinnspanne
f&uuml;r uns so klein, da&szlig; wir - wenn man die Zeit f&uuml;r die
Entwicklung und den Zusammenbau mitrechnet - sogar noch in das
Interface hineinbuttern. Damit wir trotzdem leben k&ouml;nnen, haben
wir einen Job, der einen Gro&szlig;teil unserer Zeit in Anspruch
nimmt.
<br>
</p>
<p>Wir bitten euch daher, bei Anfragen und Problemen dies zu
ber&uuml;cksichtigen.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Bisher getestete M&auml;use... </b>
<br>
</p>
<p>Hier nun eine Liste der bisher getesteten M&auml;use mit Bild
(ohne Gew&auml;hr und Anspruch auf Vollst&auml;ndigkeit).
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Wie bestelle ich YAMI und was kostet es? </b>
<br>
</p>
<p>Um YAMI zu bestellen, reicht es mir oder Richard K&ouml;rber eine
E-Mail zu schreiben. Amiga-User sollten sich auf Richards YAMI-Seiten
noch genauer &uuml;ber die zus&auml;tzlichen Funktion informieren, die
nur auf Amigas zur Verf&uuml;gung stehen.
<br>
</p>
<p>
<br>
<br><b> YAMI-Typ: </b>
<br>Amiga, Standard 25,00 Euro
<br>
</p>
<p>Atari, Standard 25,00 Euro
<br>
</p>
<p>Amiga, Wheel 30,00 Euro
<br>
<br>
</p>
<p>Zus&auml;tzlich 3 Euro (Deutschland) oder 5 Euro (Ausland)
f&uuml;r Porto und Verpackung.
<br>
</p>
<p>Zahlungsweise: Eurocheque zur Verrechnung oder
Bank&uuml;berweisung.
<br>Eine Sendung auf Rechnung, als Barvorkasse oder per Nachnahme ist
nicht m&ouml;glich.
<br>
<br>
<br><b> Wichtiger Hinweis: </b>
<br>
</p>
<p>Bei der Bestellung bitte unbedingt angeben f&uuml;r welchen
Computer -Atari oder Amiga- und ob man YAMI direkt auf den Mausport
stecken kann oder ob ein &quot;Verl&auml;ngerungkabel&quot; notwendig
ist.
<br>
</p>
<p><a href="0201.htm" target="UDOcon">Autor</a>: Edgar Hilgart
<br>Email: Elmar.Hilgart@asamnet.de
<br><a href="http://www.asamnet.de/~hilgarte/index.htm" target="_top">Romport Hardware</a>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f02.htm" target="UDOcon"><img src="udo_up.gif" alt="M&auml;use &amp; Adapter" border=0 width="24" height="24"></a>
<a href="0f0202.htm" target="UDOcon"><img src="udo_lf.gif" alt="Logitech Maus anschliessen" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_rg.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
