<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: ESCC
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0305.htm" target="UDOcon"><img src="udo_lf.gif" alt="Second serial port" border=0 width="24" height="24"></a>
<a href="0f0307.htm" target="UDOcon"><img src="udo_rg.gif" alt="RSFI" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="ESCC">15.3.6 ESCC</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Projekt ST_ESCC </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Es werden zwei zus&auml;tzliche serielle <a href="0f.htm" target="UDOcon">Schnittstellen</a> im Atari
ST/STE/MegaST installiert, die auch f&uuml;r h&ouml;here Baudraten
geeignet sind. Der ESCC (EnhancedSCC) Z85230 wurde gew&auml;hlt, da er
<br>
</p>
<p>- 8 Byte Empfangspuffer und 4 Byte Sendepuffer besitzt
<br>- vektorisierte Interrupts erzeugt
<br>- zwei serielle <a href="0f.htm" target="UDOcon">Schnittstellen</a> enth&auml;lt
<br>- kompatibel zum im MegaSTE/TT/Falcon eingesetzten SCC ist
<br>
<br>
</p>
<p>Der Einbau soll mit m&ouml;glichst wenigen Verbindungen zum
Computer erfolgen. Ein Aufsetzen auf die <a href="080108.htm" target="UDOcon">CPU</a> schied aus mehreren
Gr&uuml;nden aus. Damit war klar, da&szlig; der ESCC nicht auf der
gleichen Adresse wie der SCC im MegaSTE liegen wird. F&uuml;r eine
MegaSTE-Kompatibilit&auml;t h&auml;tte mindestens noch ein anderes
Register simuliert werden m&uuml;ssen, was eventuell &Auml;rger mit
Beschleunigern erzeugt h&auml;tte. Der MFP erschien mir passend. Da
ich ohnehin einen neuen Software-Treiber f&uuml;r serielle
<a href="0f.htm" target="UDOcon">Schnittstellen</a> schreibe und sehr f&uuml;r ein
hardwareunabh&auml;ngiges Softwareinterface zu diesen <a href="0f.htm" target="UDOcon">Schnittstellen</a>
bin, sehe ich die MegaSTE-Inkompatibilit&auml;t nicht als Nachteil.
Die Hardware wird hier genau beschrieben, da dies ein Bastelanleitung
ist. In eigenen Programmen sollte man anstelle dieses Wissens den
Software-Treiber benutzen. Ist dies unm&ouml;glich, da der Treiber die
gew&uuml;nschte Funktion nicht bietet, sollte man seine Software in
Treiber und Hauptprogramm aufteilen und das Interface dokumentieren,
um auch den Besitzern andere Hardware die Nutzung zu erm&ouml;glichen.
<br>
</p>
<p>Eine ST_ESCC-Version, die zus&auml;tzlich &uuml;ber einen
I2C-Controller verf&uuml;gt, ist fast fertig. Die Platine (42mm*60mm)
liegt schon bei mir, es fehlen aber noch ein Bauteil, die
Logikgleichungen und der Testlauf.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> <a href="0206.htm" target="UDOcon">Copyright</a> und fertige Versionen </b>
<br>
</p>
<p>ST_ESCC darf f&uuml;r den Eigenbedarf gebaut werden. Gegen den
Aufbau f&uuml;r gute Freunde habe ich ebenfalls nichts. Eine
kommerzielle Fertigung oder Verwertung ist nur mit meiner
schriftlichen Zustimmung erlaubt. Das Erstellen einer
mailboxversandf&auml;higen Version der Dokumentation war mit einem
nicht unerheblichen Zeitaufwand verbunden.
<br>
</p>
<p>Dieses Paket darf unver&auml;ndert frei weitergegeben werden. Wenn
jemand &Auml;nderungen hinzuf&uuml;gen will, so mu&szlig; er diese
eindeutig als &Auml;nderung bzw. Erg&auml;nzung kennzeichnen. Eine
&Uuml;bersetzung in andere Sprachen ist ausdr&uuml;cklich
erw&uuml;nscht. Das deutsche Original mu&szlig; aber mit im Paket
verbleiben.
<br>
</p>
<p>Ich glaube nicht, da&szlig; es viele Bastler geben wird, die sich
nach dieser Anleitung die Platinen selbst machen oder frei verdrahten.
Die Platinen sind aber nicht zur Verhinderung des Selbstbaus
zweiseitig durchkontaktiert und mit einigen SMDs best&uuml;ckt,
sondern um durch eine geringe Gr&ouml;&szlig;e den Einbau zu
vereinfachen. Wer dennoch alles selbst macht, sollte sich doch mit
einer kleinen Spende (ich nenne es absichtlich nicht Sharewarebeitrag)
erkenntlich zeigen.
<br>
</p>
<p>Einen Bausatz mit allen Bauteilen werde ich wahrscheinlich nicht
anbieten, es ist zu aufwendig, das SMD-Zeug einzut&uuml;ten.
<br>
<br>
</p>
<p>Es gibt bei mir:
<br>- den komplett aufgebauten ST_ESCC (ohne Pegelwandler)
<br>- die komplette Pegelwandlerplatine f&uuml;r RS232
<br>- die Platinen f&uuml;r ST_ESCC und Pegelwandler (zweiseitig
<br>durchkontaktiert, logischerweise gebohrt, verzinnt)
<br>- den Z85230-16PSC
<br>- das GAL20v8 programmiert
<br>- den Quarzoszi 14.7456MHz in SG636 Preise auf Anfrage.
<br>
<br>
</p>
<p>Ich habe diese Bauanleitung sorgf&auml;ltig &uuml;berpr&uuml;ft.
Ich hafte in keiner Weise f&uuml;r eventuelle Fehler und/oder (daraus
resultierende) Besch&auml;digungen irgendwelcher Objekte oder
Subjekte, oder f&uuml;r die Verwendbarkeit zu einem bestimmten Zweck.
<br>
</p>
<p>In diesem Paket sind alle Informationen zu ST_ESCC enthalten.
Au&szlig;er dem Layout als Scooter-PCB-Datei habe ich auch nicht mehr.
Schriftliche Anfragen werden nur beantwortet, wenn ein frankierter
R&uuml;ckumschlag (o.&auml;.) beiliegt.
<br>
</p>
<p>Email-Anschrift:
<br>im Mausnetz: Harun Scheutzow @B
<br>aus dem <a href="17.htm" target="UDOcon">Internet</a>: Harun_Scheutzow@B.maus.de
<br>Postanschrift:
<br>Harun Scheutzow
<br>Dresdener Stra&szlig;e 83
<br>10179 Berlin
<br>
</p>
<p>
<br>
<br><b> Inhalt </b>
<br>
</p>
<p>Das Paket enth&auml;lt die Dateien:
<br>
</p>
<p>STESCC.TXT Bauanleitung
<br>STESCC.JED JEDEC-File f&uuml;r das GAL
<br>ESCC*.IMG Bilder zur ST_ESCC-Platine
<br>148X*.IMG Bilder zur Pegelwandlerplatine
<br>*_USG.IMG Unterseite, Sicht auf Unterseite
<br>*_OS.IMG Oberseite
<br>*_BO.IMG Best&uuml;ckungsplan Oberseite
<br>*_BUG.IMG Best&uuml;ckungsplan Unterseite, Sicht auf Unterseite
<br>Alle *.IMG sind 300dpi monochrom GEM-IMG-Dateien.
<br>
</p>
<p>Zus&auml;tzlich ist noch Software enthalten. Es sollte mindestens
eine Datei HSMOD*.TXT auftauchen, in der alles weitere beschrieben
ist.
<br>
</p>
<p>
<br>
<br><b> Software </b>
<br>
</p>
<p>Es gibt von mir einen Treiber, der &auml;hnlich wie HSMODEM1
f&uuml;r MODEM1 diese zus&auml;tzlichen <a href="0f.htm" target="UDOcon">Schnittstellen</a> ansprechen
wird. Das Treiberpaket wird als HSMOD*.* in Mailboxen herumliegen. Bei
der Erstver&ouml;ffentlichung von ST_ESCC ist der Treiber noch nicht
komplett und als Testversion anzusehen.
<br>
</p>
<p>Der Treiber erm&ouml;glicht es, diese beiden seriellen
<a href="0f.htm" target="UDOcon">Schnittstellen</a> als MODEM2 und SERIAL2 anzusprechen. Er wird auch in
einer angepa&szlig;ten Version f&uuml;r MegaSTE, TT und Falcon
verf&uuml;gbar sein. In der endg&uuml;ltigen Ausstattung ist er ein
wirklich hardwareunabh&auml;ngiges Softwareinterface, so da&szlig; ein
Programm, das diesen Treiber nutzt, ohne &Auml;nderungen mit ST_ESCC
und z.B. auf dem Falcon laufen wird.
<br>
</p>
<p>Weitere Informationen sind in den Textfiles des Treibers
enthalten.
<br>
</p>
<p>
<br>
<br><b> Design </b>
<br>
</p>
<pre>MC68901, interessante Signale
-----------------------------
(Pinbelegung f&uuml;r 48poliges DIL-Geh&auml;use)
Name    Pin      Dir.   Beschreibung
D7..D0  44..37   I/O/T  Datenbus
A5..A1  6..2     I      Adre&szlig;bus
RWL     1        I      Read=H, Write=L
IRQL    32       O-oC   L f&uuml;r Interruptanmeldung
CSL     48       I      L-aktives ChipSelect
<a href="1705.htm" target="UDOcon">DSL</a>     47       I      L-aktives DataSelect (von <a href="080108.htm" target="UDOcon">CPU</a>)
                        L bei Zugriff und bei Interruptantwort
DTACKL  46       O-oC   L-aktive R&uuml;ckmeldung nach Daten/Vektortransfer
IACKL   45       I      L wenn <a href="080108.htm" target="UDOcon">CPU</a> Interruptvektor lesen will
VCC     11       x      Versorgungsspannung
GND     36       x      Masse
CLK     35       I      Systemtakt
IEIL    34       I      L wenn kein h&ouml;heres Ger&auml;t Interrupt anmelden will
                        immer L im ST
IEOL    33       O      L wenn IEIL =L und MFP keinen Interrupt melden will
                        unbenutzt im ST
RESETL  21       I      L f&uuml;r Reset

</pre>
<p>
<br>
</p>
<p>Der MFP im ST wird im Bereich $FFFFFA01..$FFFFFA3F angesprochen,
der zweite MFP im TT bei $FFFFFA81..$FFFFFAAF. Die Datenleitungen sind
mit D7..D0 der <a href="080108.htm" target="UDOcon">CPU</a> verbunden, passend zur &Uuml;bertragung von
Interruptvektoren. Der MFP hat nur bei $FFFFFA01..$FFFFFA2F Register,
f&uuml;r den leeren Bereich von $FFFFFA31..$FFFFFA3F, 8 Adressen, gibt
er trotzdem ein DTACKL und aktiviert beim Lesen wahrscheinlich seine
Datenleitungen.
<br>
</p>
<p>Da <a href="1705.htm" target="UDOcon">DSL</a> extra vorhanden ist, wird CSL des MFP wahrscheinlich nur
aus den Adressen und evtl. AdressStrobe erzeugt.
<br>
</p>
<p>Die CSL-Leitung zum MFP wird aufgetrennt, OCSL kommt von der
Computerplatine, und NCSL geht dann zum MFP. NCSL wird aktiviert, wenn
OCSL =L ist und auf A5..A1 die Werte $0..$17 anliegen. F&uuml;r OCSL
=L und A5..A1 =$18..$1F wird die Erweiterung (CEL) aktiviert. Der ESCC
wird bei $18..$1B aktiviert, die zwei Datenausg&auml;nge des GALs bei
$1C..$1F.
<br>
</p>
<p>Der MFP legt bei IACKL =L den Vektor auf den Bus, unabh&auml;ngig
von RWL. CSL wird dabei nicht bedient (Motorola sagt: IACKL und CSL
should not be asserted simultaneously).
<br>
</p>
<p>Der SCC legt den Vektor nur bei INTACKL =L und RDL =L auf den Bus,
wobei RDL auch noch gegen&uuml;ber INTACKL verz&ouml;gert sein
mu&szlig;, 150ns bei 8MHz, f&uuml;r externe _und_ SCC-intere
Priorit&auml;tsketten. Die gew&auml;hlte Verz&ouml;gerung wird im GAL
aus dem 4MHz-Takt (CLK) des MFP abgeleitet und betr&auml;gt
250..500ns.
<br>
</p>
<p>Die Interrupts des SCC werden wie die des MFP an die <a href="080108.htm" target="UDOcon">CPU</a> mit
Level6 gemeldet. Der SCC k&ouml;nnte dabei h&ouml;her oder niedriger
priorisiert werden als der MFP. F&uuml;r niedrigere Priorit&auml;t
spricht der Empfangspuffer des SCC und der fehlende Empfangspuffer des
MFP, au&szlig;erdem wird eine Pin/Leiterzugtrennung gespart. Der SCC
meldet seinen Interrupt &uuml;ber seinen oC-Ausgang INTL, der parallel
zu IRQL des MFP geschaltet wird. MFP und SCC verstehen
Interruptprorit&auml;tsketten, die aber sehr gegens&auml;tzlich
realisiert sind.
<br>
</p>
<p>Der MFP aktiviert seinen IRQL-Ausgang immer wenn er einen
Interrupt melden will und l&auml;&szlig;t ihn so lange aktiv, bis im
MFP kein Interrupt mehr ansteht, unabh&auml;ngig vom Pegel auf IEIL.
IEIL des h&ouml;chstpriorisierten MFP liegt fest auf aktiv, aber der
IEOL Ausgang jedes MFP ist im Ruhezustand inaktiv. Erst wenn das
IACKL-Signal aktiv wird, IEIL aktiv ist und der MFP selbst keinen
Interrupt angemeldet hat, aktiviert er sein IEOL. Er antwortet selbst
auf einen Interrupt (mit Vektor und DTACKL aktiv), wenn IACKL und IEIL
aktiv sind. Durch diese Realisierung sind Laufzeiten in der
Interruptpriorit&auml;tskette unwesentlich.
<br>
</p>
<p>Der SCC hingegen aktiviert seinen INTL-Ausgang nur, wenn IEI aktiv
ist. Sein IEO h&auml;lt er aktiv, wenn er nicht gerade selbst einen
Interrupt anmelden will. Die Priorit&auml;tsermittlung erfolgt erst
mit Aktivierung von INTACKL, so da&szlig; das RDL-Signal gen&uuml;gend
verz&ouml;gert werden mu&szlig;. RDL darf erst nach Einschwingen der
Priorit&auml;tskette aktiv werden.
<br>
</p>
<p>Da beim Anschalten von /IEOL des MFP (negiert) an IEI des SCC der
SCC nie sein INTL aktivieren w&uuml;rde, wird auf diese Verschaltung
verzichtet und IEI des SCC st&auml;ndig aktiviert. Stattdessen wird
das MFP-Verhalten nachgebildet, indem nur dann das RDL-Signal (und
dann auch DTACKL) f&uuml;r den SCC aktiviert wird, wenn IEOL des MFP
und IACKL aktiv sind.
<br>
</p>
<p>Die Steuersignale des SCC werden aus RWL, <a href="1705.htm" target="UDOcon">DSL</a>, OCSL, A1, A2 und
IACKL erzeugt. DTACKL wird nach Ablauf der Zugriffszeit (evtl.
fr&uuml;her) des SCC gemeldet, bei Zugriffen und beim
Interruptvektorlesen. Ein Zugriff auf den SCC beginnt erst nach Ablauf
der Erholzeit vom vorigen Zugriff.
<br>
</p>
<p>Der SCC mu&szlig; nicht mit CEL vor RDL oder WRL betrieben werden,
sondern es kann auch problemlos umgedreht werden sagen AMD und ZILOG,
die effektive Zeit des Zugriffs ist CEL =L und (RDL oder WRL) =L. Da
RWL f&uuml;r 68901 bei Interruptvektorlesen aber nicht bestimmt sein
mu&szlig; und RDL=WRL=L Reset bedeutet, wird auch WRL extra erzeugt.
<br>
</p>
<p>Bei der 10MHz-Version ist die RDL-Zugriffszeit max. 120ns, bei
20MHz nur 65ns. Stromverbrauch 9mA bei 20MHz, wenn keine Quarze
angeschaltet sind (je +6mA). Die Erholzeit zwischen zwei beginnenden
Zugriffen betr&auml;gt 4 Zyklen des Systemtaktes PCLK (beim Z85230).
<br>
</p>
<p>CEL (ChipEnable) des SCC wird fest auf L gelegt und damit dauernd
aktiviert. Im TT ist der CEL-Anschlu&szlig; des SCC dauernd auf L. Da
das Interruptvektorlesen mit RDL und INTACKL ohne Erw&auml;hnung von
CEL erfolgt und nirgends eine CEL=H-Zeit auftaucht, ist das wohl
legal.
<br>
</p>
<p>INTACKL des SCC wird direkt mit IACKL des MFP verbunden.
<br>
</p>
<p>IEOL des MFP geht negiert an IEIH des SCC.
<br>
</p>
<p>A2 an ABL des SCC, A1 an DCL des SCC
<br>
<br>
</p>
<pre>
Adressen des SCC
Erkl&auml;rung         bei ST_ESCC   bei TT/MegaSTE/Falcon
ControlRegisterA   $FFFFFA35       $FFFF8C81
DataRegisterA      $FFFFFA37       $FFFF8C83
ControlRegisterB   $FFFFFA31       $FFFF8C85
DataRegisterB      $FFFFFA33       $FFFF8C87

Abfrage des DSR-Signals
$FFFFFA39: Bit3 DSRA, Bit2 DSRB

</pre>
<p>
<br>
</p>
<p>(Im MegaSTE, TT und Falcon liegt der Kanal A wirklich vor dem
Kanal B, da mu&szlig; wohl die Adre&szlig;leitung A2 (geht an A//B)
negiert sein.)
<br>
</p>
<p>Dem SCC fehlen Eing&auml;nge f&uuml;r RING und DSR, aber er hat je
Port ein im Asynchronbetrieb frei nutzbares Pin, das hier als Eingang
RING verwendet wird. Das DSR-Signal wird &uuml;ber das GAL
gef&uuml;hrt und kann mit Lesezugriffen auf Adresse $FFFFFA39 (und als
Nebeneffekt *B, *D, *F) erfragt werden. DSRA liegt auf Bit3 und DSRB
auf Bit2, die anderen Bits sind bedeutungslos.
<br>
</p>
<p>Takt PCLK des SCC
<br>Ideal ist eine Frequenz von 14745600Hz, da daraus alle Baudraten
genau erzeugt werden k&ouml;nnen. Es ergeben sich folgende hohe
Baudraten: 230400, 153600, 115200, 92160, 76800, 65829, 57600.
<br>
<br>
<br>
</p>
<p>GAL 20v8-15ns getaktet mit 4MHz-Takt des MFP &lt;- ist das =
f&uuml;r registered-Ausg&auml;nge
<br>
</p>
<p>Erkl&auml;rungsbed&uuml;rftige GAL-Eing&auml;nge:
<br>OCSL altes vom MFP abgetrenntes ChipSelect
<br>ACCENA vom 74LS164, H nach Ablauf der Erholzeit des SCC, sonst L
<br>
<br>
</p>
<pre>
GAL-Pinbelegung
                      --**--
4MHz vom MFP, CLK    | 1  24| VCC
vom MFP       RWL    | 2  23| OCSL, von Computerplatine, Chipselect ex. MFP
vom MFP       <a href="1705.htm" target="UDOcon">DSL</a>    | 3  22| NCSL, zum MFP, sein neues ChipSelect
vom MFP       A3     | 4  21| RDL, zum SCC
vom MFP       A4     | 5  20| WRL, zum SCC
vom MFP       A5     | 6  19| DIAV1, intern
vom MFP       IACKL  | 7  18| DIAV2, intern
vom RS232-W.  DSRA   | 8  17| DTACKL, &uuml;ber Diode auf DTACK des MFP
vom RS232-W.  DSRB   | 9  16| D3, Datenbus
vom MFP       IEOL   |10  15| D2, Datenbus
vom MFP       RESETL |11  14| ACCENA, vom 74LS164
              GND    |12  13| GND (/OE, immer aktiv)
                      ------

Gleichungen
;neues CSL f&uuml;r MFP
NCSL.OE = 1
NCSL =   OCSL
       + A5 * A4

;erste IACKL-Verz&ouml;gerungsstufe
DIAV1 &lt;- IACKL

;verz&ouml;gertes IACKL zur RDL-Erzeugung, damit Verz&ouml;gerungszeit der internen
;und externen Priorit&auml;tsketten (MFP) erf&uuml;llt wird, mit 250..500ns sollte es
;immer gehen (MFP wird wohl so schnell sein)
DIAV2 &lt;- DIAV1

;f&uuml;r RDL und WRL gilt:
;Zugriff kann nur mit ACCENA =H beginnen,
;h&auml;lt sich dann selbst solange OCSL =L und <a href="1705.htm" target="UDOcon">DSL</a> =L ist

;RDL f&uuml;r SCC, L bei Lesezugriff, Reset, Interruptvektorlesen (verz&ouml;gert!)
;Interruptvektorlesen wie bei CEL sicherheitshalber erst nach Erholzeit
;und mit Selbsthaltung
RDL.OE = 1
/RDL =   RWL * ACCENA * /OCSL * /<a href="1705.htm" target="UDOcon">DSL</a> * A5 * A4 * /A3
       + RWL * /RDL * /OCSL * /<a href="1705.htm" target="UDOcon">DSL</a>
       + /RESETL
       + ACCENA * /IACKL * /<a href="1705.htm" target="UDOcon">DSL</a> * /DIAV2 * /IEOL
       + /RDL * /IACKL * /<a href="1705.htm" target="UDOcon">DSL</a>

;WRL f&uuml;r SCC, L bei Schreibzugriff, Reset
WRL.OE = 1
/WRL =   /RWL * ACCENA * /OCSL * /<a href="1705.htm" target="UDOcon">DSL</a> * A5 * A4 * /A3
       + /RWL * /WRL * /OCSL * /<a href="1705.htm" target="UDOcon">DSL</a>
       + /RESETL

;DTACKL &uuml;ber SHOTTKY-DIODE zum Bus, oC, da 120ns-Zugriffszeit bei 10MHz-Version,
;wird das Signal direkt aus RDL und WRL erzeugt, /<a href="1705.htm" target="UDOcon">DSL</a> dient nur zum
;schnellen Inaktivieren von DTACKL, die dritte Zeile f&uuml;r DSRx-Lesen
;OE-Steuerung ist hier leider unm&ouml;glich
;Bei Reset kein DTACK!
DTACKL.OE = 1
/DTACKL =   /RDL * RESETL * /<a href="1705.htm" target="UDOcon">DSL</a>
          + /WRL * RESETL * /<a href="1705.htm" target="UDOcon">DSL</a>
          + /OCSL * /<a href="1705.htm" target="UDOcon">DSL</a> * A5 * A4 * A3

;Datenausgang Bit3, f&uuml;r DSRA-Lesen
D3.OE = RWL * /OCSL * /<a href="1705.htm" target="UDOcon">DSL</a> * A5 * A4 * A3
D3 = DSRA

;Datenausgang Bit2, f&uuml;r DSRB-Lesen
D2.OE = RWL * /OCSL * /<a href="1705.htm" target="UDOcon">DSL</a> * A5 * A4 * A3
D2 = DSRB

</pre>
<p>
<br>
<br>
</p>
<p><b> 74LS164 </b>
<br>8Bit Seriell -&gt; Parallel Schieberegister
<br>
</p>
<pre>     --**--
A   | 1  14|  VCC
B   | 2  13|  QH
QA  | 3  12|  QG
QB  | 4  11|  QF
QC  | 5  10|  QE
QD  | 6   9|  CLRL  (Low f&uuml;r Reset)
GND | 7   8|  CLK   (L/H-Flanke schiebt)
     ------
</pre>
<p>
<br>
</p>
<p>Der 74LS164 wird an CLK(pin8) mit dem Takt PCLK des SCC getaktet.
An seinen Eing&auml;ngen A(pin1) und B(pin2) liegt H-Pegel. Sein
CLRL(pin9) kommt vom GAL-Ausgang DTACKL (hier wird genutzt, da&szlig;
der Ausgang kein Tristate macht sondern &uuml;ber eine Diode am /DTACK
des Computers liegt). Damit wird das Schieberegister auf L-Pegel
zur&uuml;ckgesetzt, solange DTACKL aktiv ist. Danach wird mit PCLK
wieder H eingeschrieben. QE(pin10) liefert das H-aktive Signal ACCENA
(AccessEnable), nach Ablauf der Erholzeit des SCC. Bei Anschlu&szlig;
an QE sind das 5 (worst case 4) Takte PCLK, die f&uuml;r den Z85230
(gefordert 4 Takte) ausreichen. Das ist allerdings nicht die
schnellste Variante, da die Z&auml;hlung schon mit der
DTACKL-H/L-Flanke beginnen d&uuml;rfte. Wenn ein billigerer SCC
verwendet wird, so sollte QG(pin12) verwendet werden, die 7 Takte
d&uuml;rften f&uuml;r diesen dann reichen (gefordert meist 6 Takte +
etwas Zeit). A und B k&ouml;nnten auch mit CLRL verbunden werden.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> MC1488, 75188 </b>
<br>
</p>
<p>Pegelwandler TTL -&gt; RS232, teilweise mit AND-Funktion
<br>
</p>
<pre>      --**--
VBB  | 1  14|  VDD (+12V)
IT0  | 2  13|  IT3A
OV0  | 3  12|  IT3B
IT1A | 4  11|  OV3
IT1B | 5  10|  IT2A
OT1  | 6   9|  IT2B
GND  | 7   8|  OV2
      ------
</pre>
<p>
<br>GND: Masse (Logik und RS232)
<br>VDD: RS232 positive Spannung +12V
<br>VBB: RS232 negative Spannung -12V
<br>ITxy: TTL-Eing&auml;nge x, ITxA und ITxB werden AND-verkn&uuml;pft
<br>OVx: RS232-Ausgang x
<br>
<br>
<br>
</p>
<p><b> MC1489, 75189 </b>
<br>
<br>Pegelwandler RS232 -&gt; TTL mit Enable-Eing&auml;ngen
</p>
<pre>
      --**--
IV0  | 1  14|  VCC (+5V)
EN0  | 2  13|  IV3
OT0  | 3  12|  EN3
IV1  | 4  11|  OT3
EN1  | 5  10|  IV2
OT1  | 6   9|  EN2
GND  | 7   8|  OT2
      ------
</pre>
<p>
<br>
</p>
<p>GND: Masse (Logik und RS232)
<br>VCC: Logik-Versorgungsspannung +5V
<br>IVx: RS232-Eingang x
<br>
<br>ENx: (TTL-)Enable-Eingang x, kann man f&uuml;r Enable wohl offen
lassen
<br>OTx: TTL-Ausgang x
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Z85230 ESCC </b>
<br>
<br>
</p>
<pre>
            ----**----
        D1 | 1      40| D0
        D3 | 2      39| D2
        D5 | 3      38| D4
        D7 | 4      37| D6
      /INT | 5      36| /RD
       IEO | 6      35| /WR
       IEI | 7      34| A//B
   /INTACK | 8      33| /CE
       VCC | 9      32| D//C
  /W//REQA |10      31| GND
    /SYNCA |11      30| /W//REQB
    /RTxCA |12      29| /SYNCB
      RxDA |13      28| /RTxCB
    /TRxCA |14      27| RxDB
      TxDA |15      26| /TRxCB
/DTR//REQA |16      25| TxDB
     /RTSA |17      24| /DTR//REQB
     /CTSA |18      23| /RTSB
     /DCDA |19      22| /CTSB
      PCLK |20      21| /DCDB
            ----------
</pre>
<p>
<br>
<br>
</p>
<p><b> Am85C230A von AMD </b>
<br>
</p>
<p>Es soll von AMD einen Am85C230A geben, der pinkompatibel ist, 8
Byte Sendepuffer hat und in den Synchronmodi einige Erweiterungen
bietet. Er war gerade nicht beschaffbar. Da er sich nach dem
Einschalten oder Reset genau wie der Z85230 verh&auml;lt, kann er
ebenfalls eingesetzt werden.
<br>
</p>
<p>Die zus&auml;tzlichen 4 Byte Sende-FIFO m&uuml;&szlig;ten extra
per Software freigeschaltet werden, sind aber auch dann nicht
besonders effektiv. Der Am85C230A kann nur bei halbleeren SendeFIFO
(entspricht Z85230 ganz leer) und bei einem freien Platz im SendeFIFO
(wie Z85230) interrupten, nicht bei ganz leerem FIFO.
<br>
<br>
<br>
</p>
<p><b> Anschlu&szlig;belegung eines 9poligen RS232-Steckers </b>
<br>
<br>
</p>
<pre>
(Sicht auf Steckerstifte)
---------------------------------
\  (1)   (2)   (3)   (4)   (5)  /
 \ DCD   RxD   TxD   DTR   GND /
  \                           /
   \  (6)   (7)   (8)   (9)  /
    \ DSR   RTS   CTS   RING/
     -----------------------

</pre>
<p>
<br>
<br>
</p>
<p><b> Anschlu&szlig;belegung der L&ouml;tpads unter dem SCC </b>
<br>
</p>
<p>(beginnend mit Pin1, dem gekennzeichneten, der Pin1 des SCC am
n&auml;chsten liegt)
<br>
</p>
<p>(Leitungsnamen in der Notation der Zilog-Doku.)
<br>/SYNCA
<br>/SYNCB
<br>/RTxCA
<br>/RTxCB
<br>RxDA
<br>RxDB
<br>/TRxCA
<br>/TRxCB
<br>TxDA
<br>TxDB
<br>/DTR//REQA
<br>/DTR//REQB
<br>/RTSA
<br>/RTSB
<br>/CTSA
<br>/CTSB
<br>/DCDA
<br>/DCDB
<br>VCC, +5V zur Versorgung eines stromsparenden Pegelwandlers
<br>GND, Masse
<br>/DSRA
<br>/DSRB
<br>
<br>/SYNCA und /SYNCB werden hier im Asynchronbetrieb als
RING-Leitungen benutzt.
<br>/DSRA und /DSRB gehen zum GAL.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Einbau </b>
<br>
</p>
<p>Wegen der Modellvielfalt der ST-Reihe und der verschiedenen
Umbauten der Nutzer kann und soll dies keine vollst&auml;ndige
Anleitung sein. Beim mechanischen Teil des Einbaus mu&szlig; jeder
selbst die f&uuml;r ihn g&uuml;nstigste Variante finden.
<br>
</p>
<p>Auch wenn mancher es nicht mehr lesen mag: Der Einbau sollte nur
von Personen durchgef&uuml;hrt werden, die das n&ouml;tige Wissen,
K&ouml;nnen und Werkzeug besitzen. Zum L&ouml;ten soll man nur einen
netzgetrennten L&ouml;tkolben benutzen (z.B.
Elektronik-L&ouml;tstation, (Trenn)trafo, Akku, oder als primitivste
Form: Herausziehen eines &quot;einfachen&quot; L&ouml;tkolbens aus der
Steckdose). Ob der L&ouml;tkolben nun temperaturgeregelt ist oder
nicht, ist egal.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> ST_ESCC-Platine </b>
<br>
</p>
<p>Die ST_ESCC-Platine ist zum Aufsetzen auf den MFP (MC68901, in
48poligem DIL-Geh&auml;use) vorgesehen. Der MFP befindet sich nicht
bei allen ST-Modellen am gleichen Platz. Bei den STF und STFM (also
mit Floppy) und STE ist er meist unter der Floppy zu finden. Die alten
STs ohne Floppy haben den MFP in der linken H&auml;lfte, in der
N&auml;he der <a href="080108.htm" target="UDOcon">CPU</a>. Beim MegaST versteckt sich der MFP leider unter dem
<a href="10.htm" target="UDOcon">Netzteil</a>, deshalb ist ein Einbau dieser ST_ESCC-Platinenvariante dort
nur m&ouml;glich, wenn entweder das <a href="10.htm" target="UDOcon">Netzteil</a> seinen Platz verlassen
hat (Towereinbau o.&auml;.) oder ST_ESCC &uuml;ber kurze Dr&auml;hte
angeschlossen wird (eventuell gibt es in Zukunft eine spezielle
Version f&uuml;r MegaSTs).
<br>
</p>
<p>Pin48 des MFP oder der Leiterzug zu diesem Pin mu&szlig;
aufgetrennt werden, so da&szlig; der Pin48 des MFP mit dem
aufzul&ouml;tenden Sockel (oder ST_ESCC) verbunden werden kann. An das
L&ouml;tauge OCSL auf der ST_ESCC-Platine wird ein Draht
angel&ouml;tet. Wenn es die Einbauh&ouml;he zul&auml;&szlig;t, sollte
der 48polige Sockel auf den MFP aufgel&ouml;tet werden. Andernfalls
mu&szlig; die ST_ESCC-Platine direkt oder eben mittels Dr&auml;hten
angel&ouml;tet werden. Der Draht von OCLS wird an das auf der
Computerplatine verbliebene andere Ende des
Pins/L&ouml;tauges/Leiterzugs vom MFP-Pin48 angel&ouml;tet. Der
&quot;modulare&quot; Bastler wird hier bestimmt einen kleinen <a href="0f0b.htm" target="UDOcon">Stecker</a>
einf&uuml;gen. ST_ESCC wird in den Sockel gesteckt, so da&szlig; die
ersten Pins des Steckers (bei Pin1 und 24 des GALs) in Pin1 und 48
Fassung kommen. Am anderen Ende der Fassung bleiben ein paar Pins
frei.
<br>
</p>
<p>Das Flachbandkabel von ST_ESCC ist noch NICHT mit dem Pegelwandler
verbunden. Wenn der Computer mit ST_ESCC jetzt eingeschaltet wird,
sollte er sich ganz normal verhalten - als w&auml;re kein ST_ESCC
vorhanden. Andernfalls ist Fehlersuche angesagt.
<br>
<br>
<br>
</p>
<p><b> Die Pegelwandlerplatine </b>
<br>
<br>
</p>
<p>Die ST_ESCC-Platine ist &uuml;ber ein Flachbandkabel mit der
Pegelwandlerplatine verbunden. Diese Pegelwandlerplatine befestigt man
sinnvollerweise an einer der Au&szlig;enkanten des Geh&auml;uses so,
da&szlig; die beiden SUB-D-<a href="0f0b.htm" target="UDOcon">Stecker</a> von au&szlig;en zug&auml;nglich
sind. Als Befestigung reichen die 4 Schraubbuchsen der SUB-D-<a href="0f0b.htm" target="UDOcon">Stecker</a>
aus.
<br>
</p>
<p>Der Pegelwandler erh&auml;lt seine +5V-Versorgung von ST_ESCC.
Zus&auml;tzlich ben&ouml;tigt er noch eine belastbare +12V-Versorgung,
die 300mA liefern k&ouml;nnen sollte. Das ist nur eine
Spitzenstromangabe, wenn die Quelle diesen Strom liefern kann,
m&uuml;&szlig;te es funktionieren. Normalerweise fri&szlig;t der
Pegelwandler wesentlich weniger, etwa 80mA. Dieser Wert h&auml;ngt
stark von den eingesetzten 1488-Pegelwandlern ab (Hersteller,
Herstellungsdatum). Man kann ihn auch mit +12V und -12V versorgen, er
ben&ouml;tigt dann bei +12V weniger Strom und der TL497 mit Umgebung
wird eingespart.
<br>
<br>
<br>
</p>
<p><b> Spannungsquellenentscheidung </b>
<br>
</p>
<p>Umgebauter Computer mit einem anderen <a href="10.htm" target="UDOcon">Netzteil</a>
<br>
<br>Ein PC-Schaltnetzteil o.&auml;. liefert gen&uuml;gend belastbare
+12V und -12V. Ist der TL497 bereits best&uuml;ckt, sollte man den
Pegelwandler nur mit +12V versorgen. Will man es nicht oder ist der
TL497 unbest&uuml;ckt, siehe &quot;-12V Zuf&uuml;hrung&quot;.
<br>
<br>
<br>STs mit eingebauter Floppy, STE, MegaST
<br>
<br>Bei diesen Ger&auml;ten liefert das <a href="10.htm" target="UDOcon">Netzteil</a> gen&uuml;gend Strom
bei +12V, aber keine -12V. Der TL497 mit Umgebung wird best&uuml;ckt
und der Pegelwandler mit +12V versorgt. (Den TL497 auf der
Computerplatine bitte nicht behelligen.)
<br>
<br>
<br>
</p>
<p>STs ohne interne Floppy
<br>
<br>Das externe <a href="10.htm" target="UDOcon">Netzteil</a> liefert +12V und -12V, beide aber nicht
belastbar, sondern laut Netzteilaufschrift nur mit 30mA. !!!Ich
garantiere f&uuml;r nichts!!! Der Pegelwandler fri&szlig;t ohne
besondere Last (also ohne Ausgangskurzschl&uuml;sse) je nach Pegel und
Hersteller der (MC)1488/75188 etwa 30mA bei +12V und 30mA bei -12V.
Man kann den TL497 best&uuml;cken und den Pegelwandler mit +5V statt
mit +12V versorgen, liegt damit aber schon nahe an den unteren
Pegelgrenzen (+/-3V) f&uuml;r RS232. Netzteilm&auml;&szlig;ig liegt
man so auf jeden Fall auf der sicheren Seite. Man sollte aber dringend
die 1kOhm/9kOhm Spannungsteilerkombination am TL497 durch
1kOhm/3.3kOhm ersetzen. Ich betreibe einen 520ST mit den +/-12V vom
<a href="10.htm" target="UDOcon">Netzteil</a>, also: TL497 nicht best&uuml;ckt, +12V von Pin14 des MC1488
und -12V von Pin1 des MC1488 auf der Computerplatine. GND an Pin7 des
MC1488. Weiteres siehe &quot;-12V Zuf&uuml;hrung&quot;. Ich werde mich
aber nicht wundern, wenn das <a href="10.htm" target="UDOcon">Netzteil</a> eines Tages nicht mehr geht,
dann kommt ein PC-Schaltnetzteil ran.
<br>
<br>
<br>
</p>
<p><b> Realisierung der Versorgung </b>
<br>
</p>
<p>-12V Zuf&uuml;hrung
<br>
<br>Ist der TL497 nicht best&uuml;ckt, so kann man alle in der
St&uuml;ckliste mit &quot;(&quot; gekennzeichneten Bauelemente sparen,
sie st&ouml;ren aber nicht, falls sie best&uuml;ckt sind. Ist der
TL497 jedoch best&uuml;ckt, so m&uuml;ssen zwei Leiterbahnen auf der
Unterseite der Pegelwandlerplatine unterbrochen werden. Einmal direkt
am L&ouml;tauge f&uuml;r -12V, die andere direkt am +12V L&ouml;tauge.
-12V und +12V sind an den entsprechenden L&ouml;taugen
zuzuf&uuml;hren. GND wird mit GND in der N&auml;he der +12/-12V Quelle
verbunden.
<br>
<br>Versorgung nur mit +12V
<br>Der TL497 mit Umgebung mu&szlig; best&uuml;ckt sein. Die +12V
werden am +12V-L&ouml;tauge angeschlossen, GND wird mit GND in der
N&auml;he der +12V-Quelle verbunden. Bei den Computern mit interner
Floppy und Originalnetzteil hat dieses &uuml;blicherweise eine 6polige
Buchse die auf einem <a href="0f0b.htm" target="UDOcon">Stecker</a> der Computerplatine steckt. In der
N&auml;he sollte man einen GND-Punkt und einen +12V-Punkt ausfindig
machen und den Pegelwandler anschlie&szlig;en. Meist hat das <a href="10.htm" target="UDOcon">Netzteil</a>
2 rote Kabel f&uuml;r +5V, drei schwarze Kabel f&uuml;r GND und ein
blaues Kabel f&uuml;r +12V. ACHTUNG! Dies gilt nur f&uuml;r dieses
Atari-<a href="10.htm" target="UDOcon">Netzteil</a>, bei PC-Netzteilen und den MegaSTE/TT-Netzteilen ist
_meist_ rot=+5V, schwarz=GND, gelb=+12V, blau=-12V.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Funktionstest </b>
<br>
</p>
<p>Schaltet man den Computer nun ein, so sollte er immer noch wie
gewohnt funktionieren. Seltsame Effekte, besonders Brummen, lautes
Fiepen, Rauchen und Stinken, deuten auf Fehler in der Stromversorgung
hin, dann sofort ausschalten und Fehler suchen. Der TL497 darf etwas
piepen, aber nur ganz leise.
<br>
</p>
<p>Jetzt wird das Flachbandkabel von ST_ESCC in die
Pegelwandlerplatine gesteckt. Dann k&ouml;nnen die
softwarem&auml;&szlig;igen Tests erfolgen, ***** aber momentan gibt es
das Programm noch nicht *****
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Aufbau </b>
<br>
</p>
<p>St&uuml;ckliste ESCC-Platine
<br>
<br>1* Platine ST_ESCC, zweiseitig-durchkontaktiert
<br>1* Z85230-16PSC, Zilog ESCC, 16MHz, DIL-Geh&auml;use
<br>1* GAL20v8-15, programmiert f&uuml;r ST_ESCC
<br>1* Quarzoszi 14.7456MHz, SMD Bauform SG636
<br>1* 74LS164 SMD
<br>3* Kondensator 100nF (SMD, Bauform 1206)
<br>viele Steckerstifte
<br>1* 48polige Fassung (gedrehte Kontakte) zum Aufl&ouml;ten auf MFP
<br>Flachbandkabel AWG28 1.27mm Raster, 22polig, L&auml;nge nach
Bedarf
<br>1* Schneidklemmbuchse 26polig
<br>
</p>
<p>
<br>
<br>St&uuml;ckliste RS232-Pegelwandlerplatine
<br>
<br>Die mit &quot;(&quot; gekennzeichneten Positionen entfallen, wenn
dem Pegelwandler neben +5V und +12V auch -12V von au&szlig;en
geliefert werden.
<br>1* RS232 Pegelwandlerplatine, zweiseitig durchkontaktiert
<br>3* MC1489 oder 75189
<br>2* MC1488 oder 75188
<br>(1* TL497
<br>(2* Diode LL4148 SMD
<br>(2* Elko 100uF/16V stehend
<br>(1* Spule 330uH
<br>(1* 1Ohm, SMD 1206
<br>(1* 1kOhm, SMD 1206
<br>3* 10kOhm, SMD 1206
<br>(2* 18kOhm, SMD 1206
<br>(1* 100pF, SMD 1206 oder 0805
<br>5* 100nF, SMD 1206
<br>1* 26polige Steckerwanne
<br>2* SUB-D-<a href="0f0b.htm" target="UDOcon">Stecker</a>, 90Grad Print
<br>
</p>
<p>
<br>Da der Platz um den MFP (MC68901) recht eng ist, wurde die Platine
klein gestaltet. Sie mi&szlig;t nur 36mm*60mm und ist
zweiseitig-durchkontaktiert. Die MFP-Platine enth&auml;lt keine
Pegelwandler, sondern liefert TTL-Pegel. Die Pegelwandlerplatine auf
RS232 wird &uuml;ber ein Flachbandkabel angeschlossen.
<br>
</p>
<p>Zuerst sollten die SMD-Bauelemente best&uuml;ckt werden. F&uuml;r
das GAL sollte eine Fassung verwendet werden, falls es die
Einbauh&ouml;he zul&auml;&szlig;t. Der 42-polige <a href="0f0b.htm" target="UDOcon">Stecker</a> (dem aber
noch einige Pins fehlen) zum MFP wird auf der Unterseite der Platine
best&uuml;ckt. Der MFP-Pin48 (/CS) mu&szlig; so aufgetrennt werden,
da&szlig; die ST_ESCC-Platine mit ihrem MFP-Adapter-Pin48 Kontakt zum
MFP-Pin hat. Anschlu&szlig; OCSL ist mit einem kurzen Draht an den
MFP-Pin48-Rest (oder L&ouml;tauge) auf der Computerplatine zu
l&ouml;ten. Auf den MFP sollte, wenn es der Platz zul&auml;&szlig;t,
eine Fassung aufgel&ouml;tet werden. In diese wird die ST_ESCC-Platine
gesteckt. Andernfalls mu&szlig; die Platine direkt aufgel&ouml;tet
werden. Die mit &quot;Shot&quot; bezeichnete Diode mu&szlig; eine
Shottky-Diode sein, z.B. BAT43.
<br>
</p>
<p>Es handelt sich wirklich um einen 42poligen <a href="0f0b.htm" target="UDOcon">Stecker</a> zum MFP. Er
sitzt auf Pin1 und Pin48 des MFP, so da&szlig; Pin22 bis Pin27 des MFP
frei bleiben. Diesem <a href="0f0b.htm" target="UDOcon">Stecker</a> fehlen auf der Reihe Pin1-Pin22 etliche
Pins.
<br>
</p>
<p>Das Flachbandkabel zum RS232-Pegelwandler wird direkt auf der
Unterseite der Platine angel&ouml;tet. F&uuml;r den Pegelwandler gibt
es verschiedene Aufbaum&ouml;glichkeiten. Man schlie&szlig;t ihn
sinnvollerweise steckbar an, um auch mal einen f&uuml;r RS422 (?)
o.&auml;. benutzen zu k&ouml;nnen.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Spannungswandler TL497 </b>
<br>
</p>
<p>Der TL497 erzeugt aus +12V die -12V. Der 1Ohm-Widerstand dient der
Strombegrenzung auf 120mA am Ausgang. Mehr kann der TL497 in dieser
Inverteranwendung auch nicht liefern. Der Spannungsteiler mu&szlig;
genau aus 1kOhm/9kOhm bestehen, da er die -12V festlegt (9kOhm =
18kOhm||18kOhm). Eine Alternative sind 470Ohm unten und
4.3kOhm||100kOhm oben.
<br>
</p>
<p>Wenn man im Rechner auch eine belastbare -12V-Quelle hat, kann der
TL497 mit den daran h&auml;ngenden Bauelementen entfallen. Dann werden
die +12V und -12V vom Rechnernetzteil an die entsprechenden Punkte
angeschlossen.
<br>
</p>
<p>Wird die RS232-Pegelwandlerplatine nur mit +12V versorgt, so ist
der TL497 mit Umgebung zu best&uuml;cken und es sind +12V und GND
anzuschlie&szlig;en.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Versionen </b>
<br>
</p>
<p>Neue Versionen werden zuerst in der Maus Berlin liegen, tel:
+49-30-6246510. Gastdownload: 10.00-18.59 und 23.00-03.59. Man sollte
nach dem File STESCC*.* suchen, wobei anstelle des ersten * eine
fortlaufende zweistellige Ver&ouml;ffentlichungsnummer tritt.
<br>
</p>
<p>04.11.1993 &quot;Rohversion&quot;, erste Ver&ouml;ffentlichung
<br>06.01.1994 300uH statt 100uH, Layoutfehler auf Pegelwandler
korrigiert
<br>(bei DTR von MODEM2)
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0305.htm" target="UDOcon"><img src="udo_lf.gif" alt="Second serial port" border=0 width="24" height="24"></a>
<a href="0f0307.htm" target="UDOcon"><img src="udo_rg.gif" alt="RSFI" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
