<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: 38400bps
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0302.htm" target="UDOcon"><img src="udo_lf.gif" alt="RSVE" border=0 width="24" height="24"></a>
<a href="0f0304.htm" target="UDOcon"><img src="udo_rg.gif" alt="MFP-2" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="UDO_38400bps">15.3.3 38400bps</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> 38400 bps f&uuml;r jeden ST/STE </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>
<br>(c) 06.04.1991 by J&uuml;rgen Meyer
<br>
</p>
<p>J&uuml;rgen Meyer
<br>Karolinenstra&szlig;e 15
<br>DW-2000 Hamburg 36
<br>
</p>
<p>MausNetz: Juergen Meyer@HH2
<br>E-Mail : Juergen Meyer@hh2.maus.de
<br>
</p>
<p>Diese Schaltung ist Freeware. Die private Nutzung ist gestattet.
Die Verbreitung &uuml;ber jegliche elektronische Medien ist gestattet.
Die kommerzielle Nutzung, sei es durch Abdruck in einer Publikation
oder durch Einbau gegen Entgelt seitens eines H&auml;ndlers oder einer
Werkstatt ist verboten.
<br>
</p>
<p>Obwohl diese Mini-Schaltung bei mir seit &uuml;ber einem Jahr in
drei ver- schiedenen Rechnern problemlos arbeitet, sind Fehler nie
auszuschlie&szlig;en. Ich &uuml;bernehme daher keinerlei Haftung
f&uuml;r Sch&auml;den, die durch den Einbau oder die Verwendung dieser
Schaltung entstehen. Jeglicher Einbau geschieht hiermit auf eigene
Verantwortung.
<br>
</p>
<p>Bitte beachten Sie evtl. existierende Garantie- bzw.
Gew&auml;hrleistungs- Bestimmungen, bevor Sie Ihren Rechner mit dieser
Schaltung ausr&uuml;sten. Durch diesen Eingriff werden
Ver&auml;nderungen vorgenommen, die jederzeit von einer
bef&auml;higten Person erkannt werden k&ouml;nnen. Im Zweifelsfalle
h&auml;tte dies den Verlust Ihrer Garantie- oder
Gew&auml;hrleistungs-Anspr&uuml;che gegen&uuml;ber der Ihnen
verbindlichen Person oder Firma zur Folge.
<br>
<br>
</p>
<p>Die Mini-Schaltung besteht im Wesentlichen aus einem TTL-Chip, den
74 LS 74, welcher 2 RS-Flip-Flops enth&auml;lt.
<br>
</p>
<p>Jeder normale ST oder STE kann leider nur bis zu 19200 bps auf der
seriellen Schnittstelle 'fahren'. Diese Einschr&auml;nkung kommt durch
die Taktrate der Timer im MFP (2,4576 MHz) zustande. Die bps-Raten-
Einstellung erfolgt beim ST/STE mittels Timer D des MFP-Bausteines,
der mit dieser Frequenz (2,4576 MHz) gespeist wird. Es gab mal einige
Programme, die den Vorteiler f&uuml;r RC/TC abgeschaltet haben (wird
unten erkl&auml;rt), um auch 38400 und h&ouml;here bps-Raten zu
erm&ouml;glichen.
<br>
</p>
<p>Das Problem dabei ist nur, da&szlig; ohne diesen MFP-internen
Vorteiler die Sychronisation nicht mehr erfolgt, so da&szlig; bei
normalen, asynchronen Verbindungen alle 16, 32 oder 64 Bytes ein
St&ouml;rzeichen auftritt. Daher ist das L&ouml;schen des Vorteilers
nicht sinnvoll.
<br>
</p>
<p>Der Timer D wiederum wird vom TOS aus normaler Z&auml;hler
programmiert. Je nachdem, welche bps-Rate man haben m&ouml;chte, wird
der Timer D mit entsprechenden Z&auml;hlwerten programmiert und einer
der m&ouml;glichen Vor- teiler gesetzt. Der Timer-Ausgang, der so
programmiert wird, da&szlig; er bei Erreichen des Z&auml;hlers auf 0
einen Impuls abgibt, wird fest mit den RC/TC Eing&auml;ngen des MFP
verdrahtet, an denen die Takt- Geschwindigkeit f&uuml;r die Serielle
Schnittstelle des MFP anliegen mu&szlig;. RC (Receive Clock) und TC
(Transmit Clock) werden zusammen verdrahtet. Leider hat es Atari hier
vers&auml;umt, diese getrennt an- zusteuern, so w&auml;ren dann
unterschiedliche Empfangs- und Sende- bps-Raten m&ouml;glich. Nur, wer
braucht das heute noch ...
<br>
</p>
<p>Der an RC/TC angelegte Takt wird dann immer nochmal durch 16
geteilt. Man k&ouml;nnte den Vorteiler abschalten und die Timer-D
Register mit entsprechend h&ouml;heren Z&auml;hlwerten laden, aber
da&szlig; f&uuml;hrt zu Fehlzeichen bei der &Uuml;bertragung.
<br>
</p>
<p>Warum nicht einfach den Timer D mit Werten laden, die 38400 bps
dann bewirken?
<br>
</p>
<p>W&auml;re m&ouml;glich, wenn der Systemtakt h&ouml;her w&auml;re.
Der Timer D besitzt ein Daten- und ein Vorteiler-Register. Der
Vorteiler ist hierbei der Knackpunkt: Die kleinste Stufe ist 1:4,
diesen zweiten, Timer- spezifischen Vorteiler kann man leider nicht
auf 1:1 programmieren. Somit ergibt sich folgendes, maximale Bild:
<br>
<br>Systemtakt = 2,4576 MHz
<br>
<br>Halt - Warum nicht statt des 2,4576 MHz-Taktes das doppelte an-
schlie&szlig;en?!
<br>
</p>
<p>W&auml;re m&ouml;glich, wenn da nicht noch andere Timer
w&auml;ren, die auf diesen Takt fest angewiesen sind, z.B. der
wichtiger Timer C, welcher f&uuml;r den 200 Hz-Timer des Atari genutzt
wird. Wer m&ouml;chte, kann ja mal einen 4,9152 MHz Quarz einsetzen,
das System meldet sich dann auch, nur klingen alle
Tastatur-Dr&uuml;cke etwas merkw&uuml;rdig, und jedes Programm,
da&szlig; sich auf die Genauigkeit des 200 Hz-Timer verl&auml;sst,
macht, kurz gesagt, Mist ...
<br>
</p>
<p>Weil sich der Vorteiler nur auf min. 1:4 einstellen
l&auml;&szlig;t, w&uuml;rde selbst dann, wenn das Data-Register von
Timer-D mit &quot;1&quot; geladen wird (also Z&auml;hler auf kleinsten
Z&auml;hlwert einstellen, damit er bei jedem Taktimpuls einen
Z&auml;hlimpuls erzeugt), w&uuml;rde die resultierende Frequenz 2,4576
KHz : 4 = 614,4 KHz betragen.
<br>
</p>
<p>Aber Moment, 614,4 KHz durch 1:16 (Vorteiler f&uuml;r RC und TC),
das sind 38,4 KHz = 38400 Hz, das ist doch genau das, was ich f&uuml;r
38400 bps brauche ?!?
<br>
</p>
<p>Tja, da kommt wieder eine technische Einschr&auml;nkung des MFP
ins Spiel. Der Timer-D Ausgangsimpuls erzeugt bei jedem Erreichen des
Z&auml;hlers auf 0 nur eine Flanke, aber keine komplette Schwingung,
wie auch. An RC/TC m&uuml;ssen aber, um 38400 bps zu erm&ouml;glichen,
auch 38400*16 = 614,4 KHz anliegen. Und 1 Hz ist ja bekanntlich eine
volle Schwingung.
<br>
</p>
<p>Der Timer-D Ausgang erzeugt also nur mit jedem zweiten
Z&auml;hler- Ausgangs-Impuls 1 Hz, so da&szlig; sich die oben
erw&auml;hnten 614400 Z&auml;hl- Impulse noch einmal halbieren.
Bleiben also maximal 307200 Z&auml;hlimpulse, und daher kann der
ST/STE normal auch nur maximal 19200 bps, weil 307200 durch 16 =
19200.
<br>
<br>
</p>
<p><b>Was tut nun diese Schaltung? </b>
<br>
<br>Da wir mittels der Timer keine 38400 bps hinbekommen, mu&szlig;
man sich einen anderen Weg suchen. Einfach an RC/TC einen 614,4 KHz
Takt einzuspeisen, geht leider auch nicht so einfach, da dieser Takt
synchron zum MFP-internen Takt laufen mu&szlig;. Also mu&szlig; man
sich die 614,4 KHz irgendwie 'beschaffen'.
<br>
</p>
<p>Diese Mini-Schaltung macht nun folgendes: Man greift sich den
Haupttakt der Timer, also 2,4576 MHz, und teilt diesen solange, bis
man auf 614,4 KHz runterkommt. Und dies l&auml;&szlig;t sich sogar
sehr einfach bewerkstelligen, indem man ein RS-Flip-Flop als Teiler
1:2 mi&szlig;braucht.
<br>
</p>
<p>Der hier verwendete 74 LS 74 besitzt 2 x RS-Flip-Flops, die auch
beide ben&ouml;tigt werden. Der erste Flip-Flop teilt den 2,4576 MHz
Takt nach 1,2288 MHz runter. Der zweite Flip-Flop dann die 1,2288 MHz
nach 614,4 KHz.
<br>
</p>
<p>Und somit haben wir die gew&uuml;nschten 614,4 KHz. Diese an RC/TC
angeschlossen, ergibt durch den letzen, internen 1:16 Vorteiler exakt
38400 Hz, und somit 38400 bps auf der seriellen Schnittstelle.
<br>
<br>
</p>
<p><b> Einbau </b>
<br>
<br>
</p>
<p>Den 74 LS 74 gem&auml;&szlig; des beigelegten Bildes
pr&auml;perieren. In den meisten Rechnern kann man den Chip
'huckepack' auf einen in der N&auml;he befindlichen 14 poligen
TTL-Chip setzen, somit spart man sich das Legen der Leitungen f&uuml;r
+5 Volt und Masse.
<br>
</p>
<p>Der mit &quot;XTAL in&quot; bezeichnete Anschlu&szlig; wird mit
Pin 18 des MFP verbunden. Am MFP mu&szlig; nun Pin 16 (&quot;TDO&quot;
= Ausgangs-Impuls des Timer D) von der Platine getrennt werden.
Entweder den gesamten MFP sockeln und Pin 16 hochbiegen oder Pin 16
'in der Mitte' durchkneifen und vorsichtig hochbiegen.
<br>
</p>
<p>Der mit &quot;XTAL out&quot; bezeichnete Anschlu&szlig; wird nun
an Pin 7 oder 10 des MFP (egal, da beide auf der Platine miteinander
verbunden sind) angel&ouml;tet. Das war's auch schon.
<br>
</p>
<p>Ein 'Manko' dieser Billig-L&ouml;sung ist, da&szlig; die Serielle
Schnittstelle nun, unabh&auml;ngig von der Einstellung des TOS,
Terminalprogrammes etc. fest mit 38400 bps l&auml;uft. Ben&ouml;tigt
man auch mal kleinere bps-Raten, empfielt es sich, einen 1x
UM-Schalter irgendwie im Geh&auml;use einzu- bauen. Am mittleren
Anschlu&szlig; des 1x UM-Schalters kommt die Leitung nach Pin 7 oder
10 des MFP. An der einen Schaltseite der durch den 74 LS 74 erzeugten
614,4 KHz Takt, an der anderen Schaltseite wird Pin 16 des MFP,
welcher nun hochgebogen ist, angeschlossen. So kann mit der einen
Schalterstellung auf 38400 bps fix geschaltet werden, mit der anderen
Stellung auf Normalbetrieb, also Festlegung der bps-Rate durch das TOS
(maximal 19200 bps).
<br>
</p>
<p>Sollte die L&auml;nge der einzelnen Kabel mehr als 5 cm lang sein,
sollte man abgeschirmte Kabel verwenden.
<br>
</p>
<p>Eines sollte nicht verschwiegen werden: Dieser Umbau ist ja haupt-
s&auml;chlich f&uuml;r Leute mit einem Highspeed-Modem (14400 bps oder
h&ouml;her) gedacht. Der Umbau zeigt sich aber nur dann wirklich
effektiv, wenn man zudem auch einen Speeder wie HyperCache oder
&auml;hnlich besitzt. Ohne Speeder sind bei Nullmodem-Verbindungen so
maximal 2500-2800 cps drin (Gegenseite: schneller AT), mit Speeder
deutlich mehr, bis zu 3500 cps (je nach Art des Speeders).
Au&szlig;erdem sollte man dringend einen der erh&auml;ltlichen
RS232-Fixes installieren.
<br>
<br>
</p>
<p><b> Erg&auml;nzung vom 19.07.1992 </b>
<br>
<br>Wer ein Highspeed-Modem mit Telefax-Option besitzt, MUSS obigen
Umbau unbedingt umschaltbar einbauen. Denn die meisten Modems, die
&uuml;ber Telefax-Empfang und Versand verf&uuml;gen, programmieren das
Modem auf 2400 bps, bevor die Programme auf 9600 oder 19200 bps
hochschalten. Dies ist auch aufgrund der Chips&auml;tze einiger Modems
so vorgeschrieben. Bei fix 38400 bps gibt es dann nur Fehler. Also
sollte man, m&ouml;chte man ein Fax empfangen oder senden, auf
&quot;Normalbetrieb&quot; umschalten, im normalen DF&Uuml;-Betrieb auf
38400 bps fest.
<br>
<br>
</p>
<p><b> F&uuml;r Mega STE Besitzer </b>
<br>
<br>
</p>
<p>Beim Mega STE sind die MFP's in der quadratischen PLCC-Form
vorhanden. Hier m&uuml;ssen folgende Pins beachtet werden:
<br>
<br>Die Leitung, die oben beschrieben ist und an Pin 7 oder 10 soll,
mu&szlig; beim PLCC-MFP an Pin 8 oder 11. Der Abgriff des 2,4576
MHz-Signales mu&szlig; beim PLCC-MFP an Pin 20, und nicht an Pin 18
(wie beim normalem MFP, siehe oben im Text) Statt Pin 16 (TDO)
hochzubiegen (normaler MFP), mu&szlig; Pin 18 beim PLCC-MFP vom Sockel
getrennt werden.
<br>
<br>
</p>
<p>MfG. J&uuml;rgen Meyer
<br>
<br>
</p>
<p align=center><img src="image/38400bps.gif" border=0 width="640" height="300"></p><br>
<div align=center><tt> Abbildung 2 - Die 38400bps Schaltung </tt>
</div>
<p>
<br>
<br>
</p>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
<br><b> 38400 bps for any ST/STE </b>
<br>
</p>
<p>This circuit is freeware. Private usage is allowed. Distribution
via any electronic media is allowed. Any commercial usage is _not_
allowed.
<br>
<br>Altough this circuit is working properly in three different
machines, you can never exclude faults. Because of that i can not be
responsible for any damages caused by the usage of this circuit.
<br>
</p>
<p>This circuit consits of a TTL-chip, the 74LS74 (and a switch to
choose the high baudrate).
<br>
</p>
<p>Every ST or STE can only use 19200 bps at the serial interface.
This limitation is caused by the clock-frequency of 2.4576 MHz wich is
used for the MFP-timers. The baudrate is set by the timer D of the
MFP. There where programs wich switched off the &quot;divider&quot;
(sorry, i do not know the correct word for german
&quot;Vorteiler&quot;) for the RC/TC-input of the MFP.
<br>
</p>
<p>The problem of this modification is, that the syncronization does
not work any more - so that there will by errors after every 16th,
32th or 64th byte. Because of that is not recommended to switch of the
&quot;divider&quot;.
<br>
</p>
<p>The circuit does the following: It gets the main-clock of 2.4576
MHz and divides it to produce 614.4 KHz. This may be done very simple,
by using a RS-flip-flop to divide the clock by 1:4.
<br>
</p>
<p>The 74LS74 consists of two RS-flip-flops. The first one is used to
get 1.2288 MHz. The second one gets the 1.2288 and produces 614.4KHz,
wich is needed for the RC/TC-input to use 38400 bps for the serial
interface.
<br>
<br>
</p>
<p><b> Build in </b>
<br>
<br>- Prepare the 74LS74 as shown in the images. [...]
<br>
</p>
<p>- Carefully disconnect pin 16 of the MFP 68901 from the
motherboard.
<br>
</p>
<p>- Connect &quot;XTAL in&quot; to pin 18 of the MFP 68901.
<br>
</p>
<p>- Connect &quot;XTAL out&quot; to pin 7 or pin 10 of the MFP.
[...]
<br>
</p>
<p>If you still want to use lower baudrates, you have also to build
in a switch. Normaly pin 7 and 10 are connected to pin 16 of the MFP
for &quot;normal&quot; baudrates. I hope this helps you.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0302.htm" target="UDOcon"><img src="udo_lf.gif" alt="RSVE" border=0 width="24" height="24"></a>
<a href="0f0304.htm" target="UDOcon"><img src="udo_rg.gif" alt="MFP-2" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
