<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: RSFI
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0306.htm" target="UDOcon"><img src="udo_lf.gif" alt="ESCC" border=0 width="24" height="24"></a>
<a href="0f04.htm" target="UDOcon"><img src="udo_rg.gif" alt="Midi-Schnittstelle" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="RSFI">15.3.7 RSFI</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> RSFI</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
<br><b> Informationen fuer Treiberprogrammierung </b>
<br>
</p>
<p>Um RSFI zu aktivieren, muss der MFP-Timer D eingestellt werden wie
fuer normale Operation mit 50, 75, 110, 134, 150, 200 bps. Den RSFI
interessiert nur, was bei TDO hinten fuer eine Frequenz rauskommt
(genau wie bei normaler Operation das MFP-UART-Teil nur an dieser
Frequenz interessiert ist). Diese Raten entsprechen 76800, 153600,
38400, 57600, 115200, 230400 bps. Zusaetzlich ist im MFP-UART
(Register UCR, bei $FFFFFA29, Bit7 auf 0 setzen) das /16-Bit zu
loeschen, also der /1-Modus zu aktivieren. Der EmpfangsFIFO wird bei
diesen hohen Raten automatisch aktiv.
<br>
</p>
<p>Befinden sich Zeichen im EmpfangsFIFO, so stehen diese maximal mit
einer Frequenz von:
<br>
<br>f = 921600 Hz / komplette_Zeichenlaenge_in_Bit
<br>
<br>im UART zur Abholung bereit. Das ergibt also bei 8n1 (=10
Bit/Zeichen) etwa alle 10 Mikrosekunden ein Zeichen, solange der FIFO
nicht geleert ist. Die <a href="080108.htm" target="UDOcon">CPU</a> darf natuerlich langsamer lesen (dafuer ist
der FIFO ja da).
<br>
</p>
<p>Man muss sich nicht auf Empfangsinterrupts verlassen, sondern kann
auch z.B. alle 5 Millisekunden (1/(200 Hz)) timergesteuert den
EmpfangsFIFO durch eine Routine leeren lassen, die nicht auf
Interruptlevel laeuft, also selbst wieder unterbrochen werden kann.
Bei 230400 bps haetten sich so etwa 115 Zeichen angesammelt, die in
etwa 1 Millisekunde ausgeraeumt werden koennten. D.h. 25% <a href="080108.htm" target="UDOcon">CPU</a>-Zeit
fuer diese Polling-Routine, innerhalb derer man auch noch senden
koennte per Polling. Falls die <a href="080108.htm" target="UDOcon">CPU</a> schnell genug ist, dann ist der
Interrupt-Overhead geringer als der Polling-Zeitbedarf und man wird
sich wohl fuer Empfangsinterrupts entscheiden.
<br>
</p>
<p>(C) Harun Scheutzow 1997-11-06
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/rsfi.gif" border=0 width="389" height="441"></p><br>
<div align=center><tt> Abbildung 1 - RSFI Hardware </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br><b> Was ist RSFI? </b>
<br>
</p>
<p>RSFI ist eine kleine Hardware f&uuml;r die MODEM1-Schnittstelle
der Ataris, die bestimmte niedrige Bitraten in h&ouml;here umwandelt
und einen EmpfangsFIFO beinhaltet. Zur Nutzung der neuen Bitraten ist
eine Treibersoftware erforderlich.
<br>
</p>
<pre>neu (bps):   38400   57600   76800   115200   153600   230400
alt (bps):     110     134      50      150       75      200
</pre>
<p>
<br>Der Bereich von 300 bis 19200 bps (Bit pro Sekunde) bleibt
unver&auml;ndert und funktioniert auch ohne Treiber wie &uuml;blich.
Der rund 200 Zeichen fassende EmpfangsFIFO ist nur im Bereich 38400
bis 230400 bps aktiv.
<br>
</p>
<p>
<br><b> Treibersoftware </b>
<br>
</p>
<p>F&uuml;r TOS und MagiC dient das MFP.PRG mit einem Datum ab
1997-09-20 als Treiber. Zum Funktionieren ben&ouml;tigt es
zus&auml;tzlich das DRVIN.PRG. Diese Programme befinden sich im
HSM_BETA-Ordner auf der Disk oder in entsprechender Version auch im
HSMODA-Paket ab HSMODA08, wenn es ver&ouml;ffentlicht wird. Das
MFP.PRG aus dem HSMODA07-Paket funktioniert auch schon, meint aber
einen RSVEChip gefunden zu haben und erlaubt keine 230400 bps.
<br>
</p>
<p>
<br><b> Der EmpfangsFIFO </b>
<br>
</p>
<p>Es handelt sich um einen seriellen FIFO, der 2048 Bit
zwischenspeichern kann. Im Normalfall kommen brutto 10 Bit lange
Zeichen (z.B. Format 8n1) in dichter Folge, so da&szlig; der FIFO
f&uuml;r 204 Zeichen reicht. Im ung&uuml;nstigsten Fall sind es
11-Bit-Zeichen mit Abstand und der FIFO speichert maximal 146 Zeichen.
<br>
</p>
<p>Die 204 Zeichen entsprechen bei der h&ouml;chsten Bitrate von
230400 bps einer Zeitspanne von 8,8 Millisekunden, die der FIFO bei
Nicht-Antwort der <a href="080108.htm" target="UDOcon">CPU</a> ausgleichen kann, ohne da&szlig; Empfangsdaten
verloren gehen. Dies ist mehr als das Zehnfache der &uuml;blichen
l&auml;ngsten Interruptantwortzeiten unter TOS und MagiC.
<br>
</p>
<p>
<br>
<br><b> Einbau der Hardware </b>
<br>
</p>
<p>Vorwort
<br>
</p>
<p>Es m&uuml;ssen acht Kabel im Computer angel&ouml;tet und drei
Verbindungen aufgetrennt werden. Diese Arbeiten sollten von einer
Person mit Fachkenntnissen auf diesem Gebiet und dem entsprechenden
Werkzeug durchgef&uuml;hrt werden. Andernfalls besteht eine erhebliche
Gefahr nicht nur f&uuml;r den Computer, sondern auch f&uuml;r die
Umgebung und den Benutzer. Der <a href="0201.htm" target="UDOcon">Autor</a> lehnt jede Verantwortung bei
nicht fachgerechtem Einbau ab. Zum Sammeln von
Elektronik-L&ouml;terfahrungen empfiehlt der <a href="0201.htm" target="UDOcon">Autor</a> kleine
Baus&auml;tze oder Elektronikschrott.
<br>
<br>In Kurzform die Grundregeln:
<br>- Nur im ausgeschalteten und vom Netz getrennten Computer
arbeiten. Je nach Computermodell k&ouml;nnen
netzspannungsf&uuml;hrende Teile nach Entfernung des Geh&auml;uses
oder der Abschirmung offenliegen.
<br>
<br>- Einen netzgetrennten L&ouml;tkolben verwenden, entweder eine
L&ouml;tstation oder &uuml;ber ein Trenntrafo. Bei einem einfachen
L&ouml;tkolben, auch temperaturgeregelt, zum L&ouml;ten den
Netzstecker ziehen, f&uuml;r sichere Netztrennung. Auf Schutzkontakten
des Netzes, die bei einfachen L&ouml;tkolben oft mit der
L&ouml;tspitze leitend verbunden sind, k&ouml;nnen f&uuml;r die
Elektronik gef&auml;hrliche Spannungen anliegen.
<br>
<br>- Elektrostatische Aufladungen vermeiden. Vor der Arbeit im
Computer den metallischen Rand (Masse) der Computerplatine mit der
Hand und mit der L&ouml;tkolbenspitze kurz ber&uuml;hren.
<br>
<br>- Art und Weise des Auseinanderbaus erforderlichenfalls notieren.
<a href="0f0b.htm" target="UDOcon">Stecker</a> oder Schaltkreise d&uuml;rfen nicht verdreht oder anderweitig
verkehrt wieder zusammengesetzt werden.
<br>
</p>
<p>
<br><b>Der MFP </b>
<br>
</p>
<p>Der MFP tr&auml;gt normalerweise den Aufdruck MC68901. In den ST-,
MegaST- und STE-Computern befindet sich ein MFP mit 48poligem
DIL-Geh&auml;use. Im MegaSTE ist ein MFP mit 52poligem
Quadpack-Geh&auml;use meist unter der VME-Bus-Abschirmung zu finden.
Im TT sind zwei dieser 52poligen Quadpack-MFPs vorhanden, wobei der
Gesuchte f&uuml;r die serielle Schnittstelle MODEM1 zust&auml;ndig ist
und im Best&uuml;ckungsaufdruck der Computerplatine die Bezeichnung
U303 tr&auml;gt. Sollte kein Best&uuml;ckungsaufdruck vorhanden sein,
so sollte der weiter vom MODEM1-Anschlu&szlig; entfernte MFP der
f&uuml;r MODEM1 zust&auml;ndige sein. Er sitzt zwischen <a href="10.htm" target="UDOcon">Netzteil</a> und
VME-Bus-Blechkasten. Wird der andere MFP gew&auml;hlt, so wird SERIAL1
mit RSFI ausgestattet. Das funktioniert auch.
<br>
</p>
<p>
<br><b>Anschlu&szlig;belegung </b>
<br>
</p>
<p>RSFI hat an seiner linken Kante im oberen Bereich eine 9polige
Stiftleiste. 8 Anschl&uuml;sse werden f&uuml;r den normalen Betrieb im
Computer ben&ouml;tigt. Der Anschlu&szlig; isp ist nur f&uuml;r die
Programmierung vorgesehen und darf nicht beschaltet werden.
<br>
</p>
<pre>           --------------------
TC    ----|                    |
RXDO  ----|                    |
RC    ----|                    |
TDO   ----|                    |
GND   ----|                    |
VCC   ----|                    |
isp   ----|                    |
RRL   ----|                    |
RXDI  ----|                    |
          |                    |
          |                    |
          |                    |
           --------------------
</pre>
<p>
<br><b> Notwendige Trennstellen </b>
<br>
</p>
<p>Im Originalzustand sind die drei Pins TC, RC und TDO des MFP auf
der Computerplatine untereinander verbunden. Diese Verbindungen
m&uuml;ssen aufgetrennt werden, so da&szlig; sp&auml;ter an jeden
dieser drei einzelnen MFP-Pins eine Leitung zum RSFI angeschlossen
werden kann.
<br>
</p>
<p>Der Pin SI des MFP ist im Originalzustand mit einem Ausgang eines
RS232-Empf&auml;ngers verbunden. Die RS232-Empf&auml;nger sind
normalerweise Schaltkreise mit der Typbezeichnung 1489 oder 75189
(z.B. MC1489, SN75189) in 14poligem DIL- oder SO-Geh&auml;use. Ihre
Ausg&auml;nge sind ihre Pins 3, 6, 8 und 11. Die Verbindung zwischen
MFP-SI und RS232-Empf&auml;nger-Ausgang ist so aufzutrennen, da&szlig;
sp&auml;ter an den MFP-SI-Pin und den RS232-Empf&auml;nger-Ausgang je
eine Leitung zum RSFI angeschlossen werden kann.
<br>
</p>
<p>Je nach Gegebenheiten und pers&ouml;nlichen Vorlieben k&ouml;nnen
die Trennungen durch Unterbrechung von Leiterbahnen, Durchtrennen von
Schaltkreispins (bei DIL-Geh&auml;use), Hochbiegen von Pins (bei
DIL-Geh&auml;use in Fassung, den Pin m&ouml;glichst weder direkt am
Geh&auml;use noch am vorhandenen 90-Grad-Knick biegen), Entfernen von
Fassungsfedern (bei PLCC-Fassungen) oder Einstecken d&uuml;nner
Isolierstreifen (bei PLCC-Fassungen) erfolgen.
<br>
</p>
<pre>
Anschlu&szlig; an MFP in 48poligem DIL-Geh&auml;use
----------------------------------------
MFP Pin-Nr.                            RSFI-Pin
TC     7                                TC
SI     9                                RXDO
RC    10                                RC
TDO   16                                TDO
GND   36                                GND
VCC   11                                VCC
nicht anschlie&szlig;en                       isp
/RR   31                                RRL
vom 1489, ehemals Pin9 MFP              RXDI


Anschlu&szlig; an MFP in 52poligem PLCC-Geh&auml;use
-----------------------------------------
MFP Pin-Nr.                            RSFI-Pin
TC     8                                TC
SI    10                                RXDO
RC    11                                RC
TDO   18                                TDO
GND   40                                GND
VCC   12                                VCC
nicht anschlie&szlig;en                       isp
/RR   35                                RRL
vom 1489, ehemals Pin10 MFP             RXDI

</pre>
<p>
<br><b> Buchse </b>
<br>
</p>
<p>Es wird eine 9polige Buchse mit Kabeln mitgeliefert, die f&uuml;r
den Anschlu&szlig; des RSFI benutzt werden sollte. Die Kabel sollten
so kurz wie m&ouml;glich ausgef&uuml;hrt werden.
<br>
</p>
<p>ACHTUNG! Da die <a href="0f0b.htm" target="UDOcon">Stecker</a>-Buchse Kombination keinen Schutz gegen
falsches Zusammenstecken besitzt, auch hier genau wie beim
Anl&ouml;ten der Kabel lieber einmal mehr kontrollieren!
<br>
</p>
<p>
<br><b> Besondere Hardware </b>
<br>
</p>
<p>Einige Hinweise zum Anschlu&szlig; an die Schnittstellenkarte
McSTout finden sich ganz hinten im Text.
<br>
</p>
<p>
<br><b> So werden Pins numeriert </b>
<br>
</p>
<p>Eine beliebte Frage, die nach der Numerierung der Schaltkreispins,
soll hier f&uuml;r DIL/SO-Geh&auml;use und PLCC-Geh&auml;use
exemplarisch anhand kleiner Geh&auml;use beantwortet werden.
Gr&ouml;&szlig;ere werden in der gleichen Richtung gez&auml;hlt. Die
Skizze zeigt die Draufsicht auf das Geh&auml;use.
<br>
</p>
<pre>
DIL/SO                   PLCC
   --___--                 3  2  1  20 19
1-|       |-8              ===============
2-|       |-7             /      *        |
3-|       |-6          4 |                | 18
4-|       |-5          5 |                | 17
   -------             6 |                | 16
                       7 |                | 15
                       8 |                | 14
                         |                |
                          ----------------
                           9  10 11 12 13

</pre>
<p>Charakteristisch ist bei DIL die Aussparung oder Kennzeichung an
der Kante zwischen Pin1 und dem Pin mit der h&ouml;chsten Nummer. Bei
SO-Geh&auml;usen fehlt diese Kennzeichnung oftmals, aber die gesamte
Geh&auml;usekante, an der Pin1 liegt (hier: Pin1 bis Pin4), ist
abgeschr&auml;gt. PLCC-Geh&auml;use weisen eine Kennzeichung in Form
eines Punktes oder einer Delle an Pin1 auf, oft ist die Pin1-Kante
abgeschr&auml;gt, und die Ecke links von Pin1 ist nicht eckig, sondern
45 Grad.
<br>
</p>
<p>
<br>
<br><b> Inbetriebnahme </b>
<br>
</p>
<p><b> Kontrolle </b>
<br>
</p>
<p>Bitte vor dem ersten Einschalten noch einmal &uuml;berpr&uuml;fen,
ob:
<br>- die richtigen Stellen im Computer aufgetrennt wurden,
<br>- die Kabel an den richtigen Punkten angel&ouml;tet wurden,
<br>- der RSFI richtig in der Buchse steckt.
<br>
</p>
<p>
<br><b> Einschalten </b>
<br>
</p>
<p>Der Computer sollte sich wie gewohnt verhalten. Im Bereich 300 bis
19200 bps sollte die MODEM1-Schnittstelle wie gewohnt funktionieren.
Wenn bisher kein DRVIN.PRG und MFP.PRG installiert waren, so kann man
beide Programme nacheinander in dieser Reihenfolge vom <a href="0903.htm" target="UDOcon">Desktop</a>
starten. Das MFP.PRG sollte melden &quot;RSFI found.&quot; Hatte man
schon ein &auml;lteres MFP.PRG im AUTO-Ordner, so sollte es durch die
neue Version ersetzt werden und dann beim Neustart die Meldung
&quot;RSFI found.&quot; ausgeben. &Auml;ltere MFP.PRG melden eventuell
&quot;RSVEChip found.&quot; und funktionieren mit kleinen
Einschr&auml;nkungen ebenfalls.
<br>
</p>
<p>
<br><b> Softwareinstallation </b>
<br>
</p>
<p>Die Treiberinstallation ist in den Dateien des HSMODA-Paketes
beschrieben, deshalb hier nur in K&uuml;rze die einfachste Variante.
Dazu werden das DRVIN.PRG und das MFP.PRG nacheinander in den
AUTO-Ordner des Bootlaufwerkes kopiert, so da&szlig; sie in dieser
Reihenfolge ausgef&uuml;hrt werden.
<br>
</p>
<p>Sollten Unvertr&auml;glichkeiten zwischen den Treibern und
Anwendungsprogrammen auftreten, so besteht immer noch die
M&ouml;glichkeit, die MODEM1-Schnittstelle ohne Treiber bei 300 bis
19200 bps zu benutzen.
<br>
</p>
<p>
<br>
<br><b> Betrieb </b>
<br>
</p>
<p><b> <a href="080108.htm" target="UDOcon">CPU</a>-Auslastung und Interruptpriorit&auml;t </b>
<br>
</p>
<p>Wenn die <a href="080108.htm" target="UDOcon">CPU</a> im Durchschnitt schnell genug ist, dann gibt es keine
Probleme. Der EmpfangsFIFO sorgt daf&uuml;r, da&szlig; auch in den
Momenten, in denen die <a href="080108.htm" target="UDOcon">CPU</a> zu langsam reagiert, keine Zeichen verloren
gehen.
<br>
</p>
<p>Leider ist eine 68000 <a href="080108.htm" target="UDOcon">CPU</a> mit 8 MHz ab 115200 bps aufw&auml;rts
nicht &quot;im Durchschnitt schnell genug&quot; um jedes zu
&uuml;bertragende Zeichen in einem eigenen Interrupt zu bearbeiten und
f&uuml;r den Rest des Systems genug Zeit zu haben. Da die
MODEM1-Interrupts eine h&ouml;here Priorit&auml;t haben als die
Interrupts f&uuml;r IKBD (Tastatur und Maus), MIDI und die GEMDOS-<a href="1413.htm" target="UDOcon">Uhr</a>,
kann es dazu kommen, da&szlig; letztere vernachl&auml;ssigt werden. Im
Ergebnis sind Tastatureingaben und Mausbewegungen nicht mehr
vern&uuml;nftig m&ouml;glich (der Computer schnarrt wie beim
Tasten-Autorepeat vor sich hin) und die Software-Systemuhr geht nach.
<br>
</p>
<p>Diese Probleme sind per Software l&ouml;sbar - durch
&Auml;nderungen im MFP.PRG. Diese &Auml;nderungen werden in Zukunft
erfolgen, in irgendeinem MFP.PRG neuer als 1997-12-06.
<br>
</p>
<p>Ich erwarte beim Empfang mit langsamen CPUs auch noch eine
Leistungssteigerung durch eine Empfangsdatenbearbeitung im
Timer-Interrupt. Dies ist auch &quot;nur&quot; eine &Auml;nderung im
MFP.PRG.
<br>
</p>
<p>
<br>
<br><b> Besondere Hardware </b>
<br>
</p>
<p><b> Einbau im McSTout </b>
<br>
</p>
<p>RSFI bietet sich f&uuml;r die MODEM1-Schnittstelle des McSTout an,
da der gro&szlig;e EmpfangsFIFO die leider beim Mac(OS) &uuml;blichen
langen Interruptantwortzeiten &uuml;berbr&uuml;cken kann.
<br>
</p>
<p>Auf McSTout sitzt ein 52poliger MFP (MC68901). Die voneinander zu
trennenden Pins TC (Pin8) und RC (Pin11) sind durch einen Leiterzug
auf der Platinenoberseite direkt unter dem MFP verbunden. Bitte nicht
blind unter den MFP stochern, weil hinter diesem Leiterzug gleich der
n&auml;chste liegt. Das Auftrennen des Pin8 mit einem feinen Werkzeug,
so da&szlig; am MFP noch gen&uuml;gend Pin zum Anl&ouml;ten des
Drahtes bleibt, d&uuml;rfte die beste L&ouml;sung sein.
<br>
</p>
<p>Der Leiterzug zwischen RC (Pin11) und TDO (Pin18) ist einfach zu
finden, auf der Platinenoberseite direkt am MFP. SI (Pin10) des MFP
ist mit Pin11 des MAX209 auf der Oberseite verbunden. MAX209 Pin11 ist
der RS232-Empf&auml;nger-Ausgang.
<br>
</p>
<p>
<br>
<br><b> Vor&uuml;bergehender Ausbau </b>
<br>
</p>
<p>Wenn man seinen Computer zeitweise ganz ohne RSFI betreiben will,
bietet sich der Aufbau eines Steckers mit drei Drahtbr&uuml;cken an,
der anstelle des RSFI in die Buchse gesteckt wird. Hier die
Verdrahtung, verbal beschrieben auf der rechten Seite.
<br>
</p>
<pre>
TC    ---- nach RC
RXDO  ---- nach RXDI
RC    ---- von TC, nach TDO
TDO   ---- von RC
GND   ---- offen
VCC   ---- offen
isp   ---- offen
RRL   ---- offen
RXDI  ---- von RXDO

</pre>
<p>
<br>
<br><b> Sonstiges </b>
<br>
</p>
<p><a href="0201.htm" target="UDOcon">Autor</a>
<br>
<br>Harun Scheutzow
<br>Auf der Kassebeerenworth 38
<br>31157 Sarstedt
<br>(oder: Dresdener Stra&szlig;e 83, 10179 Berlin)
<br>Email: harun@priv-hs.village.de
<br>letzte &Auml;nderung: 1998-06-22
<br>
<br>
<br>
</p>
<p>Eingesendet von Bernd Maedicke
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f03.htm" target="UDOcon"><img src="udo_up.gif" alt="Atari, Mac und PC seriell" border=0 width="24" height="24"></a>
<a href="0f0306.htm" target="UDOcon"><img src="udo_lf.gif" alt="ESCC" border=0 width="24" height="24"></a>
<a href="0f04.htm" target="UDOcon"><img src="udo_rg.gif" alt="Midi-Schnittstelle" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
