<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Easybank
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f06.htm" target="UDOcon"><img src="udo_up.gif" alt="Der Romport" border=0 width="24" height="24"></a>
<a href="0f0603.htm" target="UDOcon"><img src="udo_lf.gif" alt="Eprombank 128K" border=0 width="24" height="24"></a>
<a href="0f0605.htm" target="UDOcon"><img src="udo_rg.gif" alt="Cardridge Port Interface" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Easybank">15.6.4 Easybank</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Easybank von Maxon </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>576 KByte Easybank eine gebankte EPROM-Karte f&uuml;r alle
ATARI-ST Rechner
<br>
<br>
</p>
<p>Beim damaligen kauf wurde eine 576 KB Easybank, vollst&auml;ndig
best&uuml;ckt, ohne EPROMs, geliefert. Als Software gabe es ein Modul
Entwicklungssystem auf einer 3,5 Zoll Diskette die folgenden Programme
enhielt:
<br>
</p>
<dl>
<dt><b>INSTALL.TOS</b></dt><dd> RAM-Disk; s&auml;mtliche Programme, die auf der Easybank laufen
sollen, m&uuml;ssen auf diese kopiert werden
<br>&nbsp;
<dt><b>SAVE.PRG</b></dt><dd> verwandelt alle Programme in der RAM-Disk in eine f&uuml;r EPROMs
verst&auml;ndliche Form
<br>&nbsp;
<dt><b>SAVE.RSC</b></dt><dd> Das Resourcefile dazu
<br>&nbsp;
<dt><b>ANLEITUN.TXT</b></dt><dd> Anleitung im ASCII-Format
<br>&nbsp;
</dl>
<p>
<br>
</p>
<p>Eine Inbetriebnahme gestaltet sich einfach, vorrausgesetzt,
da&szlig; die Steuer- und Daten-EPROMs richtig erstellt und eingesetzt
wurden. Die drei auf der Platine befindlichen Jumper m&uuml;ssen je
nach Betriebsmodi korrekt gesteckt sein.
<br>
</p>
<p>Die Easybank-Platine wird mit den Bauteilen nach oben zeigend in
den ROM- Port des ATARI ST eingesteckt. Vor dem Einstecken der
Easybank ist der Rechner unbedingt auszuschalten.
<br>
<br>
<br><b> Die Hardware </b>
<br>
</p>
<p>Die Easybank ist eine gebankte EPROM-Karte. Das
&quot;Bank-Switch&quot;-Verfahren erm&ouml;glicht diese hohe
Speicherkapazit&auml;t der Easybank. Die auf der Platine vorhandene
Elektronik sorgt zusammen mit der entsprechenden Software, die in die
beiden Steuer-EPROMs (SE1U und SE1L) mit eingebrannt wird, f&uuml;r
einen problemlosen Betrieb der Easybank, so da&szlig; Sie als Benutzer
vom Bank-Switching eigentlich nichts merken.
<br>
</p>
<p>Die Steuer-EPROMs sind grunds&auml;tzlich vom Typ 27256 bzw.
27C256. Von dieser Kapazit&auml;t werden etwa 9 KByte f&uuml;r
Steueraufgaben verbraucht. 55 KByte der Steuer-EPROMs bleiben f&uuml;r
Daten und/oder Programme.
<br>
</p>
<p>Alle weiteren Sockel dieser Karte werden mit Daten-EPROMs
best&uuml;ckt. Diese EPROMs k&ouml;nnen vom Typ 27256 oder 27512 sein.
Sie sind Bezeichnet mir DE1U bis DE4U f&uuml;r die geraden Adressen
und entsprechend DE1L bis DE4L f&uuml;r die ungeraden Adressen.
<br>
</p>
<p>
<br>
</p>
<pre>
Steuer-EPROMs (SE):     2x27256 ( 64 KB)         2x27256 ( 64 KB)
Daten-EPROMs  (DE):     8x27256 (256 KB)  oder   8x27512 (512 KB)
                        ================         ================
max. Kapazit&auml;t:         320 KByte                576 KByte

</pre>
<p>
<br>
</p>
<p>Die maximale Speicherkapazit&auml;t einer Epromkarte ist ein
theoretischer Wert der sich aus der theoretischen
Speicherkapazit&auml;t aller benutzten Eproms zusammen ergibt. Genauer
sind es 4 mal 128K die per Bankswitching am 128K gro&szlig;en
&quot;Fester&quot; des Atari Romports &quot;vorbei gefahren&quot;
werden. F&uuml;r den Atari sind immer ausschliesslich 128K in einem
Moment sichbar. Sobald eine Adresse in einem anderen Bereich per
Software angesprochen wird, bewegt sich diesen 128K breite Fenster
entsprechend an auf einen anderen 128-Bereich. Eine solche Epromkarte
kann daher noch wesentlich gr&ouml;&szlig;er sein, passt man die
Steuerelektronik entsprechen an.
<br>
</p>
<p>CMOS-EPROMs unterscheiden sich gegen&uuml;ber &quot;normalen&quot;
EPROMs (NMOS) durch ein &quot;C&quot; in der Typenbezeichnung, also
z.B. 27C256 oder 27C512. Au&szlig;erdem betr&auml;gt die
Programmierspannung bei den CMOS-Typen meist 12,5 Volt. Verwenden sie
&quot;CMos&quot;-Typen um ihr Rechnernetzteil zu schonen.
<br>
</p>
<p>Die Zugriffszeit der verwendeten EPROM-Typen wird durch eine Zahl
hinter der Typenbezeichnung gekennzeichnet, so ist z.B. 27C512-20 ein
64 KByte CMOS-EPROM mit 200 ns Zugriffszeit. Verwenden sie nur Eproms
bis 200nS Zugriffszeit, eher schnellere, niemals aber noch langsamere.
<br>
</p>
<p>Am linken Rand der Karte befinden sich drei Jumper mit der
Bezeichnung J1, J2 und J3. Den EPROM-Typ, den Sie als Daten-EPROMs
verwenden, m&uuml;ssen Sie durch richtiges Setzen des Jumpers J3
einmal einstellen. Sind die unteren zwei Stifte durch den Jumper
verbunden, so m&uuml;ssen Sie als Daten-EPROM den Typ 27512 bzw.
27C512 verwenden. Bleibt bei diesem Jumper der untere Stift frei, so
ist die Easybank auf den Typ 27256 bzw. 27C256 eingestellt.
<br>
</p>
<p>Mit den beiden Jumpern J1 und J2 k&ouml;nnen Sie die Easybank
abschalten, ohne das diese aus dem ROM-Port entfernt werden mu&szlig;
(Disable-Funktion). Wollen Sie zum Beispiel einmal von Diskette
booten, obwohl eine bootf&auml;hige Easybank eingesteckt ist, so
k&ouml;nnen Sie die beiden genannten Jumper abziehen, allerdings kann
die Easybank dann nicht mehr hinzugeschaltet werden, d.h. das
Ein-/Ausschalten der Easybank sollte immer im ausgeschalteten Zustand
erfolgen.
<br>
</p>
<p>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="0f06.htm" target="UDOcon"><img src="udo_up.gif" alt="Der Romport" border=0 width="24" height="24"></a>
<a href="0f0603.htm" target="UDOcon"><img src="udo_lf.gif" alt="Eprombank 128K" border=0 width="24" height="24"></a>
<a href="0f0605.htm" target="UDOcon"><img src="udo_rg.gif" alt="Cardridge Port Interface" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
