<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: ST Stereo
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="13.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="1302.htm" target="UDOcon"><img src="udo_lf.gif" alt="Tweety Board" border=0 width="24" height="24"></a>
<a href="1304.htm" target="UDOcon"><img src="udo_rg.gif" alt="Startrak" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="ST_20Stereo">19.3 ST Stereo</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Pseudostereo am <a href="0305.htm" target="UDOcon">Atari ST</a> </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Eine Stereo Tonausgabe f&uuml;r alle <a href="0305.htm" target="UDOcon">Atari ST</a>, 1040, Mega.
<br>
</p>
<p>
<br>
</p>
<p>Da unser Atari Computer, insbesondere die &auml;ltere Generation,
wie z.B 520 ST, 1040ST normalerweise nicht f&uuml;r eine
Stereoton-Wiedergabe ausgelegt ist werden wir dem mit einer kleinen
Bastelei auf die Spr&uuml;nge helfen
<br>
</p>
<p>Der Yamaha <a href="080109.htm" target="UDOcon">Soundchip</a> in einem ST besitzt 3 einzeln steuerbare
Tongeneratoren die aber leider alle zusammen auf einen einzigen
Tonausgang zusammen gef&uuml;hrt sind. Mit einer kleinen Schaltung ist
man aber in der Lage die Signale wieder zu trennen um das Ergebniss
einer normalen Stereoanlage zuf&uuml;hren zu k&ouml;nnen.
<br>
</p>
<p>Beachten Sie bitte das dies nicht Funktioniert wenn Sie ihren ST
ausschliesslich und ohne zus&auml;tzlichen Verst&auml;rker &uuml;ber
einen <a href="120b.htm" target="UDOcon">TV-Modulator</a> an einem TV-Ger&auml;t betreiben!
<br>
<br>
</p>
<p>Das Signal der Tongeneratoren wird wie folgt aufgetrennt:
<br>
<br>
</p>
<p>Tongenerator A steuert den rechten Kanal
<br>Tongenerator C steuert &quot; linken &quot;
<br>
<br>Tongenerator B wird auf beide Kan&auml;le gleichm&auml;ssig
verteilt so dass sich mit diesem Signal ein r&auml;umlicher Effekt
erzielen l&auml;sst.
<br>
</p>
<p>Da sie sicher schon einige &Uuml;bung im &ouml;ffnen von ST
Computern haben, kann ich mir hier garantiert zu beschreiben wie man
das Geh&auml;use &ouml;ffnet und das man dabei fr&uuml;her die
Garantie verloren hat..
<br>
</p>
<p>Wichtig ist aber das Sie die Platine so hinlegen das alle hinteren
Anschlussbuchsen vom K&ouml;rper weg zeigen. Sie lokalisieren dann den
<a href="080109.htm" target="UDOcon">Soundchip</a> welcer die Bezeichnung YM 2149 tr&auml;gt bzw. tragen
sollte.
<br>
</p>
<p>Sollte dieser Chip in ihrem Rechnermodell eingel&ouml;tet sein
m&ouml;chte ich an dieser Stelle die weniger ge&uuml;bten Bastler
bitten diese Anleitung am besten gleich wieder zu Vergessen oder
jemanden darum bitten der wei&szlig; was er macht.
<br>
<br>
<br>
</p>
<p><b> Umbauen.. </b>
<br>
</p>
<p>Den Chip aus dem Sockel nehmen und die Beinchen 3 und 4 so
wegbiegen das sie nicht mehr in der Fassung stecken wenn der Chip
wieder in den Sockel zur&uuml;ckgesteckt wird.
<br>
</p>
<p>Den Chip wieder in seinen Sockel stecken.
<br>
</p>
<p>Geht das bei ihnen so nicht, d&uuml;rfen Sie Pin 3 und 4 mit einem
feinsten Seitenschneider ganz dicht &uuml;ber der Platine sauber
abtrennen. Hier zu gibt es 1001 Vorschlag. Fragen Sie 15 Leute
erhalten Sie dazu garantiert 17 verschiedene Antworten.
<br>
</p>
<p>Trennen Sie die beiden genannten Beinchen sauber ab.
Zerst&ouml;ren Sie keine Leiterbahn und achten Sie darauf das die eben
abgetrennen Beinchen nicht abbrechen, ansonsten w&uuml;rden Sie direkt
einen neuen <a href="080109.htm" target="UDOcon">Soundchip</a> ben&ouml;tigen. Achten Sie auch darauf das kein
Dreck, Metallsplitter unter einen Chip ger&auml;t.
<br>
</p>
<p>Auf jeden Fall haben Sie den Kondensator C31 auszul&ouml;ten,
dessen LINKER Anschluss wird nach oben gebogen. Danach l&ouml;ten Sie
diesen Kondensator mit seinem RECHTEN Bein wieder so ein wie Sie ihn
vorgefunden haben, bis eben auf das eine Bein. Sie sind gut beraten
wenn Sie sich merken oder markieren welches Beinchen in welchem
L&ouml;tauge steckte.
<br>
</p>
<p>Bis zu diesem Punkt haben Sie bereits den gef&auml;hrlichsten Teil
der Arbeiten abgeschlossen.
<br>
<br>
<br><b> Die Schaltung.. </b>
<br>
</p>
<p>Keine Angst, es ist nichts Aufwendiges, mehr oder weniger
eigentlich nur ein geschickter Spannungsteiler.
<br>
</p>
<p>Mit ein paar Widerst&auml;nden und einer kleinen Lochrasterplatine
bauen Sie eine winzig kleine Schaltung auf. Haben Sie bitte
Verst&auml;ndniss das es dazu keine fertige Platine gibt und auch in
Zukunft nicht geben wird.
</p>
<p>Die Schaltung folgt untenstehend
<br>
</p>
<p>Die Verbindungsleitung zur Stereoanlage besteht nat&uuml;rlich,
wie &uuml;blich, nur aus einer mehradrigen abgeschirmten Leitung.
Anonsten d&uuml;rfen Sie mit St&ouml;rger&auml;uschen rechnen. Im
Computer kann die Abschirmung direkt an den L&ouml;tpunkt J5
angel&ouml;tet werden. Er befindet sich in unmittelbarer n&auml;he von
C31 und ist leicht zu finden.
<br>
</p>
<p>Richtige Profis bauen sich in die Rechnerr&uuml;ckwand
nat&uuml;rlich RCA-Buchsen oder eine 5pol. DIN Diodenbuchse ein. Das
macht ein besseres Bild und man kann da auch jederzeit andere
Audioverbindungen herstellen.
<br>
</p>
<p>Die Platine sollte im Rechner befestigt werden, am besten so das
sie nicht an irgendwelchen Anschlu&szlig;dr&auml;htchen baumelt oder
auf einen Chip geklebt wird.
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/stereo.gif" border=0 width="398" height="179"></p><br>
<div align=center><tt> Abbildung 1 - Stereoadapter f&uuml;r <a href="0305.htm" target="UDOcon">Atari ST</a> </tt>
</div>
<p>
<br>
<br>
</p>
<p>Nach der Inbetriebnahme muss man den Tastaturklick im
Monitor-Lautsprecher und in der dann angeschlossenen Steroanlage
h&ouml;ren. Im Monitor ist der Ton nach dieser Modifikation generell
leiser, bedingt durch unseren Spannungsteiler.
<br>
</p>
<p>
<br>
<br><b> Bauteile.. </b>
<br>
</p>
<p>R1,R2,R3,R4,R5,R8, : 3,3KOHM
<br>R6,R7, : 1,0KOHM 1/4 WATT (alle)
<br>Lochrasterplatine
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Miniatur Testprogramm </b>
<br>
</p>
<p>for a= 1 to 3
<br>sound a,8,12,4,25
<br>sound a,0,0,0,0
<br>next a
<br>for a = 3 to 1 step -1
<br>sound a,8,12,4,25
<br>sound a,0,0,0,0
<br>next a
<br>
</p>
<p>Nach dem Umbau sollten selbst alte Spiele mit &quot;neuem&quot;
Ton gl&auml;nzen.
<br>Die Tonausgabe ist vollkompatibel und ben&ouml;tig keinerlei
Softwareanpassung und kann ebenfalls mit dem Testmodul getestet
werden.
<br>
</p>
<p>Die Anleitung basiert auf den Angaben eines orignalen <a href="190d.htm" target="UDOcon">Schaltplan</a>
f&uuml;r einen ST 520+ der Firma Atari von 1986 und einer &auml;lteren
Anleitung aus dem ehemaligen ST-Magazin.
<br>
</p>
<p>
<br>
<br><b> Eine weitere L&ouml;sung </b>
<br>
</p>
<p>In der heutigen Zeit bietet es sich durchaus an, einen Computer
mit Stereo-Sound zu besitzen. M&uuml;ssen Sie als ATARI-ST- das
Nachsehen haben?
<br>
</p>
<p>In den vergangenen Jahren hatte ich mich immer wieder gefragt,
warum mein alter 1040 STFM &uuml;ber seine Chip- Sound nur MONO
ausgeben konnte, wu&szlig;te aber als ehemaliger Besitzer eines
Schneider CPC 6128, der &Uuml;brigens mit einer &auml;hnlichen 8-Bit
PSG-Orgel aufzuwarten vermochte, da&szlig; es auch anders geht. Denn
was ein alter 8-bitter kann, n&auml;mlich Stereosound produzieren,
sollte eigentlich ein 16/32-bitter schon l&auml;ngst k&ouml;nnen.
<br>
</p>
<p>Also besorgte ich mir die Dokumente des PSG.
<br>
</p>
<p>Beim Anschauen der Pinbelegung f&auml;llt sofort auf, da&szlig;
alle drei Soundkan&auml;le einzeln herausgef&uuml;hrt sind. Ergo, es
besteht die M&ouml;glichkeit, diese einzeln &uuml;ber Widerst&auml;nde
auf zwei Ausg&auml;nge abzumischen.
<br>
</p>
<p>Nat&uuml;rlich kommt jetzt die Frage auf: Waren damals die
Konstrukteure des CPC einfach genial, oder waren die Jungs bei ATARI
zu faul oder zu geizig, ein paar Widerst&auml;nde und zwei
Cinchstecker mehr einzubauen.
<br>
</p>
<p>Ich glaube, da&szlig; es in Bezug auf ATARI auch bei vielen
anderen Dingen &auml;hnliche ungekl&auml;rte Fragen gibt.
<br>
</p>
<p>Wie dem auch sei, die Gesamtkosten f&uuml;r den Umbau betragen
kaum mehr als 5,- DM. Daf&uuml;r erh&auml;lt man eine neue Dimension
der Klangerzeugung. Vor allem die Musikst&uuml;cke von Jochen Hippel
w&auml;ren da zu erw&auml;hnen.
<br>
</p>
<p>Man ben&ouml;tigt einen sehr feinen L&ouml;tkolben von nicht mehr
als 15W, eine flache, feine und spitze Zange (Seitenschneider),
L&ouml;tzinn, etwas isolierten Draht.
<br>
</p>
<p>
<br>
</p>
<p>* 3 x 1 KOhm Widerst&auml;nde
<br>* 3 x 10 KOhm Widerst&auml;nde
<br>* 2 x 100 Ohm Widerst&auml;nde
<br>* 2 x 200 Ohm Widerst&auml;nde
<br>* 2 x Cinch-<a href="0f0b.htm" target="UDOcon">Stecker</a> (weiblich).
<br>
</p>
<p>
<br>Als erstes &ouml;ffnet man den ausgeschalteten Rechner und
entfernt alle Abschirmbleche.
</p>
<p>Dann sucht man den <a href="080109.htm" target="UDOcon">Soundchip</a>. Zur Hilfe: Dieser ist eine IC mit 40
Beinchen und ist in in der N&auml;he des Druckerports zu finden. Die
Bezeichnung sollte General Instruments AY-3-891-0 oder Yamaha YM-2:149
lauten.
<br>
</p>
<p>Wenn Sie nun diesen Chip gefunden haben, trennen Sie die Pins 3, 4
und 38 durch und l&ouml;ten, wie in der Zeichnung vorgegeben, die
Mischschaltung an. Den Pin mit der Bezeichnung &quot;Speaker &quot;
l&ouml;ten Sie dann an eine der fr&uuml;heren Leiterbahnkontakte von
Pin 3, 4 oder Pin 38 an.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Inbetriebnahme </b>
<br>
</p>
<p>Wenn Sie nun Musik mit Ihrem ATARI abspielen, wird ein Soundkanal
&uuml;ber die Mitte (also &uuml;ber beide Lautsprecherboxen)
ausgegeben, die anderen Kan&auml;le werden nach links und rechts
verteilt, so da&szlig; ein Stereo-Eindruck entsteht.
</p>
<p>Sollten Sie mit dem Thema Elektronik ein wenig vertraut sein, wird
es Ihnen nicht schwer fallen, ein kleines System zu integrieren, das
das individuelle Verteilen/Abmischen der einzelnen Soundkan&auml;le
erm&ouml;glicht.
</p>
<p>Schade nur, da&szlig; es eine entsprechende Hardwareerweiterung
nicht schon viel fr&uuml;her f&uuml;r die STs gegeben hat, denn dann
h&auml;tten viele Spiele- und Demo-Programmierer gezielt in Stereo
programmieren k&ouml;nnen.
<br>
</p>
<p>Daniel Nowicki
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/ststereo.gif" border=0 width="280" height="275"></p><br>
<div align=center><tt> Abbildung 1 - Stereosound mit ein paar Widerst&auml;nden
mehr.. </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="13.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="1302.htm" target="UDOcon"><img src="udo_lf.gif" alt="Tweety Board" border=0 width="24" height="24"></a>
<a href="1304.htm" target="UDOcon"><img src="udo_rg.gif" alt="Startrak" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
