<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Startrak
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="13.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="1303.htm" target="UDOcon"><img src="udo_lf.gif" alt="ST Stereo" border=0 width="24" height="24"></a>
<a href="1305.htm" target="UDOcon"><img src="udo_rg.gif" alt="WaveBlaster" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Startrak">19.4 Startrak</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Startrak <a href="1301.htm" target="UDOcon">Audio</a> Hardware </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Startrack nennt sich eine HD-Recording-Soundkarte f&uuml;r alle
Atari TT, Hades &amp; Medusa-Systeme mit internem VME-Bus.
<br>
</p>
<p>
<br><b> Kartenhardware </b>
<br>
</p>
<p>Die STARTRACK Harddisk-Recording-Soundkarte ist eine 4 lagige
Platine. Die Karte besitzt digitale Ein/Ausg&auml;nge in Cinch und
Opto-Ausf&uuml;hrung und versteht die Consumer-Norm SP/DIF, aber auch
die Studioausf&uuml;hrung AES/EBU.
<br>
</p>
<p>Die Karte erkennt Fehler in der digitalen <a href="1507.htm" target="UDOcon">Daten&uuml;bertragung</a>
und zeigt die Art des Fehlers an. Die Samplerate der digitalen
Aufnahme wird hardwarem&auml;&szlig;ig erkannt und im Programm
ausgewertet und angezeigt. Der Kopierschutz kann aus
SCMS-gesch&uuml;tzten Digitalaufnahmen vollst&auml;ndig entfernt
werden. Eigene Aufnahmen per Soundkarte k&ouml;nnen verlustfrei
digital zur&uuml;ck per DAT/DCC/MD &uuml;berspielt werden. Dabei kann
gew&auml;hlt werden ob anschlie&szlig;end keine Kopien, eine Kopie
oder mehrere Kopien der Aufnahme m&ouml;glich bzw. erlaubt sind. An
Frequenzen verarbeiten die digitalen Eing&auml;nge 32/44.1/48kHz und
dank allerneuester SP/DIF-Chips auch 96kHz Samplerate. Hiermit ist
sogar 24Bit-Mastering m&ouml;glich. Es sind au&szlig;erdem je ein
Stereo 16Bit A/D und 18Bit D/A-Wandler&gt; auf der Karte mit 64fachem
Oversampling und Sigma-Delta-Linearwandlern. Das sind keine
Billigwandler wie im Atari Falcon oder auf den meisten PC-Soundkarten
sondern erstklassige Wandler deren Qualit&auml;t von
HIFI-Zeitschriften bereits gew&uuml;rdigt wurden. Zusammen mit den
Digitaleing&auml;ngen kann die Karte im Vierkanal-Modus arbeiten.
Dabei k&ouml;nnen gleichzeitig vier Kan&auml;le aufgenommen und
wiedergegeben werden.
<br>
</p>
<p>Eine De-Emphasis-Schaltung ist auch integriert und diese kann
&uuml;ber das Programm gesteuert werden. Das ist n&ouml;tig weil
einige CDs (z.B. von Heaven 17) zwecks Rauschminderung mit stark
angehobenen H&ouml;hen auf der CD verewigt wurden.
<br>
</p>
<p>Die Karte besitzt digital steuerbare
Highend-Lautst&auml;rkeregler/verst&auml;rker im Bereich -96dB bis
+32dB, kanalgetrennt regelbar mit 256 Abstufungen f&uuml;r den
A/D-Wandler (Aufnahme) und auch f&uuml;r den D/A-Wandler (Wiedergabe).
Mit der Karte ist Harddisk-Recording m&ouml;glich. Man kann die Karte
durch eine Erweiterungsplatine mit einem Motorola DSP56002-66MHz
(doppelte Falcon-Leistung) aufr&uuml;sten der standardm&auml;&szlig;ig
&uuml;ber zus&auml;tzliche 128K x 24Bit SRAM/12ns verf&uuml;gt, das
ist viermal soviel wie im Atari Falcon.
<br>
</p>
<p>Der DSP ist aber f&uuml;r Harddisk-Recording nicht unbedingt
n&ouml;tig, da die Karte den Transfer selbst puffert. Daher steht der
DSP quasi komplett f&uuml;r Effekt-Berechnungen zur Verf&uuml;gung.
Auf der DSP-Erweiterung befindet sich auch ein Falcon-kompatibler
DSP-Port f&uuml;r Erweiterungen (Analog8, ADAT, JAM In/Out) z.B. auf 8
Einzelausg&auml;nge. Optional gibt es einen aufgebohrten
DSP-Doubleport f&uuml;r 2 Erweiterungen (2x Analog8, JAM-Out) f&uuml;r
bis zu 16 Einzelausg&auml;nge!
<br>
</p>
<p>Ein DSP-Debugport (ONCE) ist serienm&auml;&szlig;ig vorhanden und
erlaubt Entwicklern und Programmierern das komfortable
Hardware-Debugging von DSP-Programmen. Dieser Port ist kompatibel zum
Entwicklungstool EVM56002 von Motorola. Die Debug-Software ist
kostenlos erh&auml;ltlich und erlaubt u.a. Breakpoints, Trace,
Auslesen und &Auml;ndern von Registern usw.
<br>
</p>
<p>&Uuml;ber den DSP-Slot der HDR-Soundkarte sind prinzipiell auch
andere DSPs oder Erweiterungen denkbar. Anregungen hierzu sind
durchaus erw&uuml;nscht. Durch eine weitere Zusatzplatine kann das
System voll Studiotauglich gemacht werden, d.h. h&ouml;here Line-Pegel
und alle Anschl&uuml;sse in XLR-Anschlu&szlig;norm. Die 3 digitalen
Eing&auml;nge, optisch oder koaxial und AES/EBU, k&ouml;nnen &uuml;ber
das Sample-Editor-Programm umgeschaltet werden. Das erspart
st&auml;ndiges Umstecken der Kabel. Die A/D und D/A-Wandler
k&ouml;nnen mit den &uuml;blichen 32/44.1 und 48kHz arbeiten,
au&szlig;erdem aber noch mit 8/11/12/16/16.5/22.1/24/33.1 kHz und
einem optional extern angelegten Takt (Wordclock) der durch
768/512/384 oder 256 intern geteilt wird. Der Wandlertakt kann
au&szlig;erdem &uuml;ber ein Koaxkabel mit einem CD-Laufwerk verbunden
werden. Das ist bei einigen HighEnd-Laufwerken m&ouml;glich und
verhindert wirkungsvoll Jitter.
<br>
</p>
<p>Die DSP- Erweiterung verwendet einen Motorola DSP56002 mit 66MHz
Taktrate, der voll kompatibel zum im Falcon verwendeten DSP56001 ist.
Dieser bringt die doppelte Leistung verglichen zum Falcon. In Zeiten
hoher <a href="080108.htm" target="UDOcon">CPU</a>-Taktfrequenzen scheint das nicht allzu hoch zu sein, man
darf jedoch nicht vergessen das der DSP ein auf die Signalverarbeitung
hochoptimierter Chip ist, der mehrere Befehle gleichzeitig verarbeiten
kann und ohne Waitstates (bei 66MHz alle 15ns) auf den Speicher
zugreift. Auf der DSP-Karte ist zus&auml;tzlich ein sehr schneller
Cache-Speicher mit 128K x 24Bit SRAM.
<br>
</p>
<p>Das ist ebenfalls vier mal soviel wie im Atari Falcon und ist fast
der maximal m&ouml;gliche Speicherausbau den der DSP ansprechen kann.
In Verbindung mit der DSP-Erweiterung ist es m&ouml;glich, die Karte
im Vierspurbetrieb zu nutzen. Dabei werden die digitalen
SP/DIF-Anschl&uuml;sse als weiterer Stereo Ein- und Ausgang gemeinsam
mit den Analoganschl&uuml;ssen genutzt.
<br>
</p>
<p>Der Debug-Port (ONCE) ist serienm&auml;&szlig;ig vorhanden.
Hiermit und mit einem PC-Debugger der kostenlos erh&auml;ltlich ist,
kann man in den DSP-Programmablauf eingreifen, direkt Registerinhalte
einsehen und ver&auml;ndern usw. Debug-Port ist hierf&uuml;r mit dem
PC &uuml;ber einen seriellen COM-Port verbunden. und ist kompatibel
zum Motorola EVM56002-Entwicklungsboard. Au&szlig;erdem ist dabei auch
gleich noch eine serielle Verbindung zum Host-Port des DSP abgefallen.
F&uuml;r mehr Sound werden nun die allerneuesten SP/DIF-ICs verwendet,
die sogar ein rein digitales 24Bit-Mastering mit 96kHz Samplerate
erlauben. Somit d&uuml;rfte dies weltweit die erste Samplingkarte mit
96kHz-Verarbeitung sein. Au&szlig;erdem ist es durch einen
gr&ouml;&szlig;eren (leider auch teureren) Chip nun m&ouml;glich,
&uuml;ber einen erweiterten DSP-Port (DSP-Doubleport-Option) sogar
zwei Falcon-Erweiterungen parallel zu betreiben.
<br>
</p>
<p>
<br>
</p>
<p>Man kann zwei Soundpool-Analog8 anschlie&szlig;en, und hat dann 16
!! Einzelausg&auml;nge. Dabei werden alle 16 Kan&auml;le mit den
vollen 16Bit verarbeitet und ausgegeben (keine Falcon-&uuml;bliche
Datenreduktion f&uuml;r 16 Spur-Modus). Da dieses Feature aber nicht
von jedem gebraucht wird und die Karte dadurch teurer w&uuml;rde, gibt
es dieses Feature nur optional gegen Aufpreis. Man kann diesen
DSP-Doubleport aber jederzeit bei Bedarf nachr&uuml;sten lassen. Die
Soundkarte wurde gr&uuml;ndlich auf dem Atari TT getestet. Da die
Rechenleistung einer 68030er <a href="080108.htm" target="UDOcon">CPU</a> nicht allzu hoch ist, empfiehlt sich
hier unbedingt die DSP-Erweiterung die den TT beim Mischen u.a.
deutlich entlastet. So sind mit der DSP-Erweiterung auch auf dem TT
problemlos 8 Spuren/48kHz m&ouml;glich.
<br>
</p>
<p>Die StarTrack-Audiokarte und die DSP-Erweiterung ist seit
September 1997 erh&auml;ltlich.
<br>
</p>
<p>Die Startrack-Karte kostet incl. Editing- und Mastering-Software =
1495 DM
<br>
</p>
<p>DSP-Erweiterung mit Motorola 56002 (100% kompatibel zum
Falcon-DSP), DSP-Port f&uuml;r Falcon-Erweiterungen (Soundpool Analog8
&amp; ADAT,Jam IN/Out etc.), Motorola ONCE (Debug-Port,voll kompatibel
zu Motorola EVM56002) = 550 DM
<br>
</p>
<p>Startrack-Karte, DSP-Erweiterung &amp; Software komplett = 1950 DM
<br>
</p>
<p>Editing- und Mastering-Software einzeln = 348 DM
<br>
<br>
</p>
<p>Optionen:
<br>
</p>
<p>Erweiterter DSP-Port zum Anschlu&szlig; von 2 Port-Erweiterungen
(z.B. 2 x Analog8 = 16 Einzelausg&auml;nge) incl. Software = 200 DM
<br>
</p>
<p>XLR-Erweiterung a.A.
<br>
<br>
<br>
</p>
<p>Die Kontakt-Adresse:
<br>
</p>
<p>Stephan Wilhelm
<br>Niehler Str. 312
<br>50735 K&ouml;ln
<br>
</p>
<p>eMail: stepwil@aol.com
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="13.htm" target="UDOcon"><img src="udo_up.gif" alt="Audio und Sound" border=0 width="24" height="24"></a>
<a href="1303.htm" target="UDOcon"><img src="udo_lf.gif" alt="ST Stereo" border=0 width="24" height="24"></a>
<a href="1305.htm" target="UDOcon"><img src="udo_rg.gif" alt="WaveBlaster" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
