<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Ring On
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="1401.htm" target="UDOcon"><img src="udo_lf.gif" alt="METEX DMM Multimeter" border=0 width="24" height="24"></a>
<a href="1403.htm" target="UDOcon"><img src="udo_rg.gif" alt="Junior Prommer" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Ring_20On">20.2 Ring On</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Ein Anruf schaltet meinen Atari ein </tt>
</p>
<p>
<br>
<br>
</p>
<p>Eine Schaltung zum automatischen Einschalten des Atari Rechners
&uuml;ber Auswertung des Ring-Indikator-Signals der seriellen
Schnittstelle. Sehr n&uuml;tzlich z.B. zum automatischen FAX-Empfang,
ohne den Rechner 24h laufen zu lassen. Eine der L&ouml;sungen hier auf
dieser Seite dient mir noch heute zusammen mit einem Atari Falcon,
CoMa und einem Fax, Voice-Modem als komfortabler Anrufbeantworter mit
eingebauter Minimailbox. Der Computer ist grunds&auml;tzlich Aus wenn
das B&uuml;ro nicht besetzt ist, der Anrufer schaltet die
entsprechende Hardware ein. Das einzige das aktiv Strom verbraucht ist
die Einschaltbox.
<br>
</p>
<p>
<br>
<br><b> Ein kosteng&uuml;nstiger Einschalter </b>
<br>
</p>
<p>Getestet am ATARI 1040 STF im Tower
<br>
</p>
<p>Liste der ben&ouml;tigten Bauteile:
<br>
</p>
<pre>
1 Steckernetzteil 12V=
2 Relais 12V (zur allpoligen Schaltung der Netzspannung)
1 Taster (Reset)
1 NE 555 (Universal Timer IC)
2 NPN-Transistoren (z.B. BC 237, BC 547)
2 Diode (1 Freilauf, 1 Transistorschutz)
1 LED rot (Modul steht unter Spannung)
1 LED gr&uuml;n (Modul ist aktiviert)
1 ElKo 1000&#181;F/16V (Gl&auml;ttung)
1 ElKo 470&#181;F/16V (RC-Glied, C)
1 Kondensator 100n (Siebung)
1 Kondensator 10n (Referenz)
2 Widerstand 1k2 (Vorwiderstand f&uuml;r LED)
1 Widerstand 1k5 (Basiswiderstand)
1 Widerstand 3k3 (Arbeitswiderstand)
1 Widerstand 3k3 (Basiswiderstand)
1 Widerstand 2M7 (RC-Glied, RA)
1 kleines St&uuml;ck Lochrasterplatine
diverse Dr&auml;hte und Befestigungsmaterial


Zum Timer NE 555:

         ---v---
        |       |
    GND |1     8| +VCC
        |       |
TRIGGER |2     7| DISCHARGE
        |       |
 OUTPUT |3     6| THRESHOLD
        |       |
  RESET |4     5| CONTROL VOLTAGE
        |       |
         -------


Zum Transistor BC 237 (pa&szlig;t aber auch bei den meisten anderen):

         B          Transistor von den Beinchen aus
       E   C        betrachtet (also von unten)


Im Folgenden wird die Schaltung in Einzelteilen dargestellt.


Spannungsversorgung (vom Steckernetzteil kommend: 12V, GND bzw. Masse):

VCC (12V)
 ^
 O----+-----------------+----------+
      |                 |          |
      |                 |          |
      |                 |         ---
      | +               |         | |
     ===               ---        | | 1k2
         1000&#181;F/16V        100n   | |
     ---               ---        ---
      |                 |          |
      |                 |         ---
      |                 |         \|/ LED rot
      |                 |         ---
      |                 |          |
      +-----------------+----------+--------------&gt; Masse Rechner-Board
      |
     === Masse (GND)


Referenzspannung:

      +-----&gt; PIN 5
      |
      |
     ---
         10nF
     ---
      |
      |
     === Masse


RC-Glied zur Einstellung der Schaltzeit:

VCC
 ^
 O----+-----&gt; PIN 8 (+VCC)
      |
      |
     ---
     | |
     | | RA
     | |
     ---
      |
      +-----&gt; PIN 7
      |
      +-----&gt; PIN 6
      | +
     ===
         C
     ---
      |
      +-----&gt; PIN 1 (GND)
      |
     === Masse


Aktivierungsteil durch Ring Indikator:

VCC
 ^
 O----+
      |
     ---
     | |
     | | 3k3
     | |
     ---
      |
      +-----&gt; PIN 2
      |
      \ C
       \ |
        \| B
         |-----+
        /|     |
       / |    ---
      / E     | |
      |       | | 1k5
      |       | |
     ===      ---
    Masse      |
              ---
              /|\ Diode
              ---
               |
               +-----&lt; Ring-Indicator (Pin 22 der RS-232)


Schaltteil:

VCC
 ^
 O-----+-------+------+------------------+
       |       |      |                  |
       |       |      |                 ---
     ----- R -----    |                 | |
     |\  | e |\  |   ---                | | 1k2
     | \ | l | \ |   /|\ Diode          | |
     |  \| a |  \|   ---                ---
     ----- i -----    |                  |
       |   s   |      |                 ---
       |       |      |                 \|/ LED gr&uuml;n
       |       |      |                 ---
       |       |      |                  |
       +-------+------+------------------+
       |
       \ C
        \ |
         \| B
          |-----+
         /|     |
        / |    ---
       / E     | |
       |       | | 3k3
       |       | |
      ===      ---
     Masse      |
                +-----&gt; PIN 3


Resetteil:

       +-----&gt; PIN 4
       |
    \
 |---\   Reset Taster (damit der Rechner definitiv AUS geht)
      \
       |
       |
      === Masse

</pre>
<p>Die Zeit, die das Modul eingeschaltet bleibt, errechnet sich
theoretisch aus der Gleichung:
<br>
</p>
<p>t = 1.1 * RA * C
<br>
<br>
</p>
<p>Ich habe durch &quot;ausprobieren&quot; f&uuml;r etwa 35min
Einschaltzeit die oben angegebenen Werte ermittelt.
</p>
<p>Zun&auml;chst hatte ich nur ein 2-poliges Relais verwendet. Das
entsprach dann aber nicht der VDE 0100. Au&szlig;erdem kam es sehr
schnell zu einem Kurzschlu&szlig;, wonach das Relais geschrottet war.
Deshalb bin ich auf die /saubere/ L&ouml;sung mit den 2 Relais
umgestiegen.
</p>
<p>Das Ringindicator-Signal ist an einem der 1489-Chips zu finden
(zumindest auf meinem Board).
<br>
</p>
<p>Falls noch Fragen bestehen, stehe ich gerne zur Kl&auml;rung zur
Verf&uuml;gung.
</p>
<p>Die Schaltung ist aus einer spontanen Idee heraus entstanden.
&Auml;hnlichkeiten mit lebenden und verstorbenen automatischen
Rechnereinschaltschaltungen w&auml;ren rein zuf&auml;llig und nicht
beabsichtigt.
<br>
</p>
<p>F&uuml;r Fehler, die im Zusammenhang mit dieser Schaltung
entstehen (k&ouml;nnten), &uuml;bernehme ich keine Haftung.
Insbesondere weise ich darauf hin, da&szlig; die g&auml;ngigen
Bestimmungen (z.B. VDE 0100) eingehalten werden m&uuml;ssen. F&uuml;r
die Beachtung ist jede(r) selbst verantwortlich.
</p>
<p>
<br>
<br>
</p>
<p><b> Keine Faxen mehr beim Faxen </b>
<br>
<br>
</p>
<p>** Bastelvorschlag f&uuml;r eine automatische Einschaltbox ***
<br>(z.B. f&uuml;r den automatischen Faxempfang)
<br>
</p>
<p>Version: 1.60 vom 12.06.1995
<br>von E. G&uuml;ssgen (Tel.: 06302-3338 / FAX: 06302-7969)
<br>E-Mail-Adresse: Egbert G&uuml;ssgen @KL
<br>
</p>
<p>
<br>ver&ouml;ffentlicht in der ST-COMPUTER 10/94
<br>
</p>
<p>Viel Erfolg!
<br>
</p>
<p>E.G&uuml;ssgen
<br>
</p>
<p>- zur Problematik des automatischen Faxempfangs
<br>- Bastellvorschlag zum automatischen Einschalten des Computers
<br>
</p>
<p>von E.G&uuml;ssgen
<br>
<br>
</p>
<p><b> A. DAS PROBLEM </b>
<br>
</p>
<p>Sie kennen es bestimmt auch:
<br>Da ist man Besitzer eines Computers, der mit dem entsprechenden
Modem und einer passenden Software sehr gut in der Lage w&auml;re,
f&uuml;r den Faxbetrieb eingesetzt zu werden. Man erw&auml;hnt dies
auch oft genug gegen&uuml;ber Freunden und Verwandten, wenn es mal
wieder darum geht, plausibel zu machen, f&uuml;r was so ein Computer
alles zu gebrauchen ist. Man spart sich die (auch heute noch nicht
ganz billige) Anschaffung eines Faxger&auml;tes (mit allen
Folgekosten), arbeitet wesentlich komfortabler und faxt
dar&uuml;berhinaus auch noch besonders umweltfreundlich. Denn die
meiste &quot;Faxerei&quot; spielt sich v&ouml;llig papierlos ab, nur
ab und zu werden wichtige Dokumente einmal ausgedruckt.
<br>
</p>
<p>Also, ...faxen mit dem Computer... ja bitte!
<br>Aber dann wird insbesondere der Kritiker immer wieder zum Zeugen
eines geradezu l&auml;cherlichen Schauspiels:
<br>
</p>
<p>Das Telefon klingelt bei unserem &quot;Computerfaxer&quot;. Der
verl&auml;&szlig;t gelangweilt den Kaffeetisch und nimmt den
Telefonh&ouml;rer ab. Doch er h&ouml;rt nicht wie erwartet Omas
vertraute Stimme, sondern es dringt das schrille Zirpen eines fremden
Telefaxger&auml;tes an sein verbl&uuml;fftes Ohr. Ach so, da will ihm
jemand ein Fax schicken!? Und jetzt beginnt ein ulkiger Wettlauf mit
der Zeit. Nur wer eine schnelle Reaktion und/oder schnelle
Computerhardware hat, kann den Wettlauf gewinnen: ... hinstolpern zum
Computer * schnell das System hochfahren * ach, wo ist denn schon
wieder die Startdiskette * Faxsoftware starten * Fax entgegennehmen...
... oh, zu langsam, das Faxger&auml;t auf der Gegenseite wollte nicht
so lange warten und hat wieder aufgelegt... Hoffentlich versucht es
das Faxger&auml;t noch einmal. Man wartet gespannt. Und
tats&auml;chlich, nach wenigen Minuten klingelt das Telefon erneut.
Man lie&szlig; schlauerweise den Rechner gleich eingeschaltet und
nimmt von dort aus den Anruf entgegen... Doch was ist das? Kein
Telefax kommt herein. Man h&ouml;rt nur durch den Lautsprecher des
Modems die verzweifelte Stimme der Oma, die sich gerade zum Kaffee
anmelden wollte und jetzt durch ein wildes Gezirpe im Telefon zur
Verzweiflung gebracht wird. So oder &auml;hnlich sieht es doch in der
Praxis aus: Das Entgegennehmen von Faxen geht nur gut nach vorheriger
telefonischer Absprache. Und wenn mal keiner zu Hause ist, geht
&uuml;berhaupt nichts. Also, ...faxen mit dem Computer... nein danke?!
<br>
</p>
<p>
<br>
<br><b> B. DIE L&Ouml;SUNG </b>
<br>
</p>
<p>I. So sollte es sein!
<br>Wenn das Telefon klingelt, schaltet sich automatisch die komplette
Computeranlage (incl. Modem) ein, f&auml;hrt hoch und nimmt dank der
sinnvoll vorinstallierten Software den Anruf entgegen! Die Software
erkennt nun, ob es sich bei dem Anrufer um einen Menschen, ein
Faxger&auml;t oder ein Datenmodem handelt. Je nachdem steuert es die
weiteren Aktionen. Hier warten wir besonders gespannt auf die Version
2.5 von Wolfgang Wanders &quot;CONNECT&quot;! Einem menschlichen
Anrufer wird die Funktion eines (&uuml;beraus intelligenten)
Anrufbeantworters angeboten, ein anrufendes Faxger&auml;t darf sein
Fax loswerden und auch ein Modem, das einen Datenaustausch
w&uuml;nscht, wird bedient. Wenn man nun zu Hause ist, kann man dem
Computer jederzeit den Anruf &quot;wegnehmen&quot;, indem man das
Telefon abhebt, das einfach an den Ausgang des Modems angeschlossen
ist. Wenn der Anruf (in welcher Form auch immer) beendet ist, hat der
Computer noch ausreichend Zeit, das Fax, die gesprochene Nachricht
oder die eingegangenen Daten auf die Festplatte abzuspeichern. Dann
wird er komplett ausgeschaltet und nur eine kleine Warteschaltung
verbraucht im Standby-Modus minimale Energie (wenige Milliampere).
Wenn unser &quot;Computerfaxer&quot; jetzt nach Hause kommt, macht ihn
eine blinkende Leuchtdiode darauf aufmerksam, da&szlig; sich in seiner
Abwesenheit etwas getan hat. Und wenn er seinen Rechner jetzt
anschaltet, findet er auf seiner Festplatte die eingegangenen
Informationen. ...So sollte es sein!
<br>
</p>
<p>II. So bringt man es zum Funktionieren!
<br>Mit ein wenig menschlicher und digitaler Logik l&auml;&szlig;t
sich (fast) jedes Ziel erreichen. Im Folgenden soll ausf&uuml;hrlich
und in sinnvollen Schritten beschrieben werden, wie die L&ouml;sung
realisiert werden kann. Bitte ziehen Sie dabei immer die
entsprechenden Schaltpl&auml;ne hinzu.
<br>
</p>
<p><b> 1. Doch zu Beginn ein paar unumg&auml;ngliche Vorbemerkungen:
</b>
<br>
</p>
<p>Obwohl die hier beschriebenen Schaltungen weder kompliziert noch
schwer nachzubauen sind, sollten sich an den Nachbau nur diejenigen
wagen, die schon etwas Erfahrung mit Elektronik haben. Besonders weil
die Schaltung mit Netzspannung arbeitet, ist ein gewissenhafter Umgang
damit (lebens*) notwendig! Die einschl&auml;gigen VDE- und
Sicherheitsbestimmungen m&uuml;ssen unbedingt eingehalten werden!
Jeder, der sich dabei &uuml;berfordert f&uuml;hlt, kann bei der
Endmontage ja einen Fachmann zu Rate ziehen, der ihm den
Netzanschlu&szlig; vornimmt. Sofern ein direkter Eingriff in die
Telefonleitung vorgenommen wird, kommt dies nat&uuml;rlich nur
f&uuml;r Nebenstellenanlagen in Frage. Die L&ouml;sung mit der
akustischen Anruferkennung dagegen verst&ouml;&szlig;t gegen keinerlei
Verbote der Telekom. Bedenken Sie bitte auch, da&szlig; jeder Eingriff
in ein Ger&auml;t einen Garantieverlust mit sich bringen kann. Doch
nun an die Arbeit!
<br>
</p>
<p><b> 2. Das Hauptmodul </b>
<br>
</p>
<p>Wenn das Telefon klingelt und keiner zu Hause ist, brauchen wir
zun&auml;chst einmal ganz einfach einen Schalter, der es f&uuml;r uns
&uuml;bernimmt, die komplette Computeranlage einzuschalten, d.h. mit
Netzstrom zu versorgen. Diese Aufgabe &uuml;bernimmt unser
&quot;Hauptmodul&quot;. Wenn Sie sich einmal den <a href="190d.htm" target="UDOcon">Schaltplan</a> anschauen,
werden Sie feststellen, da&szlig; diese Platine einfach in die
Hauptstromzufuhr der Computeranlage eingeschleift ist. Ihre Aufgabe
ist es, &uuml;ber das Relais 1 (oder &uuml;ber das ELR) die
Computeranlage bei Bedarf einzuschalten und sp&auml;ter nach
vollendeter <a href="1507.htm" target="UDOcon">Daten&uuml;bertragung</a> mit einer Ausschaltverz&ouml;gerung
von ca. 60 Sekunden (wird zum Abspeichern ben&ouml;tigt) wieder
auszuschalten. Ich empfehle auf jeden Fall zum Schalten des Netzstroms
ein modernes elektronisches Lastrelais zu verwenden. Dies hat
(au&szlig;er dem etwas h&ouml;heren Preis) nur Vorteile! Der
ben&ouml;tigte Steuerstrom betr&auml;gt nur wenige Milliampere, so
da&szlig; der Ausgang des IC 1 in der Lage ist, das ELR direkt
anzusteuern. Ein 10A-Typ z.B. d&uuml;rfte ausreichende
Leistungsreserven zum kontaktlosen Schalten auch einer umfangreicheren
Computeranlage haben. Wer dennoch auf ein herk&ouml;mmliches Relais
zur&uuml;ckgreifen m&ouml;chte, findet beide M&ouml;glichkeiten im
<a href="190d.htm" target="UDOcon">Schaltplan</a> eingezeichnet. Das Hauptmodul ist haupts&auml;chlich mit
C-MOS-Logik realisiert worden. Es werden 3 IC's vom Typ 74 HC 221 (2
Monoflops mit Schmitt Trigger Eing&auml;ngen) verwendet. Diese
Monoflops lassen sich durch Beschalten mit einem RC-Glied sehr gut
f&uuml;r Verz&ouml;gerungsschaltungen mit den hier ben&ouml;tigten
Zeiten verwenden. Auch bieten sie diverse M&ouml;glichkeiten sich
gegenseitig sinnvoll zu beeinflu&szlig;en. IC 1 ist f&uuml;r das
richtig getimete Ein* und Ausschalten zust&auml;ndig. R4/C6 sorgt
f&uuml;r die ben&ouml;tigte Ausschaltverz&ouml;gerung von ca. 60
Sekunden. Die Kombination aus R1, R2 und C3 sorgt daf&uuml;r,
da&szlig; die Stromversorgung mit einer <a href="1409.htm" target="UDOcon">Einschaltverz&ouml;gerung</a> von
ca. 1 Sekunde durchgeschaltet wird. Dies ist * wie im n&auml;chsten
Abschnitt genau beschrieben * n&ouml;tig, damit die Telefonleitung vom
Modem getrennt werden kann, bevor das Modem Strom erh&auml;lt. IC 2
sorgt f&uuml;r zweierlei:
<br>
</p>
<p>a.) Bei manchen Modems (z.B. ZYXEL U-1496E +) gibt es folgendes
Problem: Wird die Stromversorgung erst eingeschaltet, wenn schon ein
Anruf anliegt, dann geht der Anruf verloren (durch den Reset des
Modems beim Einschalten). Da hilft ein kleiner Trick! Zuallererst
mu&szlig; die Telefonleitung kurz (ca. 3 Sekunden) vom Modem getrennt
werden. Dann bekommt die Computeranlage und damit auch das Modem
Strom. Nach Ablauf der 3 Sekunden wird die Telefonleitung wieder mit
dem Modem verbunden. Dies ist f&uuml;r den Funktionsablauf nicht
st&ouml;rend, da der Rechner ja sowieso einige Zeit (20*30 Sekunden)
zum Hochfahren ben&ouml;tigt. Sie sollten diesen Sachverhalt bei Ihrem
Modem testen! Dann wissen Sie, ob Sie diesen kleinen Trick anwenden
m&uuml;ssen oder nicht. Wenn nicht, k&ouml;nnen Sie einfach folgende
Bauteile weglassen: C9, R11, R10, T2, D8, Relais 2, R14, LED 2, D6,
D7, R7. Die beiden Eing&auml;nge von IC 2 (PIN 1 und 2) sollten Sie
dann auf +6V legen. Dar&uuml;berhinaus kann man nun noch die Funktion
von IC 3 in IC 2 hineinverlegen und ben&ouml;tigt nur noch zwei 74 HC
221.
</p>
<p>b.) Stellen Sie sich folgendes vor:
<br>Nach getaner Arbeit schaltet unser Hauptmodul die Computeranlage
aus. Die Festplatte ben&ouml;tigt nun aber noch einige Sekunden (je
nach Modell bis zu 20 Sekunden) bis sie stillsteht. W&auml;hrend
dieser Auslaufphase sollte man nicht erneut einschalten. Das bedeutet
Stre&szlig; f&uuml;r die Festplatte (es geht auf die Lager). Deshalb
sorgt IC 2 nach dem Ausschalten daf&uuml;r, da&szlig; bis zum
Stillstand der Festplatte ein erneutes Einschalten nicht m&ouml;glich
ist. Die Zeitdauer daf&uuml;r l&auml;&szlig;t sich mit R9 einstellen.
Diese Funktion mu&szlig; nicht unbedingt eingebaut werden, ist aber
sehr zu empfehlen! IC 3 registriert einen Anruf und schaltet die
Blinkdiode LED 1 ein. Diese zeigt Ihnen an, da&szlig; ein Anruf
eingegangen ist. Durch Dr&uuml;cken des Resettasters l&auml;&szlig;t
sie sich l&ouml;schen.
<br>
</p>
<p>Ganz nebenbei befindet sich auf dem Hauptmodul auch noch die
Stromversorgung f&uuml;r die ganze Schaltung. Es handelt sich dabei um
ein stabilisiertes Kleinnetzteil mit einer Ausgangsspannung von ca. 6
Volt. Mit dem Schalter S1 schalten Sie Ihre Computeranlage von
Standby-Betrieb auf Dauerbetrieb und die Leuchtdiode LED 5
signalisiert den Standby-Betrieb Ihres Computers.
<br>
</p>
<p>Die Leuchtdioden LED 2 bis 6 dienen nur der besseren
Funktionskontrolle des Einschaltmoduls. Sie k&ouml;nnen nat&uuml;rlich
auch weggelassen werden. Wenn man aber moderne LOW-CURRENT-LED's
verwendet, f&auml;llt der zus&auml;tzliche Stromverbrauch (ca. 2 mA
pro LED) kaum ins Gewicht und man beh&auml;lt leichter die
&Uuml;bersicht &uuml;ber die Funktion der Schaltung:
<br>
</p>
<p>LED 2 signalisiert das Trennen des Modems von der Telefonleitung
<br>LED 3 signalisiert das Sperren der Schaltung bis zum Stillstand
der Festplatte
<br>LED 4 zeigt das Durchschalten des Lastrelais an
<br>LED 5 zeigt Standby-Betrieb des Computers
<br>LED 6 leuchtet bei jedem eingehenden Telefonklingelsignal
<br>
</p>
<p><b> 3. Anruferkennung </b>
<br>&Uuml;ber den Eingang E 1 (Anruferkennung) wird unser Hauptmodul
mit der <a href="0205.htm" target="UDOcon">Information</a> versorgt, da&szlig; ein Klingelsignal anliegt und
die Computeranlage eingeschaltet werden soll.
<br>
</p>
<p>Daf&uuml;r sind 3 M&ouml;glichkeiten vorgesehen:
<br>a.) Am einfachsten ist es, &uuml;ber die Ring-Detect-Leitung der
seriellen Schnittstelle die Anlage einzuschalten. Dazu braucht man nur
den Ring*Detect*Anschlu&szlig; der seriellen Schnittstelle mit dem
Eingang E 1 zu verbinden. Bitte schauen Sie selber im Handbuch Ihres
Computers nach der Pinbelegung des betreffenden Steckers. Verschiedene
Rechner verwenden auch verschiedene Steckernormen. Der entscheidende
Nachteil ist allerdings, da&szlig; dazu nat&uuml;rlich das Modem immer
eingeschaltet sein mu&szlig;. Wenn man immer empfangsbereit sein will,
rund um die <a href="1413.htm" target="UDOcon">Uhr</a>. Und wer will das schon?
<br>
</p>
<p>b.) Die eleganteste L&ouml;sung besteht in der direkten Erkennung
und Verarbeitung der Klingelspannung auf der Telefonleitung. Dabei
kann auch das Modem ausgeschaltet bleiben, der Stromverbrauch und die
W&auml;rmeentwicklung sind minimal. Dies kann durch das
&quot;Eingangsmodul 1&quot; realisiert werden.
<br>
</p>
<p>c.) Um den Eingriff in die Telefonleitung zu vermeiden, wird eine
dritte M&ouml;glichkeit angeboten. &Uuml;ber ein Mikrofon wird das
Klingeln des Telefons registriert und ausgewertet. Hierbei ist ein
wenig Experimentieren angesagt, um eine gute Position f&uuml;r das
Mikrofon und die richtige Einstellung der Empfindlichkeit
herauszufinden. Die dazugeh&ouml;rende Schaltung finden Sie unter der
Bezeichnung &quot;Eingangsmodul 2&quot;.
<br>
</p>
<p>Allen drei Methoden ist eine Problematik gemeinsam:
<br>Sie k&ouml;nnen durch das Erkennen des Telefonklingelns das
Hauptmodul nur zum Einschalten veranlassen. Wenn dann nach dem
&quot;Abheben&quot; das Klingeln vorbei ist, w&uuml;rde unser
Hauptmodul durch die eingebaute und oben beschriebene
Ausschaltverz&ouml;gerung nach ca. 60 Sekunden automatisch abschalten.
Das mag zwar vielleicht manchmal ausreichen. Aber bei einem
l&auml;ngeren Anruf oder einem mehrseitigen Fax ist diese Zeit zu
kurz. Deshalb soll genau erkannt werden, wie lange die Verbindung
besteht. Und erst wenn die Verbindung beendet ist, soll unser
Hauptmodul (nach ca. 60 Sekunden Ausschaltverz&ouml;gerung)
abschalten. Dazu wird bei anderen (auch k&auml;uflichen) L&ouml;sungen
oft das DTR-Signal der seriellen Schnittstelle verwendet. Dies
erscheint aber nicht sinnvoll, obwohl es recht einfach ist, an dieses
Signal heranzukommen, da es auf der seriellen Schnittstelle vorhanden
ist.
<br>
</p>
<p>Wenn man z.B. das Programm QFAX verwendet, gibt es damit keine
Probleme. QFAX setzt das DTR-Signal w&auml;hrend des ganzen
Faxempfangs auf High, um es nach Ende des Empfangs auf Low zu setzen.
Damit kann man es als &quot;Haltesignal&quot; f&uuml;r unser
Hauptmodul verwenden. Andere Programme (z.B. CONNECT) verwalten das
DTR-Signal anders (wahrscheinlich sogar korrekter). Und schon beginnen
die Probleme. Deshalb h&auml;lt der <a href="0201.htm" target="UDOcon">Autor</a> es f&uuml;r den saubersten
Weg, das Signal der OH-LED aus dem Modem zu verwenden. Allein dies
erscheint als ein wirklich sicheres Indiz f&uuml;r die Dauer der
Verbindung. Man wird wohl davon ausgehen k&ouml;nnen, da&szlig; jedes
saubere Programm nach getaner Arbeit das Modem auflegen
l&auml;&szlig;t. Das DTR-Signal wird aber zur Zeit von Programm zu
Programm anders verwaltet. Dies macht allerdings einen kleinen
Eingriff im Modem notwendig. Ich beschreibe dies im Kapitel
&quot;Modemmodifikation&quot;. Wer dies vermeiden will, kann anstatt
der OH-Erkennung das DTR-Signal der seriellen Schnittstelle verwenden.
Auf jeden Fall ist eines dieser &quot;Haltesignale&quot; (DTR oder OH*
Erkennung) an den Eingang E 2 des Hauptmoduls zu schalten (siehe
<a href="190d.htm" target="UDOcon">Schaltplan</a>)!
<br>
</p>
<p><b> 4. Das Eingangsmodul 1 </b>
<br>Normalerweise f&uuml;hren die beiden Leitungen a und b der
Telefonleitung eine DC-Betriebsspannung von ca. 50 Volt. Als
Klingelsignal wird dieser Gleichspannung eine 25*Hz*Wechselspannung
von ca. 50 Veff &uuml;berlagert. Der Kondensator C10 koppelt die
Gleichspannung ab, so da&szlig; nur noch die Klingelwechselspannung
ausgewertet wird. Der Optokoppler trennt die Telefonleitung galvanisch
von der weiteren Schaltung und wird bei einem Klingelsignal im 50
Hz-Rhythmus durchgeschaltet. Mit Unterst&uuml;tzung von R20 und C11,
die eine Zeitbasis realisieren, wird nun T4 bei jedem Klingelsignal
durchgeschaltet, was die Leuchtdiode LED 6 signalisiert. Das dadurch
gewonnene High-Signal steuert den Eingang E 1 des Hauptmoduls an.
<br>
</p>
<p><b> 5. Das Eingangsmodul 2 </b>
<br>Eine in die N&auml;he des Telefons gebrachte kleine
ECM-Mikrofonkapsel nimmt das Klingelsignal auf. IC 4 verst&auml;rkt
das Signal auf einen brauchbaren Wert. Mit dem Trimmer R27 k&ouml;nnen
wir sehr gut die Verst&auml;rkung und damit die Empfindlichkeit
regeln. Es sollte nur so empfindlich eingestellt werden, da&szlig;
beim Telefonklingeln die LED 6 gerade noch sicher durchschaltet. So
reagiert unsere Schaltung dann auch nicht auf andere Ger&auml;usche in
der Umgebung. Wenn Sie mit dieser Eingangsschaltung arbeiten wollen,
lassen Sie einfach alle Bauteile des Eingangsmoduls 1 weg.
<br>
</p>
<p><b> 6. Modemmodifikation </b>
<br>Wenn man, wie oben n&auml;her erl&auml;utert, das OH-Signal des
Modems verwenden m&ouml;chte, kommt man um einen Eingriff ins Modem
nicht herum. Es sei denn, man m&ouml;chte das Leuchten der OH-LED
durch eine Fotodiode (Fototransistor) von au&szlig;en erkennen und
weiterverarbeiten. Dies erscheint dem <a href="0201.htm" target="UDOcon">Autor</a> aber viel zu
umst&auml;ndlich, zumal ein richtiger Elektronikbastler eine
ausgepr&auml;gt niedrige Hemmschwelle hat, wenn es um das (neugierige)
&Ouml;ffnen von elektronischen Ger&auml;ten geht. Das Modem zumal
werden wohl alle diejenigen schon von innen kennen, die einmal die
Eproms der Firmware gewechselt haben.
<br>
</p>
<p>... Also, nicht zuviel Respekt! (aber auch kein Leichtsinn!) Nun
kommt man allerdings um ein wenig Durchmessen und Nachverfolgen der
Modemschaltung nicht herum. Daf&uuml;r ist allerdings ein einfaches
Multimeter ausreichend. Die Leuchtdioden des Modems werden wohl auf
jeden Fall &uuml;ber einen Vorwiderstand mit Strom versorgt. Beim
ZYXEL U-1496 (+) z.B geschieht dies &uuml;ber Widerstands-Netzwerke
von 330 Ohm. Ob beim Anliegen eines Klingelsignals nun Masse oder die
Betriebsspannung zur OH-LED durchgeschaltet werden, mu&szlig; man bei
seinem Modem selber herausfinden. Beim ZYXEL U-1496 (+) wird Masse zu
den Leuchtdioden geschaltet. Wenn man sich dar&uuml;ber im Klaren ist,
braucht man nur eine einfache Optokopplerschaltung, die parallel mit
dem Leuchten der OH-LED ein High-Signal zum Eingang E 2 des
Hauptmoduls durchschaltet. Sie finden dazu einen prinzipiellen
<a href="190d.htm" target="UDOcon">Schaltplan</a> (pa&szlig;t beim ZYXEL U-1496 (+)), der je nach Modemtyp
leicht modifiziert werden mu&szlig;. Diese kleine Schaltung findet auf
einem Quadratzentimeter Lochrasterplatine Platz und verschwindet im
Modem. Meistens ist auf der seriellen Schnittstelle ein Anschlu&szlig;
nicht benutzt (beim ZYXEL U-1496 (+) z.B. Pin 12) und man kann diese
Leitung f&uuml;r die &Uuml;bertragung des neugewonnenen OH*Signals
(zum Hauptmodul) verwenden. Hat man nun schon einmal im Modem
&quot;herumgel&ouml;tet&quot;, ist es sehr n&uuml;tzlich bei dieser
Gelegenheit gleich die OH-LED gegen eine neue auszutauschen, die
farblich aus der Galerie der Leuchtdioden heraussticht. So bleibt es
weiterhin auch kein Geheimnis mehr, ob das Modem abgehoben hat oder
nicht!
<br>
</p>
<p><b> 7. Tips zum praktischen Aufbau </b>
<br>Die oben beschriebenen Schaltungen k&ouml;nnen sowohl auf
Lochrasterplatinen als auch auf gedruckten Platinen aufgebaut werden.
Ein Platinenlayout dazu ist diesem Artikel beigef&uuml;gt. Wer seinen
Computer in ein <a href="0903.htm" target="UDOcon">Desktop</a>* oder Towergeh&auml;use eingebaut hat, hat
leicht lachen! Er kann die komplette Einschaltautomatik dort
verstauen. Am besten ist es, wenn man in diesem Fall einen
Einbau-Kaltger&auml;testecker (mit integriertem Sicherungsfach) in
Verbindung mit einem Hauptschalter als Eingang f&uuml;r die gesamte
Netzversorgung und eine Kaltger&auml;te-Einbausteckdose als
geschalteten Ausgang verwendet. An diesen l&auml;&szlig;t sich dann
z.B. eine Steckdosenleiste anschlie&szlig;en, die vom Computer (Relais
1 oder ELR des Hauptmoduls) aus mit Strom versorgt wird und an die
alle weiteren Komponenten der Anlage (Modem, Drucker, Monitor, etc.)
angeschlossen sind. Der Schalter S1 mit der LED 5, die LED 1 und der
Resettaster werden gut sichtbar an der Front angeordnet. Ist man aber
&quot;trauriger&quot; Besitzer von tausend Einzelgeh&auml;usen und
einem Kabelverhau, so wird man nun stolzer Besitzer einer weiteren
&quot;Kiste&quot;. Man baut sich die komplette Elektronik,
&auml;hnlich wie oben beschrieben, in ein geeignetes Geh&auml;use ein,
das dann in die Computerhauptstromzufuhr eingeschleift wird.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tele1.gif" border=0 width="768" height="1024"></p><br>
<div align=center><tt> Abbildung 1 - Mein Nachbau, Frontansicht </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/tele2.gif" border=0 width="768" height="1024"></p><br>
<div align=center><tt> Abbildung 2 - Mein Nachbau, R&uuml;ckansicht </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p><b> 8. Das Platinenlayout </b>
<br>
</p>
<p>Das einseitige Platinenlayout wurde m&ouml;glichst universell
gehalten. Man best&uuml;ckt evtl. nur teilweise mit den
ben&ouml;tigten Bauteilen. Um sich nicht auf bestimmte Bauformen
f&uuml;r die beiden m&ouml;glichen Lastrelais festlegen zu
m&uuml;ssen, sind die Relaisanschl&uuml;sse nur als L&ouml;taugen
ausgef&uuml;hrt. Bitte beachten Sie die 5 L&ouml;tbr&uuml;cken, die
auf dem Best&uuml;ckungsplan dick eingezeichnet sind. F&uuml;r den
Netzanschlu&szlig; wurde eine 2 polige Anschlu&szlig;klemme
vorgesehen. Alle weiteren Anschl&uuml;sse k&ouml;nnen steckbar
&uuml;ber L&ouml;tn&auml;gel und passende Steckschuhe vorgenommen
werden.
<br>
</p>
<p><b> 9. Tips zur Software </b>
<br>Der ATARI TT zum Beispiel f&uuml;hrt direkt nach dem Einschalten
zun&auml;chst einmal einen ausf&uuml;hrlichen Speichertest durch.
Dieser l&auml;&szlig;t sich zwar per Tastendruck abbrechen, aber wer
soll den Tastendruck ausf&uuml;hren, wenn keiner zu Hause ist? Abhilfe
schafft ein kleines Programm von J. Starzynski namens
&quot;WAIT.PRG&quot;. Es schreibt ein kleines ausf&uuml;hrbares
Programm in den Bootsektor der Startdiskette, das nach einer
vorw&auml;hlbaren Zeit (wird auch zum Hochfahren der Festplatte
ben&ouml;tigt) einen Tastendruck simuliert und dadurch den
Speichertest des Betriebssystems abbricht.
<br>
</p>
<p>Nun steht dem schnellstm&ouml;glichen Hochfahren des Rechners und
dem ordnungsgem&auml;&szlig;en Entgegennehmen einen Anrufes / Faxes
nichts mehr im Wege!
<br>
</p>
<p><b> 10. Probleme </b>
<br>Die am h&auml;ufigsten auftretenden Probleme beim
vollautomatischen Faxempfang mit dem Computer sind Zeitprobleme! Es
dauert nun einmal eine gewisse Zeit bis nach dem Einschalten die
Festplatte betriebsbereit und der Computer hochgefahren ist. Auch die
Faxsoftware braucht mehr oder weniger lange, das Modem zu
initialisieren, abzuheben, die Art des Anrufes zu identifizieren und
zu guter letzt die Verbindung aufzubauen. Hier sind aber Grenzen
gesetzt! Ein Industriefaxger&auml;t wartet in der Regel nach dem
ersten Klingelsignal ca. 60 Sekunden. Wenn dann kein FAXCONNECT
zustandegekommen ist, wird die Prozedur abgebrochen und nach einer
gewissen Zeit (ca. 2-3 Minuten) ein erneuter Versuch gestartet. Es
gilt also, Zeit zu sparen: -&gt; Man sollte die
<a href="1409.htm" target="UDOcon">Einschaltverz&ouml;gerung</a>, die auf die Bereitschaft der Festplatte
wartet, so gering wie m&ouml;glich halten! -&gt; Der Rechner sollte
f&uuml;r den automatischen Faxempfang in einer abgespeckten Version
hochgefahren werden (keine unn&ouml;tigen Accessories oder
Autoordnerprogramme)! -&gt; Die Software und/oder das Modem sollte so
voreingestellt sein, da&szlig; sofort nach dem ersten eingehenden
Klingelsignal abgehoben wird! So manche Faxweichen k&ouml;nnen dem
&quot;Computerfaxer&quot; das Leben ganz sch&ouml;n schwer machen!
Zun&auml;chst einmal erfolgt die Computereinschaltung schon mit der
Verz&ouml;gerung, die die Faxweiche nach dem Abheben f&uuml;r die
Anruferkennung ben&ouml;tigt. Das k&ouml;nnen schon mal zwei
entscheidende Klingelzeichen sein. Dann schaltet die Faxweiche (die
Telekom will es so...) nach dem achten Klingelsignal zum Faxger&auml;t
(Modem) ab. In besonders ung&uuml;nstigen Konstellationen kann es
sein, da&szlig; man es einfach nicht schafft, rechtzeitig die
Faxverbindung herzustellen. Wenn dann alle Optimierungsversuche nichts
n&uuml;tzen, bleibt nur die Hoffnung, da&szlig; das anrufende
Faxger&auml;t einen zweiten Versuch unternimmt. Und den lassen wir uns
dann nicht durch die Lappen gehen! Dazu verl&auml;ngern wir einfach
die im Abschnitt II,2 beschriebene Ausschaltverz&ouml;gerung von ca.
60 Sekunden auf eine Zeit von ca. 5-6 Minuten. Das gibt das verwendete
IC (74 HC 221) noch gut her, wenn man den Widerstand R4
vergr&ouml;&szlig;ert (5 Minuten = 510K / 6,5 Minuten = 680K).
<br>
</p>
<p>
<br>
<br><b> 11. ST&Uuml;CKLISTE: </b>
<br>
</p>
<p>Widerst&auml;nde:
<br>33K R1,R2,R3,R5,R7, R13,R20
<br>100K R4,R25,R26,R8
<br>4K7 R6,R10,R24
<br>10K R29
<br>470K-Trimmer R9
<br>220K R11
<br>270 R12
<br>2K2 R14,R15,R16,R17,R18,R21
<br>1K R19,R22
<br>18K R23,R31
<br>1M-Trimmer R27
<br>200K R28
<br>22K R30
<br>
<br>
</p>
<p>Kondensatoren:
<br>1000MF/16V C1,C6
<br>0.33MF C2
<br>10MF/16V C3
<br>22MF/16V C4,C9
<br>100MF/16V C8
<br>4,7MF/16V C5,C7
<br>470nF C10
<br>47MF C11,C16
<br>2,2MF/16V C14
<br>220nF C12
<br>10nF C13
<br>47nF C15
<br>
</p>
<p>
<br>Halbleiter:
<br>74 HC 221 IC1,IC2,IC3
<br>LM 741 CN IC4
<br>BC 238 o.&auml;. T1,T2,T3
<br>BC 558 o.&auml;. T4
<br>BC 547 o.&auml;. T5
<br>1 N 4148 o.&auml;. D1,D2,D3,D4,D5,D6,D7,D8,D13
<br>1 N 4007 D9,D10,D11,D12
<br>ZPD27V, 1,3W ZD1
<br>CNY 17 OK1,OK2
<br>
<br>
</p>
<p>Sonstiges: 1 Blinkleuchtdiode LED 1
<br>5 LOW-Current-LED (versch.Farben) LED 2,3,4,5,6
<br>1 Taster 1xUM RT1
<br>1 Schalter 2xUM S1
<br>1 Feinsicherung 0,2A + Halterung Si
<br>1 Trafo EI30-1,5VA 6V / 250mA
<br>1 Br&uuml;ckengleichrichter B 40 C 800 GR1
<br>1 ECM = Electret Condenser Mikrofon
<br>1 Spannungsregler 6 Volt, 200mA
<br>1 Relais 1xUM z.B. GBR10.1-11.06. (6V/8A/250V) Relais 1
<br>1 DIL-Relais 1xUM 5V/200 Ohm Relais 2
<br>1 elektr. Lastrelais z.B. CRYDOM TD2410 + Schutzkappe ELR
<br>1 Anschlu&szlig;klemme (2pol.)
<br>( 1 passendes Geh&auml;use )
<br>
<br>
</p>
<p>Das Programmlisting, das original Archiv vom <a href="0201.htm" target="UDOcon">Autor</a>, alle Texte im
Original sowie die Schaltpl&auml;ne finden sie im Archiv
&quot;AESCHALT.ZIP&quot; im erweiterten Downloadbereich meiner
Homepage.
<br>
</p>
<p><a href="http://www.doitarchive.de/down/aeschalt.zip" target="_top">AESCHALT.ZIP</a>
</p>
<p>Zu diesem Ger&auml;t gibt es nur noch zu sagen das es seit
-Jahren- bei mir Problemlos mit einem 520ST, sp&auml;ter mit einem
Atari Falcon, seinen Dienst als &quot;Anrufbeantworter&quot; erledigt
hat.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="1401.htm" target="UDOcon"><img src="udo_lf.gif" alt="METEX DMM Multimeter" border=0 width="24" height="24"></a>
<a href="1403.htm" target="UDOcon"><img src="udo_rg.gif" alt="Junior Prommer" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
