<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: L&uuml;fterregelung
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="1404.htm" target="UDOcon"><img src="udo_lf.gif" alt="Dela Prommer" border=0 width="24" height="24"></a>
<a href="1406.htm" target="UDOcon"><img src="udo_rg.gif" alt="Centronics-Buffer" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="L_26uuml_3Bfterregelung">20.5 L&uuml;fterregelung</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt>Eine L&uuml;fterregelung im Atari zur
Ger&auml;uschreduzierung.</tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>
<br>
</p>
<p>Wenn st&ouml;ren nicht die allgemeinen L&uuml;fterger&auml;usche
in Atari Computern und in der Hauptsache an Orinalen Atari
Festplatten?
<br>
</p>
<p>Es gibt Dinge &uuml;ber die man ziemlich ausf&uuml;hrlich
diskutieren kann, und es gibt welche, bei denen man erst
&uuml;berhaupt nicht anzufangen braucht, hierzu z&auml;hlen eben auch
diese dort verwendeten Ventilatoren.
<br>
</p>
<p>Weder der Typ des eingebauten L&uuml;fters, noch das Kaufdatum
eines Atari-Ger&auml;tes spielen hierbei eine besondere Rolle - das
Ger&auml;t ist einfach mal nur laut.
<br>
</p>
<p>Da ich noch die letzten warmen Monate des letzten Jahres
abgewartet habe, und ich auch nicht jeden Tag meine Zeit damit
verbringe solche Anleitungen zu schreiben, kommt es eben halt erst
jetzt genau richtig zur warmen Jahreszeit.
<br>
</p>
<p>Es spricht also alles daf&uuml;r ca. 15,- DM f&uuml;r eine
L&uuml;fterregelung dranzuh&auml;ngen, und diese eben in den Atari
oder die entsprechende Festplatte einzubauen. Viele Leute werden
sicher bedenken wegen der Atari-Garantie haben, die ja bei einem
Eingriff in das Ger&auml;t erlischt, und der eigentlichen Arbeit, die
nicht Fachm&auml;nnern nat&uuml;rlich schwerer f&auml;llt.
</p>
<p>Die beste L&ouml;sung ist wenn man jemanden damit beauftragt der
sich damit auskennt.
<br>Der ganze Einbau in ein Ger&auml;t dauert ca. eine halbe Stunde.
<br>
</p>
<p>Vom Prinzip her sind alle hier genannten M&ouml;glichkeiten auf
-jeden- L&uuml;fter der irgend wo in irgend einem Computer eingebaut
ist, direkt &uuml;bertragbar. Von dem Mist mit in Reihe geschalteter
Widerst&auml;nde ist Abzuraten. Das ist zwar billig, geht schnell,
bringt aber gar nichts mehr wenn dieser Widerstand ausf&auml;llt oder
der L&uuml;fter bei zunehmender Verschmutzung des Fl&uuml;gelrades
nicht mehr anl&auml;uft. Im Ernstfall kostet sie das den Chip, auf dem
dieser L&uuml;fter mit der &quot;Billigheimermethode&quot; angewendet
wurde.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/fan2.gif" border=0 width="580" height="400"></p><br>
<div align=center><tt> Abbildung 1 - so setzen Sie den Regler korrekt ein </tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Ich benutze also wie schon erw&auml;hnt eine L&uuml;ftersteuerung
eines Elektronikversenders, in diesem Fall ein Bausatz f&uuml;r 15,-
DM aus dem ELV-Magazin, es eignet sich nat&uuml;rlich auch jede andere
L&uuml;ftersteuerung. Conrad-Elektronik bietet zu diesem Zweck
ebenfalls solche Steuerungen auch fertig an. Selbstredend tut es auch
eine Steuerung auf einer Lochrasterplatine die man sich eben aus
Einzelteilen selber angefertigt hat. Einen passenden <a href="190d.htm" target="UDOcon">Schaltplan</a> finden
Sie hier in diesem Artikel weiter unten
<br>
<br>
<br>
</p>
<p align=center><img src="image/fan1.gif" border=0 width="306" height="218"></p><br>
<div align=center><tt> Abbildung 2 - Eine einfache L&uuml;fterregelung</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Meine Schaltung kann auf einer 4*4 cm Lochrasterplatine aufgebaut
werden.
<br>Es gibt kein Platinenlayout dazu, daf&uuml;r passt das kleine Teil
einfach &uuml;berall rein
<br>
</p>
<p>Einen Selbstbau steht nichts im Weg, hier halbiert sich der Preis
da die elektronischen Einzelteile im Prinzip jeweils nur
Pfennigartikel sind. Unterschiedlich von Schaltung zu Schaltung ist
einzig der Bauteileaufwand. Noch wesentlich einfacher h&auml;lt sich
die Sache bei Verwendung eines der neueren Papstl&uuml;fter, hier
befindet sich die Temperaturregelung gleich im Motorgeh&auml;use des
L&uuml;fters. Man spart sich so auf jeden Fall die gesamte Arbeit mit
der Reglerplatine, obgleich diese L&uuml;fter mit ca. 55 DM um einiges
teurer sind. Daf&uuml;r braucht man dann aber nur den alten
L&uuml;fter gegen den neuen geregelten zu ersetzen
<br>
</p>
<p>Enth&auml;lt ein Ger&auml;t einen L&uuml;fter sollte man diesen
auch nicht wegen den Ger&auml;uschen komplett aus dem Ger&auml;t
entfernen, manche Leuten machen das ja so, einige warme Tage mit
erh&ouml;hten Temperaturen sprechen aber immer dagegen. Auch erscheint
mir der Einsatz eines Festspannungsreglers, z.B einem 7808, nicht
besonders geeignet da dieser Regler eben zus&auml;tzlich auch noch
reichlich warm wird. Selbstverst&auml;ndlich Funktioniert auch das in
der gezeigten Art u. Weise wie es in Abbilung 1 zu sehen ist. Nicht zu
Empfehlen ist es ganz ohne L&uuml;fter zu arbeiten wenn sich im Atari
z.B noch Hardwarebeschleuniger oder &auml;hnliches befindet.
L&ouml;sungen mit Widerst&auml;nden in der L&uuml;fterzuleitung sind
nicht zu Bevorzugen, da es hier bei einer falschen Berechnung des
Widerstandes ausf&auml;lle geben kann. Gerne werden solche 'billige'
L&ouml;sungen an verschiedenen Stellen propagiert. An hei&szlig;en
Tagen kann der Luftdurchsatz eben dann nicht mehr ausreichend sein.
Ein W&auml;rmestau und Temperaturbedingte aussetzer des Rechners
w&auml;ren sicher die Folge einer falschen Sparsamkeit.
<br>
</p>
<p>Mit dem zunehmenden Alter und der Verschmutzung des L&uuml;fters
kann kein sicherer Anlauf gew&auml;hrleistet werden kann. Eine Reglung
'dreht' beim Einschalten eben solange die Spannung hoch bis der Motor
sicher l&auml;uft, sofern kein defekt des Motors vorliegt. Erst danach
beginnen die meisten fertigen Reglerschaltungen die Drehzahl des
L&uuml;fters auf die vorhanden (gemessene) Temperatur einzustellen.
<br>
</p>
<p>Auch gibt es bereits Schaltungen die den L&uuml;ftermotor
zus&auml;tzlich &uuml;berwachen und auch ein akkustisches Signal
aussenden wenn es zum Ausfall des L&uuml;fters kommen sollte
<br>
</p>
<p>Die Reglerplatine sollte auf keinen Fall irgendwelche Bauteile
ber&uuml;hren oder gar irgendwo auf die Computer-Chips ect. aufgeklebt
werden. Teilweise werden die Chips doch ganz sch&ouml;n warm, das
aufkleben einer Platinenhalterung ect. w&uuml;rde also nur den
W&auml;rmeabtransport behindern. Ferner sollte man bei Einbau gleich
daran denken, da&szlig; in das Ger&auml;t nachtr&auml;glich noch recht
gro&szlig;e Erweiterungskarten eingesteckt werden k&ouml;nnen. Also
nicht jetzt schon wertvollen Platz verbauen!(!nl)
</p>
<p>Der Temperatursensor wurde von mir vorher von der Reglerplatine
entfernt und mit zwei Dr&auml;hten passend verl&auml;ngert; so
da&szlig; er n&auml;her am <a href="10.htm" target="UDOcon">Netzteil</a> zum liegen kommen kann. Das
d&uuml;rfte sicher die w&auml;rmste Stelle im ganzen Geh&auml;use
sein. Der Sensor ist bei meiner L&ouml;sung mit einem winzigen Tropfen
Hei&szlig;kleber an der Netzteilplatine fixiert, man will ja keine
Spazierg&auml;nger im Rechner haben, und ist von der Platine weg nach
oben leicht nach oben gebogen.
<br>
</p>
<p>Weiterhin hat man immer die M&ouml;glichkeit auf komplett
Temperaturgesteuerte Papst-L&uuml;fter zur&uuml;ckzugreifen. Diese
gibt es in allen denkbaren Baugr&ouml;ssen und Kosten idR ca. 50 DM.
Diese L&uuml;fter eignen sich auch sehr gut um laute Billigl&uuml;fter
in Schaltnetzteilen rasch zu ersetzen.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/fan.gif" border=0 width="410" height="92"></p><br>
<div align=center><tt>Abbildung 3 - Die Verschaltung eines geregelten
Papst-Variofan.</tt>
<br>
</div>
<p>
<br>
<br>
</p>
<p>Zu jeden VarioFan wird ein passender NTC-Widerstand geliefert der
nach obigen Schema verdrahtet wird. Das ist bei den meisten VarioFans
v&ouml;llig identisch. Es ist kein Problem das bei dem
Papst-L&uuml;fter auch der Sensor fest mit dem L&uuml;fter verbunden
ist, es gen&uuml;gt auch f&uuml;r den Falle, sollte der Sensor direkt
im Abluftstrom sitzen, zu einer vollst&auml;ndigen Reglung!
<br>Es bleiben die beiden &uuml;blichen Anschlu&szlig;leitungen
f&uuml;r die Versorgungsspannung &uuml;brig die an den ensptechenden
Stellen im Computer angeschlossen werden.
<br>
</p>
<p>Bei Computern ist es ratsam die Luft aus dem Geh&auml;use zu
saugen, nicht hineinblasen lassen. Es kommt so weniger Dreck aus der
Umgebung in den Rechner
<br>
<br>
<br><b> Eine weitere Schaltung </b>
<br>
</p>
<p>Von : Sieghard Schaefer @ BB (Mi, 30.10.91 17:43)
<br>
</p>
<p>Hier finden Sie eine weitere einfache Schaltung um einen lauten
12Volt L&uuml;fter in der Drehzahl zu regeln
<br>
</p>
<pre>12V o-*---*----*---------------,
      |   |    |               |
      |  ,-,   | +            /-\        P1 : Trimmpoti 470k
      '-&gt;| |  ===            | M |       R1 : 12k
      P1 | |  === C1          \_/        R2 : 18k
         '-'   |               |         R3 : 47R
          |    |           T1  *----,    C1 : 47uF, 20V
          |    |  ,___,      |/  R3 |    D1 : 1N4148 o.&auml;.
          '----*--|___|--*---|     ,-,   T1 : BC238 o.&auml;.
               |   R2    |   |\    | |   M  : Original-L&uuml;fter 40mm
              ,-,        |     V   | |
              | |       _|_    |   '-'   Mit dem Trimmpoti P1 l&auml;&szlig;t sich die
           R1 | |    D1 /_\    |    |    Drehzahl einstellen, durch R3 wird
              '-'        |     |    |    ein Stillstand des L&uuml;fters verhindert.
               |         |     |    |    C1 bewirkt ein 100%iges Anlaufen des
0V o-----------*---------*-----*----'    L&uuml;fters. D1 ist zum Schutz von T1 da.
                (c) SSCH 7.10.90
</pre>
<p>&Uuml;ber den Trimmpoti habe ich den L&uuml;fter ganz leicht
runtergedreht, damit er nicht mehr im Bereich der Resonanzfrequenz im
Geh&auml;use l&auml;uft. Die Schaltung passt auf eine ca. 10*15mm
kleine Lochrasterplatine. L&auml;uft seit einem Jahr absolut
problemlos und hat an Bauteilen h&ouml;chstens DM 5.- gekostet.
</p>
<p>
<br>
<br><b> Aufgeklebte L&uuml;fter oder K&uuml;hlk&ouml;rper entfernen
</b>
<br>
</p>
<p>L&ouml;ten sie immer zuerst die Anschlu&szlig;leitungen ab.
Markieren sich sich die L&ouml;tstellen f&uuml;r + und - auf der
Platine.
<br>
</p>
<p>(Disclaimer: Nat&uuml;rlich keine Gew&auml;hr f&uuml;r
irgendwas!):
<br>
</p>
<p>- durch Anbohren des K&uuml;hlk&ouml;rpers oder Auf-/Einklemmen
einen ca.10 cm langen stabilen Stahldraht (3-4mm) am
K&uuml;hlk&ouml;rper befestigen (die Verwendung einer Zange war mir
immer zu unsicher, da man bei dem erforderlichen, z&uuml;gigen
Arbeiten leicht abrutschen k&ouml;nnte)
<br>
</p>
<p>- der &quot;Hebel&quot; mu&szlig; dabei so angebracht sein,
da&szlig; er sp&auml;ter das Drehen des K&uuml;hlk&ouml;rpers auf der
Klebe-Fl&auml;che erm&ouml;glicht, ohne sich die Finger zu
&quot;verbrennen&quot;!
<br>
</p>
<p>- den K&uuml;hlk&ouml;rper mit einem Hei&szlig;luftgebl&auml;se
auf hoher Einstellung (ca. 150 Grad C) solange erhitzen, bis die
Klebefl&auml;che weich wird und sich der K&uuml;hlk&ouml;rper auf der
Klebefl&auml;che &quot;rotierend&quot; abdrehen l&auml;&szlig;t
<br>
</p>
<p>- schnelles Arbeiten verhindert zuverl&auml;ssig eine zu
gro&szlig;e Erhitzung des Chipinneren, der Kleber wurde
*sp&auml;testens* bei etwa 100 Grad C so weich, das der
K&uuml;hlk&ouml;rper sich sicher abdrehen lie&szlig;...
<br>
</p>
<p>- Die Klebestelle ist hinterher komplett zu Reinigen. Dazu gibt es
L&ouml;semittel f&uuml;r Klebstoffe. Ein neuer L&uuml;fter &amp;
K&uuml;hlk&ouml;rper k&uuml;hlt nur korrekt wenn er sauber und plan
auf der Chipoberfl&auml;che befestigt wird. Dabei sollten auch kein
Luftspalt zwischen Chip u. K&uuml;hlk&ouml;rper entstehen.
<br>
</p>
<p>- Zum erneuten befestigen verwendet man ausschliesslich
W&auml;rmeleitkleber aus dem einschl&auml;gigen Fachhandel.
<br>
</p>
<p>
<br>
<br><b> Technical.. </b>
<br>
</p>
<p>Modern fans have a miniature blob of electronics inside, to
control the brushless DC motor in the core. I am not sure that this
electronics would like very much to be supplied a reduced voltage..
<br>
</p>
<p>The electronics serve to switch the field polarity of the coils,
so that they are constantly being repelled from the surrounding
circular magnet. The magnet has N-S-N-S poles, and a Hall effect
sensor detects the change of magnetic field and thus allows the coil
switching to be correctly timed. The coils are fixed, so the magnet
and thus the fan blades are forced to rotate.
<br>
</p>
<p>The fan won't appreciate too little a voltage, it will simply
stall or just not start. I'd favour pulsing it on and off, varying the
on/off ratio to vary the speed, or a 47R or so resistor in series with
it. Too small a pulse or too high a resistor and it won't start.
<br>
</p>
<p>An better way is to use an external electronic they managed the
start up and the power regulation of the fan if it is running.
Integrated temperatur controled simple electronics are welcome. You
found schematics in german part upper. They are all testet well and
they all long time works as in my own hardware. I doasn't use any
computer, external hard drive or some else with an non regulated fan.
<br>
</p>
<p>Makes real silent offices.. :)
<br>
</p>
<p>Spending a bit of money on a good quality fan will help, a proper
ball-bearing one will surely bring its own rewards. Most better are
liquid holded fans.
<br>
</p>
<p>
<br>
</p>
<p>Various ideas were mentioned here on the subject of reducing or
removing fan noise.
<br>
<br>
</p>
<p>But, are you sure that all this is good to do?
<br>
</p>
<blockquote>
<p>- I am inclined to think that the grille over the fan would in
fact muffle the noise somewhat, not increase it, so removing the
grille may have the effect opposite to one desired.
</p>
<p>- AFAIK (at least some of) the fans have a miniature blob of
electronics inside, to control the brushless DC motor in the core. I
am not sure that this electronics would like very much to be supplied
a reduced voltage. (But it works, some modified hardware sounds good
after long time)
</p>
<p>- If the thermostatic control circuit turns the fan on/off
intermittently this may, respecting Murphy's law, result in
fluctuating temperature in the computer box. This is in fact a
closed-loop-control situation and I suspect that a mistuned loop may
even, if one is unlucky, result in larger temperature swings than in
the &quot;uncontrolled&quot; variant. Btw. temperature cycling
increases fatigue risks in chips and solder joints.
</p>
<p>- The fan uses 12V DC. This creates a (small) load on the power
supply but this load may be neseccary for the power supply to operate
properly (especially if one tries it out of the computer). A warning
about this can be found on <a href="10.htm" target="UDOcon">Netzteil</a> part of this archive.
</p>
</blockquote>
<p>
<br>
</p>
<p>Cooling fans DO become noisy after a while on a quite regular
basis, and need replacement. They are, in fact, expendables. They also
need an occasional cleaning because the accumulated dust may cause
imbalance which causes additional noise.
<br>
</p>
<p>Oiling the shaft of a noisy fan with light silicone oil may reduce
noise for a while, but this should be considered a temporary measure.
<br>
</p>
<p>Small cooling fans tend to come in two form factors, say
&quot;thick&quot; and &quot;thin&quot;, e.g. the fan fitting for a
MegaST come in about 10mm and 20mm thickness. I would suggest using
the thicker fan because the distance between shaft bearings is wider,
and the loads caused on the bearings by residual dynamic mass
imbalances are smaller. I have used twice on anyones MegaST the
&quot;thin&quot; cooling fans and their life was not very long before
they became noisy. Then I found a &quot;thick&quot; fan and it lasts
here for a long time now.
<br>
</p>
<p>Another simple way is to buy an ready to use regulated Papst
Variofan. They only had 3 wires to connect as you found in schematics
below. They all had ball-bearing shafts an they are all real silent.
This manufacure had an good name in germany. No resistor, external
electronic ore some else needed. Simple to replace.
<br>
</p>
<p>They produce fans for any device.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="1404.htm" target="UDOcon"><img src="udo_lf.gif" alt="Dela Prommer" border=0 width="24" height="24"></a>
<a href="1406.htm" target="UDOcon"><img src="udo_rg.gif" alt="Centronics-Buffer" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
