<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Videotextdecoder
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="140a.htm" target="UDOcon"><img src="udo_lf.gif" alt="Fischertechnik" border=0 width="24" height="24"></a>
<a href="140c.htm" target="UDOcon"><img src="udo_rg.gif" alt="HAM Interfaces" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Videotextdecoder">20.11 Videotextdecoder</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Falcon F030 mit Videotextdecoder</tt>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>Das c't Magazin stellte in seiner Ausgabe 1-2/91 einen externen
Videotextdecoder vor der bei mir jahrelang am ST gelaufen ist und sich
mit wenig Aufwand auch am Falcon F030 zu betreiben l&auml;sst. Das
geht hier an der seriellen Modem2 Schnittstelle oder aber bequemer an
einem der Extended-Joystickports. Sicherlich werden viele Leute an
Modem2 eben ein Modem betreiben wollen. Der LAN-Port scheidet hier aus
da diese Schnittstelle von keinem Treiber der beiden mir bekannten
VT-Programme unterst&uuml;tzt wird.
<br>
</p>
<p>Eine Leerplatine gab es als ebenfalls beim c't-Verlag so das man
sich hier den Nachbau releativ einfach machen konnte. Auch sollte der
Verlag noch in der Lage sein die entsprechenden Artikel aus dem
c't-Magazin vorr&auml;tig zu haben. Einen guten Griff tut man halt
wenn man diesen c't Decoder irgendwo g&uuml;nstig gebraucht Auftreiben
kann.
<br>
<br>
</p>
<p>Die Pinbelegung des Decoderanschlu&szlig;kabels Enhanced
Joystickports:
</p>
<pre>
Decoder Pin      Falcon ext. Joystickport A oder B
--------------------------------------------------
Decoder GND     ----------------------------- 3
Decoder +5V     ----------------------------- 7
Decoder SDA-OUT ----------------------------- 6
Decoder SCL     ----------------------------- 2
Decoder SDA-IN  ----------------------------- 1
--------------------------------------------------

</pre>
<p>
<br>
</p>
<p>Die Pinbelegung des Decoderanschlu&szlig;kabels f&uuml;r Mausport:
</p>
<pre>
Decoder Pin               TT/ST/Falcon Mausport
--------------------------------------------------
Decoder GND     ----------------------------- 8
Decoder +5V     ----------------------------- 7
Decoder SDA-OUT ----------------------------- 6
Decoder SCL     ----------------------------- 2
Decoder SDA-IN  ----------------------------- 1
--------------------------------------------------

</pre>
<p>
<br>
</p>
<p>Die Pinbelegung des Decoderanschlu&szlig;kabels f&uuml;r serial
Port:
</p>
<pre>
Decoder Pin               TT/ST/Falcon serial
--------------------------------------------------
Decoder GND     ----------------------------- 5 +ext. Netzeil
Decoder +5V     -----------------------------   +ext. Netzeil
Decoder SDA-OUT ----------------------------- 2
Decoder SCL     -----------------------------
Decoder SDA-IN  ----------------------------- 3
--------------------------------------------------

</pre>
<p>
<br>
</p>
<p>Verwenden Sie abgeschirmtes Kabel!
<br>
<br>
</p>
<p>Nat&uuml;rlich mu&szlig; das verwendete Videotextprogramm den
Anschlu&szlig; am Ext. Joystickport des Falcons unterst&uuml;tzten.
Meines Wissens nach ist das bisher nur bei der Software von Armin
Schneider@FR der Fall. Der Support f&uuml;r dieses Programm wurde
allerdings in diesem Jahr eingestellt da Armin sich anderweitig
bet&auml;tigt.
<br>
</p>
<p>Diese Software sollte noch in der Maus @FR zu finden sein. Auch
Alexander Heinrich hat f&uuml;r genau diesen Decoder Software parat
die hier aber nur arbeitet wenn der Decoder an der seriellen
Schnittstelle des Falcons auch wirklich angeschlossen ist.
<br>
</p>
<p>Zum Betrieb des Decoders am Falcon wir der MAX232 auf der
Decoderplatine nicht ben&ouml;tigt, man kann diesen Weglassen oder am
besten ausbauen.
<br>Gut wer diesen Chip beim Decoderbau gesockelt hat.
<br>
</p>
<p>Die Leitungen des Ext. Joystickport am Falcon haben TTL-Pegel so
das dieser Chip nicht mehr ben&ouml;tigt wird. Pin 1 des Joystickport
wird als Decoder SDAin verwendet und wird am gleichnamigen Punkt am
Decoder angel&ouml;tet. SCL wird an Punkt 3 angel&ouml;tet und
f&uuml;hrt somit direkt zu Pin 32 des SAA5246, also dem eigentlichen
Decoderchip. Pin 24 des Decoderchip wird mit Punkt 6 verbunden und
bildet damit SDAout. Selbstredend k&ouml;nnte man noch die +5V aus dem
Falcon entnehmen. Das bereitet bei mir bis heute keinerlei Probleme.
<br>
</p>
<p>Es wird erst zum Problem bei einem Kurzschlu&szlig;!!
<br>
</p>
<p>Besser ist es schon den VT-Decoder aus einem Steckernetzteil zu
versorgen.
<br>
</p>
<p>Die Leitung zwischen Decoder und Videoquelle ist bei mir 2 Meter
lang, es wird auch mit einer Leitungsl&auml;nge bis 10 Meter
problemlos laut dem Handbuch einer Decodersoftware laufen.
<br>
</p>
<p>Als Videosignal gen&uuml;gt das Composit Videosignal von einem TV
oder oder einem Videorecorder, man greift das Signal hier einfach an
Pin 20 (Comp.<a href="12.htm" target="UDOcon">Video</a>) und Pin 19 (GND) in einem Scartstecker ab. Will
man den Videotext von diesem Decoder nicht auf dem laufenden TV
einblenden gen&uuml;gt das als Kabelverbindung zur Videoquelle.
<br>
<br>
<br>
</p>
<p align=center><img src="image/vtdecode.gif" border=0 width="655" height="280"></p><br>
<div align=center><tt> Abbildung 1 - c't Videotextdecoder im offenen
Geh&auml;use</tt>
</div>
<p>
<br>
<br>
</p>
<p>Hier sieht man den fertig aufgebauten c't-Decoder im eigens von
mir angepasstem Minigeh&auml;use. Die Stromversorgung erfolgt bei mir
aus dem <a href="10.htm" target="UDOcon">Netzteil</a> des Falcon direkt &uuml;ber die entsprechenden
DB9-Buchse f&uuml;r den Anschlu&szlig; an den Rechner, rechts die
DB15-Buchse zum Anschlu&szlig; an eine Videoquelle zu sehen. Oben
links im auf der Decoderplatine sieht man das der MAX232 bei mir
fehlt. Diesen RS232-Pegelwander ben&ouml;tigt man nur wenn man den
Decoder an einer seriellen Schnittstelle betreiben m&ouml;chte. Der
Ext. Joystickport am Falcon arbeitet mit normalem TTL-Pegel so
da&szlig; man diesen Baustein einsparen kann. Die ge&auml;nderten
Anschl&uuml;sse befinden sich nat&uuml;rlich auf der
Platinenunterseite.
<br>
</p>
<p>Wo heute eigentlich jedes TV-Ger&auml;t einen eingbauten Decoder
besitzt ist ein externer VT-Decoder eigentlich ein
&uuml;berfl&uuml;ssiger Luxus, aber der einzige mir bekannte Weg
Videotext auf dem Computer zu benutzten.
<br>Zumal es hier unter einem Multitasking BS nebenher zu betreiben
ist.
<br>
</p>
<p>
<br><b> Technisches zum Videotextdecoder </b>
<br>
</p>
<p>Von: Uwe Werner
<br>
</p>
<p>Es ist nicht unbedingt sinvoll, SCL in dieser Weise (mit einem
einzigen Schreibzugriff) auf 'Hi' bzw. 'Lo' zu setzen. Das mag zwar in
den allermeisten F&auml;llen funktionieren, aber man sollte jedoch den
Wert der &uuml;brigen Bits dieses Registers nicht einfach voraussetzen
und wie in c't angegeben &uuml;berschreiben. Das kann Probleme mit
softwarem&auml;&szlig;igen Monitorumschaltern usw. ergeben.
<br>
</p>
<p>Besser ist es, das Register des Sound-Chips erst zu lesen, nur das
eine Bit zu ver&auml;ndern und dann wieder zur&uuml;ckschreiben. Damit
kein Interrupt dazwischenfunkt, m&uuml;ssen diese gesperrt werden, das
sieht dann so aus:
<br>
</p>
<pre>
  SCH/L:  MOVE    SR,-(SP)        ;Status retten
          ORI     #$0700,SR       ;Interrupts sperren
          MOVE.B  #$0E,SOUNDBASE  ;REG. 14 selektieren
          MOVE.B  SoundBase,D4    ;Register lesen
          ORI.B   #$08,D4         ;IOA3 (RTS) setzen
    bzw.  ANDI.B  #$F7,D4         ;IOA3 (RTS) l&ouml;schen
          MOVE.B  D4, SoundBase+2 ;Register schreiben
          MOVE.B  (SP)+,SR        ;Status wieder herstellen
          RTS

</pre>
<p>Die f&uuml;r das Timing erforderlichen NOPs k&ouml;nnen dann
(teilweise) weggelassen werden, da die ge&auml;anderten Routinen lahm
genug sein d&uuml;rften.
<br>
</p>
<p>Auch die c't Hardware ist verbesserungsf&auml;hig (siehe
beigelegten <a href="190d.htm" target="UDOcon">Schaltplan</a>):
<br>(Als .IMG gesondert u.a Anfrage erh&auml;ltlich)
<br>
</p>
<p>Bei meinem Videotext-Adapter wird auch SCL &uuml;ber einen
Transistor vom RTS-Signal der seriellen Schnittstelle bedient und kann
'r&uuml;ckw&auml;rts' durch den MAX232 an CTS gelesen werden. Das hat
den Vorteil, da&szlig; auch die SCL-Leitung Open-Collector-Charakter
bekommt und weitere Master an den I2C-Bus angeschlossen werden
k&ouml;nnen. Bei SCL-Bedienung durch den MAX232 d&uuml;rfte dies zu
Problemen f&uuml;hren, da dieser keine OC-Ausg&auml;nge hat sondern
feste Pegel ausgibt.
<br>
</p>
<p>Als Erg&auml;nzung zur Schaltung w&auml;re noch zu sagen,
da&szlig; ein 1uF-Kondesator vom Schleifer von Tr1 nach Masse nicht
schaden kann und auch die RGB-Puffer aus c't 7/92 der Schaltung nicht
schlecht zu Gesicht stehen. Die Jumper J1 und J2 sind je nach
H&ouml;he und Quelle der Betriebsspannung zu setzen, bzw. wegzulassen.
Pin 10 der Scartbuchse ist i.A. frei und kann im FS-Ger&auml;t an
einer geeigneten Spannung angeschlossen werden. J3 ist bei langer
FBAS-Leitung zu setzen, wie in c't beschrieben.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="140a.htm" target="UDOcon"><img src="udo_lf.gif" alt="Fischertechnik" border=0 width="24" height="24"></a>
<a href="140c.htm" target="UDOcon"><img src="udo_rg.gif" alt="HAM Interfaces" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
