<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Scanner
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="140d.htm" target="UDOcon"><img src="udo_lf.gif" alt="Exposure Lichtsteuerung" border=0 width="24" height="24"></a>
<a href="140e01.htm" target="UDOcon"><img src="udo_rg.gif" alt="Scanner am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Scanner">20.14 Scanner</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Scanner am Atari und kompatiblen Systemen </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p>7.9.2000
<br>Scanner am Atari und kompatiblen Systemen
<br>Von Thomas Kerkloh / Atos Magazin
<br>
</p>
<p>Atarianer haben es schon schwer: da bietet der &quot;ich bin ja
bl&ouml;d&quot;-Markt um die Ecke einen so g&uuml;nstigen DIN
A4-Scanner f&uuml;r nur 80,00 DM an und man kann dabei nicht ruhigen
Gewissens zugreifen. Gibt man der Versuchung trotzdem nach, so geht es
bei der Inbetriebnahme am heimischen Atari oft mit Problemem los.
<br>
</p>
<p>
<br>Dabei h&auml;tte er sich den weiteren &auml;rger ersparen
k&ouml;nnen, er h&auml;tte nur diesen extra f&uuml;r solche F&auml;lle
geschriebenen Artikel der ATOS lesen m&uuml;ssen ...
<br>
</p>
<p>
<br><b> Inhalt: </b>
<br>
</p>
<p>Klartext
<br>USB-Scanner
<br>Die SCSI-Scanner und Treiber
<br>Welcher Treiber mit welchem Scanner
<br>Was man sonst noch ben&ouml;tigt
<br>Support
<br>Scanner-Fazit
<br>
<br>Verf&uuml;gbarkeit von Treibern
<br>Emulatoren
<br>Leistungsf&auml;higkeit
<br>Schlussbemerkung
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Klartext </b>
<br>
</p>
<p>Heutige (Billig-)Scanner f&uuml;r den Parallelport sind in aller
Regel nicht am Atari nicht einsetzbar, da es f&uuml;r die
TOS-kompatiblen Systeme keine Treiber gibt.
<br>
</p>
<p>Grund:
<br>
</p>
<p>Es gibt keinen einheitlichen Standard f&uuml;r
Parallelport-Scannersteuerung wie z.B. f&uuml;r SCSI, und die Firmen
bringen immer wieder neue Scanner mit neuen Treibern auf den Markt. Es
ist teilweise sehr schwer, Informationen &uuml;ber die Art der
Ansteuerung von den Firmen zu bekommen (eine M&ouml;glichkeit ist das
Linux-Paket sane, das recht viele Scannertreibersourcen enth&auml;lt).
da den Ataris bzw. dem bidirektionalen Parallelport der Ataris einige
Steuerleitungen fehlen. Beim Milan sieht das wieder anders aus, aber
da greift zur Zeit Grund 1. Zur Zeit liegen keine Informationen
&uuml;ber Scannertreiber f&uuml;r den Parallelport des Milan vor.
<br>
</p>
<p>Aus demselben Grund laufen auch nur einige Funktionen dieser
Multifunktions-Ger&auml;te, die Fax, Scanner und Drucker in einem
sind.
<br>
</p>
<p>Aus dem gleichen Grund gibt es auch keinen Anschluss eines
Parallelport-ZIP-Drives am Parallelport eines Atari. Beim Milan sieht
es wieder anders aus, er hat eine vollst&auml;ndige bidirektionale
(ECP/EPP-f&auml;hige) Schnittstelle. Es fehlen da eigentlich nur noch
die Treiber ... Via ROM-Port-Adapter von Woller und Link ist es
allerdings m&ouml;glich, ein solches Parallelport-<a href="0d0b.htm" target="UDOcon">Zip-Drive</a> am
Rom-Port des Atari anzuschlie&szlig;en.
<br>
</p>
<p>Scanner, die nur am Parallelport eines intel-kompatiblen PCs
angeschlossen werden k&ouml;nnen, sind in der Regel an dem
entsprechenden Aufdruck auf dem Karton und am Preis zu erkennen
(zumeist unter 150 DM, von vielen H&auml;ndlern und insbesondere
Gro&szlig;handelsketten wie dem MediaMarkt werden diese Ger&auml;te
schon ab 80 DM verkauft).
<br>
</p>
<p>Alteingesessene Atarianer werden jetzt zu Recht einwerfen, das es
sehr wohl am Atari m&ouml;glich, ist einen Scanner am Parallelport zu
betreiben und das es sehr wohl Treiber daf&uuml;r gibt.
<br>
</p>
<p>Es handelt sich dabei um die Scanner von ehemals PrintTechnik und
um einige Epson GT-Modelle, welche gr&ouml;&szlig;tenteils heute nicht
mehr hergestellt werden und bei denen die fehlenden Leitungen
&uuml;ber andere Ports teils nachgebildet wurden/werden (siehe Andere
Anschlussm&ouml;glichkeiten).
<br>
<br>
<br>
</p>
<p><b> USB-Scanner </b>
<br>
</p>
<p>USB-Scanner sind ebenfalls zur Zeit nicht am Atari einsetzbar,
</p>
<p>da es bisher f&uuml;r die Atari-Rechner ST, STe, TT, F030 keine
USB-Schnittstelle gibt. da es f&uuml;r die theoretisch per Karte
ausr&uuml;stbaren Atari-kompatiblen Rechner (Hades, Medusa, Milan I)
keine Treiber gibt.
<br>
</p>
<p>Der seit Ende 1999 angek&uuml;ndigte Milan II sollte mit einem USB
ausger&uuml;stet werden, ob dann USB-Scanner dort unterst&uuml;tzt
werden, h&auml;ngt dann ebenfalls von der Verf&uuml;gbarkeit von
Treibern ab.
<br>
<br>
<br>
</p>
<p><b> Die SCSI-Scanner und Treiber </b>
<br>
</p>
<p>Bei SCSI-Scannern sieht es schon besser aus, zumindest einige
k&ouml;nnen am Atari dank existierender Treiber eingesetzt werden. Und
einigen der Treiber ist es m&ouml;glich, diese Scanner auch unter den
Emulatoren MagiCMac und MagiCPC zu nutzen.
<br>
</p>
<p>Erm&ouml;glicht wird dieses durch den Treiber SCSI-Treiber von
Steffen Engel.
<br>
</p>
<p>Zur Zeit sind folgende Treiber f&uuml;r SCSI-Scanner am Atari
bekannt:
<br>
<br>ScanX bzw. ScanXPRO
<br><a href="140e02.htm" target="UDOcon">Mustek Paragon Scanner</a> Driver
<br>HP Scanner Driver
<br>NovaScan
<br>GT-Look II
<br>Sandrine 4
<br>IDC-Microtek
<br>Microtek-Scan
<br>GT-Scan
<br>GDPS-Scannertreiber
<br>Tamarak-Scanner-Treiber
<br>
<br>
</p>
<p>Die ersten sechs Treiber sind auch auf aktuellen Systemen
funktionsf&auml;hig, bei den restlichen ist es eher fraglich, ob sie
z.B. unter MagiC oder N-AES &uuml;berhaupt funktionieren.
<br>
</p>
<p>
<br>
<br><b> Welcher Treiber mit welchem Scanner </b>
<br>
</p>
<p>Welcher Treiber mit welchem Scanner nun am Atari funktioniert,
kann man dieser Kurz&uuml;bersicht entnehmen:
<br>
</p>
<p><b> ScanX bzw. ScanXPRO </b>
<br>
</p>
<dl>
<dt><b>Microtek:</b></dt><dd> Scanmaker E3, E3+, E6, E6+, E330, E630, V300, V310, X6, 35t+,
V300, V310
<br>
<br>&nbsp;
<dt><b>Umax</b></dt><dd> ASTRA 1200S, 1210S, 1220S, PowerLook II, VISTA SE6, VISTA, S12,
Umax 610
<br>Der Treiber f&uuml;r 600S/610S wird wohl sp&auml;ter angepasst.
<br>
<br>&nbsp;
<dt><b><a href="140e02.htm" target="UDOcon">Mustek Paragon Scanner</a> Driver</b></dt><dd> Paragon 6000/1200 CX, 600/1200 SP/SP II
<br>&nbsp;
<dt><b>HP Scanner Driver</b></dt><dd> HP ScanJet IIcx, 3C, 4P/C, 5P
<br>&nbsp;
<dt><b>NovaScan</b></dt><dd>
<br>&nbsp;
<br>Mustek:MFS 6000/12000CX(3-Pass), 600/1200SP/SPII, 800SP
<br>HP:SCANJET IICX, IIp, 3P/C, 4P/C
<br>
<br>&nbsp;
<dt><b>GT-Look II</b></dt><dd> Epson GT 4000, Epson GT 6000, Epson GT 6500, Epson GT 8000, Epson
GT 8500, Epson GT 9000
<br>&nbsp;
<dt><b>Sandrine 4</b></dt><dd> UMAX ASTRA 600S ( ScanOffice 600 ), UMAX ASTRA 610S (ScanOffice
610/FunScan 610)
<br>UMAX ASTRA 1220S (ScanOffice 1220/FunScan 1220)
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p><b> Was man sonst noch ben&ouml;tigt </b>
<br>
</p>
<p>Neben dem Problem, welcher Treiber f&uuml;r welchen Scanner, muss
man sich auch noch folgende Punkte vor Augen f&uuml;hren:
<br>
<br>
</p>
<p><b> weitere Software </b>
<br>
</p>
<p>Neben dem reinen Treiber, der ja &quot;nur&quot; Daten vom Scanner
in den Rechner holt, ist f&uuml;r die weitere Bearbeitung der Grafiken
ein geeignetes Programm notwendig. Diese ist bei den neueren
Atari-Treibern im Gegensatz zu Scannerpaketen auf anderen Systemen wie
z.B. MacOS nicht mit dabei! Eine M&ouml;glichkeit, die Bilder
auszudrucken, werden wohl die meisten Programme bieten, ansonsten
ben&ouml;tigt man dazu ebenfalls noch geeignete Software.
<br>
<br>
</p>
<p><b> Plattenkapazit&auml;t </b>
<br>
</p>
<p>Je nach Gr&ouml;&szlig;e der eingescannten Bilder sollte allein
schon f&uuml;r die Grafikdateien ausreichend Platz auf dem
Speichermedium sein. Bearbeitet man die Bilder weiter so wird
mann&ouml;ch mehr Platz ben&ouml;tigen da man zumeist mit Backups der
Bilder arbeitet um das Original im Falle eines Falles nicht nochmals
einscannen zu m&uuml;ssen.
<br>
</p>
<p>Gleiches gilt beim Ausdruck z.B. via NVDI: NVDI ben&ouml;tigt je
nach Gr&ouml;&szlig;e und Farbtiefe zus&auml;tzlichen Platz auf der
Festplatte. Was an Datenmengen anfallen kann, sieht man im Kapitel
Datenmengen.
<br>
<br>
</p>
<p><b> Speicher </b>
<br>
</p>
<p>Speicher ist nur durch eines zu ersetzen: noch mehr Speicher. Das
gilt insbesondere f&uuml;r den Bereich der Grafikbearbeitung bzw. dem
Bereich der Elektronischen BildVerarbeitung. Auch hier sei auf das
Kapitel Datenmengen verwiesen.
<br>
<br>
</p>
<p><b> KnowHow </b>
<br>
</p>
<p>Warum sieht jetzt das gescannte Zeitungsbild so seltsam gemustert
aus? Ben&ouml;tige ich f&uuml;r meinen 300-dpi-sw-Ausdruck Bilder in
600 dpi TrueColor? Wie hole ich das Optimale aus meinen Vorlagen beim
Scannen heruas? Diese und andere Fragen werden in den fast schon
unz&auml;hligen B&uuml;chern beantwortet die es zum Thema Scannen am
(nicht nur) heimischen Computer gibt. Ein Einsteiger ben&ouml;tigt sie
nicht unbedingt, der etwas ambitioniertere Anwender h&auml;tte die
Fragen sicherlich gerne im Laufe seiner Scannernutzung beantwortet.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> Support </b>
<br>
</p>
<dl>
<dt><b>ScanX bzw. ScanXPRO</b></dt><dd> Support &uuml;ber: Homa System
<br>Weiterentwicklung: zur Zeit keine neue Version in Arbeit
<br>
<br>&nbsp;
<dt><b><a href="140e02.htm" target="UDOcon">Mustek Paragon Scanner</a> Driver</b></dt><dd> keine Angaben; es ist auch sicher sinnvoller, beim Neuerwerb
NovaScan zu kaufen, da dort mehr Scanner unterst&uuml;tzt werden
<br>
<br>&nbsp;
<dt><b>HP Scanner Driver</b></dt><dd> keine Angaben; es ist auch sicher sinnvoller, beim Neuerwerb
NovaScan zu kaufen, da dort mehr Scanner unterst&uuml;tzt werden
<br>
<br>&nbsp;
<dt><b>NovaScan</b></dt><dd> Wo nun die Rechte liegen, ob nun bei Computerinsel oder Axel
Gehringer oder ganz woanders: es ist uns nicht bekannt und die
verschiedenen Angaben wiedersprechen sich sogar teilweise. Support im
weitesten Sinne gibt es wohl f&uuml;r das Produkt nicht mehr.
<br>
<br>&nbsp;
<dt><b>GT-Look II</b></dt><dd> Support: keiner
<br>Weiterentwicklung: nein
<br>Der <a href="0201.htm" target="UDOcon">Autor</a> Markus Juergens ist aber f&uuml;r Kommentare erreichbar:
Markus Juergens
<br>
<br>&nbsp;
<dt><b>Sandrine 4</b></dt><dd> Centek ist seit Juni 2000 aufgel&ouml;st keine Angaben
<br>&nbsp;
<dt><b>IDC-Microtek</b></dt><dd> keine Angaben
<br>&nbsp;
<dt><b>Microtek-Scan</b></dt><dd> keine Angaben
<br>&nbsp;
<dt><b>GT-Scan</b></dt><dd> keine Angaben
<br>&nbsp;
<dt><b>GDPS-Scannertreiber</b></dt><dd> keine Angaben
<br>&nbsp;
<dt><b>Tamarak-Scanner-Treiber</b></dt><dd> keine Angaben
<br>&nbsp;
</dl>
<p>
<br>
<br>
</p>
<p><b> Scanner-Fazit </b>
<br>
</p>
<p>Verf&uuml;gbarkeit von Treibern
<br>
<br>
</p>
<p>Wenn man nicht ein komplettes Paket (bestehend aus Scanner und
dazu passenden Treiber) bekommt, so ist das Risiko f&uuml;r einen
Atarianer recht hoch, dass er seinen erworbenen Scanner mangels
Treiber an seinem System nicht einsetzen kann.
<br>
<br>Aktuell macht es nur Sinn, SCSI-Scanner zu erwerben, die via ScanX
bzw. ScanXPRO,GT-Look II, NovaScan, Sandrine 4 oder Mustek Paragon
Scanner Driver- bzw. HP Scanner Driver angesteuert werden k&ouml;nnen,
und selbst dabei ist ein Komplettpaket zumeist die bessere
L&ouml;sung. Wenn man nicht die <a href="0205.htm" target="UDOcon">Information</a> hat, das der Scanner XYZ
inkl. Treiber auf seinem System ohne Probleme funktioniert, so sollte
man beim Kauf entweder eine R&uuml;ckgabem&ouml;glichkeit aushandeln
oder/und diesesn Scanner nebst Treiber zun&auml;chst an seinem eigenen
System testen.
<br>
</p>
<p>Sollte dieses nicht m&ouml;glich sein, z.B. beim Neukauf im
MediaMarkt, Saturn oder Vobis so k&ouml;nnte man notfalls zumindestens
seinen Rechner mit zum <a href="1907.htm" target="UDOcon">H&auml;ndler</a> nehmen, um den Scanner dort zu
testen. Die Versionen von ScanX bzw. ScanXPRO, NovaScan, Sandrine 4
oder <a href="140e02.htm" target="UDOcon">Mustek Paragon Scanner</a> Driver- bzw. HP Scanner Driver existieren
als Demoversionen und GT-Look II ist frei erh&auml;ltlich.
<br>
</p>
<p>
<br>
</p>
<p><b> Emulatoren </b>
<br>
</p>
<p>Arbeitet man unter einem Emulator auf einem Apple Macintosh bzw.
einem Clone oder unter einem Intel-kompatiblen System, so ist es ja
kein Problem, den Scanner nebst Treiber passend zum Wirtssystem zu
kaufen. F&uuml;r Mac gibt es nur SCSI- und, seit Erscheinen des IMac,
auch USB-Scanner, am Intel-kompatiblen System klappt es auch mit dem
Parallelport. Die Treiber sind frei erh&auml;ltlich, Updates
k&ouml;nnen im Regelfall direkt von der Homepage des Herstellers
heruntergeladen werden und Bildbearbeitungssoftware zum Nulltarif ist
in den allermeisten F&auml;llen mit dabei.
<br>
<br>
</p>
<p><b> Leistungsf&auml;higkeit </b>
<br>
</p>
<p>Eine andere Problematik neben der Verf&uuml;gbarkeit von Treibern
ist die Leistungsf&auml;higkeit der Atari-Software. Jeder, der auf dem
Wirtssystem Apple Macintosh z.B. das Programm Silverfast kennt, ist
dann von den M&ouml;glichkeiten der Atarisoftware doch etwas
entt&auml;uscht.
<br>
</p>
<p>Nat&uuml;rlich variieren Qualit&auml;t bzw. die M&ouml;glichkeiten
der Software, egal auf welchem System sie nun l&auml;uft, teils sehr
erheblich. Doch einen Blick &uuml;ber den Tellerrand auf andere
Software w&uuml;rde so manchem <a href="0201.htm" target="UDOcon">Autor</a> sicherlich so einiges an
Anregungen bringen, die dann allerdings noch in einer neuen Version
umgesetzt werden m&uuml;ssten. Leider sieht es gerade mit diesem Punkt
sehr schlecht aus. Selbst die relativ neuen Programme werden nach
unseren Recherchen nicht mehr weiterentwickelt (siehe auch das Kapitel
Support. Der Benutzer muss also mit dem Stand der Dinge zurechtkommen.
<br>
</p>
<p>Es ist allerdings nicht so, dass es nichts Positives zu berichten
gibt Da gibt es Autoren, die ihre Software zur Freeware erkl&auml;ren
und Usern bei Fragen auch weiterhelfen, Autoren, die teils neue
Konzepte f&uuml;r Scannertreiber f&uuml;r den Atari aus den
Erfahrungen aus den Sourcen von Linux (sane ist dort das ultimaive
Sourcenpaket f&uuml;r den Bereich Scanneransteuerung) in Arbeit haben,
Autoren, die bereit w&auml;ren ihr KnowHow an Treiberschreiber
weiterzugeben, Autoren die einen system&uuml;bergreifenden
Scannertreiber in Arbeit haben.
<br>
<br>Interessant sind dabei die folgenden beiden Ideen/Projekte:
<br>
</p>
<p>Atari-Treiber als Open-Source-Projekt in Anlehnung an Linux (sane)
<br>
<br>
</p>
<p>Dazu bedarf es einer konsequenten Definition der <a href="0f.htm" target="UDOcon">Schnittstellen</a>
(USB, SCSI, Firewire, Parallel) und deren Treiber, wobei zur Zeit nur
Treiber f&uuml;r SCSI bereitstehen (SCSI-Driver).
<br>
</p>
<p>Gleichzeitig muss man auch &uuml;berlegen, wie die Bilder vom
Scan-Programm in das Bildverarbeitungsprogramm &uuml;bernommen werden
sollen, GDPS scheint (wegen Memory-Protection) nicht mehr sinnvoll zu
sein. Es wird also ein GEM-Frontend ben&ouml;tigt, das &uuml;ber eine
definierte Software-Schnittstelle mit dem Scanner-Backend
kommuniziert, so dass nach und nach weitere Backends implementiert und
dem Hauptprogramm entweder als Module bereitgestellt oder einfach
dazugelinkt werden k&ouml;nnen. Kontakt: Diethard Janssen auch
Atari-Treiber &uuml;ber einen system&uuml;bergreifenden Scannertreiber
ebenfalls in Anlehnung der sane-Sourcen
<br>
</p>
<p>Es gibt eine plattformunabh&auml;ngige Klassenbibliothek Namens
WxWindows (http://www.wxwindows.org/). W&uuml;rde jemand einen Port
f&uuml;r Atari-Systeme dazu programmieren, so w&auml;re es kein
gro&szlig;es Problem, dann auch eine Version f&uuml;r Atari-Systeme
der dann noch zu programmierenen Scanner-Programme zu kompilieren
(nat&uuml;rlich w&uuml;rde es dann auch m&ouml;glich sein, andere
Programme auf den Atari zu portieren).
<br>Kontakt: Markus Juergens
<br>
</p>
<p>
<br>Leider war es nicht m&ouml;glich, alle Treiber f&uuml;r diesen
Artikel direkt selber zu testen bzw. sie intensiver zu in Augenschein
zu nehmen, aber im Zeitalter von Multitaskingsystemen muss es aber
z.B. nicht mehr sein, dass man die Steuerungsoberfl&auml;che der
Treiber wie z.B. ScanX oder NovaScan in einen modalen Dialog legt, der
das komplette System sperrt - das es anders geht, zeigt ja gerade
GT-Look II. Auch die M&ouml;glichkeit, einen Teilbereich als Preview
in der Scanaufl&ouml;sung vorzuscannen, ist eine M&ouml;glichkeit, die
Treiber von anderen Welten bieten.
<br>
<br>
</p>
<p><b> Schlussbemerkung </b>
<br>
</p>
<p>Dieser Artikel war anf&auml;nglich nur eine Zusammenfassung
diverser Informationen zum Thema Scanner am Atari und sollte eine
FAQ-Sammlung mit Antworten werden. Die nun in diesem Artikel
eingeflossenen Informationen sind nach besten Wissen und Gewissen
zusammengetragen worden, f&uuml;r ihre Richtigkeit kann aber kein
Gew&auml;hr &uuml;bernommen werden. sollte jemand weitere
Informationen zu einzelnen Treibern und Scannern haben, so w&uuml;rde
der <a href="0201.htm" target="UDOcon">Autor</a> diese gerne zur Vervollst&auml;ndigung in die Datenbank
einf&uuml;gen.
<br>
</p>
<p><a href="0206.htm" target="UDOcon">Copyright</a> und alle Rechte beim ATOS-Magazin.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>
<ul>
<li>20.14.1 <a href="140e01.htm" target="UDOcon">Scanner am Romport</a></li>
<li>20.14.2 <a href="140e02.htm" target="UDOcon">Mustek Paragon Scanner</a></li>
</ul>
<br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="14.htm" target="UDOcon"><img src="udo_up.gif" alt="Specials" border=0 width="24" height="24"></a>
<a href="140d.htm" target="UDOcon"><img src="udo_lf.gif" alt="Exposure Lichtsteuerung" border=0 width="24" height="24"></a>
<a href="140e01.htm" target="UDOcon"><img src="udo_rg.gif" alt="Scanner am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
