<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!-- last modified on 23.05.2004 -->
<html>
<head>
<title>
DOIT_ST - Tips u. Tricks zur Atari Serie: Atari NetWork
</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="Generator" content="UDO6 PL14 for TOS">
<meta name="Email" content="doit@doitarchive.de">
<link rev=made href="mailto:doit@doitarchive.de" title="E-Mail">
<link rel=home href="doitst1h.htm" title="Homepage">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" alink="#FF0000" vlink="#800080">

<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="18.htm" target="UDOcon"><img src="udo_up.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="18.htm" target="UDOcon"><img src="udo_lf.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="1802.htm" target="UDOcon"><img src="udo_rg.gif" alt="Ethernet Project am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr>
<td valign=top width="8">&nbsp;</td><td valign=top width="100%">
<h1><a name="Atari_20NetWork">24.1 Atari NetWork</a></h1>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p><tt> Ethernet/Netzwerk mit Atari Computern </tt>
<br>
<br>
</p>
<p><img src="image/deutsch.gif" border=0 width="35" height="22"></p><br>
<p><img src="image/english.gif" border=0 width="35" height="22"></p><br>
<p>Einen Atari an ein Ethernet anschliessen, geht das &uuml;berhaupt?
<br>
<br>
</p>
<p>Die Frage stellte ich mir in den meinen Anfangsjahren, es ist eine
Weile her, auch oft. Sicher gab es die ein oder andere interessante
L&ouml;sung, doch wer hatte zuhause schon mehr wie einen Computer, ein
damit verbundenes Netzwerk und obendrein auch noch die reichlich
notwendigen Penunzen f&uuml;r eine damals reichlich kostenintensive
Netzwerkanbindung.
<br>
</p>
<p>Es ging kann man heute beruhigt schreiben, auch wenn es offiziell
eigentlich gar nicht so richtig Publik war. Es mag die verschiedensten
Ursachen gehabt haben. Bei mir war es das fehlende eigene Netzwerk und
eben die hohen Kosten.
<br>
</p>
<p>Wer damals ein Netzwerk hatte, bzw. seinen Atari in ein Netzwerk
einbinden musste konnte auch die kosten Tragen. F&uuml;r den
Heimanwender so gut wie unm&ouml;glich.
<br>
<br>
</p>
<p>Wenn Sie ihren Atari in ein lokales Netzwerk oder in ein Ethernet
einbinden wollen sind sie hier genau richtig. Wir werden hier alle
L&ouml;sungen ansprechen die jemals existiert haben. Beachten Sie
bitte das einige L&ouml;sungen nicht mehr oder nur noch gebraucht zur
Verf&uuml;gung stehen.
<br>
</p>
<p>Alles was man man an Atari Hardware ben&ouml;tigt ist ein Atari
ST, TT oder ein Atari Falcon F030. Der Milan kann mit einer NE2000
Karte ausger&uuml;stet werden. Selbstredent kann hier nicht bei jedem
Produkt auf das kleinste Detail eingegangen werden, zum einen
w&uuml;rde das den Umfang einer Recherche sprengen, zum anderen kann
man unm&ouml;glich alles Haarklein und S&auml;uberlich
auseinanderlegen, denn dazu h&auml;tte man all die genannte
Netzwerkadapter auch selbst besitzen und betreiben m&uuml;ssen.
<br>
</p>
<p>
<br>
<br><tt> - Hardwarel&ouml;sungen </tt>
<br>
</p>
<p><b> Hub: </b> Ein Netzwerkknoten, der Ger&auml;te per Ethernet
verbindet. Alle Ger&auml;te m&uuml;ssen mit der selben Geschwindigkeit
(10/100/GBit) laufen. Das langsamste Ger&auml;t gibt die
Geschwindigkeit vor. Da ein <a href="1705.htm" target="UDOcon">DSL</a>-Modem immer 10KBit hat, werden Macs,
die 100KBit oder GBit k&ouml;nnen, auf 10 KBit runtergebremst -&gt;
Keine gute L&ouml;sung. Die Geschwingigkeit Rechner -&gt; Rechner
l&auml;uft selbstverst&auml;ndlich immer mit der h&ouml;chst
m&ouml;glichen Geschwindigkeit des Hubs.
<br>
</p>
<p>Ein Hub verbindet mehrere Computer miteinander. Die Bandbreite im
Netz wird dabei nach Bedarf verteilt. Computer A, der in einem
10ÊMBit/s-Netz gerade mit 7 MBit/s Daten zu Computer B
&uuml;bertr&auml;gt, l&auml;&szlig;t den Computern C, D, ... nur noch
3ÊMBit/s freie Bandbreite.
<br>
</p>
<p><b> Switch: </b> Im Prinzip genau gleiche Ger&auml;t, nur
deutlich intelligenter. Hier k&ouml;nnen alle Ger&auml;te mit ihrer
maximalen Geschwindigkeit arbeiten, da der Switch intelligent und
schnell zwischen den gerade agierenden Ports umschaltet.
<br>
</p>
<p>Ein Switch stellt allen Computern im Netz die maximale Bandbreite
zur Verf&uuml;gung. Trotz der <a href="1507.htm" target="UDOcon">Daten&uuml;bertragung</a> von A zu B haben
damit Computer C, D, ... weiterhin 100 MBit/s Bandbreite zur
Verf&uuml;gung.
<br>
</p>
<p><b> Router: </b> Verteilt eine Internetverbindung (ISDN/<a href="1705.htm" target="UDOcon">DSL</a>, je
nach Ger&auml;tetypt) auf die am Router angeschlossenen Ger&auml;te.
In der Regel ist gleich noch ein Hub oder Switch integriert.
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> * D-Link DE 600 / D-Link DE 620 </b>
<br>
</p>
<p>D-Link DE 600, eine L&ouml;sung f&uuml;r jeden ST or TT, and I
assume it will work with a Falcon. Der D-Link DE 600 / D-Link DE 620,
ein PC Pocket-Ethernet-Adapter, mit einer parallelen, eigenwilligen
Schnittstelle.
<br>
</p>
<p>Es gab Modelle mit BNC-Anschlu&szlig; (Thin Koax) und mit
AUI-Adapter (Thick Koax) bzw. mit RJ-45 Anschlu&szlig; f&uuml;r
10Base-T UTP. Von der TU-Wien gab es hierzu einen Romport-Adapter der
es erm&ouml;glichte diesen Ethernet-Pocked-Adapter an den
Atari-Computern zu betreiben.
<br>
</p>
<p>Ehemaliger Vertreiber war die Firma D-Link, Bad Soden, Germany.
Diese L&ouml;sung ist meines Wissens nach nicht mehr verf&uuml;gbar.
<br>
</p>
<p>Softwaretreiber waren verf&uuml;gbar f&uuml;r MintNet und Linux.
<br>
</p>
<p>Sourcen der Treiber, Schaltbilder findet man im <a href="17.htm" target="UDOcon">Internet</a> unter:
<br>http://gallery.uunet.be/saka/atari/ethernet/dlink.htm
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> * Genius E3000 II-2 Pocket Ethernet Adapter </b>
<br>
</p>
<p>Ein weiterer Ansatz mit einem Romport-Interface betrifft den
Genius E3000 II-2 Pocket Ethernet Adapter. Auch diese L&ouml;sung ist
f&uuml;r den <a href="0305.htm" target="UDOcon">Atari ST</a>, TT und den Falcon verf&uuml;gbar. Dieser
Pocked-Adapter basiert auf dem RealTek 8012 Ethernet Controller Chip.
Diese L&ouml;sung betreibe ich hier bei mir zuhause sehr erfolgreich
an einem Beschleunigten Atari Falcon F030 und einem heimischen
Ethernet.
<br>
</p>
<p>Der Adapter kann &uuml;ber BNC-Anschlu&szlig; (Thin Koax) und mit
AUI-Adapter (Thick Koax) bzw. mit RJ-45 Anschlu&szlig; f&uuml;r
10Base-T UTP an ein Netzwerk angeschlossen werden. Der Anschlu&szlig;
an den Atari findet ebenfalls &uuml;ber ein Romport-Interface statt
das den parallelen Anschlu&szlig;port zur Verf&uuml;gung stellt. Die
STC berichtete.
<br>
</p>
<p>Dieser Pocked-Adapter wurde zuletzt hergestellt von:
<br>
</p>
<p>KYE Systems Europe GmbH
<br>Karl-Benz-Stra&szlig;e 9
<br>40764 Langenfeld
<br>
</p>
<p>
<br>Sourcen der Treiber, Schaltbilder, Screenshots mit aktuellen
Downloadraten in CPS findet man im <a href="17.htm" target="UDOcon">Internet</a> unter:
<br>
</p>
<p>http://gallery.uunet.be/saka/atari/ethernet/genius.htm
<br>
</p>
<p>Diese L&ouml;sung ist bei Artikellegung aktuell verf&uuml;gbar.
<br>
</p>
<p>E-mail : Elmar Hilgart
<br>URL : http://www.asamnet.de/&nbsp;hilgarte/ether.htm
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> * FlexLink </b>
<br>
</p>
<p>FlexLink war ein Produkt von PAM Software. Diese L&ouml;sung war
ein Ethernet Adapter f&uuml;r Atari Falcon und Atari TT. Die einzigen
beiden Atari Computer mit externer SCSI- Schnittstelle. Das Packet
hatte Unterst&uuml;tzung f&uuml;r Novell Netzwerke und war mit einem
Preis von damals ab 800 DM aufw&auml;rts, je nach Ausstattung,
reichlich teuer. Ein kommerzieller Einsatz war quasi die Voraussetzung
f&uuml;r eine Anschaffung.
<br>
</p>
<p>Das Softwarepaket hatte L&ouml;sungen f&uuml;r FTP and TELNET
&uuml;ber TCP/IP. Das NFS Softwarepaket unterst&uuml;tzte FTP, TELNET
und NFS Clients. Zugriff auf UNIX-Filesysteme war &uuml;ber einfache
logische TOS Laufwerkskennungen m&ouml;glich.
<br>
</p>
<p>Die ehemalige Adresse des Herstellers:
<br>
</p>
<p>PAM Software GmbH
<br>Carl Zuckmayer Strasse 27
<br>D 55127 Mainz, Germany
<br>
</p>
<p>
<br>
<br><b> * Riebl Karte </b>
<br>
</p>
<p>Die &quot;Riebl Karte&quot; war in zwei Konfigurationen
verf&uuml;gbar. Es gab ausschliesslich eine Karte f&uuml;r den Mega
Bus und eine f&uuml;r den VME Bus der im Atari TT (VME) vorhanden war.
Diese L&ouml;sungen d&uuml;rfte ausschliesslich noch auf dem
Secondhand Sektor verf&uuml;gbar sein. Zu dieser Karte gab es eine
Diskette mit den <a href="18.htm" target="UDOcon">Network</a> Services f&uuml;r Atari Computer unter TOS.
<br>
</p>
<p>Teiber f&uuml;r andere Betriebssysteme wie Linux und Atari V Unix
befanden sich bei diesen Betriebssystemen was bedeutet das diese Karte
von diesen Betriebssystemen aus direkt ansprechbar war. F&uuml;r
damals eine wohl fortschrittliche L&ouml;sung die man sogar heute noch
auf aktuellen System vermisst.
<br>
</p>
<p>F&uuml;r die Riebl Karte sind MiNT-Net Konfigurationen
verf&uuml;gbar.
<br>
</p>
<p>Als kleine Orientierungshilfe folgt eine ASCII-Grafik:
<br>
<br>
</p>
<pre>
       +----------------------------------------+
       |                                        |
      ++ +-----+                                ++
AUI   || | A   |  ++                            ||
      || +-----+  || D                          || VME
      ++          ++                            ||
       |                             +-+        ||
       |                             | |        ||
      ++                             | | C      ||
BNC   ++                             | |        ||
       |                             +-+        ||
       |                                +---+   ++
       |                             B  +---+   |
       +----------------------------------------+

</pre>
<p>
<br>
</p>
<p>In den Positionen A und D befinden sich die Jumper J1-6 und J7.
Sie m&uuml;ssen alle gleichzeitig entweder nach oben oder nach unten
gesetzt werden, um zwischen AUI und BNC umzuschalten. Auf dem
handschriftlichen Zettel steht, da&szlig; alle nach oben m&uuml;ssen,
um auf AUI zu stellen, ich habe jedoch eine e-mail herumliegen, auf
der steht es genau anders herum.
<br>
</p>
<p>Der Jumperblock C enth&auml;lt die Jumper J17-23. Wenn J22/23
geschlossen ist, ist der VME-Bus f&uuml;r TT gejumpert, ist er
ge&ouml;ffnet, ist die Riebl f&uuml;r den Einbau in einen MegaSTE
eingestellt. Zu den &uuml;brigen Jumpern habe ich keine Informationen.
<br>
</p>
<p>Kerstin Hoef-Emden
<br>
</p>
<p>Weitere Informationen findet man in der <a href="http://www.netbsd.org/Ports/atari/faq.html" target="_top">NetBSD FAQ</a>
<br>
</p>
<p>Riebl Card plus:
<br>I mostly know about this one from the net. It seems that the
network software associated with the Riebl card is slow and flaky, but
it seems to be the only Ethernet card for Ataris for which technical
documentation is publicly accessible. A group at the TU Wien has
developed a TCP/IP package for the Riebl card.
<br>
</p>
<p>
<br>
<br>Die Riebl Netzwerkkarten (ATARI <a href="18.htm" target="UDOcon">Network</a> System)
<br>
</p>
<p>Die Netzwerkkarte f&#166;r die MegaST Computer wird nach entfernen
der ab- nehmbaren Plastikabdeckung an der R&#166;ckseite des
Computers, einfach in den Megabus gesteckt. Anschlie&#186;end wird
noch das Spannungsversorgungs- kabel auf den freien <a href="0f0b.htm" target="UDOcon">Stecker</a> gesteckt,
der sich links vom dem Steck- platz befindet wo das <a href="10.htm" target="UDOcon">Netzteil</a>
eingesteckt ist.
<br>
</p>
<p>An den Jumpern sollte man bei dieser Karte keine &egrave;nderung
vornehmen! Die Batterie dient dem Datenerhalt der NODE-ID und weiteren
Daten die mittels des Configurationsprogrammes auf der Karte selber
abgespei- chert werden.
<br>
</p>
<p>Die Batterie dient dem Datenerhalt der NODE-ID und weiteren Daten
die mittels des Configurationsprogrammes auf der Karte selber abge-
speichert werden.
<br>
</p>
<p>So und jetzt die Jumperdoku (Danke an Ronald van der Kamp von der
Zeitschrift Stichting ST)
<br>
</p>
<p>jumper array A (J1-J6) The one near the connection AUI
<br>all to bottom -&gt; BNC
<br>all top top -&gt; AUI
<br>this means:
<br>put them on the side of the BNC-plug for BNC and to the side of
AUI when AUI is wanted.
<br>
<br>jumper D (J7) near the array A.
<br>Direction the same:
<br>to top -&gt; BNC
<br>to bottom -&gt; AUI
<br>some say: no jumper for BNC.
<br>
<br>See: jumper should be just placed topsy turvey from Array A
direction.
<br>
<br>jumper array C (J12-J23)
<br>all closed TT
<br>all open MegaSTE
<br>
</p>
<p>jumper array B (J8-J10)
<br>is closed/open/closed
</p>
<p>
<br>
<br><b> * Bio Net </b>
<br>
</p>
<p>Ehemals von der Firma <a href="1212.htm" target="UDOcon">Overscan</a> aus Berlin unterst&uuml;tzt.
<br>
</p>
<p>Das Packet enthielt einen Ethernetadapter, mit Novell
Unterst&uuml;tzung, zum Preis pro &quot;BioNet-Knoten&quot; (Gateway)
von damals ca. 500 DM. Sie haben richtig gelesen, 500 DM pro Rechner
der Ethernetanschlu&szlig; erhalten sollte. Der BioNet 100
&quot;Knoten&quot; ist ein Ethernet Adapter der am Atari ACSI Bus
angeschlossen wurde. Eben so war eine VME Bus Karte f&uuml;r den Atari
(VME) TT verf&uuml;gbar.
<br>
</p>
<p>Es ist Unterst&uuml;tzung f&uuml;r Linux/m68k vorhanden.
<br>Eine MiNT/MiNTNet Unterst&uuml;tzung ist mir nicht bekannt.
<br>
</p>
<p>Nachteile diese L&ouml;sung war wohl das ein PC-Server den Atari
TT als Server simulierte. Die Atari Clients liefen nach meines Wissens
auch ausschlieslich als BioNet Client unter TOS.
<br>
</p>
<p>BioData:
<br>Another Ethernet-based Atari network. I don't know if there are
other adapters than those for ACSI for BioData. TCP/IP is available,
and since BioData is also available for DOS PCs, they can be
integrated without any problem.
<br>
</p>
<p>
<br>
<br><b> * Smartnet98 </b>
<br>
</p>
<p>Smartnet98, eine L&ouml;sung die meiner Meinung nach bis Dato
niemals richtig bekannt wurde. Smartnet offeriert Datenraten bis zu
2Mbyte/s, was 20 Mbit/s oder 120 MByte/min entsprechen w&uuml;rde,
gesehen habe ich das leider noch nie. Alle technischen Angaben
basieren nur auf einer einfachen Rechereche.
<br>
</p>
<p>In ein Smartnetz sollen bis zu 4 Rechner und maximal 6 Drucker
einbindbar sein. Bei dieser L&ouml;sung m&uuml;sste kein Atari
aufgeschraubt werden, Smartnet begn&uuml;gt sich mit dem installieren
der Smartnet-Software und dem einstecken des jeweiligen
Anschlu&szlig;kabels.
<br>
</p>
<p>Softwareunterst&uuml;tzung gibt es in Form von NDIS3-Treibern
f&uuml;r Windows 3.11, 95, 98, und auch f&uuml;r Windows NT.
ADYS-Treiber f&uuml;r DOS, Windows 3.11/95/NT. F&uuml;r Atari GEM.
<br>
</p>
<p>NDIS3-Treiber erm&ouml;glichen den verbundenen Rechner alle
Ressourcen gemeinsam zu nutzen. Festplatten, CD-ROMs, Drucker usw.
also alles das was in Windows Netzwerken zur Verf&uuml;gung steht.
ADYS-Treiber sind f&uuml;r den Zugriff auf die Laufwerke der jeweils
anderen Rechner zust&auml;ndig.
<br>
</p>
<p><a href="11.htm" target="UDOcon">Verbindungskabel</a> in der L&auml;nge von 5m od. 10m L&auml;nge
kosten 120 DM bzw. 145 DM.
</p>
<p>Die Hauptanwendung besteht offensichtlich darin einen PC mit einem
Atari und auch umgekehrt, verbinden zu k&ouml;nnen. Das einzige was
dazu ben&ouml;tigt wird ist das offensichtlich mit eigeninteligenz
ausgestatte Smartnet-Kabel und eben die parallel Schnittstelle eines
jeden Computers der in das Netz eingebunden werden soll.
<br>
</p>
<p>Mit &quot;Ethernet&quot; hat diese L&ouml;sung wenig zu tun. Sie
gleicht eher einer vom PC her bekannten
&quot;LapLink-L&ouml;sung&quot; die man sehr gerne benutzt um eben mal
schnell seinen Laptop in den <a href="0903.htm" target="UDOcon">Desktop</a> Rechner zu entleeren. Es ist mit
dieser L&ouml;sung m&ouml;glich jede bestehende Kombination aus Atari,
Amiga und PC dazu zu bewegen untereinandere Daten auszutauschen.
<br>
</p>
<p>Die nicht mehr aktuelle Adresse der Hersteller:
<br>
</p>
<p>Adyton Systems,
<br>Reichenbachstrasse 35/313,
<br>D-01069 Dresden,
<br>Germany
<br>
</p>
<p>
<br>
<br>
</p>
<p><b> * MidiCOM </b>
<br>
</p>
<p>Jahrelang selbst betrieben, ein Netzwerk &uuml;ber die am Atari
vorhandenen Midi-IN und Midi-OUT Buchsen und normalen
handels&uuml;blichen 5 poligen DIN-Kabeln. Als &quot;Treiber&quot; ist
die Software &quot;MidiCOM&quot; von Harald Blees erforderlich.
&ouml;ber dieses recht langsame Netzwerk hat man Zugriff auf alle
vorhandenen TOS-Laufwerke und Drucker auf jedem in diesen Midi-Ring
eingebundenen Atari Computer.
<br>
</p>
<p>Langsam aber stetig. Probleme sind keine bekannt.
<br>
</p>
<p>Die von Dieter Cotta entwickelten MidiCom-Romport Interfaces waren
eine drastische Steigerung in der &ouml;bertragungsgeschwindigkeit und
der Funktionalit&auml;t, gleichzeit aber auch eine Einschr&auml;nkung
in der Anzahl der verwendbaren Computer. Lediglich zwei Atari Computer
mit Romport sind so zu einem &quot;Netzwerk&quot; zusammen zu fassen.
<br>
</p>
<p>
<br>
<br><b> * Itos Lan </b>
<br>
</p>
<p>Itos Lan scheint das einzige Verfahren zu sein das jemals den
&quot;LAN&quot; (Local-Talk) Anschlu&szlig; an einem Atari Computer
f&uuml;r ein &quot;Netzwerk&quot; benutzt hat. Der &quot;LAN&quot;
Port an verschiedenen Atari Computern ist eine normale serielle
Schnittstelle.
<br>
</p>
<p>Von OXO Systems in Frankreich wurde auch offensichtlich das Itos
Lan Start Packet vertrieben. Das Packet bestand aus einer Lizenz
f&uuml;r 2! Netzwerkstationen, den beiden Local-Talk Adaptern und den
entsprechenden <a href="11.htm" target="UDOcon">Verbindungskabel</a>. Offensichtlich also nicht viel
Unterschied zu Apple-Talk von der Firma Apple.
<br>
</p>
<p>
<br>
<br><b> * Galaxy VME Ethernet Karte </b>
<br>
</p>
<p>Die Karte ist eine VME Hybridkarte. Auf der Karte befindet sich
eine VME Grafikkarte f&uuml;r den Atari STe und den Atari TT (VME).
Der Ethernetadapter auf dieser Karte hat die folgenden technischen
Spezifikationen:
<br>
</p>
<p>* 10 Megabit Ethernet Interface.
<br>* Attachment unit interface (AUI)
<br>* MAU/transceiver not supplied.
<br>* Treibersoftware f&uuml;r MiNT.
<br>
</p>
<p>Alle weiteren Informationen erh&auml;lt man von Mario Becroft
<br>
</p>
<p>
<br>
<br><b> * PamsNet </b>
<br>
</p>
<p>This Ethernet-based Atari network allows you to network up to 127
Atari computers. There are three versions of the adapters: one for
ACSI, one for the Megabus, and one for the VME slot. PamsNet uses a
special network protocol, but TCP/IP and a gateway to Novell are
available. A unique feature of PamsNet is the availability of a server
for a VAX under VMS, which allows transparent access to the VMS
filesystem over the network.
<br>
</p>
<p>
<br>
<br>
<br>
</p>
<p><tt> - Netzwerk Software </tt>
<br>
</p>
<p>
<br>
<br><b> * TUWTCP/IP </b>
<br>Ein Paket entwickelt an der TU-Wien 1992/93.
<br>
</p>
<p>Das Treiberpaket soll seht Stabil sein und sich kompatibel zu
MultiTOS, MagiC und Geneva verhalten. Seit 1994 wird an dieser
Software nicht mehr gearbeitet.
<br>
</p>
<p>
<br><b> * MiNTNet </b>
<br>Der BSD port f&uuml;r MiNT. Ausf&uuml;hrliche beschreibungen sind
im <a href="17.htm" target="UDOcon">Internet</a> vorhanden.
<br>
</p>
<p>
<br><b> * <a href="1701.htm" target="UDOcon">STinG</a> </b>
<br><a href="1701.htm" target="UDOcon">STinG</a> ist der wohl am weitesten verbreitete Freeware TCP/IP Stack
f&uuml;r Atari Computer. Ab der Version 1.20 ist es mit <a href="1701.htm" target="UDOcon">STinG</a>
m&ouml;glich seinen Atari &uuml;ber verschiedene Ethernet Adaptoren
mit einem Netzwerk bzw. mit dem <a href="17.htm" target="UDOcon">Internet</a> zu verbinden.
</p>
<p>Vassilis Papathanassiou hat den Ethernet Treiber f&uuml;r den
Pocket Adapter der vom Elmar Hilgart vertrieben wird programmiert. Der
Treiber agiert f&uuml;r die bekannten RealTek 8002 oder 8012 Ethernet
Controller Chips und arbeitet perfekt auch in der <a href="1701.htm" target="UDOcon">STinG</a> Version 1.26
unter TOS und MagiC6. Der Treiber ist f&uuml;r Atari Computer mit
orignalem Romport ausgelegt.
<br>
</p>
<p>
<br><b> * DECDriver </b>
<br>
</p>
<p>Der &quot;DECDriver&quot; ist ausschliesslich f&uuml;r Ethernet
PCI-Bus Karten gedacht die im Hades040- oder im Hades060 Clone
eingesetzt werden. Der Treiber unterst&uuml;tzt PCI Ethernet LAN
Controllerdes Typs DEC21040 und den neueren DEC21041.
<br>
</p>
<p>Mehr zu diesem Treiber erf&auml;hrt man bei Markus Fichtenbauer.
Die genannte URL f&uuml;hrt seit einiger Zeit leider bisher Ersatzlos
in die Leere. http://www.wvnet.at/privat/97021702/
<br>
<br>Markus Fichtenbauer,
<br>Hans-Reithergasse 1,
<br>A-3950 Gm&uuml;nd, Austria
<br>
</p>
<p>
<br><b> * NE2000 Treiber (ISA NE2000) </b>
<br>
</p>
<p>Dieser Treiber, f&uuml;r gleichnamige Ethernetkarte, ist f&uuml;r
den MILAN40 entstanden.
<br>
</p>
<p>Bei der Erstellung des Artikels war der Treiber ausschliesslich in
einer MiNT-Net Version verf&uuml;gbar. Der Treiber ist auf der MiNT98
CD zu finden. M&ouml;chte man mit dieser L&ouml;sung auch
Internetbetrieb erreichen ben&ouml;tigt man Gluestik f&uuml;r
MiNT-Net.
<br>
</p>
<p>Danach sollten alle bekannten STiK/<a href="1701.htm" target="UDOcon">STinG</a> Clients auf diesem
Rechner Internetzugriff erlangen wenn die Ethernetkarte an einen Hub,
Router angeschlossen wird auf dem auch der Webzugriff geroutet wird.
(Kabelmodem)
<br>
</p>
<p>Als Bezugsquellen wurden auch zwei Adressen ausfindig gemacht:
<br>
</p>
<p>AG Computer
<br>Axel Gehringer
<br>Memmingen
<br>Germany
<br>Phone: +49 (0)8331 86373
<br>
</p>
<p>MW Computersysteme
<br>Heisterbacher Str. 96
<br>K&ouml;nigswinter
<br>Germany
<br>Phone: +49 (0)2223 1567
<br>
</p>
<p>
<br><b> * Atari <a href="18.htm" target="UDOcon">Network</a> System </b>
<br>
</p>
<p>(ANS) Ein Treiber f&uuml;r diverse Ethernet Adapter. Wohl in der
Hauptsache f&uuml;r die Riebl Karten, dessen Treiber, erdacht. Das
ANS-Interface beschreibt einige Verfahren um Netzwerkroutinen wie IP,
ARP, UDP auf einfachem Weg f&uuml;r Clients zur Verf&uuml;gung zu
stellen.
<br>
</p>
<p>
<br>
<br><b> * FAQ f&uuml;r CAT und MiNT-Net </b>
<br>
</p>
<p>Von:
<br>Dimitri Junker &lt;Dimitri_Junker@b.maus.de&gt;
<br>Frank Szymanski &lt;Frank_Szymanski@du3.ohse.de&gt;
<br>
</p>
<p><font color="green"> F: Ich benutze MiNT und MiNT-Net und
m&ouml;chte nun mit CAT Emails senden und empfangen.
<br></font>
<br>A: Cat stellt keine Verbindung her. Daf&uuml;r ist <a href="1702.htm" target="UDOcon">IConnect</a>, oder
STing/StiK u.&auml;. zust&auml;ndig. Nur bei der Nutzung der
In2Cat.dll unter MagicPC bin ich (Dimitri) auch daf&uuml;r
zust&auml;ndig. In2Cat selbst stellt dabei auch keine Verbindung her,
es beauftragt nur <a href="1702.htm" target="UDOcon">IConnect</a> o.&auml;.
<br>
<br>
</p>
<p><font color="green"> F: O.K. Ich habe aber weder STing/STiK noch
<a href="1702.htm" target="UDOcon">IConnect</a> sondern MiNT-Net.
<br></font>
<br>A: Daf&uuml;r ben&ouml;tigst Du GlueSTiK, dann k&ouml;nnen auch
<a href="1701.htm" target="UDOcon">STinG</a>-Clients unter MiNT-Net genutzt werden.
<br>
</p>
<p>
<br><font color="green"> F: O.K. Ist installiert. In2Cat kann jetzt
aber leider keine Emails senden (empfangen klappt hingegen
problemlos).
<br>
</p>
<p>Bei mir passiert beim Start von In2Cat folgendes:
<br>
</p>
<p>Aktuelles Modul: Login
<br>Aktion: Login &uuml;ber <a href="1701.htm" target="UDOcon">STinG</a>/STiK herstellen
<br>
</p>
<p>Danach modale Dialogbox: Zu wenig Speicher [Mist]. Nachdem ich die
ein paar mal weggeklickt habe, kommt dann in der Konsole folgende
Ausgabe:
<br>
</p>
<p>pid 137 (in2cat): BUS ERROR: User PC=20175FC, Address: 0
(basepage=2014000, text=2014100, data=202652C, bss=2031B10)
<br></font>
<br>
</p>
<p>A: Ach, DER Fehler. Verwendest Du <a href="1701.htm" target="UDOcon">STinG</a>? Dann mu&szlig; da in der
default.cfg der Wert von ALLOCMEM hochesetzt werden. Den Eintrag gibt
es f&uuml;r GlueSTiK auch in [boot]:\stik_cfg\default.cfg und ist hier
ALLOCMEM = 150000.
<br>
</p>
<p>Bei <a href="1701.htm" target="UDOcon">STinG</a> kann man sich im Dialer den Speicherstatus anzeigen
lassen. Wenn es da eng wird, einfach 'mal 50k mehr spendieren.
<br>
<br><font color="green"> F: Ja. Ich verwende MiNT-Net mit GlueSTiK.
<br></font>
</p>
<p>Bisher hatte ich diese Datei &uuml;berhaupt nicht. Jetzt schon.
Nun funktioniert auch das Senden und Empfangen von Emails.
<br>
</p>
<p>Allerdings leider doch nicht ganz zu 100%. Teilweise bekomme ich
keine Verbindung mit meinem Provider.
<br>
</p>
<p>A: Verwendest Du zuf&auml;llig <a href="1504.htm" target="UDOcon">ExtenDOS</a>?
<br>
<br><font color="green"> F: Ja, wieso?
<br></font>
</p>
<p>A: Weil das bei mir dazu f&uuml;hrt, da&szlig; ich nur genau 1x
pro Sitzung eine Dialup-Verbindung herstellen kann. Zumindest in
&auml;lteren Versionen, mit der neuesten habe ich es noch nicht
versucht.
<br>
</p>
<p>Deswegen verwende ich normalerweise Spin!, das hat dieses Problem
nicht. Nur zum Brennen von CDs mu&szlig; ich dann doch <a href="1504.htm" target="UDOcon">ExtenDOS</a>
aktivieren.
<br>
<br><font color="green"> F: Mit <a href="1504.htm" target="UDOcon">ExtenDOS</a> und einem anderen Provider
funktioniert es bei mir jetzt aber. Sieht so aus, als ob es die
Kombination aus <a href="1504.htm" target="UDOcon">ExtenDOS</a> und diesem Provider war. Mit einem anderen
Provider geht es.
<br></font>
</p>
<p>A: Kann sein. Im Zweifelsfall also mal einen anderen Provider
probieren, oder <a href="1504.htm" target="UDOcon">ExtenDOS</a> deaktivieren.
<br>
</p>
<p>
<br>
<br><b> * FAQ f&uuml;r CAT und charsets </b>
<br>
</p>
<p>Von:
<br>Dimitri Junker &lt;Dimitri_Junker@b.maus.de&gt;
<br>Frank Szymanski &lt;Frank_Szymanski@du3.ohse.de&gt;
<br>
</p>
<p><font color="green"> F: Ich m&ouml;chte in Cat Mails mit
verschiedenen Codepages (z.B. kyrillisch, d.h. russischen Buchstaben)
darstellen. Kann CAT also auch mit anderen charsets als iso-8859-1
umgehen?
<br></font>
</p>
<p>A: Sollte so sein, ja! ISO-8859-15, UTF-8 und eine Reihe anderer.
Und zusammen mit KEYTAB 10 sollten alle Zeichens&auml;tze von KEYTAB
verf&uuml;gbar sein - je nach Einstellung in CAT nat&uuml;rlich.
<br>
</p>
<p>RTFchanges.txt:
<br>
</p>
<pre>24.12.01    *** Version 4.30 (im Vergleich zu 4.25)

-NEW  Neben dem ISO-8859-1 Zeichensatz werden jetzt auch noch
      die anderen der Serie, der Windows CP 1252 und utf-8 un-
      terst&uuml;tzt.
</pre>
<p>Gesendet wird derzeit allerdings immer in iso-8859-1. Nur beim
Empfang werden auch andere erkannt. Da bei der Anzeige aber nur der
Atarizeichensatz verwendet wird, kann es teilweise zu seltsamen
Sonderzeichen kommen. Aber hier gilt wie allgemein. Neue Features
werden dann eingebaut wenn sie jemand braucht. Also was brauchst Du?
<br>
<br><font color="green"> F: Konkret ben&ouml;tige ich die charsets
&quot;koi8-r&quot;, &quot;utf-8&quot; und &quot;windows-1251&quot;, da
ich h&auml;ufig russische Mails erhalte und diese dann nat&uuml;rlich
nicht so besonders gut lesen kann. Genau so wichtig ist aber auch das
Senden von Mails mit diesen charsets.
<br></font>
</p>
<p>A: UTF-8 und Windows-1251 k&ouml;nnen sowohl CAT als auch KEYTAB
10 decodieren. Beide (Keytab und Cat-intern) decodieren in den
Atarizeichensatz und der enth&auml;lt keine russischen Zeichen.
F&uuml;r solche Zeichens&auml;tze w&uuml;rden wir also einen anderen
Zielzeichensatz ben&ouml;tigen, und der m&uuml;&szlig;te dann von Cat
automatisch zur Darstellung benutzt werden. Mit koi8-r sieht es
ohnehin ganz anders aus, d.h. das wird noch gar nicht
unterst&uuml;tzt.
<br>
</p>
<p>Beim Senden m&uuml;&szlig;te in CAT noch etwas gemacht werden,
da&szlig; man - am besten pro Nachricht - einstellen kann, in welchem
Charset man enden m&ouml;chte. Am besten so, da&szlig; man beim
Schreiben den ATARI-Zeichensatz aus w&auml;hlt, also normalerweise
einen Systemfontcompatiblen, oder eben einen anderen. Wird so ein
anderer verwendet w&uuml;rde Cat dann von diesem in einen anderen
iso8859 o.&auml;. wandeln.
<br>
</p>
<p>
<br>
<br><b> EtnerNec TT </b>
<br>
</p>
<p>I have a TT with EtheNEC and <a href="1701.htm" target="UDOcon">STinG</a> and it works but I had to do
some tweaks to get it running. (EtherNEC has however lately started to
act strange here, possibly because I have used the TT too much or
something...)
<br>
</p>
<p>Use ENEC.STX (not ENEC3.STX)
<br>
</p>
<p>Set ENEC.STX to load and allocate in TT RAM by altering the
program flags. Some desktops can do this but if you are using the
built in desktop you need some application to change them. Sorry I use
the desktop so I have no app name to give...
<br>
</p>
<p>Check that ENEC.STX is the physically last program in the STING
folder. When <a href="1701.htm" target="UDOcon">STinG</a> launches it puts the driver names on screen and if
the EtherNEC driver appear last you are fine.
<br>
</p>
<p>EtherNEC has problems with some TT's. Probably timing problems? On
another TT here I only got it working with TOS and not Magic. On this
TT it works (actually worked) fine with Magic but not with TOS.
<br>
</p>
<p>I have a third TT with the older Genius LAN parallel port EtherNet
and it runs fine all the time as my webserver. Guess it's time to
power it down soon and check how EtherNEC works with that...
<br>
</p>
<p>A month ago the TT I'm writing this on started to have problems
with EtherNEC if I _reboot_ or turn it completely off and start it
again warm. If I leave it overnight it starts just fine. Sympthoms are
no connection and wrong or no MAC address. I actually did shut it down
for an hour today and now I'm working with the rather strange MAC
address 6a6a6a6a6a6a! (Checked from my router's arp table.)
<br>
</p>
<p>This means I lose my <a href="17.htm" target="UDOcon">Internet</a> connection if I have to reboot but
fortunately this TT runs very stable...
<br>
</p>
<p>Did some tests earlier today and booted into TOS and managed to
get the correct MAC there (but not with Magic) using both ENEC.STX and
ENEC3.STX. PingpPackets got out but all dropped on return.
<br>
</p>
<p>I have some time ago actually got it working with TOS when the
computer had been on for really long and at that time EtherNEC refused
to work with Magic. <a href="1701.htm" target="UDOcon">STinG</a> configuration remained the same.
<br>
</p>
<p>I have full control over file contents here (backups in four
generations plus an older reference backup) using checksum validation
so it's really something with the hardware that changes.
<br>
</p>
<p>(I realise you may not have use for all this info but there are
others who have TT's and EtherNEC...)
<br>
</p>
<p>Once you get a proper STing init, with the proper MAC address
showing in your STing CPX, these are some things I learned along the
way:
<br>
</p>
<p>1. Before my Windows XP box will pay any attention to anything non
MS on my LAN, I had to do manual ARP entries on the XP box.
<br>
</p>
<pre>I.E.  arp.exe -s 192.168.1.8       00-00-1c-1c-37-a5
                        ^^^^^^^^^        ^^^^^^^^^^^^^^^
                        IP for ENEC      Mac Address for NEC Card

</pre>
<p>2. Your TCP/IP settings do make a difference. Particularly the
RWIN value. I understand that if it's too big, the NEC card's buffers
can overflow. Here's how I've been taught to figure optimal values.
<br>
</p>
<p>First find out what the suggested MTU is for your router/ISP.
<br>Use that setting in STing for MTU.
<br>
</p>
<p>Now subtract 40 from this MTU value.
<br>Set Maximum Segment Size (MMS) to this.
<br>
</p>
<p>Finally, multiply the MSS value by 3. (You might also try 4, but
that's getting close to the card's buffer limit, 2 or 3 should be very
safe and perform well) Set the Recieve Window (RWIN) to this value.
<br>
</p>
<p>The main thing here is the RWIN size...if it gets too big, buffers
in the NEC card can overflow. Keep in mind that taking the time to set
this properly can indeed make alot of difference in speed/performance.
<br>
<br>In summary:
<br>
<br>MTU = Maximum Transmission Unit: Typically 1442 or 1500 over
broadband...ask your ISP for their recommended MTU and match
everything your lan to this, or any variant evenly divisible.
<br>
</p>
<p>MSS = Maximum Segment Size: This is your MTU minus 40.
<br>
</p>
<p>RWIN= Recieve Window Buffer Size: The Receive Window (RWIN) value
is the maximum number of bytes of data that can be buffered, pending
the receipt of an acknowledgment packet back from the sender.
Typically, the RWIN value should be a multiple of 2-10 times the
maximum segment size (MTU-40). I recommend a multiple of 2 or 3 with
the NEC2000 Ethernet card.
<br>
</p>
<p>
<br>
<br>
</p>
<p align=center><img src="image/sline.gif" border=0 width="640" height="2"></p><br>
<p align=center><img src="image/img.gif" border=0 width="50" height="40"></p><br>

<hr>
<address>Copyright &copy; <a href="http://www.doitarchive.de/">Robert Schaffner</a> (<a href="mailto:doit@doitarchive.de">doit@doitarchive.de</a>)<br>
Letzte Aktualisierung am 23. Mai 2004</address>
</td></tr></table>
<table border=0 cellpadding=0 cellspacing=0 width="100%"><tr><td valign=top>
<a href="00con.htm" target="UDOcon"><img src="udo_hm.gif" alt="Home" border=0 width="24" height="24"></a>
<a href="18.htm" target="UDOcon"><img src="udo_up.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="18.htm" target="UDOcon"><img src="udo_lf.gif" alt="Network" border=0 width="24" height="24"></a>
<a href="1802.htm" target="UDOcon"><img src="udo_rg.gif" alt="Ethernet Project am Romport" border=0 width="24" height="24"></a>
</td></tr></table>
</body></html>
